{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": [
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.3",
          "author": null,
          "description": "Fixed: broken links in documentation\nChore: Dependency updates\nThank you: @hirdot",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.3",
          "publishedOn": "2021-10-16T00:01:47.000Z",
          "wordCount": 299,
          "title": "v1.11.3"
        },
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.2",
          "author": null,
          "description": "Fixed: unicode characters in URL caused download error\nFixed: project root npm install error\nAdded: unit test library\nChore: Dependency updates\nThank you: @CaptNo1",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.2",
          "publishedOn": "2021-09-26T18:45:39.000Z",
          "wordCount": 350,
          "title": "v1.11.2"
        }
      ]
    },
    {
      "title": "Kotaku",
      "feedUrl": "https://kotaku.com/rss",
      "siteUrl": "https://kotaku.com",
      "articles": [
        {
          "id": "1844512015",
          "author": "Zack Zwiezen",
          "description": "Halloween is here and while you may enjoy this holiday, you might not be as into scary horror games as others. You aren’t alone! Horror games can be incredibly intense, even for those who love a good scary movie. But maybe you still want to enjoy some games on Halloween, just without all the jump scares. \nRead more...",
          "link": "https://kotaku.com/the-best-not-scary-games-to-play-on-halloween-1844512015",
          "publishedOn": "2021-10-17T16:00:00.000Z",
          "wordCount": 1226,
          "title": "The Best (Not Scary) Games To Play This Halloween Season"
        },
        {
          "id": "1847880801",
          "author": "Zack Zwiezen",
          "description": "Hello! It’s time for Kotaku’s Sunday Comics, your weekly roundup of the best webcomics. The images enlarge if you click on the magnifying glass icon.\nRead more...",
          "link": "https://kotaku.com/sunday-comics-incredible-sam-1847880801",
          "publishedOn": "2021-10-17T14:45:00.000Z",
          "wordCount": 190,
          "title": "Sunday Comics: Incredible, Sam!"
        },
        {
          "id": "1847879147",
          "author": "Zack Zwiezen",
          "description": "For as long as Minecraft has been around, there has been dirt and water. But yet, no mud. Or frogs. Well, that all changes next year when Minecraft’s next big update hits. It adds mud blocks, frogs, boats with chests, and new swamps. Fans are losing their shit over it all. \nRead more...",
          "link": "https://kotaku.com/minecraft-announces-mud-and-frogs-fans-go-wild-1847879147",
          "publishedOn": "2021-10-16T22:45:00.000Z",
          "wordCount": 576,
          "title": "Minecraft Announces Mud And Frogs, Fans Go Wild"
        },
        {
          "id": "1847878298",
          "author": "Zack Zwiezen",
          "description": "Epic Games and its CEO Tim Sweeney are open to letting games that use blockchain technology and NFTs onto its PC store, even as NFTs continue to be criticized for being a giant, planet-burning scam filled with grifters. This follows Valve’s decision to remove and ban all games that utilize NFTs and blockchain…\nRead more...",
          "link": "https://kotaku.com/epic-games-store-will-welcome-nft-games-after-steam-ban-1847878298",
          "publishedOn": "2021-10-16T20:30:00.000Z",
          "wordCount": 659,
          "title": "Epic Games Store Will 'Welcome' NFT Games After Steam Bans Them"
        },
        {
          "id": "1847878338",
          "author": "Zack Zwiezen",
          "description": "Today during DC’s annoyingly long Fandome event, the company revealed new trailers and teasers for a host of upcoming comic book-related projects, including a new in-engine trailer for Suicide Squad: Kill The Justice League featuring our first look at what The Flash and Wonder Woman look like in this 2022 continuation…\nRead more...",
          "link": "https://kotaku.com/a-year-later-heres-a-bit-more-of-that-suicide-squad-ga-1847878338",
          "publishedOn": "2021-10-16T18:45:00.000Z",
          "wordCount": 467,
          "title": "A Year Later, Here's A Bit More Of That Suicide Squad Game By Rocksteady"
        },
        {
          "id": "1847877768",
          "author": "Zack Zwiezen",
          "description": "If Grand Theft Auto: The Trilogy - Definitive Edition was a boat, it would have sunk by now after all the recent leaks. First, there was the leaked rating information, then leaked achievements. Now, more details about how the game will play, box art, and its apparent PC specs have also slipped out into the wild. \nRead more...",
          "link": "https://kotaku.com/remastered-gta-trilogy-will-seemingly-feature-gta-v-sty-1847877768",
          "publishedOn": "2021-10-16T16:20:00.000Z",
          "wordCount": 813,
          "title": "Remastered GTA Trilogy Will Seemingly Feature GTA V-Style Controls And High-Res Textures"
        },
        {
          "id": "1847875421",
          "author": "Zack Zwiezen",
          "description": "Every Pokemon is interesting and worth talking about. I don’t play a ton of Pokemon, but I do enjoy the universe and I love learning more about the creatures in it. So, Here’s Another Pokemon! It’s Shuppet!\nRead more...",
          "link": "https://kotaku.com/shuppet-loves-drama-and-hanging-around-bad-people-1847875421",
          "publishedOn": "2021-10-16T14:35:00.000Z",
          "wordCount": 614,
          "title": "Shuppet Loves Drama And Hanging Around Bad People"
        },
        {
          "id": "1847875371",
          "author": "Isaiah Colbert",
          "description": "Even if you live under a rock duplex, you’ve probably seen Netflix’s Squid Game do the rounds on social media. This should come as no surprise because Netflix reports that Squid Game (not to be confused with Nintendo’s Splatoon) is its most popular series launch ever, gaining 111 million viewers within 17 days of the…\nRead more...",
          "link": "https://kotaku.com/12-things-to-check-out-after-youve-binged-squid-game-1847875371",
          "publishedOn": "2021-10-15T22:05:00.000Z",
          "wordCount": 1945,
          "title": "12 Things To Check Out After You've Binged Squid Game"
        },
        {
          "id": "1847874854",
          "author": "Mike Fahey",
          "description": "When Apple released the original iPad Mini back in late 2012 I thought, “This is it, the perfect form-factor for tablet gaming.” Everywhere I went I pulled out the compact device, showing off its 7.9-inch screen, how well it fit in my oversized paws. I was never going back to a full-size iPad. Then Apple spent the…\nRead more...",
          "link": "https://kotaku.com/the-new-ipad-mini-reclaims-the-title-of-best-gaming-tab-1847874854",
          "publishedOn": "2021-10-15T21:30:00.000Z",
          "wordCount": 869,
          "title": "The New iPad Mini Reclaims The Title Of Best Gaming Tablet"
        },
        {
          "id": "1847874410",
          "author": "Patricia Hernandez",
          "description": "On Thursday, former Republican National Committee communications strategist Liz Mair expressed disappointment that fetid hellhole Twitter had gotten pretty boring recently. “I’m starting to consider tweeting deliberately crazy and offensive stuff just to try to spice it up again,” she wrote. Lo and behold, by Friday,…\nRead more...",
          "link": "https://kotaku.com/republican-political-consultant-under-fire-for-trolling-1847874410",
          "publishedOn": "2021-10-15T21:15:00.000Z",
          "wordCount": 635,
          "title": "Republican Political Consultant Under Fire For Trolling About Burning Kid's Pokémon Cards"
        },
        {
          "id": "1847874435",
          "author": "Zack Zwiezen",
          "description": "A few nights ago, while playing Far Cry 6, I arrived at a small beachside shack that was surrounded by a tall fence. Inside I found notes about a man who was being terrorized by a mongoose. When he finally caught it, he trapped it in his shed behind his home while he picked up some gasoline. So I snuck in, found his…\nRead more...",
          "link": "https://kotaku.com/far-cry-6s-treasure-hunts-are-the-best-part-of-the-game-1847874435",
          "publishedOn": "2021-10-15T21:00:00.000Z",
          "wordCount": 739,
          "title": "Far Cry 6's Treasure Hunts Are The Best Part Of The Game"
        },
        {
          "id": "1847874519",
          "author": "Ian Walker",
          "description": "Nickelodeon All-Star Brawl is just 10 days old, but serious competitors have already found a problem character: Teenage Mutant Ninja Turtle party animal Michelangelo. He’s so problematic, in fact, that he’s been banned from the game’s first major tournament.\nRead more...",
          "link": "https://kotaku.com/nickelodeon-all-star-brawl-s-first-big-money-tournament-1847874519",
          "publishedOn": "2021-10-15T20:40:00.000Z",
          "wordCount": 616,
          "title": "Nickelodeon All-Star Brawl’s First Big-Money Tournament Bans Ninja Turtle Michelangelo"
        },
        {
          "id": "1847874385",
          "author": "Sisi Jiang",
          "description": "Damn. Good Guy Steam is (sort of) back. The developer of an upcoming NFT-based PC game revealed in a tweet that Steam is no longer allowing games built on blockchain technology or that “issue or allow exchange of cryptocurrencies or NFTs.” Indeed, Valve’s onboarding rules page now says exactly that. \nRead more...",
          "link": "https://kotaku.com/good-riddance-steam-bans-games-that-feature-crypto-and-1847874385",
          "publishedOn": "2021-10-15T20:15:00.000Z",
          "wordCount": 536,
          "title": "Good Riddance: Steam Bans Games That Feature Crypto And NFTs"
        },
        {
          "id": "1847874001",
          "author": "Ari Notis",
          "description": "Confession time: I’ve never played Left 4 Dead. I’m obviously aware of what Valve’s iconic shooter is all about—team up with friends and shoot zombies—and that a ton of players sucked it up like zombies feasting on cerebral miasma. Still, despite the game’s ubiquity, I just...never got around to it. Happens sometimes!…\nRead more...",
          "link": "https://kotaku.com/the-moment-that-sold-me-on-back-4-blood-the-new-shoote-1847874001",
          "publishedOn": "2021-10-15T19:30:00.000Z",
          "wordCount": 600,
          "title": "The Moment That Sold Me On Back 4 Blood, The New Shooter By L4D Devs"
        },
        {
          "id": "1847873282",
          "author": "Sisi Jiang",
          "description": "It’s finally happened. For the first time ever, after nearly a year of playing Genshin Impact, the new Tsurumi Island update forced me to look up a puzzle solution on YouTube. And the difficulty of the new puzzle isn’t an isolated incident. Whether you’re a fan of puzzles or run to wikis at the slightest whiff, almost…\nRead more...",
          "link": "https://kotaku.com/genshin-impact-s-new-inazuma-update-brings-the-difficul-1847873282",
          "publishedOn": "2021-10-15T18:20:00.000Z",
          "wordCount": 781,
          "title": "Genshin Impact’s New Inazuma Update Brings The Difficulty Spike"
        },
        {
          "id": "1847872423",
          "author": "Mike Fahey",
          "description": "With the November 5 release of both Nintendo’s paid and free DLC, New Horizons becomes more than just another Animal Crossing game. By combining concepts from past installments and spin-offs like City Folk and Happy Home Designer, New Horizons is becoming the ultimate version of Animal Crossing, the most comprehensive…\nRead more...",
          "link": "https://kotaku.com/new-horizons-updates-will-give-it-the-best-bits-of-ever-1847872423",
          "publishedOn": "2021-10-15T17:15:00.000Z",
          "wordCount": 613,
          "title": "New Horizons Updates Will Give It The Best Bits Of Every Animal Crossing"
        },
        {
          "id": "1847872455",
          "author": "Ian Walker",
          "description": "Animal Crossing: New Horizons gives players thousands of items with which to decorate their homes, but they all paled in comparison to the glory of previous entries’ beloved Froggy Chair. And now, Nintendo has finally seen fit to add it to the game.\n\nRead more...",
          "link": "https://kotaku.com/animal-crossing-new-horizons-is-finally-getting-the-fr-1847872455",
          "publishedOn": "2021-10-15T16:55:00.000Z",
          "wordCount": 437,
          "title": "Animal Crossing: New Horizons Is Finally Getting The Froggy Chair And Everyone Is Freaking Out"
        },
        {
          "id": "1847871994",
          "author": "Ari Notis",
          "description": "In September, Nintendo announced that it would make N64 games available as part of its Nintendo Switch Online service. At the time, Nintendo withheld the pricing info, leading some to speculate about how steep it could be. Today, we get our answer. Nintendo Switch Online + Expansion Pack (official name) will run you…\nRead more...",
          "link": "https://kotaku.com/you-ll-have-to-pay-more-than-double-for-switch-online-i-1847871994",
          "publishedOn": "2021-10-15T16:10:00.000Z",
          "wordCount": 520,
          "title": "You’ll Have To Pay More Than Double For Switch Online If You Want N64 Games"
        },
        {
          "id": "1847871074",
          "author": "Alex Walker",
          "description": "Diablo 2: Resurrected launched, it’s authentic as all hell—but then the D2 servers took an instant trip to the Seventh Circle. For the last week, players have faced constant login issues and outages. And by the sounds of things, the poor server engineers must be absolutely hating life.\n\nRead more...",
          "link": "https://kotaku.com/fixing-the-diablo-ii-resurrected-servers-sounds-like-a-1847871074",
          "publishedOn": "2021-10-15T15:00:00.000Z",
          "wordCount": 1725,
          "title": "Fixing The Diablo II: Resurrected Servers Sounds Like An Absolute Nightmare"
        },
        {
          "id": "1847870881",
          "author": "Ari Notis",
          "description": "It’s been a long time coming, but Animal Crossing: New Horizons is finally getting a major update, and it’s way bigger than anything ACNH has gotten so far. Nintendo detailed forthcoming additions in an ACNH-theme Nintendo Direct today.\nRead more...",
          "link": "https://kotaku.com/damn-no-wonder-animal-crossings-big-november-patch-too-1847870881",
          "publishedOn": "2021-10-15T14:40:00.000Z",
          "wordCount": 632,
          "title": "Damn, No Wonder Animal Crossing's Big November Patch Took So Long"
        },
        {
          "id": "1847870918",
          "author": "Isaiah Colbert",
          "description": "Animal Crossing: New Horizon’s first paid DLC, Happy Home Paradise, lets players build dream vacation homes for their residents. Players can scope out islands and design a paradise home for their favorite villagers. \nRead more...",
          "link": "https://kotaku.com/animal-crossing-is-getting-paid-dlc-and-it-looks-meaty-1847870918",
          "publishedOn": "2021-10-15T14:15:00.000Z",
          "wordCount": 592,
          "title": "Animal Crossing Is Getting Paid DLC, And It Looks Meaty"
        },
        {
          "id": "1847870864",
          "author": "Sisi Jiang",
          "description": "During the Animal Crossing: New Horizons Direct, Nintendo announced that the adored music performer, K.K. Slider, will be adding 12 additional songs. These include titles such as “K.K. Break” and “K.K. Polka.” Players will also be able to play them when they want, from a new music box item.\nRead more...",
          "link": "https://kotaku.com/animal-crossings-k-k-slider-expands-discography-1847870864",
          "publishedOn": "2021-10-15T14:14:00.000Z",
          "wordCount": 433,
          "title": "Animal Crossing: New Horizons' K.K. Slider Is Getting New Music"
        },
        {
          "id": "1847870839",
          "author": "Mike Fahey",
          "description": "It’s harvest time, and today’s long-awaited Animal Crossing: New Horizons direct presentation certainly bore fruit. Along with the return of Kapp’n and Brewster’s cafe, Nintendo also announced something fans should be very excited about: popular photo destination Harv’s Island is turning into a full-blown shopping…\nRead more...",
          "link": "https://kotaku.com/animal-crossing-new-horizons-turns-harv-s-island-into-1847870839",
          "publishedOn": "2021-10-15T14:10:00.000Z",
          "wordCount": 661,
          "title": "Animal Crossing Is Getting A Shop-Filled Island"
        },
        {
          "id": "1847822593",
          "author": "Lisa Marie Segarra",
          "description": "The pigeon has come home to roost. Nintendo showed off how Brewster and his café The Roost will come to Animal Crossing: New Horizons along with a load of other features and changes coming November 5. It will also be the last free update to the game, and the first New Horizons DLC is coming.\n\nRead more...",
          "link": "https://kotaku.com/animal-crossing-direct-serves-up-a-steaming-cup-of-brew-1847822593",
          "publishedOn": "2021-10-15T14:01:00.000Z",
          "wordCount": 701,
          "title": "November Animal Crossing Update Brings Brewster's Cafe, Kapp'n And More New Shops"
        },
        {
          "id": "1847870109",
          "author": "Brian Ashcraft",
          "description": "There are countless Pokémon fan theories. One of the most famous in Japan is that the Regis represent hibakusha—the survivors of the Hiroshima and Nagasaki atomic bombings. \n\nRead more...",
          "link": "https://kotaku.com/japanese-pokemon-fan-theory-links-the-regis-to-world-wa-1847870109",
          "publishedOn": "2021-10-15T13:15:00.000Z",
          "wordCount": 823,
          "title": "Japanese Pokémon Fan Theory Links The Regis To World War II"
        }
      ]
    },
    {
      "title": "Nintendo Life | Latest Updates",
      "feedUrl": "https://www.nintendolife.com/feeds/latest",
      "siteUrl": "https://www.nintendolife.com/feeds/latest",
      "articles": [
        {
          "id": "https://www.nintendolife.com/#article-122391",
          "author": null,
          "description": "Now known as \"Island Ordinances\".\n\nNintendo shared a huge amount of news about Animal Crossing: New Horizons during its special presentation for the game this week, and while there's so much exciting content to look forward - one feature in the next free (and final) update that we're really looking forward to the return of is ordinances.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/yay-town-ordinances-are-finally-making-a-return-to-animal-crossing",
          "publishedOn": "2021-10-17T18:00:00.000Z",
          "wordCount": 1025,
          "title": "Yay! Town Ordinances Are Finally Making A Return To Animal Crossing"
        },
        {
          "id": "https://www.nintendolife.com/#article-122126",
          "author": null,
          "description": "We asked Aaron “Cybertron” Zheng what the future holds.\nTwo years have passed since Pokémon Sword and Shield inaugurated the eighth generation of Pokémon games. With it came indignation from some some fans, though most agreed Sword and Shield didn’t flounder when it came to its competitive scene.\nPokémon tournaments are played under the Video Game Championship (VGC) umbrella, and online Ranked Battles in Sword and Shield mirror the VGC ruleset. Tournaments, both grassroot and official, are frequent, and exciting rule changes occur every three months, restricting and unrestricting the availability of certain Pokémon.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/features/where-does-competitive-pokemon-go-from-here",
          "publishedOn": "2021-10-17T17:00:00.000Z",
          "wordCount": 2260,
          "title": "Feature: Where Does Competitive Pokémon Go From Here?"
        },
        {
          "id": "https://www.nintendolife.com/#article-122403",
          "author": null,
          "description": "Is it another \"mobile miracle\"?\nDying Light Platinum Edition arrives on the Nintendo Switch next week, and ahead of its release, the tech experts over at Digital Foundry have shared their own technical review of the game.\nSo, has Techland succeeded with the Switch port? In docked mode, the survival horror game runs at 1080p and 720p in handheld mode, but there's a bit of a catch:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/video-digital-foundrys-technical-analysis-of-dying-light-on-switch",
          "publishedOn": "2021-10-17T16:00:00.000Z",
          "wordCount": 2276,
          "title": "Video: Digital Foundry's Technical Analysis Of Dying Light On Switch"
        },
        {
          "id": "https://www.nintendolife.com/#article-121832",
          "author": null,
          "description": "Ink between worlds.\nIn the current era of impressive development tools and talented studios of all sizes, there can be download-only games that are just as eye-catching as big-budget contemporaries while having a focus on a small, carefully constructed experience. Inked: A Tale of Love is a good example of what can be achieved by small but talented creative teams, making a leap from Apple Arcade and providing a reminder of the lovely diversity to be found in the Switch eShop library.\nInked: A Tale of Love utilises a hand-drawn style not just for visual panache, but as a fundamental part of the story. You play a hero that at first tries to solve a mystery of suffering animals, and then embarks on a quest to save his true love. It's smartly told with a narrator that's more than they seem, along with some fourth wall-breaking for added effect. It's a simple but carefully told story, with impressive beats that'll make you think twice about some actions.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/reviews/switch-eshop/inked-a-tale-of-love",
          "publishedOn": "2021-10-17T15:00:00.000Z",
          "wordCount": 1149,
          "title": "Mini Review: Inked: A Tale Of Love - A Beautifully Drawn Experience"
        },
        {
          "id": "https://www.nintendolife.com/#article-122394",
          "author": null,
          "description": "40k and counting.\nIt's not often you see a video on Nintendo's main YouTube channel not performing well in terms of 'Likes' compared to 'Dislikes' but every now and then it posts something that doesn't go down so well with subscribers, and viewers in general.\nThe latest video that's struggling to win over the masses is the Switch Online overview trailer for the new 'Expansion Pack' add-on (see above). Although it's generated over 700,000 views at the time of writing, it seems to have upset quite a lot of people - with over 40k 'dislikes' and just 14k 'likes'.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/random-uh-oh-nintendos-switch-online-expansion-pack-overview-trailer-is-generating-a-lot-of-dislikes",
          "publishedOn": "2021-10-17T13:30:00.000Z",
          "wordCount": 13279,
          "title": "Random: Uh-Oh, Nintendo's Switch Online 'Expansion Pack - Overview Trailer' Is Generating A Lot Of Dislikes"
        },
        {
          "id": "https://www.nintendolife.com/#article-122107",
          "author": null,
          "description": "Metroid Dread = portable + headphones + a dark room, right?\nThe Nintendo Switch has various strengths, but the key aspect of its design that has helped to fuel its success is flexibility. It's a concept that is ultimately more than the sum of its parts — when you break it down, it's a tablet with mid-2010s technology and a USB-C connector to hook up to TVs. Yet, it's more than that thanks to Nintendo's product design. To gamers around the world it delivers choice and intuitive ways to play. Docking to a TV is simple and instantaneous, the Joy-Con controllers slide off and become wireless, you can pop it on a table in the park. This is all stuff that is either less intuitive or not possible with other gaming hardware, and Nintendo has even been doing 'My Way' Switch trailers to make that point for quite some time.\nIt also has a massive library by this point, with a huge variety of titles from both a first- and third-party perspective. Yet as this scribe started Metroid Dread recently a realisation hit — there's one way to play the game: In portable mode, with headphones, in a dark room. That's how it'll be played to the credits, from now on, making it a 'just before bed' sort of game.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/features/talking-point-do-you-have-a-way-you-play-certain-switch-games",
          "publishedOn": "2021-10-17T13:00:00.000Z",
          "wordCount": 5973,
          "title": "Talking Point: Do You Have A 'Way' You Play Certain Switch Games?"
        },
        {
          "id": "https://www.nintendolife.com/#article-122395",
          "author": null,
          "description": "A Saiyan from Universe 6 has arrived.\nBandai Namco's action role-playing fighting game Dragon Ball Xenoverse 2 has announced the next downloadable content character on the way.\nIt's Caulifa (Super Saiyan 2), who represents Universe 6 in the Dragon Ball Super series. She'll join the game as an addition to \"Legendary Pack 2\" this fall.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/bandai-namco-shows-off-dragon-ball-xenoverse-2s-next-dlc-character",
          "publishedOn": "2021-10-17T04:30:00.000Z",
          "wordCount": 1700,
          "title": "Bandai Namco Shows Off Dragon Ball Xenoverse 2's Next DLC Character"
        },
        {
          "id": "https://www.nintendolife.com/#article-122392",
          "author": null,
          "description": "Still no mention of localisation.\n\nEarlier this month, Square Enix confirmed the \"offline\" version of the MMO Dragon Quest X would be coming to the Nintendo Switch. I'll be arriving in Japan on 26th February 2022 and is officially titled, Dragon Quest X Offline.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/video-heres-a-first-look-at-dragon-quest-x-offline-coming-to-switch-in-2022",
          "publishedOn": "2021-10-17T00:05:00.000Z",
          "wordCount": 1382,
          "title": "Video: Here's A First Look At Dragon Quest X Offline, Coming To Switch In 2022"
        },
        {
          "id": "https://www.nintendolife.com/#article-122382",
          "author": null,
          "description": "Caves & Cliffs Part 2 is also a \"month or two\" away.\n\nDuring this year's Minecraft Live broadcast, Mojang unveiled its next big update for the ever-expanding sandbox, crafting and survival game.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/mojang-reveals-minecraft-the-wild-update-arriving-in-2022",
          "publishedOn": "2021-10-16T18:30:00.000Z",
          "wordCount": 1368,
          "title": "Mojang Reveals Minecraft: The Wild Update, Arriving In 2022"
        },
        {
          "id": "https://www.nintendolife.com/#article-122380",
          "author": null,
          "description": "Players can also take on a new 'Tower' challenge.\nThe hack-and-slash Minecraft Dungeons will be getting even more new content this holiday season. During this year's Minecraft Live event, the team at Mojang announced new Seasonal Adventures.\nAs the player, you'll progress through an all-new progression system to earn pets, flairs, emotes and skins, and starting in December, you'll reach new heights in the first seasonal adventure - Cloudy Climb.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/minecraft-dungeons-is-getting-seasonal-adventures-this-holiday",
          "publishedOn": "2021-10-16T17:30:00.000Z",
          "wordCount": 1131,
          "title": "Minecraft Dungeons Is Getting Seasonal Adventures This Holiday"
        },
        {
          "id": "https://www.nintendolife.com/#article-120190",
          "author": null,
          "description": "The House In Fata Morgana Game Diary, Part 4.\nWriter's note: Although the previous diary entries have veered away from big spoilers for The House in Fata Morgana, this one does not, because it's hard to talk about the themes without specifics. Be warned!\nAs a content warning, topics discussed in this piece will include trauma, gender, abuse, and coming out.\n\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/features/we-finally-finished-the-game-with-an-almost-perfect-metascore",
          "publishedOn": "2021-10-16T17:00:00.000Z",
          "wordCount": 5879,
          "title": "Feature: We Finally Finished The Game With An Almost-Perfect Metascore"
        },
        {
          "id": "https://www.nintendolife.com/#article-122358",
          "author": null,
          "description": "Block out some time to watch.\nMinecraft is a global phenomenon, so it makes sense that it has its own whopping live stream to showcase updates and new content. Expect new mobs and assorted goodies, as this is a rather big annual extravaganza for the game.\nIt all kicks off at 9am PT / noon ET / 5pm BST / 6pm CEST, so get comfy and feel free to join in with our live chat as you watch the show!\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/watch-minecraft-live-2021-live",
          "publishedOn": "2021-10-16T15:30:00.000Z",
          "wordCount": 1844,
          "title": "Watch: Minecraft Live 2021 - Live!"
        },
        {
          "id": "https://www.nintendolife.com/#article-122333",
          "author": null,
          "description": "The video game development industry needs to respect its contributors.\n\nThe conversations around Metroid Dread have been mostly positive since its launch, but a recent topic that has caused a good deal of debate and criticism of developer MercurySteam has related to the game's credits. Multiple contributors to the game have raised the fact that they're not credited, and the developer has responded to clarify its internal policy. Its statement is below.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/features/talking-point-the-metroid-dread-credits-debate-is-sadly-common",
          "publishedOn": "2021-10-16T13:00:00.000Z",
          "wordCount": 12275,
          "title": "Talking Point: The Metroid Dread Credits Debate Is Sadly Common"
        },
        {
          "id": "https://www.nintendolife.com/#article-122374",
          "author": null,
          "description": "\"I heard Sega were paid very, very well\".\n\nNintendo yesterday lifted the lid on the price of its new 'Expansion Pack' for the Switch Online service, and if you've seen our reader poll about the subject, it might be a bit too expensive for some.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/nintendo-leaker-suggests-pricing-of-switch-onlines-expansion-pack-could-be-tied-to-licensing-costs",
          "publishedOn": "2021-10-16T11:00:00.000Z",
          "wordCount": 22018,
          "title": "Nintendo Leaker Suggests Pricing Of Switch Online's Expansion Pack Could Be Tied To \"Licensing Costs\""
        },
        {
          "id": "https://www.nintendolife.com/#article-122069",
          "author": null,
          "description": "Dread to think what you're up to this weekend.\nThis week we closed out with an Animal Crossing Direct broadcast that detailed the final free content coming to the game, plus the Happy Home Paradise paid DLC. The broadcast also confirmed the price and date of the Nintendo Switch Online Expansion Pack (not Pass, Pack!), too. Earlier in the week we also got our first good look at Pokémon Blimey This Is A Long Title When You Have To Type It Out A Dozen Times A Day. And the MetrOLED train just keeps on rolling. Phew!\nAfter all that, it's time to chill out and discuss our weekend gaming plans. A few members of the Nintendo Life team have done just that below, so feel free to give our entries a read and then join in with your own via our comment section. Enjoy!\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/features/talking-point-what-are-you-playing-this-weekend-october-16th",
          "publishedOn": "2021-10-16T09:00:00.000Z",
          "wordCount": 7773,
          "title": "Talking Point: What Are You Playing This Weekend? (October 16th)"
        },
        {
          "id": "https://www.nintendolife.com/#article-122370",
          "author": null,
          "description": "And visual enhancements across-the-board.\nEarlier on in the month, Rockstar made it official - confirming a definitive edition of Grand Theft Auto: The Trilogy would be coming to the Nintendo Switch and multiple other platforms later this year.\nSo, just how 'definitive' will this Definitive Edition be? A user on the GTA Forums, who has apparently leaked information in the past, has shared details from a now-removed support page about the upcoming Trilogy release. Based on the description, there'll be new lighting, environmental upgrades, high-res textures, increased draw-distances, and more. Perhaps the highlight though is the mention of \"GTA V-style controls\", which hasn't really been mentioned until now.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/gta-trilogys-definitive-edition-will-reportedly-feature-gta-v-style-controls",
          "publishedOn": "2021-10-16T05:00:00.000Z",
          "wordCount": 4257,
          "title": "GTA Trilogy's Definitive Edition Will Reportedly Feature 'GTA V-Style Controls'"
        },
        {
          "id": "https://www.nintendolife.com/#article-122369",
          "author": null,
          "description": "Nintendo explains the fine details.\nOne of the many highlights of the recent Animal Crossing: New Horizons Direct broadcast was the reveal of the 'Happy Home Paradise' DLC.\nIt's essentially a follow-up to Happy Home Designer on the 3DS and will be made available as a standalone paid expansion for the \"one-time fee\" of $24.99USD / 24,99 Euros / £22.49, or can be accessed as part of Nintendo Switch Online's 'Expansion Pack' upgrade.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/dont-worry-youll-still-have-access-to-certain-things-from-animal-crossings-dlc-when-your-nso-sub-expires",
          "publishedOn": "2021-10-16T03:30:00.000Z",
          "wordCount": 7779,
          "title": "Don't Worry, You'll Still Have Access To \"Certain Things\" From Animal Crossing's DLC When Your NSO Sub Expires"
        },
        {
          "id": "https://www.nintendolife.com/#article-122367",
          "author": null,
          "description": "He's been enjoying his retirement all along.\nBefore Animal Crossing: New Horizons was even released on the Nintendo Switch, fans spotted an eerie gravestone in one of the game's trailers. Many within the community latched onto this at the time, which then led to theories a beloved character in Nintendo's social simulation series had died.\nAt the time, many thought it might have been the former town mayor, Tortimer - who went into retirement in Animal Crossing: New Leaf on the 3DS. Well, fast forward to today and it's been discovered Tortimer is still alive and well. Yes, that's right folks, the old tortoise is still kickin' - here's how social media reacted:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/random-relax-animal-crossings-former-town-mayor-tortimer-is-alive-and-well",
          "publishedOn": "2021-10-16T00:05:00.000Z",
          "wordCount": 1202,
          "title": "Random: Relax, Animal Crossing's Former Town Mayor Tortimer Is Alive And Well"
        },
        {
          "id": "https://www.nintendolife.com/#article-122364",
          "author": null,
          "description": "New furniture, characters, and polishing!\nNone of us could have predicted it — well, okay, one of us could — but Happy Home Designer, the spin-off 3DS game that trimmed Animal Crossing down to just the home decor mechanic, is being added to Animal Crossing: New Horizons.\nNamed \"Happy Home Paradise\", this paid DLC is basically a spin-off of a spin-off, which adds a ton of new content, mechanics, and characters to the game, alongside the Version 2.0 free update (if you want to know what's included in that, check out our round-up!).\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/guides/animal-crossing-new-horizons-everything-we-know-about-the-happy-home-paradise-dlc",
          "publishedOn": "2021-10-15T20:30:00.000Z",
          "wordCount": 3704,
          "title": "Guide: Animal Crossing: New Horizons: Everything We Know About The Happy Home Paradise DLC"
        },
        {
          "id": "https://www.nintendolife.com/#article-122350",
          "author": null,
          "description": "Will you be doubling up?\nWhile the Animal Crossing Direct was 20+ minutes of cuteness and excitement for fans of Animal Crossing: New Horizons, it also served up a major update on the Nintendo Switch Online Expansion Pass. We have a release date and pricing, and a firm idea of the content it'll offer at launch.\nSo, let's summarise the key details:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/poll-what-do-you-think-of-the-nintendo-switch-online-expansion-pack-price",
          "publishedOn": "2021-10-15T20:00:00.000Z",
          "wordCount": 27941,
          "title": "Poll: What Do You Think Of The Nintendo Switch Online Expansion Pack Price?"
        },
        {
          "id": "https://www.nintendolife.com/#article-122362",
          "author": null,
          "description": "New stuff, old friends, and Froggy Chair.\nTwenty minutes of a Nintendo Direct is usually about four to ten big things, but this Animal Crossing Direct was more jam-packed than a sticky child's lunchbox. So much so, in fact, that we've had to split up our usual \"everything\" round-up into two parts: The free stuff, and the paid stuff.\nHere's everything you can find in update 2.0 for Animal Crossing: New Horizons without paying for it:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/guides/animal-crossing-new-horizons-everything-coming-in-the-final-free-update",
          "publishedOn": "2021-10-15T19:30:00.000Z",
          "wordCount": 4358,
          "title": "Guide: Animal Crossing: New Horizons: Everything Coming In The Final Free Update"
        },
        {
          "id": "https://www.nintendolife.com/#article-122337",
          "author": null,
          "description": "One of the rarest Super Famicom games lives again.\nIrem's Undercover Cops is one of the most expensive Super Famicom titles, regularly changing hands for $200 just for the loose cartridge. However, Retro-Bit has come to our rescue with a reissue of the game which comes with a bunch of other goodies that collectors will want to check out.\nRetro-Bit was kind enough to send us a sample of the North American version, and we've pulled together this gallery to show it off. As a refresher, this is what's contained within 'The Collectors Edition' ($69.99 / €64.99):\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/gallery-breaking-the-seal-on-retro-bits-undercover-cops-reissue",
          "publishedOn": "2021-10-15T18:30:00.000Z",
          "wordCount": 980,
          "title": "Gallery: Breaking The Seal On Retro-Bit's 'Undercover Cops' Reissue"
        },
        {
          "id": "https://www.nintendolife.com/#article-122313",
          "author": null,
          "description": "We speak to series producer, Ichiro Hazama.\nDuring the recent Super Smash Bros. presentation, which revealed Kingdom Hearts' Sora as the final DLC fighter, it was revealed that the entire Kingdom Hearts series is headed to Switch. What should have been an incredible announcement was somewhat dampened, however, with the catch being that the entire collection would only be available in Cloud Version form.\nIt's safe to say that the reaction wasn't particularly great; we ran a poll right here on Nintendo Life to see how many of you would be interested in picking up the cloud versions and, at the time of writing, only 9% of respondents were confident in a 'yes' answer. The vast majority of respondents had no interest at all or would have preferred native ports of the games.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/wish-kingdom-hearts-was-native-on-switch-a-true-port-is-still-undecided",
          "publishedOn": "2021-10-15T18:00:00.000Z",
          "wordCount": 5567,
          "title": "Wish Kingdom Hearts Was Native On Switch? A True Port Is Still \"Undecided\""
        },
        {
          "id": "https://www.nintendolife.com/#article-122354",
          "author": null,
          "description": "\"No Rumble Pak required\" - Oh Nintendo, you crack us up.\nAs you may have seen, pre-orders are starting to appear for the wireless Nintendo 64 Switch controllers in different territories, which will offer us retro-heads a rather fun way to try out the Nintendo Switch Online Expansion Pass titles when they land on 25th/26th October. You have to have a standard NSO subscription to buy it though, which is quirky considering the standard sub doesn't get you the N64 games but... let's move on.\nWe already know about various extra buttons and indicators that make it compatible with the Switch, but a fun detail in the product description also confirms rumble. This writer had assumed that would be the case, which was probably silly, but in any case it is a feature.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/yes-the-nintendo-64-controller-for-switch-has-rumble",
          "publishedOn": "2021-10-15T16:30:00.000Z",
          "wordCount": 2554,
          "title": "Yes, The Nintendo 64 Controller For Switch Has Rumble"
        },
        {
          "id": "https://www.nintendolife.com/#article-122353",
          "author": null,
          "description": "Brewster, Tortimer, Kapp'n, and more!\nWell, that was a jam-packed Animal Crossing Direct, wasn't it? Here at NLHQ, we're all frantically trying to type out the ten billion things that were just announced in that 20-minute showcase, and our fingers have already almost fallen off.\nFor now, though, let's have a look at all the new, returning, and improved special characters for Animal Crossing: New Horizons, as well as some of the ones we probably won't be seeing...\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/guides/animal-crossing-new-horizons-all-the-returning-special-characters",
          "publishedOn": "2021-10-15T16:15:00.000Z",
          "wordCount": 4255,
          "title": "Guide: Animal Crossing: New Horizons: All The Returning Special Characters"
        }
      ]
    },
    {
      "title": "Rock Paper Shotgun Latest Articles Feed",
      "feedUrl": "https://www.rockpapershotgun.com/feed",
      "siteUrl": "https://www.rockpapershotgun.com/feed",
      "articles": [
        {
          "id": "https://www.rockpapershotgun.com/the-sunday-papers-614",
          "author": "Ed Thorn",
          "description": "Sundays are for inhaling the smell of a new book. Before you lean in, let's read this week's best writing about games.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-sunday-papers-614",
          "publishedOn": "2021-10-17T10:00:00.000Z",
          "wordCount": 1180,
          "title": "The Sunday Papers"
        },
        {
          "id": "https://www.rockpapershotgun.com/gta-the-trilogy-system-requirements-and-details-allegedly-leak",
          "author": "Graham Smith",
          "description": "Rockstar finally announced their long-rumoured Grand Theft Auto remasters a little over a week ago. Official confirmation that they were on the way hasn't stopped the leaks, however. A user of GTAForums has seemingly leaked a more detailed description of the games and their system requirements.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/gta-the-trilogy-system-requirements-and-details-allegedly-leak",
          "publishedOn": "2021-10-16T23:26:28.000Z",
          "wordCount": 947,
          "title": "GTA: The Trilogy system requirements and details allegedly leak"
        },
        {
          "id": "https://www.rockpapershotgun.com/dota-2s-next-hero-is-marci-from-the-dota-dragons-blood-anime",
          "author": "Graham Smith",
          "description": "Dota 2 is getting a new hero this autumn. It's Marci, the mute bodyguard from Netflix's Dota anime, Dota: Dragon's Blood. She'll join the game in an update \"coming soon.\"\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/dota-2s-next-hero-is-marci-from-the-dota-dragons-blood-anime",
          "publishedOn": "2021-10-16T22:42:10.000Z",
          "wordCount": 651,
          "title": "Dota 2's next hero is Marci from the Dota: Dragon's Blood anime"
        },
        {
          "id": "https://www.rockpapershotgun.com/tweet2doom-lets-you-play-doom-via-twitter",
          "author": "Graham Smith",
          "description": "Doom is now playable on Twitter - sort of. Thanks to Tweet2Doom bot, you can send replies to the account with a list of actions - move, turn, shoot, etc. - and get a video clip of Doom showing the results sent back to you. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/tweet2doom-lets-you-play-doom-via-twitter",
          "publishedOn": "2021-10-16T22:06:44.000Z",
          "wordCount": 795,
          "title": "Tweet2Doom lets you play Doom via Twitter"
        },
        {
          "id": "https://www.rockpapershotgun.com/rocksteadys-suicide-squad-gets-a-new-story-trailer",
          "author": "Graham Smith",
          "description": "Today's DC FanDome event brought another trailer for Rocksteady's Suicide Squad: Kill The Justice League. There's still no gameplay, but the story trailer filled out the world, its cast, and heck, it's good fun. Watch it below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/rocksteadys-suicide-squad-gets-a-new-story-trailer",
          "publishedOn": "2021-10-16T21:27:52.000Z",
          "wordCount": 722,
          "title": "Rocksteady's Suicide Squad gets a new story trailer"
        },
        {
          "id": "https://www.rockpapershotgun.com/epic-games-store-will-welcome-games-that-make-use-of-blockchain-tech",
          "author": "Graham Smith",
          "description": "Yesterday Valve told developers that they wouldn't allow games featuring NFTs or cryptocurrency on their digital storefront, Steam. Since then, Epic have followed up by telling The Verge that the Epic Games Store would be \"open to games that support cryptocurrency or blockchain-based assets.\"\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/epic-games-store-will-welcome-games-that-make-use-of-blockchain-tech",
          "publishedOn": "2021-10-16T20:48:45.000Z",
          "wordCount": 814,
          "title": "Epic Games Store will \"welcome games that make use of blockchain tech\""
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-dungeons-adds-roguelikelike-singleplayer-mode-this-december",
          "author": "Imogen Beckhelling",
          "description": "Minecraft Dungeons has finished telling its story through a number of DLCs that have released over the last year, but Mojang isn't done with the blocky Diablo-like just yet. They're introducing seasonal updates that they're calling Seasonal Adventures, adding progression systems, challenges and more - similar to the new Sea Of Thieves' Seasons. Season 1 will be called The Cloudy Climb, and it's coming this December. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-dungeons-adds-roguelikelike-singleplayer-mode-this-december",
          "publishedOn": "2021-10-16T19:10:00.000Z",
          "wordCount": 833,
          "title": "Minecraft Dungeons adds roguelikelike singleplayer mode this December"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecrafts-the-wild-update-will-add-excellent-frogs-after-caves-cliffs",
          "author": "Imogen Beckhelling",
          "description": "With Minecraft's Caves & Cliffs part 2 nearly upon us, Mojang have revealed the next big update that will follow it. Named The Wild Update, it'll focus on enhancing some of the existing areas we can explore and, importantly, adding colourful frogs! They'll arrive with the new Mangrove Swamp biome, along with tadpoles, fireflies and more. The Wild Update will also introduce the Deep Dark biome, which was supposed to arrive with Caves & Cliffs, but needed a little more time in the oven. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/minecrafts-the-wild-update-will-add-excellent-frogs-after-caves-cliffs",
          "publishedOn": "2021-10-16T19:05:00.000Z",
          "wordCount": 931,
          "title": "Minecraft's The Wild Update will add excellent frogs after Caves & Cliffs"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-will-soon-bundle-java-and-bedrock-editions-together",
          "author": "Imogen Beckhelling",
          "description": "For years and years, Minecraft's Java and Bedrock editions have lived apart, but Mojang finally have plans to unite them. They plan to package the two together next year as the Minecraft PC Bundle, so if you own one you'll get the other too. Ahead of this, both Java and Bedrock are coming to Xbox Game Pass for PC on November 2nd, which is lovely news. I've only ever owned Java, so it'll be nice to have the option to jump into Bedrock too.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-will-soon-bundle-java-and-bedrock-editions-together",
          "publishedOn": "2021-10-16T19:00:00.000Z",
          "wordCount": 766,
          "title": "Minecraft will soon bundle Java and Bedrock editions together"
        },
        {
          "id": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-165",
          "author": "Alice O'Connor",
          "description": "A week of goodbyes. Vid bud Colm waved goodbye on Monday, and Friday was the final shift at the news face for longtime evening freelancer Lauren Morton. She leaves us to join cheery RPS fanzine PC Gamer and they'll be lucky to have her, as we were. Say goodbye, gang.\nRead more",
          "link": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-165",
          "publishedOn": "2021-10-16T08:00:00.000Z",
          "wordCount": 1143,
          "title": "What are we all playing this weekend?"
        },
        {
          "id": "https://www.rockpapershotgun.com/portal-speedrunner-explains-their-wild-tricks-to-valve-developers",
          "author": "Lauren Morton",
          "description": "I'm constantly in awe of the wild tricks that speedrunners discover in just about any game they set their collective minds to. It's always a treat to hear developers being equally astounded though, and Valve's developers are no exception. Three of them recently got to have a chat with Portal speedrunner \"CantEven\" to ask about extremely calculated trick shots, weird save glitches, and all the other things that game developers don't always know about their own games.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/portal-speedrunner-explains-their-wild-tricks-to-valve-developers",
          "publishedOn": "2021-10-15T22:48:02.000Z",
          "wordCount": 872,
          "title": "Portal speedrunner explains their wild tricks to Valve developers"
        },
        {
          "id": "https://www.rockpapershotgun.com/twitch-are-confident-no-passwords-or-credit-cards-were-exposed-in-leak",
          "author": "Lauren Morton",
          "description": "Twitch were hit by a rather big source code and data breach earlier this month, which they say they've since been investigating. They've updated users again today, reiterating that the breach was made possible by a server configuration change and that they're confident no passwords, login credentials, or credit card numbers were exposed.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/twitch-are-confident-no-passwords-or-credit-cards-were-exposed-in-leak",
          "publishedOn": "2021-10-15T22:07:41.000Z",
          "wordCount": 724,
          "title": "Twitch are \"confident\" no passwords or credit cards were exposed in leak"
        },
        {
          "id": "https://www.rockpapershotgun.com/retro-sci-fi-thriller-the-invincible-now-has-a-proper-trailer",
          "author": "Lauren Morton",
          "description": "Retro-future sci-fi romp The Invincible is the upcoming thriller from some folks formerly of The Witcher, Cyberpunk, Dying Light, and others. It's based on the sci-fi novel of the same title from the 60s by Polish author Stanisław Lem. The first we saw of The Invincible last year was mostly a teaser set to some nice tunes, but now there's a full cutscene-style trailer to check out and it sure does look like some classic space stuff.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/retro-sci-fi-thriller-the-invincible-now-has-a-proper-trailer",
          "publishedOn": "2021-10-15T21:05:14.000Z",
          "wordCount": 832,
          "title": "Retro sci-fi thriller The Invincible now has a proper trailer"
        },
        {
          "id": "https://www.rockpapershotgun.com/steam-is-banning-games-with-nfts-and-cryptocurrency",
          "author": "Lauren Morton",
          "description": "Valve appear to be laying down some new rules for games on Steam, specifically games that involve trading or receiving cryptocurrancy and NFTs. The change has been shared by SpacePirate Games, developers of Age Of Rust, who say they were notified this week about the new prohibition. Over in the Steamworks portal, a new type of content that cannot be published on Steam has been added. \"Applications built on blockchain technology that issue or allow exchange of cryptocurrencies or NFTs.\"\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/steam-is-banning-games-with-nfts-and-cryptocurrency",
          "publishedOn": "2021-10-15T20:14:57.000Z",
          "wordCount": 860,
          "title": "Steam is banning games with NFTs and cryptocurrency"
        },
        {
          "id": "https://www.rockpapershotgun.com/lo-fi-adventure-chasing-static-is-now-out-with-some-classic-horror-puzzling",
          "author": "Lauren Morton",
          "description": "Chasing Static is both the name of this lo-fi Welsh horror story and also an accurate description of me attempting to track down a post about it on RPS. Someone's written about it. I just know it. Oh no, we've just mentioned it several times in a roundabout way. Well, I've finally pinned it down—chased the clues and cornered it now that it's launched and I can tell you a thing or two about it. Chasing Static is a swell and spooky story so far with a good chunk of classic horror game puzzling and just a bit of sudden scares. Come on and have a quick look.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/lo-fi-adventure-chasing-static-is-now-out-with-some-classic-horror-puzzling",
          "publishedOn": "2021-10-15T16:56:16.000Z",
          "wordCount": 918,
          "title": "Lo-fi adventure Chasing Static is now out with some classic horror puzzling"
        },
        {
          "id": "https://www.rockpapershotgun.com/ultimate-audio-bang-16-all-things-fps-merch",
          "author": "Ed Thorn",
          "description": "I've returned from my trip to the Lake District, with aching calves and a desire to talk about online shooters with Imogen. On this week's episode of the Ultimate Audio Bang, we don't chat sore muscles, instead, we focus on various Halloween events in games like Apex Legends and Rainbow Six: Siege, our thoughts on the Battlefield 2042 beta, Destiny 2 vaulting yet more stuff, and Call Of Duty: Vanguard finally introducing anti-cheat.\nRead more",
          "link": "https://www.rockpapershotgun.com/ultimate-audio-bang-16-all-things-fps-merch",
          "publishedOn": "2021-10-15T16:24:48.000Z",
          "wordCount": 816,
          "title": "Ultimate Audio Bang #16: all things FPS merch"
        },
        {
          "id": "https://www.rockpapershotgun.com/tfi-friday-three-indie-puzzle-games-with-slightly-melancholy-vibe",
          "author": "Alice Bell",
          "description": "The year has finally turned, reader. I am having discussions at home about putting the heating on. When I leave the office it isn't dark, but it's fuzzy around the edges. My knuckles are cold. It's the time of year, before the Skeleton War memes begin in earnest, to luxuriate in feeling a bit melancholy. It's healthy to feel sad sometimes, you know. Didn't you watch Inside Out? I did, and in my screening at the cinema a child called out \"Where's Bing Bong?\" when the heroic Bing Bong disappeared...\nThis week, I have collected three different puzzle games with very different vibes. I know I'm biased in favour of puzzle games more than the usual reader, but these ones are very good and worth a punt, and at least one should pique the old interest. And they all gave me that happy-sad feeling. Like, I want to wrap up in a blanket and play these games and maybe think about my granny a bit. That sort of feeling.\nRead more",
          "link": "https://www.rockpapershotgun.com/tfi-friday-three-indie-puzzle-games-with-slightly-melancholy-vibe",
          "publishedOn": "2021-10-15T15:45:00.000Z",
          "wordCount": 1468,
          "title": "TFI Friday: three indie puzzle games with slightly melancholy vibe"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-roblox-horror-games",
          "author": "Rebecca Jones",
          "description": "What are the best horror games in Roblox? It's October once again, so naturally our minds are turning to Halloween. There are so, so many horror games in the world to choose from, especially since it's a genre that lends itself so well to short indie offerings. What I'm getting at here is that there are tons of scary games on Roblox, and if you fancy giving some a go this spooky season, we've put together a list of all-time favourites and current big trends.\nYou might have seen \"scary corn game\" trending in Roblox circles recently, and if you're wondering why that is, it's because no-one can spell or pronounce Kalampokiphobia — the technical name for fear of corn. This game, which originally popped up on the platform earlier this year, looks set to be the big Roblox horror trend this Halloween, egged on by TikTok and YouTube jumpscare videos that have been doing the rounds. It's a pretty standard run-and-hide game with a truly ludicrous (but somehow still a bit creepy) stalker character pursuing you through a disorienting corn maze.\nHere's the link.\n Read more",
          "link": "https://www.rockpapershotgun.com/best-roblox-horror-games",
          "publishedOn": "2021-10-15T15:42:10.000Z",
          "wordCount": 1836,
          "title": "Best Roblox horror games: great scary games in Roblox"
        },
        {
          "id": "https://www.rockpapershotgun.com/mon-amour-is-the-most-crazed-loved-up-take-on-flappy-bird-youll-ever-see",
          "author": "Katharine Castle",
          "description": "It's been a banner week for Japanese indie game releases. First we had the delightful puzzle platformer ElecHead, now we have the latest from Onion Games, Mon Amour. It's a one-button score attack game in the same vein as Flappy Bird, only instead of piloting a dumpy chicken through a bunch of green pipes, here you're guiding a spinning, mustachioed man toward dozens of smoochable women. But before you arch that eyebrow at its somewhat questionable premise, yes, this is another entry from Onion Games where kissing saves the day, following in the esteemed footsteps of Chulip and Dandy Dungeon - and yes, it is every bit as mad and baffling (and exquisitely designed) as you'd expect.  \nRead more",
          "link": "https://www.rockpapershotgun.com/mon-amour-is-the-most-crazed-loved-up-take-on-flappy-bird-youll-ever-see",
          "publishedOn": "2021-10-15T15:38:35.000Z",
          "wordCount": 774,
          "title": "Mon Amour is the most crazed, loved up take on Flappy Bird you'll ever see"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-karlee",
          "author": "Hayden Hefford",
          "description": "Want to know the best build for Karlee in Back 4 Blood? Karlee isn’t one of the best characters in Back 4 Blood, but she still has some killer abilities that deserve a spot in your team. Most notably, Karlee can sense nearby hazards and Special Ridden, so you won’t be surprised when a Tallboy smashes around the corner. She also gets an extra quick inventory slot (used for defibrillators and stun guns) and increases the team’s use speed by 50%.\nThis guide will show you how to make the best Karlee build in Back 4 Blood, so you can stop staring at cards and start using them. Of course, you’ll need to unlock all the cleaners in Back 4 Blood before you can play as Karlee.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-karlee",
          "publishedOn": "2021-10-15T14:09:15.000Z",
          "wordCount": 1142,
          "title": "The best Back 4 Blood Karlee build"
        },
        {
          "id": "https://www.rockpapershotgun.com/song-of-farca-is-great-if-you-dont-take-it-personally",
          "author": "Sin Vega",
          "description": "Often a game can feel frustrating because you can't make decisions that you want to. I had this initially with Song Of Farca. It almost kept me from playing it further, until I came back at it with a different attitude instead, thanks to a few conversations I've had lately about player choice versus narrative.\nYou play as Izy Song, a hacking-based private investigator in a fictional, dystopian island in the near future. And she's kind of a fool.\nRead more",
          "link": "https://www.rockpapershotgun.com/song-of-farca-is-great-if-you-dont-take-it-personally",
          "publishedOn": "2021-10-15T14:00:00.000Z",
          "wordCount": 658,
          "title": "Song Of Farca is great if you don't take it personally"
        },
        {
          "id": "https://www.rockpapershotgun.com/far-cry-6-co-op-multiplayer",
          "author": "Ollie Toms",
          "description": "Want to know how to play Far Cry 6 in co-op multiplayer? Ubisoft's bombastic open-world FPS franchise is always best played with company. Double the players, double the devastation, after all. And Far Cry 6 has taken after its predecessors in offering players a couple of different ways to play the game in co-op. Whether you're looking for self-contained co-op missions or you want to play through the entire story with a friend, read on to find out how to set up Far Cry 6 for multiplayer.\nRead more",
          "link": "https://www.rockpapershotgun.com/far-cry-6-co-op-multiplayer",
          "publishedOn": "2021-10-15T13:57:47.000Z",
          "wordCount": 1264,
          "title": "How to play Far Cry 6 in co-op multiplayer mode"
        },
        {
          "id": "https://www.rockpapershotgun.com/crysis-2-3-remastered-are-out-now-making-the-trilogy-maximum-shiny",
          "author": "Alice O'Connor",
          "description": "All three games of the Crytek's super-powered shooter trilogy are now available fancied up with modern graphical bells and whistles, with Crysis 2 Remastered and Crysis 3 Remastered today following the first game's 2020 revamp. Given that developers Crytek were always years ahead of most shooters in shininess, the originals hardly look hideous but hey, you can pay for extra fancieness. The first game was always the best though.\nRead more",
          "link": "https://www.rockpapershotgun.com/crysis-2-3-remastered-are-out-now-making-the-trilogy-maximum-shiny",
          "publishedOn": "2021-10-15T13:33:01.000Z",
          "wordCount": 926,
          "title": "Crysis 2 & 3 Remastered are out now, making the trilogy maximum shiny"
        },
        {
          "id": "https://www.rockpapershotgun.com/rally-point-how-to-pay-the-deposit-and-enjoy-playing-strategy-games",
          "author": "Sin Vega",
          "description": "Strategy games are, as everyone knows, much like moving house. Whether it's your first, daunting one and you don't yet know that the whole \"most stressful thing in life\" line is a total lie, or you stopped counting house moves after your 15th, there's one obstacle that never stops getting in the way: the deposit.\r\n\nYou know you can pay it, theoretically. You could gather together the energy and focus it takes. It is not beyond you to learn how a new game works and take the time to situate yourself within its world. But doing it all at once? Right now? Ach. Now you're asking.\nThat's the deposit. And it prevents you from playing games you'd love.\nRead more",
          "link": "https://www.rockpapershotgun.com/rally-point-how-to-pay-the-deposit-and-enjoy-playing-strategy-games",
          "publishedOn": "2021-10-15T12:00:00.000Z",
          "wordCount": 2145,
          "title": "Rally Point: how to pay the deposit and enjoy playing strategy games"
        },
        {
          "id": "https://www.rockpapershotgun.com/call-of-duty-warzones-shiny-new-anti-cheat-might-have-leaked-already",
          "author": "Imogen Beckhelling",
          "description": "This week, Activision revealed Ricochet, their new kernel-level anti-cheat that will be used for Call Of Duty: Vanguard and Warzone. They've been in a constant battle with cheaters for ages now, so it's nice to see them stepping up their anti-cheat game. Unfortunately, Ricochet might have already leaked, and it's claimed cheat-makers are currently working on reverse-engineering it. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/call-of-duty-warzones-shiny-new-anti-cheat-might-have-leaked-already",
          "publishedOn": "2021-10-15T11:48:06.000Z",
          "wordCount": 826,
          "title": "Call Of Duty: Warzone's shiny new anti-cheat might have leaked already"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-jim",
          "author": "Hayden Hefford",
          "description": "Want to know the best build for Jim in Back 4 Blood? Jim is quick to take aim and fire thanks to his increased ADS speed, but damage is his real strength. With each precision kill, Jim gains 2.5% stacking damage, which stays until you are hit. This means you could increase Jim’s damage to ridiculous levels if you avoid damage. Oh, and he also gets a 10% boost to team weakspot damage, so it shouldn’t come as a surprise that Jim deserves a spot on your team in Back 4 Blood.\nThis guide will show you everything that you need to know to make the best Jim build in Back 4 Blood.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-jim",
          "publishedOn": "2021-10-15T10:59:40.000Z",
          "wordCount": 1278,
          "title": "The best Back 4 Blood Jim build"
        },
        {
          "id": "https://www.rockpapershotgun.com/gears-tactics-and-dirty-bomb-devs-working-on-a-new-sci-fi-game",
          "author": "Imogen Beckhelling",
          "description": "Splash Damage, the folks who made Gears Tactics and Brink, have announced they're working on a new sci-fi game. They've worked on a number of series created by other developers over the years, including Wolfenstein and Gears, but haven't made their own PC game since Dirty Bomb in 2014. It'll be interesting to see what they have in store - perhaps a first-person shooter like Wolfenstein: Enemy Territory? Or maybe something more strategic, given Gears Tactics' success.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/gears-tactics-and-dirty-bomb-devs-working-on-a-new-sci-fi-game",
          "publishedOn": "2021-10-15T10:22:41.000Z",
          "wordCount": 876,
          "title": "Gears Tactics and Dirty Bomb devs working on a new sci-fi game"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-hoffman",
          "author": "Hayden Hefford",
          "description": "Want to know the best build for Hoffman in Back 4 Blood? Hoffman is one of the best characters in Back 4 Blood, as he has a chance to find ammo when he kills Ridden, whilst also increasing the team’s max ammo capacity by 10%. As a bonus, he also carries an extra grenade so that you can make more zombies go boom.\nThis guide will show you everything you need to know to make the best Hoffman build in Back 4 Blood. However, don't expect to play as Hoffman straight away. You'll need to actually unlock all of the cleaners in Back 4 Blood first.\n \nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-hoffman",
          "publishedOn": "2021-10-15T09:59:26.000Z",
          "wordCount": 1196,
          "title": "The best Back 4 Blood Hoffman build"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloops-first-major-update-fixes-stuttering-adds-dlss-support",
          "author": "Alice O'Connor",
          "description": "Exactly one month after launch, Deathloop received its \"first major game update\" last night. Along with (hopefully?) fixing lingering issues with stuttering framerates, it has added DLSS support to give Nvidia folks a big FPS boost, fixed some crashes and other bugs, including a nasty one where a bad menu option would reset Colt's progress, and generally improved things. And this is the point where I think I'll finally play the game.\nRead more",
          "link": "https://www.rockpapershotgun.com/deathloops-first-major-update-fixes-stuttering-adds-dlss-support",
          "publishedOn": "2021-10-15T09:52:58.000Z",
          "wordCount": 966,
          "title": "Deathloop's first \"major\" update fixes stuttering, adds DLSS support"
        },
        {
          "id": "https://www.rockpapershotgun.com/diablo-2-resurrecteds-servers-falling-over-due-to-modern-player-behaviour",
          "author": "Graham Smith",
          "description": "Diablo II: Resurrected launched to widespread and ongoing server issues. Today, a Blizzard community manager offered some insight into the nature of the problem - and it's partly some 20-year-old code, and partly some modern player behaviour.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/diablo-2-resurrecteds-servers-falling-over-due-to-modern-player-behaviour",
          "publishedOn": "2021-10-14T23:21:27.000Z",
          "wordCount": 998,
          "title": "Diablo 2 Resurrected's servers falling over due to \"modern player behaviour\""
        },
        {
          "id": "https://www.rockpapershotgun.com/fifa-reportedly-wants-double-the-old-licence-fee-from-ea",
          "author": "Graham Smith",
          "description": "Last week, EA said they were considering renaming FIFA, their long-running football series. The issue is that their licensing deal with football's world governing body is up for renewal. Now a report by the New York Times says that the issue is that FIFA want double what they were getting before for EA to continue using the name.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/fifa-reportedly-wants-double-the-old-licence-fee-from-ea",
          "publishedOn": "2021-10-14T22:09:55.000Z",
          "wordCount": 824,
          "title": "FIFA reportedly wants double the old licence fee from EA"
        },
        {
          "id": "https://www.rockpapershotgun.com/dungeon-encounters-is-out-now-offering-encounters-in-dungeons",
          "author": "Graham Smith",
          "description": "Sometimes a functional game strikes me as bland or forgettable. Dungeon Encounters appeals to me, oddly. I look at this game about exploring 99 levels of a dungeon, fighting enemies using an iteration of Final Fantasy's Active Time Battle System, designed by the man who created it, and I think: yes, you should be called Dungeon Encounters.\r\n\nIt's out now, and there's a new launch trailer below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/dungeon-encounters-is-out-now-offering-encounters-in-dungeons",
          "publishedOn": "2021-10-14T21:28:06.000Z",
          "wordCount": 729,
          "title": "Dungeon Encounters is out now, offering encounters in dungeons"
        },
        {
          "id": "https://www.rockpapershotgun.com/call-of-duty-vanguards-zombie-mode-shows-new-supernatural-powers",
          "author": "Graham Smith",
          "description": "Call Of Duty: Vanguard has finally revealed its zombie mode. It continues the zombies storyline from the Black Ops series, returning to WW2, where you'll be fighting Nazi zombies with the aid of new 'Dark Aether' powers. The reveal trailer is below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/call-of-duty-vanguards-zombie-mode-shows-new-supernatural-powers",
          "publishedOn": "2021-10-14T21:08:02.000Z",
          "wordCount": 698,
          "title": "Call Of Duty: Vanguard's Zombie mode shows new supernatural powers"
        },
        {
          "id": "https://www.rockpapershotgun.com/is-this-the-cheapest-4tb-ssd-ever-312-for-a-samsung-870-qvo",
          "author": "Will Judd",
          "description": "The massive 4TB Samsung 870 Qvo has hit a historic low price at Newegg, where you can use code EMCXHEHU2 to knock this drive from $390 to just $312. That's an incredible price for a high-speed SATA SSD, just 8¢ per gigabyte (!!). \nRead more",
          "link": "https://www.rockpapershotgun.com/is-this-the-cheapest-4tb-ssd-ever-312-for-a-samsung-870-qvo",
          "publishedOn": "2021-10-14T20:20:51.000Z",
          "wordCount": 823,
          "title": "Is this the cheapest 4TB SSD ever? $312 for a Samsung 870 Qvo"
        },
        {
          "id": "https://www.rockpapershotgun.com/lenovos-legion-5-pro-rtx-3070-laptop-is-back-in-stock-and-10-off",
          "author": "Will Judd",
          "description": "Lenovo's Legion 5 Pro 16 hits the current sweet spot for a high-end gaming laptop: an RTX 3070 graphics card, an AMD Ryzen 7 5800H processor and a 2560x1600 165Hz screen. These screens are a new addition for 2021, and make a massive difference when it comes to the amount of visible detail for playing games or just browsing the web.\nThis particular laptop has been out of stock for some time, but it's finally returned to Lenovo's online store - and you can get it for 10% off when you sign up to Lenovo's email newsletter. That knocks £150 off the price, bringing this high-spec laptop to £1350.\nRead more",
          "link": "https://www.rockpapershotgun.com/lenovos-legion-5-pro-rtx-3070-laptop-is-back-in-stock-and-10-off",
          "publishedOn": "2021-10-14T19:44:19.000Z",
          "wordCount": 891,
          "title": "Lenovo's Legion 5 Pro RTX 3070 laptop is back in stock and 10% off"
        },
        {
          "id": "https://www.rockpapershotgun.com/paradox-considered-cancelling-vampire-the-masquerade-bloodlines-2",
          "author": "Alice O'Connor",
          "description": "When Paradox Interactive made the remarkable decision to take Vampire: The Masquerade - Bloodlines 2 away from its original developers, Hardsuit Labs, the company considered outright cancelling the game. That's according to returning CEO Fredrik Wester in a recent interview. Paradox still aren't saying who's making the World Of Darkness RPG now nor when it will be done, but apparently it's still happening?\nRead more",
          "link": "https://www.rockpapershotgun.com/paradox-considered-cancelling-vampire-the-masquerade-bloodlines-2",
          "publishedOn": "2021-10-14T19:22:07.000Z",
          "wordCount": 1033,
          "title": "Paradox considered cancelling Vampire: The Masquerade - Bloodlines 2"
        },
        {
          "id": "https://www.rockpapershotgun.com/baldurs-gate-3-has-added-a-sorcerer-class-and-new-region-in-latest-patch",
          "author": "Alice O'Connor",
          "description": "As Baldur's Gate 3 continues its adventure through early access, the fantasy RPG from the makers of Divinity: Original Sin has whacked in a load of newness. Patch 6 hit today to continue the story, add a Sorcerer class, open the new region called Grymforge, and spruce up the graphics. Some might focus on those big features, me I'm all about a little one: a Sorcerer spell which lets you turn characters tiny or giant. We'll see who's a tadpole now!\nRead more",
          "link": "https://www.rockpapershotgun.com/baldurs-gate-3-has-added-a-sorcerer-class-and-new-region-in-latest-patch",
          "publishedOn": "2021-10-14T17:37:05.000Z",
          "wordCount": 950,
          "title": "Baldur's Gate 3 has added a Sorcerer class and new region in latest patch"
        },
        {
          "id": "https://www.rockpapershotgun.com/sweat-shar-and-sorcerers-make-for-a-killer-new-update-for-baldurs-gate-3",
          "author": "Matthew Castle",
          "description": "Larian put blood, sweat and tears into Baldur’s Gate 3’s latest patch. I mean, they’ve literally put them in: venture into the scorching heat of a subterranean forge and you’ll see a greasy sheen on your hero’s face during conversational close-ups. Get blood spattered on you in battle and it’ll remain until you take a long rest to wash it away. Same goes for dirt, and bruises that bloom at low health. “We want you to feel you’ve been adventuring a bit,” says lead systems designer Nick Pechenin, “rather than just stepping out of a modelling agency.”\r\n\n\r\nIf he’d seen the potato-faced oddballs I’ve repeatedly made in character creation (saves are not compatible between big patches) Pechenin would not be so generous. Even so, I like seeing heroes wearing evidence of their travels. An earlier patch already made the camping system feel more demanding - a small price in food means you can’t just spam it after every fight - and now those longer treks between naps can visually sell you on the difficult journey heroes are undertaking, too. A journey that, with patch six, has gotten a little longer.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/sweat-shar-and-sorcerers-make-for-a-killer-new-update-for-baldurs-gate-3",
          "publishedOn": "2021-10-14T17:30:00.000Z",
          "wordCount": 2086,
          "title": "Sweat, Shar and sorcerers make for a killer new update for Baldur’s Gate 3"
        },
        {
          "id": "https://www.rockpapershotgun.com/elechead-review",
          "author": "Katharine Castle",
          "description": "ElecHead is one of those devilishly clever puzzle platformers that delights at every turn. Developed by solo dev NamaTakahashi, you play as the titular Elec, a tiny robot whose body can electrify whatever surface he touches, causing it to light up a dazzling shade of yellow in the dark halls of a strange, underground facility. \nTechnically, it's his head where his electrical currents stem from, which you quickly learn how to throw in order to flip switches from afar, create new platforms and dodge deadly obstacles in order to get from one side of the room to the other. The catch? Elec's body only has ten seconds of power left when he's without his head, causing him to explode if he doesn't reach it in time. The result is a stunningly good puzzle game whose bank of brilliantly conceived ideas is executed to perfection, and it left me with a big fat grin on my face for the whole of its three hour run-time.\nRead more",
          "link": "https://www.rockpapershotgun.com/elechead-review",
          "publishedOn": "2021-10-14T16:35:20.000Z",
          "wordCount": 1396,
          "title": "ElecHead review: a clever puzzle platformer with real spark"
        },
        {
          "id": "https://www.rockpapershotgun.com/far-cry-6-secret-ending",
          "author": "Ollie Toms",
          "description": "Want to know how to get the secret ending in Far Cry 6? If you've played previous entries in Ubisoft's long-running open-world FPS series, you'll likely have come to expect a secret ending somewhere early on. But fittingly for a game of this scale, in Far Cry 6 the secret ending comes not right at the very beginning, but a few hours into the game once everything starts to open up. Keep reading to learn exactly what to do to unlock Far Cry 6's secret ending.\nRead more",
          "link": "https://www.rockpapershotgun.com/far-cry-6-secret-ending",
          "publishedOn": "2021-10-14T15:46:07.000Z",
          "wordCount": 1166,
          "title": "Far Cry 6 secret ending"
        },
        {
          "id": "https://www.rockpapershotgun.com/a-windows-11-update-made-amd-performance-even-worse",
          "author": "James Archer",
          "description": "The problems keep coming for Windows 11. Besides missing gaming features and a vote of no confidence by cloud PC providers, perhaps the worst of it has been a bug that drastically increases L3 cache latency on most AMD chips. That includes some of the best CPUs for gaming, like the Ryzen 5 5600X, and while both AMD and Microsoft have promised fixes, an unrelated Windows 11 update appears to have made the problem even worse.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/a-windows-11-update-made-amd-performance-even-worse",
          "publishedOn": "2021-10-14T15:45:46.000Z",
          "wordCount": 823,
          "title": "A Windows 11 update made AMD performance even worse"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-electronic-wireless-episode-160-the-best-cities-in-games-special",
          "author": "Alice Bell",
          "description": "This week the Electronic Wireless Show podcast is going the place you can always go when you're alone and life is making you lonely. That's right: down town! We're talking about our favourite cities in games, although we spend a lot of time talking about city builders even though we decide they probably don't meet the brief.\nSurprisingly, though, we talk about games so much this week that we run out of time to do a Cavern Of Lies! Even though I had actually prepared one! Unprecedented scenes. Don't worry, though, because there are plenty of diversions this week too, including Nate's unwise excursion into green milk, and Matthew eating something he shouldn't ought to have ate.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-electronic-wireless-episode-160-the-best-cities-in-games-special",
          "publishedOn": "2021-10-14T15:25:35.000Z",
          "wordCount": 877,
          "title": "EWS podcast episode 160: the best cities special"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-doc",
          "author": "Hayden Hefford",
          "description": "Want to know the best build for Doc in Back 4 Blood? Doc is the resident healer in Back 4 Blood, so she takes on a supportive role like Mom. Doc’s passive bonuses allow her to heal each teammate for 25 health once per level, whilst also increasing her healing efficiency and the team’s trauma resistance. However, you'll need to know how to unlock all cleaners in Back 4 Blood before you can select Doc in your campaign.\nThis guide will show you everything that you need to know to create the best Doc build in Back 4 Blood, so that you can keep your teammates at the top of their game.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-doc",
          "publishedOn": "2021-10-14T15:13:42.000Z",
          "wordCount": 1313,
          "title": "The best Back 4 Blood Doc build"
        },
        {
          "id": "https://www.rockpapershotgun.com/battlefield-2042s-hazard-zone-mode-strikes-me-as-a-bit-hunt-showdown",
          "author": "Ed Thorn",
          "description": "Multiplayer FPS Battlefield 2042's Conquest and Breakthrough modes are largely about shooting bullets across vast distances on a vast map while trying to capture a vast number of objectives. They are vast, mate. But the newly revealed Hazard Zone mode? Nope, this is smaller, more survival-oriented, with a hint of Hunt: Showdown.\nRead more",
          "link": "https://www.rockpapershotgun.com/battlefield-2042s-hazard-zone-mode-strikes-me-as-a-bit-hunt-showdown",
          "publishedOn": "2021-10-14T15:01:46.000Z",
          "wordCount": 985,
          "title": "Battlefield 2042's Hazard Zone mode strikes me as a bit Hunt: Showdown"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-good-life-review",
          "author": "Steve Hogarty",
          "description": "The Good Life – which has nothing to do with the 1970s British television show about a couple of doom-prepping swingers who owned an allotment in Surbiton – is a colourful open world adventure in which you play an investigative photographer charged with uncovering the secrets of an idyllic English town.\r\n\n\r\nLike so many of Swery’s previous games, most notably Deadly Premonition, The Good Life is characteristically goofy and haphazard. It can be broadly categorised as a daily life simulator — in the vein of Stardew Valley and Animal Crossing, but not like either of those — with a Pokémon Snap style camera mechanic in which you take photographs of interesting things and people about town for kudos and cash rewards. You can also turn into a dog or a cat whenever you like.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-good-life-review",
          "publishedOn": "2021-10-14T15:00:00.000Z",
          "wordCount": 1628,
          "title": "The Good Life review: tonally stupid, structurally broken, surprisingly deep and occasionally self-aware"
        },
        {
          "id": "https://www.rockpapershotgun.com/liquid-cooling-vs-air-cooling-which-is-better",
          "author": "James Archer",
          "description": "Like just about everything else in your PC, the CPU can get very hot, very quickly. That’s why not even the best CPUs are complete without a dedicated cooler, but which of the two main types are better: liquid coolers or air coolers?\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/liquid-cooling-vs-air-cooling-which-is-better",
          "publishedOn": "2021-10-14T14:55:50.000Z",
          "wordCount": 1892,
          "title": "Liquid cooling vs air cooling: which is better?"
        },
        {
          "id": "https://www.rockpapershotgun.com/far-cry-6-rides",
          "author": "Ollie Toms",
          "description": "Looking for more Far Cry 6 Rides to unlock? There is a huge variety of cars and other vehicles to hijack and take back to Vehicle Dropoff Points in Far Cry 6, but none of them compare to the four Rides that you can unlock. These heavily modified cars are the pride of your collection, and can be customised and fitted with all sorts of powerful guns and other armaments.\nBelow you'll find out how to unlock all four Rides in Far Cry 6. Once you know the locations, you can easily go round and unlock them all in 20 minutes or so. So let's get driving!\nRead more",
          "link": "https://www.rockpapershotgun.com/far-cry-6-rides",
          "publishedOn": "2021-10-14T14:00:48.000Z",
          "wordCount": 1299,
          "title": "Far Cry 6 Rides: all four Ride locations and how to unlock them"
        },
        {
          "id": "https://www.rockpapershotgun.com/this-new-battle-royale-is-an-fmv-game",
          "author": "Alice O'Connor",
          "description": "Just when you thought we'd seen every possible permutation of battle royale, here comes the strangest form yet: a movie. An interactive movie, specifically. Bloodshore will drop our laaad onto an island to fight for big money in murderous reality show Kill/Stream, with our decisions pushing the story down different paths and affecting relationships with other contestants. What's next, a battle royale novel?\nRead more",
          "link": "https://www.rockpapershotgun.com/this-new-battle-royale-is-an-fmv-game",
          "publishedOn": "2021-10-14T12:38:45.000Z",
          "wordCount": 783,
          "title": "This new battle royale is an FMV game"
        },
        {
          "id": "https://www.rockpapershotgun.com/halo-2-and-halo-3-have-official-moding-tools-now",
          "author": "Imogen Beckhelling",
          "description": "Fancy tweaking some Halo games to make some cool or cursed content? Then good news! Yesterday, developers 343 industries released modding tools for Halo 2 and Halo 3 alongside the Master Chief Collection's season 8 update. Halo: Combat Evolved got its own official modding tools back in June, and the new tools for 2 and 3 offer similar programs for modders to mess with. I look forward to seeing what good stuff they make.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/halo-2-and-halo-3-have-official-moding-tools-now",
          "publishedOn": "2021-10-14T11:38:45.000Z",
          "wordCount": 837,
          "title": "Halo 2 and Halo 3 have official modding tools now"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-mom",
          "author": "Hayden Hefford",
          "description": "Want to know the best build for Mom in Back 4 Blood? Mom is one of the best characters in Back 4 Blood, with the ability to instantly revive a teammate once per level. She also grants the team an extra life and has an increased support inventory, which you can use for bandages, painkillers, or other medicinal goodies that you find on your zombie-stomping adventures.\nWith our Mom build, we push these supportive capabilities to the limit. Mom won't be able to match more combat-focused characters like Walker when fighting the undead, but she'll definitely pull you back from the brink of death and defeat. This guide will show you how to make the best Mom build in Back 4 Blood.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-mom",
          "publishedOn": "2021-10-14T11:19:33.000Z",
          "wordCount": 1282,
          "title": "The best Back 4 Blood Mom build"
        },
        {
          "id": "https://www.rockpapershotgun.com/live-action-system-shock-show-planned-for-a-new-streaming-site",
          "author": "Alice O'Connor",
          "description": "As if they weren't busy enough remaking System Shock, Nightdive Studio have announced plans for a live-action web TV series based on Looking Glass's sci-fi FPS. It'd be headed to Binge, an upcoming gaming-focused streaming platform which also has plans for a Driver series. Yeah yeah, but who's gonna play Shodan?\nRead more",
          "link": "https://www.rockpapershotgun.com/live-action-system-shock-show-planned-for-a-new-streaming-site",
          "publishedOn": "2021-10-14T10:33:57.000Z",
          "wordCount": 1004,
          "title": "Live-action System Shock show planned for a new streaming site"
        },
        {
          "id": "https://www.rockpapershotgun.com/roblox-squid-game",
          "author": "Rebecca Jones",
          "description": "What are the best Squid Game experiences on Roblox? Odds are you're at least somewhat aware of Squid Game, the Netflix original thriller that came out of nowhere and has been taking the world by storm since its first season released on September 17th. If you've somehow missed it, suffice to say that it's a fictional TV show about a group of desperate people participating in a series of six deadly children's games — so, naturally, the video game imitations have already started to roll in, largely courtesy of Roblox.\n Read more",
          "link": "https://www.rockpapershotgun.com/roblox-squid-game",
          "publishedOn": "2021-10-14T10:16:26.000Z",
          "wordCount": 1624,
          "title": "Roblox Squid Game: the best Squid Game experiences in Roblox"
        },
        {
          "id": "https://www.rockpapershotgun.com/riders-republic-is-most-fun-when-it-turns-into-a-platformer",
          "author": "Ed Thorn",
          "description": "Having given Riders Republic a go over its free-to-play day, I can confirm that it really leans into Ubisoft's current obsession. Splashes of yellow and pink with the word \"Blamo!\" graffitied over the top, that whole thing. This is a Forza Horizon-esque trip, only you're not going to a pleasant festival in a car, you're going to an extreme sports resort with a roving band of TikTokers.\nSwerve through the cringe on your bike, though, and there's some decent fun to be had. And for me, this wasn't so much in the game's fast and furious moments, but when it slowed the pace right down and transformed into a platformer of sorts.\nRead more",
          "link": "https://www.rockpapershotgun.com/riders-republic-is-most-fun-when-it-turns-into-a-platformer",
          "publishedOn": "2021-10-14T08:00:00.000Z",
          "wordCount": 1117,
          "title": "Riders Republic is most fun when it turns into a platformer"
        },
        {
          "id": "https://www.rockpapershotgun.com/former-state-of-decay-founder-launches-new-studio-possibility-space",
          "author": "Lauren Morton",
          "description": "Jeff Strain—co-founder of Guild Wars studio ArenaNet and founder of State Of Decay studio Undead Labs—is now founding a new game studio once again. Strain's studio Possibility Space has already drawn in a group of leadership talent worth paying attention to with history at the likes of Valve, Electronic Arts, Ubisoft, BioWare, Double Fine, and more. Possibility Space doesn't have a game to announce just yet, but is hiring up for their first \"joyful game\" that Strain describes as his \"dream for many years.\"\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/former-state-of-decay-founder-launches-new-studio-possibility-space",
          "publishedOn": "2021-10-13T23:14:28.000Z",
          "wordCount": 892,
          "title": "Former State Of Decay founder launches new studio Possibility Space"
        },
        {
          "id": "https://www.rockpapershotgun.com/amds-superbly-fast-ryzen-9-5900x-is-467-at-amazon",
          "author": "Will Judd",
          "description": "The AMD Ryzen 9 5900X is the company's latest high-end consumer processor, offering 12 cores and 24 threads using the incredibly fast Zen 3 design. AMD's latest generation CPUs have made incredible strides against Intel*, and are now often the best choice for both gaming and content creation - an unthinkable situation just five years ago when Ryzen first launched. \nThe 5900X has been the hardest Ryzen 5000 model to find at a good price, thanks to low supply and incredible demand, but today you can pick one up for a significant discount - £43 below RRP, or £466.92. That's a great price for a CPU of this quality, especially in the middle of a silicon shortage.\nRead more",
          "link": "https://www.rockpapershotgun.com/amds-superbly-fast-ryzen-9-5900x-is-467-at-amazon",
          "publishedOn": "2021-10-13T22:48:35.000Z",
          "wordCount": 1101,
          "title": "AMD's superbly fast Ryzen 9 5900X is £467 at Amazon"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-logitech-g-pro-x-is-our-best-premium-gaming-headset-and-its-just-63-today",
          "author": "Will Judd",
          "description": "The Logitech G Pro X is a fantastic headset - a comfy and well-built premium option that sounds fantastic. Today, it's not so premium any more, as Currys has discounted the headset from its original RRP of £110 to just £62.99 - a massive bargain. To get that price, you'll need to use code FNDDGAMING at the checkout. \nRead more",
          "link": "https://www.rockpapershotgun.com/the-logitech-g-pro-x-is-our-best-premium-gaming-headset-and-its-just-63-today",
          "publishedOn": "2021-10-13T22:24:54.000Z",
          "wordCount": 887,
          "title": "Our 'best premium gaming headset' pick, Logitech's G Pro X, is £63 today"
        },
        {
          "id": "https://www.rockpapershotgun.com/activision-introduce-call-of-dutys-upcoming-ricochet-anti-cheat-system",
          "author": "Lauren Morton",
          "description": "As it goes in online competitive games, Activision are in a constant battle against cheaters in Call Of Duty games. They've banned more than half a million cheaters in Call Of Duty: Warzone and yet there are always more. They've announced a new tool to help crack down: their Ricochet Anti-Cheat system. When it launches in Warzone and Call Of Duty: Vanguard it will include server-side tools along with a kernel-level driver to monitor applications interacting with the game.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/activision-introduce-call-of-dutys-upcoming-ricochet-anti-cheat-system",
          "publishedOn": "2021-10-13T22:04:08.000Z",
          "wordCount": 855,
          "title": "Activision introduce Call Of Duty's upcoming Ricochet Anti-Cheat system"
        },
        {
          "id": "https://www.rockpapershotgun.com/genshin-impact-version-22-is-here-with-a-new-island-and-your-free-5-star-aloy",
          "author": "Lauren Morton",
          "description": "As it does, action and explore 'em up Genshin Impact has rolled out another game update adding more characters, weapons, a domain, and a new island too. Genshin Impact version 2.2 has launched today, opening up more of that new Inazuma area and bringing its first crossover character Aloy of Horizon Zero Dawn fame to the game. You can hop into the new update titled \"Into the Perilous Labyrinth of Fog\" as of today to get started on all the new activities.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/genshin-impact-version-22-is-here-with-a-new-island-and-your-free-5-star-aloy",
          "publishedOn": "2021-10-13T20:11:21.000Z",
          "wordCount": 783,
          "title": "Genshin Impact version 2.2 is here with a new island and your free 5-star Aloy"
        },
        {
          "id": "https://www.rockpapershotgun.com/hyper-light-drifter-developers-next-game-solar-ash-delayed-to-december",
          "author": "Lauren Morton",
          "description": "Solar Ash is the next action-y adventure from the folks behind Hyper Light Drifter, which they've described as \"Super Mario Galaxy meets Shadow Of The Colossus, and sprinkle in a bit of Jet Set Radio.\" It was coming up quite soon, and ranked on RPS's list of best games in October to look forward to thanks to that colourful world and skater-like movement. The monthly list has taken a hit again, as there's a bit longer to wait for it now. Heart Machine have just announced a delay, though fortunately a short one.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/hyper-light-drifter-developers-next-game-solar-ash-delayed-to-december",
          "publishedOn": "2021-10-13T18:37:15.000Z",
          "wordCount": 798,
          "title": "Hyper Light Drifter developer's next game Solar Ash delayed to December"
        },
        {
          "id": "https://www.rockpapershotgun.com/battle-royale-naraka-bladepoint-is-adding-a-1v1-mode-tomorrow",
          "author": "Lauren Morton",
          "description": "After launching in August, mostly-melee battle royale 'em up Naraka: Bladepoint rated on RPS's list of best battle royale games for its parkour and grabble hook fights. If you're all about the battle and less about the royale, Naraka is queueing up a new game mode for you. The new 1v1 mode is inspired by and named after the movie Bloodsport, pitting sixteen players against one another in an elimination tourney until just one emerges as the winner. Naraka's new Bloodsport mode is kicking off tomorrow for you to go face to face and sword to sword with solo challengers.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/battle-royale-naraka-bladepoint-is-adding-a-1v1-mode-tomorrow",
          "publishedOn": "2021-10-13T16:33:16.000Z",
          "wordCount": 857,
          "title": "Battle royale Naraka: Bladepoint is adding a 1v1 mode tomorrow"
        },
        {
          "id": "https://www.rockpapershotgun.com/skyrims-anniversary-edition-might-break-many-mods-badly-modder-warns",
          "author": "Alice O'Connor",
          "description": "November may bring an unpleasant surprise for Skyrim Special Edition players, as one prolific modder has warned that changes in an update will mean a large part of Skyrim modding \"is going to be broken for an unknown length of time\". While it's common for updates to break mods, supposedly this will require a whole lot more work than usual to get back on track. And there's a risk some will never be fixed.\nRead more",
          "link": "https://www.rockpapershotgun.com/skyrims-anniversary-edition-might-break-many-mods-badly-modder-warns",
          "publishedOn": "2021-10-13T16:28:15.000Z",
          "wordCount": 1059,
          "title": "Skyrim's Anniversary Edition might break many mods badly, modder warns"
        },
        {
          "id": "https://www.rockpapershotgun.com/demon-slayer-kimetsu-no-yaiba-the-hinokami-chronicles-review",
          "author": "Hirun Cryer",
          "description": "I love a bit of anime fighting. The darting back and forth over a battlefield the size of a small town, the gravity-defying jumps through the air, the razing of entire cities with the flick of a thumb, the volume of someone’s yell equating to their increase in power - it’s all equal parts enrapturing melodrama and total lunacy. \r\n\n\nDemon Slayer -Kimetsu no Yaiba- The Hinokami Chronicles gets this. It gets that, when I am playing a 3D fighting game adapting a popular manga, I really want to inhabit the part of an incredibly wholesome anime boy, journeying across feudal Japan to cure my younger sister of her demonic sickness and smack around some otherworldly folk on the way there. Tanjiro Kamado is about as pure as anime protagonists come, and if there’s one lovable anime lad whose shoes I had to step into, it’d probably be his.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/demon-slayer-kimetsu-no-yaiba-the-hinokami-chronicles-review",
          "publishedOn": "2021-10-13T16:00:00.000Z",
          "wordCount": 1492,
          "title": "Demon Slayer: The Hinokami Chronicles review: simple, unfiltered fun"
        },
        {
          "id": "https://www.rockpapershotgun.com/amd-radeon-rx-6600-announced",
          "author": "James Archer",
          "description": "AMD have finally launched the Radeon RX 6600, the new entry-level model (which is still kind of a mid-ranger) in the RX 6000 graphics cards series. As expected, it’s a tuned-down relative of the Radeon RX 6600 XT, with fewer cores and lower clock speeds – but the same 8GB of GDDR6 VRAM. As far as I can see, it’s also sold out immediately, despite just releasing with models from Asus, MSI, Gigabyte, XFX, PowerColor and more. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/amd-radeon-rx-6600-announced",
          "publishedOn": "2021-10-13T15:20:56.000Z",
          "wordCount": 981,
          "title": "Here’s the AMD Radeon RX 6600, and where to buy it"
        },
        {
          "id": "https://www.rockpapershotgun.com/finding-zen-in-rally-sim-wrc-10",
          "author": "Ed Thorn",
          "description": "Is it called rally driving or rally racing? Oh, it's neither of these options: it's called rallying. As you can see, I'm no expert on the act of flinging cars around dirt tracks. The only experience I've got is watching other people do so rather beautifully. In fact, that's what inspired me to give rally simulator WRC 10 a whirl and finally learn how to drive, drive.\nBut what I've really learned is terrible, actually. I've learned to totally ignore the bloke who sits next to you and dictates corners. I've learned not to pay attention at all. I'm in my own head, thinking back to that Greek yoghurt I just had. And I'm driving superbly. If I concentrate for even just a second my drive goes to shambles. So long as I find zen, I'm in control.\nRead more",
          "link": "https://www.rockpapershotgun.com/finding-zen-in-rally-sim-wrc-10",
          "publishedOn": "2021-10-13T15:09:38.000Z",
          "wordCount": 768,
          "title": "Finding zen in rally sim WRC 10"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-holly",
          "author": "Hayden Hefford",
          "description": "Want to know the best build for Holly in Back 4 Blood? Holly is our own Alice Bee’s favourite character, and with very good reason. Holly recovers 10 stamina each time she kills a Ridden, gets +10% damage resistance, and even gives the whole team an extra 25 stamina. However, with the right cards, you can push Holly even further, making her an absolute powerhouse and solidifying her position as one of the best characters in Back 4 Blood.\nThis guide will show you how to create the best build for Holly in Back 4 Blood, so you can dive into a session and start punching, stabbing, and smacking Ridden with your choice of melee weapon.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-holly",
          "publishedOn": "2021-10-13T14:52:46.000Z",
          "wordCount": 1249,
          "title": "The best Back 4 Blood Holly build"
        },
        {
          "id": "https://www.rockpapershotgun.com/now-a-union-has-objected-to-activision-blizzards-settlement-too",
          "author": "Imogen Beckhelling",
          "description": "The Communications Workers Of America union (CWA) have filed an objection to the proposed settlement between Activision Blizzard and the USA's Equal Employment Opportunity Commission (EEOC). As part of the settlement to this, one of several current legal battles, ActiBliz have agreed to create an $18 million fund for those who experienced harm from \"sexual harassment, pregnancy discrimination and/or related retaliation\". But the CWA says there are \"a number of serious deficiencies\" with the agreement, and are requesting a fairness hearing to address them. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/now-a-union-has-objected-to-activision-blizzards-settlement-too",
          "publishedOn": "2021-10-13T14:29:56.000Z",
          "wordCount": 912,
          "title": "Now a union has objected to Activision Blizzard's settlement too"
        },
        {
          "id": "https://www.rockpapershotgun.com/oh-my-god-fallout-3-has-removed-games-for-windows-live",
          "author": "Alice O'Connor",
          "description": "After 13 years, Fallout 3 has finally removed Microsoft's reviled (and broken) Games For Windows Live service from the Steam release. Hooray! FO3 is still busted because Bethesda haven't updated the game to run happily on modern Windows, but I'll take any opportunity to dance on GFWL's grave. However, avoid the update if you play FO3 with lots of mods.\nRead more",
          "link": "https://www.rockpapershotgun.com/oh-my-god-fallout-3-has-removed-games-for-windows-live",
          "publishedOn": "2021-10-13T12:17:24.000Z",
          "wordCount": 1097,
          "title": "Oh my god, Fallout 3 has removed Games For Windows Live"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-genshin-impact-arataki-itto-build",
          "author": "Rebecca Jones",
          "description": "When will Arataki Itto be coming to Genshin Impact? Arataki Itto is an upcoming playable character in Genshin Impact whose imminent arrival as a potential party member is causing a great deal of excitement, and let's not pretend we can't work out why.\n Read more",
          "link": "https://www.rockpapershotgun.com/best-genshin-impact-arataki-itto-build",
          "publishedOn": "2021-10-13T12:17:01.000Z",
          "wordCount": 1183,
          "title": "Genshin Impact Arataki Itto: everything we know so far"
        },
        {
          "id": "https://www.rockpapershotgun.com/final-fantasy-xiv-endwalker-preview",
          "author": "Ed Thorn",
          "description": "Shadow Hulk and I, we've been through a lot in MMORPG Final Fantasy XIV. I've learned to love his run, and together we've been largely been taken aback at just how nice everyone in the game is. Right now, though, we've hit a bit of a wall. We're deep in what I've dubbed the 'Filler City' quest line, as we attempt to reach the game's first expansion, Heavensward. Motivation has dipped considerably as of late.\nBut you should have seen me at the Endwalker hands-on preview, Final Fantasy XIV's upcoming fourth expansion. I played as a tall bunny boy, not Shadow Hulk. I was suddenly at the highest level cap, not the foothills of the early-mid game. I soared over new zones and wrestled through a new dungeon in a state of delirium. And now, writing this in the present, I desperately want to go back. Motivation? Renewed.\nRead more",
          "link": "https://www.rockpapershotgun.com/final-fantasy-xiv-endwalker-preview",
          "publishedOn": "2021-10-13T12:00:00.000Z",
          "wordCount": 1546,
          "title": "Final Fantasy XIV: Endwalker has re-motivated me to reach the finish line"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-split-screen",
          "author": "Hayden Hefford",
          "description": "Can you play Split Screen co-op in Back 4 Blood? Back 4 Blood harkens back to some classic co-op games like Left 4 Dead, so many of you are probably wondering whether you can hunker down on the sofa and play split screen like you did before.\nThis guide will let you know whether you can play split screen in Back 4 Blood, so that you can jump into a match, pick up a gun, and start slaying all kinds of zombies and Special Ridden with your friends.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-split-screen",
          "publishedOn": "2021-10-13T11:00:57.000Z",
          "wordCount": 869,
          "title": "Can you play Split Screen in Back 4 Blood?"
        },
        {
          "id": "https://www.rockpapershotgun.com/riot-are-removing-cross-team-text-chat-in-league-of-legends",
          "author": "Imogen Beckhelling",
          "description": "Riot Games have announced they're disabling /all chat in matchmade queues in League Of Legends to cut back on verbal abuse. Players in the same team will still be able to type to each other, and post-match chat will remain cross-team too, so you'll still be able to throw out your \"ggs\". But, as of League's next patch, you'll no longer be able to see messages from enemies mid-game. Good riddance, I say.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/riot-are-removing-cross-team-text-chat-in-league-of-legends",
          "publishedOn": "2021-10-13T10:51:58.000Z",
          "wordCount": 1025,
          "title": "Riot are removing cross-team text chat in League Of Legends"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-crossplay",
          "author": "Hayden Hefford",
          "description": "Want to know how to enable crossplay in Back 4 Blood? Nightmare mode can be pretty tough, so you’ll want to assemble the best team possible to survive the zombie onslaught in Back 4 Blood. Fortunately, you can stretch beyond your platform to find only the best zombie slayers by enabling crossplay.\nThis guide will explain how to enable and disable crossplay, so that you can pick and choose exactly who you play with in Back 4 Blood. Before hopping online, you should probably finish up the tutorial and figure out how to unlock all cleaners so that you can fit into any team.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-crossplay",
          "publishedOn": "2021-10-13T10:16:01.000Z",
          "wordCount": 844,
          "title": "How to enable Crossplay in Back 4 Blood"
        },
        {
          "id": "https://www.rockpapershotgun.com/genshin-impact-endgame",
          "author": "Rebecca Jones",
          "description": "What is there to do once you reach the endgame in New World? Currently at least, New World has a level cap of 60. There's a debate among MMO fans as to whether reaching the endgame should be the whole point of playing, or if it's really just a nice bonus after you've finished the satisfying business of levelling your character up from nothing. Whichever opinion you hold, most can agree that it's nice to have something to keep you coming back to the game that you've spent all those hours mastering.\nRead more",
          "link": "https://www.rockpapershotgun.com/genshin-impact-endgame",
          "publishedOn": "2021-10-13T09:30:10.000Z",
          "wordCount": 1277,
          "title": "New World endgame content: things to do when you hit Level 60"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-walker",
          "author": "Hayden Hefford",
          "description": "Want to know the best Walker build in Back 4 Blood? Walker is a sharpshooter who gains increased accuracy with precision kills. He also deals 10% more damage and increases everyone’s health by 10, making him an invaluable member of any team. However, to really unlock his full potential, you need to create the best build using all of the cards at your disposal. There are over 100 cards in Back 4 Blood, so check out our Supply Lines guide to see how you can start unlocking them all.\nIf you want to stop looking at stat numbers and start looking at mushy piles of zombies, then you’re in the right place. This guide will cover everything that you need to know to make the best Walker build in Back 4 Blood.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-walker",
          "publishedOn": "2021-10-13T09:09:13.000Z",
          "wordCount": 1239,
          "title": "The best Back 4 Blood Walker build"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-genshin-impact-eula-build",
          "author": "Amelia Zollner",
          "description": "Want to learn how to create the best Eula build in Genshin Impact? While Cryo Claymore user Eula isn’t the most loved by her fellow Mondstadt citizens thanks to her family’s tyrannical history, you’re sure to love her if you have her on your team. Eula has an all-around solid moveset, making her a stellar main DPS.\nThis guide will show you how to create the best Eula build in Genshin Impact. Below we'll cover everything you need to know about Eula, including wishing, weapons, artifacts, ascension materials, talents, abilities, and constellations.\nRead more",
          "link": "https://www.rockpapershotgun.com/best-genshin-impact-eula-build",
          "publishedOn": "2021-10-13T09:05:18.000Z",
          "wordCount": 1780,
          "title": "The best Genshin Impact Eula build"
        },
        {
          "id": "https://www.rockpapershotgun.com/call-of-duty-vanguards-writers-want-to-make-two-sequels",
          "author": "Graham Smith",
          "description": "Call Of Duty: Vanguard has started to dribble out a few more details about its story in new trailers, with a particular focus on its five new protagonists. If those characters are appealing, then good news: Vanguard's developers say that they hope to make a Vanguard 2 and 3 with the same cast.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/call-of-duty-vanguards-writers-want-to-make-two-sequels",
          "publishedOn": "2021-10-12T22:50:24.000Z",
          "wordCount": 783,
          "title": "Call Of Duty: Vanguard's writers want to make two sequels"
        },
        {
          "id": "https://www.rockpapershotgun.com/team-fortress-2-halloween-cosmetic-gets-restricted-prices-skyrocket",
          "author": "Graham Smith",
          "description": "Team Fortress 2 launched its Halloween update last week. Scream Fortress XIII adds new maps, cosmetics, taunts and contracts, amongst a lot else. One of the additions has caused a stir, however.\r\n\nThe \"Corpse Carrier\" is a cosmetic item wearable by Scouts that makes the speedster look as if he's carrying his own severed torso. It's a nightmare for snipers for obvious reasons, but it was initially easy to obtain and wearable all year round. Valve have since changed both of those things - and in turn, created a new, highly valuable item within TF2's trading marketplace.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/team-fortress-2-halloween-cosmetic-gets-restricted-prices-skyrocket",
          "publishedOn": "2021-10-12T22:13:19.000Z",
          "wordCount": 833,
          "title": "Team Fortress 2 Halloween cosmetic gets restricted, prices skyrocket"
        },
        {
          "id": "https://www.rockpapershotgun.com/long-standing-spelunky-speedrun-record-revealed-as-fraudulent",
          "author": "Graham Smith",
          "description": "In 2012, a player named BarryMode completed Spelunky Classic in two minutes and 30 seconds. Since then, this time has stood as the world record, and no other speedrunner has come close. Now, BarryMode's speedrun has been revealed as fraudulent. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/long-standing-spelunky-speedrun-record-revealed-as-fraudulent",
          "publishedOn": "2021-10-12T21:03:46.000Z",
          "wordCount": 709,
          "title": "Long-standing Spelunky speedrun record revealed as fraudulent"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-ironhide-loadout-warzone",
          "author": "Charlie Biggerstaff",
          "description": "Looking for the best Ironhide loadout in Warzone? The new lever-action Shotgun probably won’t crack the meta, but it’s aesthetically killer. If you’re looking for something different now that the Gallo has been nerfed, the Ironhide is an excellent choice. With two-shot kill potential, it’s a menace up close. To maximize its strengths though, you’re going to need the best build.\r\n\nTo make Shotguns work in Warzone, you need as much range and hipfire accuracy as you can get. Target those stats with this build:\r\n\nThis may be a shotgun, but we’re still starting off with an Agency Choke and Task Force Barrel. Both attachments grant a big boost to damage range, though the Task Force comes with a hipfire penalty. That's why the SOF Target Designator is also a must on Cold War shotguns, as it provides even more of the two stats we need; hipfire accuracy and damage range. You have some options in the stock slot, but we’ve gone with No Stock here. This is the biggest mobility boost you can get on your Ironhide, which is a big help when dueling SMG users. Unfortunately, it also comes with a hipfire penatly. These unfortunate tradeoffs have really held Cold War shotguns back in the meta. If you find the hipfire spread on this build isn't tight enough, a Wire Stock boosts sprint-to-fire speed without a penalty. Finally, we’ve gone with the 7 Round Tube magazine to help take on groups of foes without a reload.\r\n \nRead more",
          "link": "https://www.rockpapershotgun.com/best-ironhide-loadout-warzone",
          "publishedOn": "2021-10-12T20:21:24.000Z",
          "wordCount": 836,
          "title": "Best Ironhide loadout in Warzone Season 6"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-grav-loadout-warzone",
          "author": "Charlie Biggerstaff",
          "description": "Looking for the best Grav loadout in Warzone Season 6? Warzone’s newest rifle packs a potent combination of damage and fire rate that makes for excellent time-to-kill numbers. The Grav also boasts one of the highest bullet velocities in the Assault Rifle category and is one of the only Cold War weapons with a caliber-conversion magazine. Get a handle on its beastly recoil, and the Grav has the potential to be a top-tier rifle. Here are the best ways to build it out.\r\n\nThe Grav’s excellent damage and bullet velocity make it highly effective at long-range if you can control the recoil. That’s no easy task, but this build will help:\r\n\nAs usual, you’ll want to start with an Agency Suppressor and Task Force Barrel. I’m as tired of writing that sentence as you are of reading it, but until Vanguard drops this is the long-range combo for every Cold War weapon. The pile of damage range and recoil control stats these two attachments provide are too good to pass up. You’ll want a Field Agent Grip as well for maximum recoil control. The Grav has a lot of vertical climb, so even skilled players should welcome the help. You’ll want some zoom for range as well, and the Axial Arms 3x remains the go-to. If you prefer a Royal and Kross 4x or other optic though, you’ll have no issues making a substitution. \r\n \nRead more",
          "link": "https://www.rockpapershotgun.com/best-grav-loadout-warzone",
          "publishedOn": "2021-10-12T20:19:48.000Z",
          "wordCount": 1315,
          "title": "Best Grav loadout in Warzone Season 6"
        },
        {
          "id": "https://www.rockpapershotgun.com/paradox-staff-allege-culture-of-silence-in-new-reports-of-toxic-workplace",
          "author": "Graham Smith",
          "description": "New reports have been published containing further allegations of abuse at Swedish publisher Paradox Interactive. The reports, published initially by Swedish newspaper Svenska Dagbladet (paywalled), are based primarily on interviews with Paradox staff who wished to remain anonymous.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/paradox-staff-allege-culture-of-silence-in-new-reports-of-toxic-workplace",
          "publishedOn": "2021-10-12T20:09:56.000Z",
          "wordCount": 881,
          "title": "Paradox staff allege \"culture of silence\" in new reports of toxic workplace"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-a-27-in-fast-ips-1440p-144hz-monitor-for-238-thats-62-off-its-normal-price",
          "author": "Will Judd",
          "description": "Fast IPS monitors like the Dell S2721DGFA and LG 27GN800 have become some of my personal favourites to recommend, thanks to their combination of excellent motion handlin, wide viewing angles and gorgeous colours. We've seen these 27-in models discounted to around £300 a few times over the past few months, but today a couple of discount codes have dropped the price to historic lows. \nYou can choose from the Dell S2721DGFA, a 165Hz monitor with great ergonomics, for £270, or the LG 27GN800, a 144Hz monitor with a more basic stand, for £238. Either way, you'll get an incredible value gaming monitor that's perfect for a wide range of games and gaming PCs.\nRead more",
          "link": "https://www.rockpapershotgun.com/get-a-27-in-fast-ips-1440p-144hz-monitor-for-238-thats-62-off-its-normal-price",
          "publishedOn": "2021-10-12T18:38:16.000Z",
          "wordCount": 999,
          "title": "Get a 27-in Fast IPS 1440p 144Hz monitor for £238 - that's £62 off its normal price"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-is-peak-00s-action-cheese-and-i-am-here-for-it",
          "author": "Alice Bell",
          "description": "Back 4 Blood is out today, that new game from the original developers of Left 4 Dead that is definitely not Left 4 Dead 3, but is still about turning waves of zombies into splashes on the post-apocalyptic pavement as a co-op team. And yes, I still love it. It is fun. It is so much fun. When is this formula not fun? The release version is, in several respects, an improvement on the beta. The characters do more bantering, it has cinematic cutscenes, and if you have to play with bots those bots do not spend all their time shooting into the drywall. Tick, tick, tick.\nBut in playing the full game in context, with stuff like opening cinematics and tutorialising videos all embedded in it, something else has become clear: this game is peak early-00s cheese. Not just because many of the enemies have the same texture as a fully loaded pizza.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-is-peak-00s-action-cheese-and-i-am-here-for-it",
          "publishedOn": "2021-10-12T18:35:37.000Z",
          "wordCount": 1299,
          "title": "Back 4 Blood is peak 00s action cheese and I am here for it"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-a-12tb-wd-elements-external-hard-drive-for-19999-50-off",
          "author": "Will Judd",
          "description": "When it comes to giant external hard drives, WD sells more drives than anyone - and they might see a fair few more sales today. Their 12TB Elements external hard drive has been sharply discounted over at Newegg, with the code EMC2AAZAA27 knocking off $50 off the usual price of $249.99.   \nRead more",
          "link": "https://www.rockpapershotgun.com/get-a-12tb-wd-elements-external-hard-drive-for-19999-50-off",
          "publishedOn": "2021-10-12T18:19:22.000Z",
          "wordCount": 788,
          "title": "Get a 12TB WD Elements external hard drive for $199.99 ($50 off)"
        },
        {
          "id": "https://www.rockpapershotgun.com/monster-hunter-rise-pc-demo-looks-glorious",
          "author": "Katharine Castle",
          "description": "Despite having sunk several hours into Monster Hunter Rise on my Nintendo Switch this year, I cannot tell you how excited I am to play the upcoming PC version. While my relationship with the previous game in the series, Monster Hunter: World, has been somewhat tainted by excessive hours of benchmarking, the Monster Hunter series has always been a sight to behold on PC, and Rise looks set to be no different - especially now I've had a chance to play the upcoming PC demo ahead of its release on Steam tomorrow, October 13th. \nRead more",
          "link": "https://www.rockpapershotgun.com/monster-hunter-rise-pc-demo-looks-glorious",
          "publishedOn": "2021-10-12T16:10:46.000Z",
          "wordCount": 1709,
          "title": "Monster Hunter Rise looks glorious in its new PC demo"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-pc-performance-the-best-settings-to-change",
          "author": "James Archer",
          "description": "Most of my Back 4 Blood playtime has been spent getting brutalised by an endless queue of Special Ridden, like an zombified take on that bit in Airplane!. Even so, it’s nice to see Turtle Rock Studios’ latest co-op shooter goes a lot easier on PC hardware than it does on me. It runs smoothly on older low-end hardware, and scales well enough on luxury kit that with one of the best graphics cards you can easily secure 144fps at 4K. Back 4 Blood is also one of few games to support both Nvidia DLSS and AMD FidelityFX Super Resolution (FSR), so there’s ample opportunity to boost performance via upscaling.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-pc-performance-the-best-settings-to-change",
          "publishedOn": "2021-10-12T16:02:18.000Z",
          "wordCount": 1901,
          "title": "Back 4 Blood PC performance: the best settings to change"
        },
        {
          "id": "https://www.rockpapershotgun.com/hearthstone-adds-roguelikey-rpg-mode-mercenaries-today",
          "author": "Imogen Beckhelling",
          "description": "If you're a little bored of Hearthstone's usual card shenanigans, Blizzard are releasing a new game mode that turns the CCG into a roguelike-ish RPG. Named Mercenaries, players will be able to gather Hearthstone characters then send them off into combat to collect bounties. Like Battlegrounds, you won't use your collection of cards for this, you'll have to gather a party as you venture on. It comes out later today, and will be free-to-play.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/hearthstone-adds-roguelikey-rpg-mode-mercenaries-today",
          "publishedOn": "2021-10-12T15:55:46.000Z",
          "wordCount": 858,
          "title": "Hearthstone adds roguelikey RPG mode Mercenaries today"
        },
        {
          "id": "https://www.rockpapershotgun.com/destiny-2-celebrates-halloween-with-dinosaur-costumes-today",
          "author": "Alice O'Connor",
          "description": "Today is apparently the day for live service games to start Halloween events, with Destiny 2 throwing its wizard hat into the ritual ring too. Festival Of The Lost returns for another year at reset time today, with some welcome new elements. For one, the tired Haunted Forest event is replaced by Haunted Lost Sectors. For another, this year's seasonal outfit is DINOSAUR COSTUMES. Rawr!\nRead more",
          "link": "https://www.rockpapershotgun.com/destiny-2-celebrates-halloween-with-dinosaur-costumes-today",
          "publishedOn": "2021-10-12T15:38:42.000Z",
          "wordCount": 976,
          "title": "Destiny 2 celebrates Halloween with dinosaur costumes today"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-evangelo",
          "author": "Hayden Hefford",
          "description": "Want to know the best build for Evangelo in Back 4 Blood? Whilst the best cards could fit into any deck, you should always aim to specialise when creating a specific build in Back 4 Blood. Creating the best build for your character is essential if you want to survive on Nightmare difficulty, but it can be tricky to weed through every card to find the perfect match.\nIf you've looked through the characters and decided that you like Evangelo, then you're in luck. This guide covers the best melee build for Evangelo in Back 4 Blood, so that you can stop scratching your head looking at cards and start slashing (which is sort of his speciality). Evangelo might not be one of the best characters at first, but you can transform him into a powerhouse with certain cards.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-evangelo",
          "publishedOn": "2021-10-12T15:10:18.000Z",
          "wordCount": 1223,
          "title": "The best Back 4 Blood Evangelo build"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-best-weapons",
          "author": "Hayden Hefford",
          "description": "Want to know the best weapons in Back 4 Blood? Once you’ve figured out the best characters for your playstyle, you’ll need to think about the best weapons for your build. There are over 30 weapons to choose from in Back 4 Blood, so you’re spoilt for choice in your fight against the Ridden.\nThe weapon that you choose will mostly come down to your playstyle. If you want to run and gun, an SMG will be best, whilst a sniper rifle will suit those who want to pick off their targets from a distance. This guide will show you the best weapons in Back 4 Blood in every category.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-best-weapons",
          "publishedOn": "2021-10-12T15:05:57.000Z",
          "wordCount": 1969,
          "title": "The best weapons and attachments in Back 4 Blood"
        },
        {
          "id": "https://www.rockpapershotgun.com/pokemon-like-rpg-monster-crown-has-left-early-access",
          "author": "Imogen Beckhelling",
          "description": "We have a bunch of Pokémon-like monster catching games on PC now, but if you're tired of Temtem or Coromon, you could give Monster Crown a go. It's an RPG with turn-based combat that launched in full today after a year of early access. It sounds a little darker than other Pokélikes though, because instead of taming or catching your mons in magical contraptions, you make pacts with them. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/pokemon-like-rpg-monster-crown-has-left-early-access",
          "publishedOn": "2021-10-12T15:00:30.000Z",
          "wordCount": 859,
          "title": "Pokémon-like RPG Monster Crown has left early access"
        },
        {
          "id": "https://www.rockpapershotgun.com/guardians-of-the-galaxy-launch-trailer-launches-far-ahead-of-launch",
          "author": "Alice O'Connor",
          "description": "While Marvel's Guardians Of The Galaxy doesn't launch for another fortnight, the superhero game's launch trailer arrived today. That's a long run-up, that. If I'm running up for a launch for two weeks straight, I'm either leaping directly into the sun or falling asleep half-way. Presumably Square Enix are hoping for the former, given the ehhhh reaction to their Avengers game. Here, have a watch below.\nRead more",
          "link": "https://www.rockpapershotgun.com/guardians-of-the-galaxy-launch-trailer-launches-far-ahead-of-launch",
          "publishedOn": "2021-10-12T13:56:00.000Z",
          "wordCount": 862,
          "title": "Guardians Of The Galaxy launch trailer launches far ahead of launch"
        },
        {
          "id": "https://www.rockpapershotgun.com/far-cry-6-leaders",
          "author": "Ollie Toms",
          "description": "Where do you find more Far Cry 6 Leaders? It's a common question among many players who have discovered the delights of the Bandido Operations minigame, and want to maximise their chances of victory by sending the right people to lead their Guerrilla expeditions. There are eight Leaders to be unlocked in Far Cry 6, each of whom brings different skills to your growing Libertad army. Learn where to find and how to unlock each of the Far Cry 6 Leaders below.\nRead more",
          "link": "https://www.rockpapershotgun.com/far-cry-6-leaders",
          "publishedOn": "2021-10-12T13:34:20.000Z",
          "wordCount": 1605,
          "title": "How to unlock all the Far Cry 6 Leaders"
        },
        {
          "id": "https://www.rockpapershotgun.com/rainbow-six-siege-halloween-event-adds-spooky-hide-and-seek-today",
          "author": "Imogen Beckhelling",
          "description": "According to video games, Halloween officially starts today. Look, I don't make the rules! Tonight marks the start of Halloween events in Overwatch, Apex Legends, and Rainbow Six Siege. Ubisoft's tactical first-person shooter is bringing back Doktor's Curse, its 5v5 hide-and-seek mode where a team of monsters have to survive in a spookily decked-out Theme Park while exterminators hunt them down. This year, new operators are joining the fray too.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/rainbow-six-siege-halloween-event-adds-spooky-hide-and-seek-today",
          "publishedOn": "2021-10-12T12:26:42.000Z",
          "wordCount": 820,
          "title": "Rainbow Six Siege Halloween event adds spooky hide-and-seek today"
        },
        {
          "id": "https://www.rockpapershotgun.com/us-agencies-clash-over-two-activision-blizzard-legal-cases",
          "author": "Imogen Beckhelling",
          "description": "Last week, California's Department of Fair Employment and Housing (DFEH) filed an objection to an $18 million proposed settlement between Activision Blizzard and the USA's Equal Employment Opportunity Commission (EEOC), claiming it could harm their own lawsuit with the Call Of Duty and World Of Warcraft publishers. This objection might have an adverse affect on their legal battle however, because it revealed that two lawyers working on the DFEH suit had previously worked for the EEOC, specifically investigating Activision Blizzard. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/us-agencies-clash-over-two-activision-blizzard-legal-cases",
          "publishedOn": "2021-10-12T11:56:11.000Z",
          "wordCount": 1092,
          "title": "US agencies clash over two Activision Blizzard legal cases"
        },
        {
          "id": "https://www.rockpapershotgun.com/disco-elysium-has-a-big-discount-now-and-hits-xbox-and-switch-today",
          "author": "Alice O'Connor",
          "description": "Strange and wonderful detective RPG Disco Elysium launches on Xbox and Nintendo Switch today, which is good for them. That's good for you too, person who wants to talk about Disco Elysium all the time but finds pub conversations waylaid by platform unavailability. And hey, it's good for PC peeps who haven't yet bought the game either, because it has a tidy 45% discount on Steam for the next week. Win-win-win.\nRead more",
          "link": "https://www.rockpapershotgun.com/disco-elysium-has-a-big-discount-now-and-hits-xbox-and-switch-today",
          "publishedOn": "2021-10-12T10:25:34.000Z",
          "wordCount": 788,
          "title": "Disco Elysium has a big discount now, and hits Xbox and Switch today"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-unlock-cleaners",
          "author": "Hayden Hefford",
          "description": "Want to know how to unlock all of the cleaners in Back 4 Blood? When you start Back 4 Blood, you will see that only 4 out of the 8 cleaners are playable. Doc, Hoffman, Jim, and Karlee are locked, so you won’t be able to play as them straight away. Doc and Hoffman are some of the best characters in Back 4 Blood, so you’ll want to know how to unlock them as soon as possible.\nBack 4 Blood is a difficult game, regardless of whether you are playing on Recruit or Nightmare mode. If you’re new to the game, you won’t have many cards unlocked, so it’s especially important to choose the best cleaners and weapons for your team in the early stages. This guide will cover everything that you need to know to unlock all cleaners in Back 4 Blood.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-unlock-cleaners",
          "publishedOn": "2021-10-12T10:16:26.000Z",
          "wordCount": 946,
          "title": "How to unlock all Cleaners in Back 4 Blood"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-crucials-2tb-mx500-ssd-for-150-after-a-30-discount",
          "author": "Will Judd",
          "description": "We've spoken about the Crucial MX500 before, but the short version is this: it's a fast SATA SSD that also offers great value. Today, it's even better value than normal in the UK, as Amazon have discounted the gargantuan 2TB size of the drive to just £149.97, a 30% discount from its normal £214 RRP. \nRead more",
          "link": "https://www.rockpapershotgun.com/get-crucials-2tb-mx500-ssd-for-150-after-a-30-discount",
          "publishedOn": "2021-10-11T23:41:51.000Z",
          "wordCount": 948,
          "title": "Get Crucial's 2TB MX500 SSD for £150 after a 30% discount"
        },
        {
          "id": "https://www.rockpapershotgun.com/blues-excellent-snowball-usb-mic-is-half-price-just-40",
          "author": "Will Judd",
          "description": "Blue Microphones are known for their popular Yeti podcasting and streaming mic, but they also make a great budget USB model called the Snowball. Its small, adorably round shape belies its capability to make surprisingly detailed recordings, and it's currently half price at Amazon in the UK. That means you need to pay just £40 to take home this mic that normally retails for £80, the cheapest it's been by some margin for years. If you're interested in streaming or podcasting, or just fancy a USB mic to use alongside headphones without a mic (or a rubbish one), then this is a great shout. \nRead more",
          "link": "https://www.rockpapershotgun.com/blues-excellent-snowball-usb-mic-is-half-price-just-40",
          "publishedOn": "2021-10-11T23:22:53.000Z",
          "wordCount": 1029,
          "title": "Blue's excellent Snowball USB mic is half price - just £40"
        },
        {
          "id": "https://www.rockpapershotgun.com/no-cross-saves-for-monster-hunter-rise-but-capcom-say-they-looked-into-it",
          "author": "Lauren Morton",
          "description": "Getting Monster Hunter games on PC still feels like a new treat, even after Monster Hunter World has been out for a few years. Next up for the action and fashion series is Monster Hunter Rise, which is already out on the Nintendo Switch and coming to PC in January. With the PC release coming ten months after the Switch, it's no surprise that MonHunt fans would be keen on being able to carry their save files over to PC in January with cross-progression. Capcom looked into the possibility they say, and cross-platform multiplayer too, but won't be doing either, they've now said.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/no-cross-saves-for-monster-hunter-rise-but-capcom-say-they-looked-into-it",
          "publishedOn": "2021-10-11T22:04:00.000Z",
          "wordCount": 870,
          "title": "No cross-saves for Monster Hunter Rise, but Capcom say they looked into it"
        }
      ]
    },
    {
      "title": "Root.cz - články",
      "feedUrl": "https://www.root.cz/rss/clanky/",
      "siteUrl": "https://www.root.cz/clanky/",
      "articles": [
        {
          "id": "www.root.cz-text-15716",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Ubuntu 21.10, nový referenční AV1 kodér, 25 let KDE a Plasma 5.23, nový linuxový smartphone PinePhone Pro, změny v systému aktualizací openSUSE Leap, Strawberry 1.0, fork Clementine běžící na Qt6.",
          "link": "https://www.root.cz/clanky/prvni-xbox-mel-mit-cpu-od-amd-apple-je-sponzorem-blenderu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-16T22:00:10.000Z",
          "wordCount": 1608,
          "title": "První Xbox měl mít CPU od AMD, Apple je sponzorem Blenderu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/219/strawberry-1-0-1.png",
            "length": "221821",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-text-15713",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Adobe už léta hlásá konec Flashe. Dokonce i oficiálně začátkem roku 2021 skončil. Přesto právníci Adobe využívají DMCA, aby vynutili konec alternativního projektu instalátoru Flashe v čínské variantě.",
          "link": "https://www.root.cz/clanky/adobe-flash-jeste-neni-mrtvy-firma-dal-tvrde-potira-souvisejici-projekty/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-14T22:00:10.000Z",
          "wordCount": 1607,
          "title": "Adobe Flash ještě není mrtvý: firma dál tvrdě potírá související projekty",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/668/flash-1.jpg",
            "length": "50926",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15712",
          "author": "redakce@root.cz (Root.cz: Daniel Salzman)",
          "description": "Uživatelé se často ptají, jak zprovoznit vlastní DNS server. Na praktických příkladech si tedy přiblížíme základy i pokročilejší možnosti Knot DNS, autoritativního serveru z dílen českého sdružení CZ.NIC.",
          "link": "https://www.root.cz/clanky/nasazujeme-knot-dns-na-vlastni-domene-prakticky-navod/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-13T22:00:10.000Z",
          "wordCount": 3219,
          "title": "Nasazujeme Knot DNS na vlastní doméně: praktický návod",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/399/uzel-provaz-spojeni-1.jpg",
            "length": "44034",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15711",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "Ve druhém a současně i závěrečném článku o Small Basicu si ukážeme práci s vestavěnými objekty, zejména s grafickým oknem. Taktéž si popíšeme želví grafiku a systém událostí (a reakcí na ně). Zmíníme se i o alternativně ke Small Basicu, jímž je Basic-256.",
          "link": "https://www.root.cz/clanky/vestavene-objekty-small-basicu-prace-s-grafikou-casovacem-reakce-na-udalosti/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-13T22:00:05.000Z",
          "wordCount": 6307,
          "title": "Vestavěné objekty Small Basicu: práce s grafikou, časovačem, reakce na události",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/263/small-basic-1.jpg",
            "length": "34319",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15673",
          "author": "redakce@root.cz (Root.cz: Pavel Herout)",
          "description": "Ve druhém článku si ukážeme poměrně podrobně možnosti výstupů logování zajišťovaných handlery. Tyto možnosti jsou vcelku rozsáhlé a evidentně reagují na reálnou poptávku takřka „ze života“.",
          "link": "https://www.root.cz/clanky/logovani-v-php-moznosti-vystupu-logovani-zajistovanych-handlery/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-12T22:00:10.000Z",
          "wordCount": 3000,
          "title": "Logování v PHP: možnosti výstupů logování zajišťovaných handlery",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/516/php-1.jpg",
            "length": "42482",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15705",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Sonda do světa otevřeného softwaru. Dnes si přidáme anotace k obrázkům, zvýšíme si výdrž baterie u notebooku, proměníme skripty z Pythonu ve webové aplikace a stáhneme si informace z chytrých hodinek.",
          "link": "https://www.root.cz/clanky/softwarova-sklizen-13-10-2021/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-12T22:00:05.000Z",
          "wordCount": 959,
          "title": "Softwarová sklizeň (13. 10. 2021)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/root/368/kombajn-sklizen.jpg",
            "length": "394618",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15706",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "Už jsme se několikrát zmínili o jazycích navržených pro výuku programování. Do této kategorie spadá i Small Basic, jehož jméno se sice odkazuje na klasické BASICy, ovšem jedná se o značně rozdílný dialekt.",
          "link": "https://www.root.cz/clanky/small-basic-moderni-reinkarnace-basicu-urcena-pro-vyuku-programovani/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-11T22:00:15.000Z",
          "wordCount": 6089,
          "title": "Small Basic: moderní reinkarnace BASICu určená pro výuku programování",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/263/small-basic-1.jpg",
            "length": "34319",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15651",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Otevřená závodní hra SuperTuxKart chystá vydání nové verze se spoustou novinek. Emulátor přenosné herní konzole Nintentdo Switch Yuzu vylepšuje výkon a renderování. Dopravní strategie OpenTTD 12.0 má první beta verzi.",
          "link": "https://www.root.cz/clanky/supertuxkart-chysta-spoustu-novinek-yuzu-vylepsuje-vykon/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-11T22:00:10.000Z",
          "wordCount": 1156,
          "title": "SuperTuxKart chystá spoustu novinek, Yuzu vylepšuje výkon",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/509/supertuxkart-1-3-nintendo-switch-1.jpg",
            "length": "81451",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15704",
          "author": "redakce@root.cz (Root.cz: CESNET CERTS)",
          "description": "Ve tmě a chaosu vzniklém při výpadku Facebooku by se mohlo zdát, že se už nic horšího stát nemůže. Ale přesvědčíme se, že útočníci číhají na každém rohu a využíjí každičkou, byť nepatrnou, příležitost.",
          "link": "https://www.root.cz/clanky/postrehy-z-bezpecnosti-apache-nevi-ze-neni-tecka-jako-tecka/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-10T22:00:10.000Z",
          "wordCount": 1517,
          "title": "Postřehy z bezpečnosti: Apache neví, že není tečka jako tečka",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/356/beruska-1.jpg",
            "length": "35123",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15698",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Red Hat Enterprise Linux 8.5 beta je k dispozici k veřejnému testování. Vyšly opravné verze Debianu 10 a 11. Vydání Linux Mint 20.3 je v plánu na letošní Vánoce. TUXEDO InfinityBook Pro 14 je k mání s grafikou NVIDIA GeForce RTX 3050 Ti.",
          "link": "https://www.root.cz/clanky/vysel-rhel-8-5-beta-a-prvni-opravna-verze-debianu-11/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-10T22:00:05.000Z",
          "wordCount": 1129,
          "title": "Vyšel RHEL 8.5 beta a první opravná verze Debianu 11",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/558/rhel-8-1.jpg",
            "length": "14085",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "Root.cz - zprávičky",
      "feedUrl": "https://www.root.cz/rss/zpravicky/",
      "siteUrl": "https://www.root.cz/zpravicky/",
      "articles": [
        {
          "id": "www.root.cz-actuality-42914",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Společnost PINE64 včera představila linuxový telefon PinePhone Pro, který je vylepšením původního PinePhone. Obsahuje SoC Rockchip RK3399S (2× A72 + 4× A53 na 1,5 GHz) a 4 GB RAM. Interní úložiště má 128 GB eMMC a je možné připojit SDCX kartu až do velikosti 2 TB.",
          "link": "https://www.root.cz/zpravicky/linuxovy-telefon-pinephone-pro/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-16T11:25:32.000Z",
          "wordCount": 901,
          "title": "Linuxový telefon PinePhone Pro",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/682/pinephone-pro-1.jpg",
            "length": "16313",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42913",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Následující vydání oblíbené distribuce Ubuntu 22.04 LTS bude mít označení Jammy Jellyfish. Tedy šťastná medúza nebo také medúza marmeládové konzistence.",
          "link": "https://www.root.cz/zpravicky/ubuntu-22-04-lts-bude-jammy-jellyfish/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-16T10:57:59.000Z",
          "wordCount": 729,
          "title": "Ubuntu 22.04 LTS bude Jammy Jellyfish",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/52/meduza-1.jpg",
            "length": "36696",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42912",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Panel Self Refresh (PSR) je vlastnost DisplayPortu, která při statickém obrazu umožňuje snížení spotřeby. AMD konečně zapíná ve výchozím stavu PSR pro nové integrované grafické karty DCN v jádře 5.16.",
          "link": "https://www.root.cz/zpravicky/amd-konecne-zapina-ve-vychozim-stavu-panel-self-refresh-pro-nove-apu-v-jadre-5-16/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-15T12:29:18.000Z",
          "wordCount": 803,
          "title": "AMD konečně zapíná ve výchozím stavu Panel Self Refresh pro nové APU v jádře 5.16",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/654/amd-apu-1.jpg",
            "length": "20496",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42911",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Sysmon (system monitor) je nástroj od Sysinternals pro monitorování systémové aktivity a odhalení škodlivých programů. Včera Mark Russinovich z Microsoftu (je spoluzakladatel Sysinternals, který později Microsoft koupil) oznámil Sysmon pro Linux.",
          "link": "https://www.root.cz/zpravicky/microsoft-vydal-sysmon-pro-linux/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-15T12:04:00.000Z",
          "wordCount": 1505,
          "title": "Microsoft vydal Sysmon pro Linux",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/567/linux-windows-tux.png",
            "length": "121771",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-38836",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Automatizace pomocí continuous integration přímo v Gitlabu. CI vám pomůže automatizovat rutinní procesy a ušetří vám hromadu času. Pomůže vám od automatického testování, buildy po nasazování. Chcete vědět víc? Přijďte na naše školení GitLab CI, které se uskuteční 18. listopadu a proběhne plně online. Školí Ondřej Sika.",
          "link": "https://www.root.cz/zpravicky/gitlab-ci-automatizujte-primo-v-gitlabu-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-15T11:32:13.000Z",
          "wordCount": 744,
          "title": "Gitlab CI: automatizujte přímo v Gitlabu (školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/214/gitlab-ci-1.png",
            "length": "75559",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42910",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Claude Schwarz ve středu zveřejnil výsledek extrémního přetaktování Raspberry Pi Compute Module 4 až na 3 GHz.  K dosažení takového výsledku bylo potřeba odstranit víčko SoC a nahradit vodivou pastu lepším tekutým kovem Thermal Grizzly Conductonaut (obsahuje galium, cín a indium).",
          "link": "https://www.root.cz/zpravicky/extremni-pretaktovani-raspberry-pi-cm-4-na-3-ghz/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-15T07:06:04.000Z",
          "wordCount": 1256,
          "title": "Extrémní přetaktování Raspberry Pi CM 4 na 3 GHz",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/673/raspberry-pi-compute-module-4-1.jpg",
            "length": "54007",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42909",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Podle plánu vyšla nová verze Ubuntu 21.10 s kódovým jménem Impish Indri. Toto vydání bude podporováno devět měsíců, tedy do července 2022. Kromě hlavní verze Ubuntu jsou k dispozici také všechny oficiální odnože: Kubuntu, Lubuntu, Ubuntu Budgie, Ubuntu Kylin, Ubuntu MATE, Ubuntu Studio a Xubuntu.",
          "link": "https://www.root.cz/zpravicky/ubuntu-21-10-impish-indri-prinasi-wayland-na-kartach-nvidia/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-14T20:15:15.000Z",
          "wordCount": 1287,
          "title": "Ubuntu 21.10 Impish Indri přináší Wayland na kartách Nvidia",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/537/ubuntu-21-10-impish-indri-1.jpg",
            "length": "13671",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42908",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Rok a čtvrt po předchozím vydání je k dispozici nová verze distribuce Devuan s označením 4.0 a kódovým jménem Chimaera. Ten je postaven na čerstvém Debianu 11 Bullseye a vynechává z instalace závislost na systemd. Místo něj je možné si vybrat mezi SysVInit, Runit nebo OpenRC.",
          "link": "https://www.root.cz/zpravicky/devuan-4-0-chimaera-je-debian-11-bullseye-bez-systemd/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-14T20:01:35.000Z",
          "wordCount": 808,
          "title": "Devuan 4.0 Chimaera je Debian 11 Bullseye bez systemd",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/453/devuan-1.jpg",
            "length": "21885",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42902",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Vývojáři uvolnili novou verzi operačního systému OpenBSD s číselným označením 7.0. Zatímco budete stahovat čerstvé obrazy, můžete si přečíst o hlavních změnách, které nová verze přináší. Především je to nová platforma risc64 pro 64bitové procesory RISC-V. Plně podporována je zatím jen jediná deska HiFive Unmatched, ale na dalších se pracuje.",
          "link": "https://www.root.cz/zpravicky/openbsd-7-0-prinasi-podporu-pro-64bitove-procesory-risc-v/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-14T14:53:22.000Z",
          "wordCount": 850,
          "title": "OpenBSD 7.0 přináší podporu pro 64bitové procesory RISC-V",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/5/openbsd-ryba-notebook-1.jpg",
            "length": "50733",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42907",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Počítač Commodore 65 byl nikdy nevydaným nástupcem legendárního Commodore 64. Byl vyvinut mezi lety 1990 a 1991 a mělo jít o nejvýkonnější 8bitový počítač na trhu – měl 128K RAM, grafiku s rozlišením až 1280×400, stereo zvuk a 3,5\" disketovou mechaniku.",
          "link": "https://www.root.cz/zpravicky/mega65-moderni-verze-nikdy-nevydaneho-commodore-65/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-14T12:15:37.000Z",
          "wordCount": 1276,
          "title": "Mega65: moderní verze nikdy nevydaného Commodore 65",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/98/mega65-1.jpg",
            "length": "44187",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42906",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Konference OpenAlt zveřejnila svůj rozsáhlý program rozdělený do čtyř samostatných paralelních skupin (tracků). Letošní ročník proběhne opět online a ve znamení otevřených a alternativních řešení a nových možností pro každý den, které řeší nebo otevírají moderní technologie dnešního světa.",
          "link": "https://www.root.cz/zpravicky/openalt-zverejnil-program-letosni-online-konference-probehne-6-a-7-listopadu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-14T09:19:04.000Z",
          "wordCount": 829,
          "title": "OpenAlt zveřejnil program letošní online konference, proběhne 6. a 7. listopadu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/385/openalt-2018-1.jpg",
            "length": "62039",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42905",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Národní úřad pro kybernetickou a informační bezpečnost (NÚKIB) vydal zprávu o kybernetických incidentech [PDF] pokrývající září letošního roku. Z hlediska počtu incidentů jde o nejklidnější měsíc letošního roku, přesto si zpráva všímá zajímavých trendů. Jednak jsou zpět útoky pomocí ransomware a jednoznačně také přibývá incidentů na české vzdělávací instituce.",
          "link": "https://www.root.cz/zpravicky/nukib-ceske-vzdelavaci-instituce-hlasi-vice-utoku-ransomware-je-zpet/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-14T09:02:24.000Z",
          "wordCount": 899,
          "title": "NÚKIB: české vzdělávací instituce hlásí více útoků, ransomware je zpět",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/557/hacker-ransomware-1.jpg",
            "length": "29427",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42904",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Microsoft oficiálně ukončil podporu platformy Silverlight, která byla určena pro běh komplexních webových aplikací. Mělo jít o přímou konkurenci k Adobe Flash, který ale ve své době jednoznačně v prohlížečích kraloval. Přesto zřejmě existuje řada aplikací, které Silverlight využívají a ty již není možné v současných prohlížečích používat.",
          "link": "https://www.root.cz/zpravicky/silverlight-je-mrtev-at-zije-opensilver/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-14T08:04:30.000Z",
          "wordCount": 1230,
          "title": "Silverlight je mrtev, ať žije OpenSilver",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/426/opensilver-1.jpg",
            "length": "19864",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42903",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Přesně před čtvrt stoletím, tedy 14. října 1996, odeslal Matthias Ettrich do linuxové diskusní skupiny dlouhou zprávu, ve které oznámil vznik nového projektu Kool Desktop Environment (KDE). V ní napsal, že popularita unixových operačních systémů roste, ale chybí pořádné desktopové prostředí. Uvědomoval si, že existuje řada správců oken a různých grafických knihoven, ale žádné ucelené prostředí pro práci.",
          "link": "https://www.root.cz/zpravicky/desktopove-prostredi-kde-slavi-25-narozeniny/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-14T07:48:54.000Z",
          "wordCount": 968,
          "title": "Desktopové prostředí KDE slaví 25. narozeniny",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/132/kde-1.jpg",
            "length": "40912",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42901",
          "author": "redakce@root.cz (Root.cz: Vilém Sládek)",
          "description": "Sdružení CZ.NIC, pořadatel konference Internet a Technologie (21.2), zveřejnilo webové stránky akce a otevřelo registraci. Tato tradiční konference správce české národní domény se uskuteční 10. listopadu v konferenčních prostorech hotelu Grandior (Na Poříčí 1052/42, Praha 1). Program, registrační formulář a další informace včetně archivu minulých ročníků jsou k dispozici na webu akce.",
          "link": "https://www.root.cz/zpravicky/poradatele-konference-internet-a-technologie-predstavili-program-a-spustili-registraci/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-13T11:59:10.000Z",
          "wordCount": 915,
          "title": "Pořadatelé konference Internet a Technologie představili program a spustili registraci",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/579/konference-internet-a-technologie-19-1.jpg",
            "length": "52279",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-38548",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Nginx je dnes přibližně na třetině web serverů na internetu a toto číslo stále roste. Je výkonný, spolehlivý, má spoustu funkcí a dobře se spravuje. Pokud potřebujete dobrý web server pro svůj projekt, bude Nginx správnou volbou.",
          "link": "https://www.root.cz/zpravicky/nasadte-moderni-web-server-s-nginx-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-13T11:22:03.000Z",
          "wordCount": 768,
          "title": "Nasaďte moderní web server s Nginx (online školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/398/nginx-logo-1.jpg",
            "length": "17314",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42900",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Tým v Red Hatu věnující se GPU subsystému a věcem souvisejícím už obsahuje velká jména jako David Airlie (správce DRM) či dalších vývojářů pracujících v rámci projektu MESA. Nyní Red Hat hledá dalšího experta přes GPU, který se bude věnovat oblasti GPU hardware enablement.",
          "link": "https://www.root.cz/zpravicky/red-hat-najima-dalsiho-vyvojare-pro-gpu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-13T07:56:00.000Z",
          "wordCount": 844,
          "title": "Red Hat najímá dalšího vývojáře pro GPU",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/383/amd-radeon-hd-7970-1.jpg",
            "length": "27361",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42898",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Sotva se nám budou za pár týdnů objevovat první spotřebitelské procesory s podporou PCI Express 5.0 (pozn. Intel Alder Lake), PCI-SIG hovoří o téměř finální specifikaci generace následné. PCI Express 6.0 opět nabídne zdvojnásobení přenosových rychlostí a plnou zpětnou kompatibilitu, to vše stále „na metalice“.",
          "link": "https://www.root.cz/zpravicky/pci-express-6-0-opet-zrychli-na-dvojnasobek-diky-pam4-modulaci/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-13T06:00:00.000Z",
          "wordCount": 1405,
          "title": "PCI Express 6.0 opět zrychlí na dvojnásobek, díky PAM4 modulaci",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/116/pci-express.jpg",
            "length": "88396",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42899",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Začíná to být nekonečná telenovela. Sotva pár desítek hodin po tom, co jsme psali o dosažení propustnosti téměř 7 miliónů IOPS na CPU jádro v Linuxu, přichází zpráva, jejímž autorem je opět Jens Axboe, že IOPS poskočily na téměř sedm a půl miliónů. Zrychlení jde na bedra dalších optimalizací, mimo jiné 10% snížení latence u synchronizace.",
          "link": "https://www.root.cz/zpravicky/linux-znovu-lame-rekord-dosahuje-7-4-milionu-iops-na-jadro/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-12T22:00:00.000Z",
          "wordCount": 1052,
          "title": "Linux znovu láme rekord, dosahuje 7,4 miliónů IOPS na jádro",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/183/intel-optane-1.png",
            "length": "136512",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42897",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Oblíbený programátorský editor Geany přichází ve verzi 1.38 s několika novinkami. Tou největší je asi odstranění podpory GTK+ v2 (verze pro Windows mimochodem přechází na GTK3 a x86_64). Zrychluje načítání souborů, zejména při spouštění programu.",
          "link": "https://www.root.cz/zpravicky/geany-1-38-uz-bez-podpory-gtk2/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-12T13:37:16.000Z",
          "wordCount": 798,
          "title": "Geany 1.38 už bez podpory GTK2",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/262/geany-1-37-1-v-gnome-3-38-1.png",
            "length": "67933",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42896",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Intel Xeony generace Sapphire Rapids přinesou jednu horkou novinku: instrukční sadu AMX, tedy další nadstavbu x86 světa, cílící tentokrát na maticové výpočty. Již tato první generace bude podporovat všechny typy instrukcí AMX (bude jich na začátku 12) a co Intel životně potřebuje, je zajištění podpory AMX v Linuxu.",
          "link": "https://www.root.cz/zpravicky/intel-pracuje-na-upravach-kodu-x86-fpu-pripravuje-jej-pro-amx/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-12T12:27:42.000Z",
          "wordCount": 3322,
          "title": "Intel pracuje na úpravách kódu x86 FPU, připravuje jej pro AMX",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/640/intel-xeon-ice-lake-1.jpg",
            "length": "45315",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42895",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Společnost Cloudflare oznámila, že o čtvrtinu rozšířila svou síť datových center, takže nyní jsou její datová centra přítomna ve 250 městech ze 100 zemí světa. Během posledních dvou let zdvojnásobila celkovou síťovou kapacitu na 100 Tbps, díky čemuž je schopna čelit i těm nejmasivnějším DDoS útokům a poskytovat svým zákazníkům rychlejší a spolehlivější služby kdekoliv na světě.",
          "link": "https://www.root.cz/zpravicky/cloudflare-rozsiril-svou-sit-datovych-center-navysil-sitovou-kapacitu-na-100-tbps/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-12T10:48:30.000Z",
          "wordCount": 890,
          "title": "Cloudflare rozšířil svou síť datových center, navýšil síťovou kapacitu na 100 Tbps",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/92/cloudflare-1.jpg",
            "length": "36223",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42894",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Windows 11 jsou na světě a do jejich aplikačního obchodu nyní Microsoft přidal preview verzi Windows Subsystem for Linux (WSL). Končí tak nutnost tuto funkcionalitu aktivovat ručně v dostupných vlastnostech operačního systému, vše lze instalovat jednoduše z Microsoft Store.",
          "link": "https://www.root.cz/zpravicky/windows-subsystem-for-linux-ve-windows-11/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-12T07:21:20.000Z",
          "wordCount": 3168,
          "title": "Windows Subsystem for Linux ve Windows 11",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/9/windows-11-1.jpg",
            "length": "41918",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42893",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "připravili jsme pro vás vylepšení, po kterém jste mnozí z vás volali, a to možnost přispět na provoz serveru Root.cz převodem z účtu. Tato možnost se vám objeví, pokud nezvolíte opakovanou platbu.",
          "link": "https://www.root.cz/zpravicky/nova-moznost-jak-podporit-server-root-cz/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-12T07:14:42.000Z",
          "wordCount": 843,
          "title": "Nová možnost, jak podpořit server Root.cz",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/154/root-cz-palec-1.jpg",
            "length": "16943",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42892",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Vývojář linuxového blokového subsystému a jeden z hlavních vývojářů IO_uring Jens Axboe pokračuje s optimalizacemi linuxového jádra pro vysoký počet I/O operací za sekundu. Používá k tomu Intel Optane Gen2 (s PCIe 4) a nově AMD Ryzen 9 5950X.",
          "link": "https://www.root.cz/zpravicky/linux-dosahuje-temer-7-milionu-iops-na-jadro/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-11T16:32:24.000Z",
          "wordCount": 1167,
          "title": "Linux dosahuje téměř 7 miliónů IOPS na jádro",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/344/tux-linux-1.jpg",
            "length": "22348",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "abclinuxu - aktuální články",
      "feedUrl": "http://www.abclinuxu.cz/auto/abc.rss",
      "siteUrl": "http://www.abclinuxu.cz/clanky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-umela-inteligence-v-kooperativnich-hrach",
          "author": "Redakce",
          "description": "Nový typ magnetismu nezpůsobují spiny. Beethovenovu slavnou 10. symfonii dokončila umělá inteligence  Studium neuronových sítí může pomoci při zkoumání toho, jak se do mozku ukládají konspirační teorie. Minirobot se pohybuje díky gradientům teploty. Splynutí obřích černých děr provázejí nejen gravitační vlny.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-umela-inteligence-v-kooperativnich-hrach",
          "publishedOn": "2021-10-16T22:01:00.000Z",
          "wordCount": 1622,
          "title": "Týden na ScienceMag.cz: Umělá inteligence v kooperativních hrách"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-41-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-41-2021",
          "publishedOn": "2021-10-15T22:01:00.000Z",
          "wordCount": 2483,
          "title": "Událo se v týdnu 41/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/goodoffer24-dozivotni-licence-windows-11-za-16-66-nebo-windows-10-za-pouhych-12-52",
          "author": "Reklama",
          "description": "Získejte doživotní licenci Windows 11 za pouhých 16,66  €, Windows 10 za pouhých 12,52  €. Opět jde o finančně velmi výhodnou nabídku prodejního portálu GoodOffer24.com, kde lze najít kromě nástrojů produktivity také hry, ale i další softwarové produkty.",
          "link": "http://www.abclinuxu.cz/clanky/goodoffer24-dozivotni-licence-windows-11-za-16-66-nebo-windows-10-za-pouhych-12-52",
          "publishedOn": "2021-10-15T14:00:00.000Z",
          "wordCount": 1298,
          "title": "GoodOffer24: Doživotní licence Windows 11 za 16,66  € nebo Windows 10 za pouhých 12,52  €"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/key-trainings-je-openshift-tou-spravnou-volbou",
          "author": "Reklama",
          "description": "OpenShift je platforma pro provoz kontejnerů ve firemním prostředí. Usnadňuje standardizaci provozu vašich aplikací a současně zjednodušuje provoz a zvyšuje bezpečnost a spolehlivost provozu. Umožňuje vám přidělit vybraná oprávnění např. dodavatelským firmám a mít tak pod kontrolou větší část nebo celý vývojový cyklus aplikací. Současně vám přináší jednotný způsob monitoringu a sběru logů.",
          "link": "http://www.abclinuxu.cz/clanky/key-trainings-je-openshift-tou-spravnou-volbou",
          "publishedOn": "2021-10-13T22:01:00.000Z",
          "wordCount": 1452,
          "title": "KEY Trainings: Je OpenShift tou správnou volbou?"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/distribucni-novinky-38-40-2021",
          "author": "Redakce",
          "description": "Babí léto přineslo aktualizace řady více či méně specializovaných distribucí: přechod na Debian 11 v projektech Emmabuntüs DE4 nejen pro vzdělávání, Q4OS také s desktopovým prostředím Trinity, stabilní obrazy PureOS firmy Purism, dále Redo Rescue pro práci s diskovými oddíly, pokračující experimenty v EasyOS a mezi tím vším občerstvení MidnightBSD, UBports, IPFire, Tails, Feren OS či Debianu.",
          "link": "http://www.abclinuxu.cz/clanky/distribucni-novinky-38-40-2021",
          "publishedOn": "2021-10-11T22:01:00.000Z",
          "wordCount": 1906,
          "title": "Distribuční novinky 38-40/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-budovani-kyberneticky-odolne-spolecnosti",
          "author": "Redakce",
          "description": "Problémy s Wi-Fi mohou ohrozit fungování českých firem. Technologické trendy pro finanční ředitele: hyperautomatizace a inteligentní komponovaný byznys. Od pilotního projektu k produkčnímu nasazení umělé inteligence. S evidencí vandalismu pomůže umělá inteligence, řešení bude hledat Atos Hackathon. Budování kyberneticky odolné společnosti. Tiskárny během lockdownů a poté (1) Dodávky.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-budovani-kyberneticky-odolne-spolecnosti",
          "publishedOn": "2021-10-10T14:00:00.000Z",
          "wordCount": 1470,
          "title": "Týden na ITBiz: Budování kyberneticky odolné společnosti"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-40-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-40-2021",
          "publishedOn": "2021-10-08T22:01:00.000Z",
          "wordCount": 2868,
          "title": "Událo se v týdnu 40/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-supravodive-hydridy-ceru",
          "author": "Redakce",
          "description": "Světy s oceány a atmosférou z vodíku. Těžba ve vesmíru s pomocí bakterií. Panspermie v měřítku celé galaxie. Umělá inteligence pro předpověď počasí. Vylepšená uhlíková vlákna.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-supravodive-hydridy-ceru",
          "publishedOn": "2021-10-08T14:00:00.000Z",
          "wordCount": 1608,
          "title": "Týden na ScienceMag.cz: Supravodivé hydridy ceru"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/jaderne-noviny-prehled-za-zari-2021",
          "author": "Redakce",
          "description": "Přehled zářijových vydání Jaderných novin: stav vydání jádra, citáty týdne a seznam článků týkajících se jádra.",
          "link": "http://www.abclinuxu.cz/clanky/jaderne-noviny-prehled-za-zari-2021",
          "publishedOn": "2021-10-07T11:00:00.000Z",
          "wordCount": 2361,
          "title": "Jaderné noviny – přehled za září 2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-vztah-mezi-bezpecnosti-it-a-vyvojem-se-musi-zlepsit",
          "author": "Redakce",
          "description": "IBM Cloud a jeho umělá inteligence i ve vlastním datacentru. HPE představilo nové cloudové služby pro platformu HPE GreenLake. Pure nabízí Database-as-a-Service pro Kubernetes. Internet věcí nás obklopuje na každém kroku, účastníci Atos Hackathonu se naučí s ním zacházet. Vztah mezi bezpečností, IT a vývojem se musí zlepšit.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-vztah-mezi-bezpecnosti-it-a-vyvojem-se-musi-zlepsit",
          "publishedOn": "2021-10-03T22:01:00.000Z",
          "wordCount": 1397,
          "title": "Týden na ITBiz: Vztah mezi bezpečností, IT a vývojem se musí zlepšit"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-elektronika-s-elektrony-se-zapornou-hmotnosti",
          "author": "Redakce",
          "description": "Podivný model chování elektronů, kupodivu v nijak zvlášť exotických polovodičích. Zrcadlo lape vlhkost i ve vedru. Jak vůbec funguje zhroucení hvězdy? Kromě temné hmoty chybí ve vesmíru i ta běžná.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-elektronika-s-elektrony-se-zapornou-hmotnosti",
          "publishedOn": "2021-10-02T22:01:00.000Z",
          "wordCount": 1575,
          "title": "Týden na ScienceMag.cz: Elektronika s elektrony se zápornou hmotností"
        }
      ]
    },
    {
      "title": "abclinuxu - čerstvé zprávičky",
      "feedUrl": "http://www.abclinuxu.cz/auto/zpravicky.rss",
      "siteUrl": "http://www.abclinuxu.cz/zpravicky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/zpravicky/hodnota-bitcoinu-opet-prekonala-60-000-dolaru",
          "author": "Ladislav Hagara",
          "description": "V dubnu letošního roku byla hodnota Bitcoinu, decentralizované kryptoměny téměř 65 000 dolarů. V červnu hodnota klesla pod 30 000 dolarů. Aktuálně opět překonala 60 000 dolarů.",
          "link": "http://www.abclinuxu.cz/zpravicky/hodnota-bitcoinu-opet-prekonala-60-000-dolaru",
          "publishedOn": "2021-10-15T19:50:44.000Z",
          "wordCount": 2730,
          "title": "Hodnota Bitcoinu opět překonala 60 000 dolarů"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/novinky-od-pine64-10-2021-pinephone-pro",
          "author": "Ladislav Hagara",
          "description": "Společnost PINE64 stojící za telefonem PinePhone, notebooky Pinebook a Pinebook Pro, IP kamerou PineCube, hodinkami PineTime, páječkou (pájecím perem) Pinecil, zdroji PinePower nebo RISC-V vývojovou deskou PineCone publikovala na svém blogu říjnový souhrn novinek (YouTube) a představila nový vylepšený PinePhone Pro.",
          "link": "http://www.abclinuxu.cz/zpravicky/novinky-od-pine64-10-2021-pinephone-pro",
          "publishedOn": "2021-10-15T14:06:00.000Z",
          "wordCount": 2561,
          "title": "Novinky od PINE64 - 10/2021 - PinePhone Pro"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/ubuntu-22.04-bude-jammy-jellyfish",
          "author": "Ladislav Hagara",
          "description": "Ubuntu 22.04 bude Jammy Jellyfish.",
          "link": "http://www.abclinuxu.cz/zpravicky/ubuntu-22.04-bude-jammy-jellyfish",
          "publishedOn": "2021-10-15T13:46:40.000Z",
          "wordCount": 869,
          "title": "Ubuntu 22.04 bude Jammy Jellyfish"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/sysinternals-sysmon-pro-linux",
          "author": "Ladislav Hagara",
          "description": "Projekt Sysinternals, tj. technické informace, nástroje pro diagnostiku, monitorování a hledání chyb v Microsoft Windows, včera slavil 25 let. Při této příležitosti byl představen Sysinternals Sysmon pro Linux. Zdrojové kódy jsou k dispozici na GitHubu. Další informace v příspěvku na blogu Microsoft Tech Community.",
          "link": "http://www.abclinuxu.cz/zpravicky/sysinternals-sysmon-pro-linux",
          "publishedOn": "2021-10-15T13:06:45.000Z",
          "wordCount": 805,
          "title": "Sysinternals Sysmon pro Linux"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/strawberry-1.0.0",
          "author": "Fluttershy, yay!",
          "description": "Správce sbírky a přehrávač hudby Strawberry, fork Clementine, duchovního nástupce původního Amaroku z KDE 3.x, dospěl k vydání 1.0.0. Používá Qt 6, doplňuje několik funkcí včetně podpory ALSA PCM zařízení a unikátní identifikace souborů ve sbírce.",
          "link": "http://www.abclinuxu.cz/zpravicky/strawberry-1.0.0",
          "publishedOn": "2021-10-15T08:42:50.000Z",
          "wordCount": 787,
          "title": "Strawberry 1.0.0"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/devuan-4.0-chimaera",
          "author": "Ladislav Hagara",
          "description": "Devuan (Wikipedie), fork Debianu bez systemd, byl vydán ve verzi 4.0. Jeho kódové jméno je Chimaera podle planetky 623. Přehled novinek v poznámkách k vydání. Devuan 4.0 je založen je na Debianu 11.1 Bullseye.",
          "link": "http://www.abclinuxu.cz/zpravicky/devuan-4.0-chimaera",
          "publishedOn": "2021-10-14T20:45:24.000Z",
          "wordCount": 1273,
          "title": "Devuan 4.0 Chimaera"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/ubuntu-21.10-impish-indri",
          "author": "Ladislav Hagara",
          "description": "Bylo vydáno Ubuntu 21.10 s kódovým názvem Impish Indri. Přehled novinek v poznámkách k vydání.",
          "link": "http://www.abclinuxu.cz/zpravicky/ubuntu-21.10-impish-indri",
          "publishedOn": "2021-10-14T18:23:24.000Z",
          "wordCount": 2144,
          "title": "Ubuntu 21.10 (Impish Indri)"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/apple-sponzorem-blenderu",
          "author": "Ladislav Hagara",
          "description": "Vývojáři svobodného 3D softwaru Blender představili nejnovějšího firemního sponzora Blenderu. Je ním společnost Apple a úroveň sponzoringu je Patron, tj. minimálně 120 tisíc eur ročně.",
          "link": "http://www.abclinuxu.cz/zpravicky/apple-sponzorem-blenderu",
          "publishedOn": "2021-10-14T15:34:43.000Z",
          "wordCount": 855,
          "title": "Apple sponzorem Blenderu"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/program-konference-openalt-2021-zverejnen",
          "author": "Ladislav Hagara",
          "description": "Byl zveřejněn program konference OpenAlt 2021. Konference proběhne online o víkendu 6. a 7. listopadu. Pokud to protiepidemická opatření dovolí, po skončení hlavního programu proběhne offline část v restauracích v Brně, v Praze, …",
          "link": "http://www.abclinuxu.cz/zpravicky/program-konference-openalt-2021-zverejnen",
          "publishedOn": "2021-10-14T11:19:53.000Z",
          "wordCount": 1205,
          "title": "Program konference OpenAlt 2021 zveřejněn"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/kde-plasma-25th-anniversary-edition-aneb-kde-plasma-5.23",
          "author": "Ladislav Hagara",
          "description": "Byla vydána KDE Plasma 25th Anniversary Edition aneb desktopové prostředí KDE Plasma bylo vydáno ve verzi 5.23. Přehled novinek i s videem a se snímky obrazovky v oficiálním oznámení. Podrobný přehled v seznamu změn.",
          "link": "http://www.abclinuxu.cz/zpravicky/kde-plasma-25th-anniversary-edition-aneb-kde-plasma-5.23",
          "publishedOn": "2021-10-14T10:56:46.000Z",
          "wordCount": 840,
          "title": "KDE Plasma 25th Anniversary Edition aneb KDE Plasma 5.23"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-SME-No-Default-Use",
          "author": null,
          "description": "Being sent in as a fix for the Linux 5.15 kernel this morning and to be back-ported to existing stable series is a behavior change that the Linux kernel will no longer use AMD Secure Memory Encryption (SME) by default on supported hardware but rather making it now opt-in due to shortcomings of some platforms...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-SME-No-Default-Use",
          "publishedOn": "2021-10-17T11:00:00.000Z",
          "wordCount": 885,
          "title": "Linux To No Longer Enable AMD SME Usage By Default Due To Problems With Some Hardware"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Vortex86-Linux-Detection",
          "author": null,
          "description": "The Vortex86 32-bit SoCs have worked under Linux for those distributions still maintaining 32-bit x86 support and where not hitting corner-cases of some i686 level features not being supported by some Vortex86 cores, but there is finally a pending kernel patch to provide proper CPU detection for Vortex86 hardware...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Vortex86-Linux-Detection",
          "publishedOn": "2021-10-17T10:13:31.000Z",
          "wordCount": 805,
          "title": "Vortex86 Processors Finally Seeing Work In 2021 For Proper Handling Under Linux"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=8M-IOPS-Per-Core-Linux",
          "author": null,
          "description": "It was just last week that Linux optimizations were leading to possible 6M IOPS per core and then at the start of this week new patches pushed Linux past 7M IOPS per-core with an ideal hardware configuration as well. In ending out the week, 8M IOPS has been reached!..",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=8M-IOPS-Per-Core-Linux",
          "publishedOn": "2021-10-17T04:00:00.000Z",
          "wordCount": 784,
          "title": "Axboe Achieves 8M IOPS Per-Core With Newest Linux Optimization Patches"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Cloud-Hypervisor-19.0",
          "author": null,
          "description": "Cloud-Hypervisor 19.0 debuted this week as the Intel-led open-source VMM focused on supporting modern cloud workloads and written in the Rust programming language while leveraging the Linux's KVM virtualization code or the Microsoft MSHV hypervisor on Windows...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Cloud-Hypervisor-19.0",
          "publishedOn": "2021-10-16T17:33:30.000Z",
          "wordCount": 801,
          "title": "Rust-Based Cloud-Hypervisor 19.0 Released With Improved Live Migration, Faster Boot Time"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Realtek-802.11ax-rtw89",
          "author": null,
          "description": "Arriving in the wireless-drivers-next branch this week is the \"rtw89\" driver as a Realtek-contributed open-source 802.11ax WiFi driver...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Realtek-802.11ax-rtw89",
          "publishedOn": "2021-10-16T09:40:17.000Z",
          "wordCount": 818,
          "title": "Realtek 802.11ax WiFi Driver \"rtw89\" Queued Ahead Of Linux 5.16"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-More-Crash-Fixes-Coming",
          "author": null,
          "description": "This week marked the release of Plasma 5.23 in celebrating 25 years of the KDE desktop project while celebrations didn't last long with developers already hard at work on the Plasma 5.23.1 point release, feature work for Plasma 5.24, and also improvements to the KDE Applications and KDE Frameworks...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-More-Crash-Fixes-Coming",
          "publishedOn": "2021-10-16T09:27:24.000Z",
          "wordCount": 860,
          "title": "KDE's Plasma Wayland Session Continues Seeing More Crash Fixes"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Bareflank-3.0-Pre-Release",
          "author": null,
          "description": "The open-source Bareflank Hypervisor project designed to prototype new hypervisors across Intel, AMD, and AArch64 platforms issued their long-awaited 3.0 pre-release on Friday...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Bareflank-3.0-Pre-Release",
          "publishedOn": "2021-10-16T08:46:44.000Z",
          "wordCount": 786,
          "title": "Bareflank Hypervisor 3.0 Pre-Release Debuts With Many Changes"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Sculpt-OS-21.10",
          "author": null,
          "description": "On Thursday in addition to the releases of Ubuntu 21.10 (plus its derivatives) and OpenBSD 7.0, the Genode OS Framework based Sculpt OS saw its 21.10 release...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Sculpt-OS-21.10",
          "publishedOn": "2021-10-16T07:30:00.000Z",
          "wordCount": 893,
          "title": "Genode-Based Sculpt OS 21.10 Adds Intel GPU Acceleration, USB Web Camera Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=OpenCL-3.0.9",
          "author": null,
          "description": "The Khronos Group's OpenCL working group did a quiet Friday evening tagging of OpenCL 3.0.9...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=OpenCL-3.0.9",
          "publishedOn": "2021-10-15T23:32:58.000Z",
          "wordCount": 776,
          "title": "OpenCL 3.0.9 Specification Released"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=PinePhone-Pro",
          "author": null,
          "description": "The PinePhone Pro is being announced this morning as the organization's new smartphone building upon the successes and experience of the original PinePhone Linux smartphone...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=PinePhone-Pro",
          "publishedOn": "2021-10-15T14:00:00.000Z",
          "wordCount": 840,
          "title": "PinePhone Pro Announced As New Linux Smartphone"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Compute-21.41.21220",
          "author": null,
          "description": "Intel's open-source engineers have shipped Compute-Runtime 21.41.21220 as the newest version of this Linux compute stack enabling OpenCL and Level Zero support with their graphics processors...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Compute-21.41.21220",
          "publishedOn": "2021-10-15T13:30:21.000Z",
          "wordCount": 813,
          "title": "Intel Compute-Runtime 21.41.21220 Ships Updated DG1 Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AV1-libaom-3.2",
          "author": null,
          "description": "Libaom 3.2 is now available as the latest version of the official AOMedia/Google-developed AV1 Codec Library. With libaom 3.2 comes compression efficiency improvements, perceptual quality improvements, and a variety of speed-ups and memory optimizations...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AV1-libaom-3.2",
          "publishedOn": "2021-10-15T12:31:50.000Z",
          "wordCount": 778,
          "title": "AV1 Codec Library libaom v3.2 Brings More Performance Optimizations"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.16-Cluster-Scheduler",
          "author": null,
          "description": "Cluster scheduler support has been queued up for landing in the Linux 5.16 kernel for AArch64 and x86_64 systems for improving the CPU scheduler behavior for systems that have clusters of CPU cores...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.16-Cluster-Scheduler",
          "publishedOn": "2021-10-15T10:37:13.000Z",
          "wordCount": 867,
          "title": "Cluster Scheduler Support Queued Ahead Of Linux 5.16"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=SALSA-Linux-Audio-2021",
          "author": null,
          "description": "Linux sound subsystem maintainer Takashi Iwai of SUSE is back to hacking on SALSA, the \"small ALSA\" library that he started a decade ago but hadn't seen a new release in six years or any code activity for the past four years... until this week...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=SALSA-Linux-Audio-2021",
          "publishedOn": "2021-10-15T10:03:05.000Z",
          "wordCount": 905,
          "title": "SALSA Back In Development As A Small ALSA Library For Linux Systems"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMDGPU-Linux-5.16-PSR",
          "author": null,
          "description": "With it getting late into the Linux 5.15 kernel cycle, the focus is shifting by the Direct Rendering Driver maintainers from new feature work targeting the next cycle (5.16) to instead on bug fixes. AMD sent out a pull request of new AMDGPU Linux 5.16 material this week that is primarily delivering bug fixes but one notable addition is finally enabling PSR by default for newer GPUs...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMDGPU-Linux-5.16-PSR",
          "publishedOn": "2021-10-15T09:33:59.000Z",
          "wordCount": 996,
          "title": "AMD Finally Enabling PSR By Default For Newer Hardware With Linux 5.16"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30613",
          "author": null,
          "description": "Made public this week by CPU security researchers at Graz University of Technology and CISPA Helmholtz Center for Information Security was the research paper published \"AMD Prefetch Attacks through Power and Time\". The paper points to AMD CPUs suffering from a side-channel leakage vulnerability through timing and power variations of the PREFETCH instruction. The paper argues that AMD CPUs should activate stronger page table isolation by default. AMD has now published their security response where they are not recommending any mitigation changes at this time. But what if Kernel Page Table Isolation (KPTI/PTI) proves necessary for AMD CPUs? Here are some initial benchmarks showing what that performance impact could look like.",
          "link": "https://www.phoronix.com/vr.php?view=30613",
          "publishedOn": "2021-10-15T04:00:00.000Z",
          "wordCount": 1325,
          "title": "The \"What If\" Performance Cost To Kernel Page Table Isolation On AMD CPUs"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=X.Org-Server-21.1-RC2",
          "author": null,
          "description": "X.Org Server 21.1 continues running slightly behind schedule but out today is a second release candidate of that upcoming xorg-server version -- the first in more than three years...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=X.Org-Server-21.1-RC2",
          "publishedOn": "2021-10-14T19:36:24.000Z",
          "wordCount": 847,
          "title": "X.Org Server 21.1 RC2 Brings Fix For Mixed VRR/Non-VRR Multi-Monitor Setups"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Devuan-4.0-Released",
          "author": null,
          "description": "Devuan 4.0 \"Chimaera\" is officially out today as the latest stable release of this Linux distribution known for being a close rebuild of Debian but without a dependence on systemd...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Devuan-4.0-Released",
          "publishedOn": "2021-10-14T17:46:47.000Z",
          "wordCount": 687,
          "title": "Devuan 4.0 Released As Debian 11 Without Systemd"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-21.10",
          "author": null,
          "description": "Ubuntu 21.10 \"Impish Indri\" is now officially available as the latest six-month update to Ubuntu Linux and also serving as the last release prior to the next long-term support cycle, Ubuntu 22.04 LTS...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-21.10",
          "publishedOn": "2021-10-14T14:53:57.000Z",
          "wordCount": 873,
          "title": "Ubuntu 21.10 Released With GNOME 40 Desktop, Many Underlying Improvements"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-495.29.05-Linux",
          "author": null,
          "description": "NVIDIA 495.29.05 is out today as the first public Linux driver in the 495 series...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-495.29.05-Linux",
          "publishedOn": "2021-10-14T13:36:20.000Z",
          "wordCount": 755,
          "title": "NVIDIA 495 Linux Beta Driver Released With GBM Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=OpenBSD-7.0-Released",
          "author": null,
          "description": "Not only is Ubuntu 21.10 releasing today but over on the BSD side of the table is the debut this morning of OpenBSD 7.0...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=OpenBSD-7.0-Released",
          "publishedOn": "2021-10-14T13:00:03.000Z",
          "wordCount": 857,
          "title": "OpenBSD 7.0 Released With RISC-V 64-bit Port, Better Apple Silicon Support"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30607",
          "author": null,
          "description": "While we recently looked at autumn 2021 Linux distributions on Intel Tiger Lake for seeing how these various latest distributions are competing on client platforms, in today's article is a look at how well the latest Linux distributions perform when using the latest-generation Intel Xeon Scalable 3rd Gen \"Ice Lake\" server hardware with two Xeon Platinum 8380 processors. AlmaLinux, Arch Linux, CentOS Stream, Clear Linux, Debian, Fedora, openSUSE, and Ubuntu were battling it out on this Intel reference server.",
          "link": "https://www.phoronix.com/vr.php?view=30607",
          "publishedOn": "2021-10-14T12:30:00.000Z",
          "wordCount": 963,
          "title": "9-Way H2'2021 Linux OS Performance Comparison On Intel Xeon Scalable Ice Lake"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-Plasma-5.23-Released",
          "author": null,
          "description": "KDE Plasma 5.23 is officially out this morning as the newest major open-source desktop release and is known now as the KDE 25th Anniversary Edition...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-Plasma-5.23-Released",
          "publishedOn": "2021-10-14T10:22:20.000Z",
          "wordCount": 872,
          "title": "KDE Plasma 5.23 Released In Marking 25 Years Of KDE"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Qt-Creator-6-Beta",
          "author": null,
          "description": "With Qt 6.2 LTS having shipped at the end of September, The Qt Company is now turning their attention to Qt Creator 6 as the next version of their Qt/C++ focused integrated development environment...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Qt-Creator-6-Beta",
          "publishedOn": "2021-10-14T10:15:19.000Z",
          "wordCount": 826,
          "title": "Qt Creator 6 Beta Released With Updated C++ Code Model, Binaries Built Against Qt 6.2"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=openSUSE-Leap-Regular-Rebuilds",
          "author": null,
          "description": "Moving forward regular respins of the openSUSE Leap images are expected to include the latest package updates in making for a more pleasant out-of-the-box experience...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=openSUSE-Leap-Regular-Rebuilds",
          "publishedOn": "2021-10-14T09:27:24.000Z",
          "wordCount": 760,
          "title": "openSUSE Leap ISOs To See Regular Respins For Integrating Latest Updates"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=XeHPG-Tess-Geometry-Distribute",
          "author": null,
          "description": "A new feature for upcoming XeHPG graphics that was merged into Intel's open-source Linux OpenGL and Vulkan drivers today was for tessellation distribution and geometry distribution across the graphics hardware...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=XeHPG-Tess-Geometry-Distribute",
          "publishedOn": "2021-10-14T04:00:00.000Z",
          "wordCount": 786,
          "title": "Intel Linux Driver Lands Tessellation/Geometry Distribution Feature For Xe-HPG"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-rc1-Released",
          "author": null,
          "description": "Mesa 21.3 feature development is now over with the code having been branched and the first release candidate issued...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-rc1-Released",
          "publishedOn": "2021-10-13T20:26:46.000Z",
          "wordCount": 886,
          "title": "Mesa 21.3-rc1 Released With Improved Zink, Radeon Ray-Tracing, RADV NGG Culling"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Retpoline-Rewrite-Rewrite",
          "author": null,
          "description": "The Linux kernel has supported Retpolines for over three years now as part of their Spectre Variant Two mitigations while now a patch series is proposed that rewrites Retpoline's rewrite logic...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Retpoline-Rewrite-Rewrite",
          "publishedOn": "2021-10-13T18:11:04.000Z",
          "wordCount": 842,
          "title": "Linux Patches Rewrite The Retpoline Rewrite Code - Possible Performance Benefit"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=DragonFlyBSD-6.0.1-Released",
          "author": null,
          "description": "Released back in May was the shiny DragonFlyBSD 6.0 release while today a point release for it has been issued...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=DragonFlyBSD-6.0.1-Released",
          "publishedOn": "2021-10-13T17:20:35.000Z",
          "wordCount": 670,
          "title": "DragonFlyBSD 6.0.1 Released With AMD Zen 3 Temperature Monitoring, Fixes"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30600",
          "author": null,
          "description": "Today AMD is officially launching the Radeon RX 6600 graphics card as a trimmed down model from the Radeon RX 6600 XT that launched back in August. This new (non-XT) model has a suggested price of $329 USD and here is a look at how well this RDNA2 graphics card is performing under Linux.",
          "link": "https://www.phoronix.com/vr.php?view=30600",
          "publishedOn": "2021-10-13T13:00:00.000Z",
          "wordCount": 899,
          "title": "AMD Radeon RX 6600 Linux Performance"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Vulkan-1.2.196-H265-Encode",
          "author": null,
          "description": "Arriving back in April were the initial Vulkan Video extensions that included support for video decode of H.264 and H.265 while the initial video encode support was limited to H.264. Out today with Vulkan 1.2.196 is the new extension allowing for H.265 encoding with this new industry-standard video API...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Vulkan-1.2.196-H265-Encode",
          "publishedOn": "2021-10-13T11:27:41.000Z",
          "wordCount": 793,
          "title": "Vulkan 1.2.196 Introduces H.265 Encode Extension"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-Fixes-Wayland-Trans",
          "author": null,
          "description": "Landing in time for the imminent Mesa 21.3 feature freeze / code branching is support for the EGL_EXT_present_opaque extension on Wayland. While this EGL extension may not sound too exciting, for some OpenGL games on Wayland it will address some transparency issues...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-Fixes-Wayland-Trans",
          "publishedOn": "2021-10-13T11:17:28.000Z",
          "wordCount": 779,
          "title": "Mesa 21.3 Fixes Issue Of Some Games Having Transparency Issues Under Wayland"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/rss.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2529/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2529/",
          "publishedOn": "2021-10-15T04:00:00.000Z",
          "wordCount": 187,
          "title": "Unsolved Math Problems"
        },
        {
          "id": "https://xkcd.com/2528/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2528/",
          "publishedOn": "2021-10-13T04:00:00.000Z",
          "wordCount": 187,
          "title": "Flag Map Sabotage"
        },
        {
          "id": "https://xkcd.com/2527/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2527/",
          "publishedOn": "2021-10-11T04:00:00.000Z",
          "wordCount": 187,
          "title": "New Nobel Prizes"
        },
        {
          "id": "https://xkcd.com/2526/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2526/",
          "publishedOn": "2021-10-08T04:00:00.000Z",
          "wordCount": 187,
          "title": "TSP vs TBSP"
        }
      ]
    }
  ],
  "cliVersion": "1.11.3"
}