{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "Kotaku",
      "feedUrl": "https://kotaku.com/rss",
      "siteUrl": "https://kotaku.com",
      "articles": [
        {
          "id": "1847676264",
          "author": "Ian Walker",
          "description": "Deathloop is, by all accounts, a damn good game. That said, its reception on Steam is sitting shakily in “Mixed” territory due to the various performance-related issues currently plaguing PC players.\n\nRead more...",
          "link": "https://kotaku.com/even-beefy-rigs-arent-saving-deathloop-from-pc-issues-1847676264",
          "publishedOn": "2021-09-14T21:45:00.000Z",
          "wordCount": 725,
          "title": "Even Beefy Rigs Aren't Saving Deathloop From PC Issues"
        },
        {
          "id": "1847676245",
          "author": "Jeremy Winslow",
          "description": "The Nintendo Switch has received its first price cut in certain parts of the world, dropping from €330 in Europe and €280 in the UK down to €270 and €260, respectively. But while fans hoped the same could happen in the U.S., especially with sites like VGC insisting a cut is coming, Nintendo says such a thing is…\nRead more...",
          "link": "https://kotaku.com/the-world-seems-ready-for-a-nintendo-switch-price-cut-1847676245",
          "publishedOn": "2021-09-14T21:30:00.000Z",
          "wordCount": 565,
          "title": "The World Seems Ready For A Nintendo Switch Price Cut"
        },
        {
          "id": "1847675986",
          "author": "Ari Notis",
          "description": "You probably know that fashion week happens eight times per year, twice annually in Paris, Milan, London, and New York. But soon, the so-called “Big Four” will face some serious competition for the limelight when Pokémon Go kicks off its own fashion week event next Tuesday.\n\nRead more...",
          "link": "https://kotaku.com/pokemon-go-gets-form-changes-for-fashion-week-1847675986",
          "publishedOn": "2021-09-14T21:05:00.000Z",
          "wordCount": 386,
          "title": "Pokémon Go Gets 'Form Changes' For Fashion Week"
        },
        {
          "id": "1847675870",
          "author": "Ethan Gach",
          "description": "Activision Blizzard employees represented by the ABetterABK worker group filed a lawsuit against the Call of Duty publisher with the National Labor Review Board yesterday accusing it of union busting. It comes in the wake of a bombshell California lawsuit alleging widespread sexual harassment and discrimination at the…\nRead more...",
          "link": "https://kotaku.com/workers-accuse-activision-blizzard-of-union-busting-1847675870",
          "publishedOn": "2021-09-14T20:45:00.000Z",
          "wordCount": 618,
          "title": "Workers Accuse Activision Blizzard Of Union Busting"
        },
        {
          "id": "1847675656",
          "author": "Ian Walker",
          "description": "Ubisoft plans to revive the Driver franchise, the company announced today...with a live-action streaming series. Those sounds you just heard were millions of excited fans collectively scooting forward in their seats and then immediately slumping back in disappointment.\n\nRead more...",
          "link": "https://kotaku.com/nobody-wants-a-driver-tv-show-ubisoft-1847675656",
          "publishedOn": "2021-09-14T20:35:00.000Z",
          "wordCount": 479,
          "title": "Nobody Wants A Driver TV Show, Ubisoft"
        },
        {
          "id": "1847671952",
          "author": "Isaiah Colbert",
          "description": "Only three things in life are certain for a shonen otaku: tournament arcs, Studio Trigger series finales ending in space, and One Piece continuing until the heat death of the universe. I’d made prior attempts to read One Piece, but each time I got too intimidated by its length, which has now surpassed 1,000 chapters.…\nRead more...",
          "link": "https://kotaku.com/i-just-read-1-025-chapters-of-one-piece-and-its-a-damn-1847671952",
          "publishedOn": "2021-09-14T20:20:00.000Z",
          "wordCount": 1350,
          "title": "I Just Read 1,025 Chapters Of One Piece, And It's A Damn Masterpiece"
        },
        {
          "id": "1847673845",
          "author": "Jeremy Winslow",
          "description": "What’s up, Kotaku? I’m Jeremy Winslow, your second Black staff writer, and while I hustled for this spot and know that I earned it through years of hard work and dedication, part of me still can’t believe I actually made it here.\n\nRead more...",
          "link": "https://kotaku.com/your-boy-s-here-so-let-s-get-real-1847673845",
          "publishedOn": "2021-09-14T17:45:00.000Z",
          "wordCount": 745,
          "title": "Your Boy’s Here, So Let’s Get Real"
        },
        {
          "id": "1847673704",
          "author": "Ari Notis",
          "description": "Developer 1047 Games has raised $100 million from a bunch of venture capital investors, the studio announced via press release today. The eye-popping fundraising haul will allow the outfit to remain independent and beef up work on its enormously popular free-to-play arena shooter, Splitgate.\n\nRead more...",
          "link": "https://kotaku.com/splitgate-s-getting-bigger-and-better-thanks-to-a-cool-1847673704",
          "publishedOn": "2021-09-14T17:25:00.000Z",
          "wordCount": 555,
          "title": "Splitgate’s Getting Bigger And Better, Thanks To A Cool $100M"
        },
        {
          "id": "1847673337",
          "author": "Sisi Jiang",
          "description": "Hailing from the darkly humorous animated show, Ren and Stimpy are the newest additions to the Nickelodeon All-Star Brawl roster, developer Ludosity announced on Tuesday.\n\nRead more...",
          "link": "https://kotaku.com/ren-and-stimpy-are-coming-to-the-nick-fighting-game-as-1847673337",
          "publishedOn": "2021-09-14T17:00:00.000Z",
          "wordCount": 446,
          "title": "Ren And Stimpy Are Coming To The Nick Fighting Game As A Duo"
        },
        {
          "id": "1847673046",
          "author": "Ari Notis",
          "description": "For a minute there, Cyberpunk 2077 wasn’t wet enough. Today, it is, thanks to an update that restores missing water effects in the troubled open-world shooter.\n\nRead more...",
          "link": "https://kotaku.com/cyberpunk-2077-patch-makes-its-roads-wet-again-1847673046",
          "publishedOn": "2021-09-14T16:35:00.000Z",
          "wordCount": 467,
          "title": "Cyberpunk 2077 Patch Makes Its Roads Wet Again"
        },
        {
          "id": "1847672280",
          "author": "John Walker",
          "description": "As a cynical, bitter, battle-worn games critic, I would like nothing better than to declare what a disastrous mess Microsoft is making of Game Pass. But damn them, they’re not, and the line-up of new additions coming in the second half of September is pleasingly strong. Another 13 games are getting added by October…\nRead more...",
          "link": "https://kotaku.com/game-pass-is-really-blowing-up-in-september-1847672280",
          "publishedOn": "2021-09-14T15:15:00.000Z",
          "wordCount": 497,
          "title": "Game Pass Is Really Blowing Up In September"
        },
        {
          "id": "1847672103",
          "author": "Sisi Jiang",
          "description": "While most science fiction games ask me what it means to be human, Opus: Echo of Starsong asked me: “Is it enough to be human?” This philosophical space opera is a staggeringly emotional game that deserves a spot among indie narrative greats such as Transistor and What Remains of Edith Finch. \nRead more...",
          "link": "https://kotaku.com/opus-echo-of-starsong-the-kotaku-review-1847672103",
          "publishedOn": "2021-09-14T14:55:00.000Z",
          "wordCount": 1847,
          "title": "Opus: Echo Of Starsong: The Kotaku Review"
        },
        {
          "id": "1847671904",
          "author": "Ethan Gach",
          "description": "The PS5 is getting a slew of new features in a massive software update set to go live around the world on September 15, Sony announced in a PlayStation blog post today.\nRead more...",
          "link": "https://kotaku.com/the-ps5-is-getting-a-major-update-1847671904",
          "publishedOn": "2021-09-14T14:30:00.000Z",
          "wordCount": 498,
          "title": "The PS5 Is Getting A Major Update"
        },
        {
          "id": "1847671839",
          "author": "Ari Notis",
          "description": "Dying Light 2: Stay Human, the first-person zombie parkour game slated for a December 7 release, has been delayed, developer Techland announced in a tweet today. It’ll now come out on February 4, 2022, for Xbox, PlayStation, and PC, contributing to what’s shaping up to be the most stacked release month of all time,…\nRead more...",
          "link": "https://kotaku.com/dying-light-2-delayed-to-2022-1847671839",
          "publishedOn": "2021-09-14T14:25:00.000Z",
          "wordCount": 517,
          "title": "Dying Light 2 Delayed To 2022"
        },
        {
          "id": "1847671052",
          "author": "Brian Ashcraft",
          "description": "In Attack on Titan, the human-eating Titans are horrifying and freaky. So naturally, when official Titan trash and recycling bins were introduced in Japan, they also look unsettling—even more so when placed next to Coca-Cola vending machines. \nAs part of an effort to promote recycling and good urban sanitation,…\nRead more...",
          "link": "https://kotaku.com/attack-on-titan-gets-freaky-looking-trash-and-recycling-1847671052",
          "publishedOn": "2021-09-14T11:58:00.000Z",
          "wordCount": 470,
          "title": "Attack On Titan Gets Freaky-Looking Trash And Recycling Bins"
        },
        {
          "id": "1847670873",
          "author": "Brian Ashcraft",
          "description": "It’s a tale as old as time—or at least as old as sports games. Athlete plays the in-game version of themselves and is sorely disappointed by what they see. Keisuke Honda, you are not alone!\nRead more...",
          "link": "https://kotaku.com/keisuke-honda-played-himself-in-pro-evo-and-wasnt-happy-1847670873",
          "publishedOn": "2021-09-14T10:30:00.000Z",
          "wordCount": 361,
          "title": "Keisuke Honda Played Himself In Pro Evo And Wasn't Happy"
        },
        {
          "id": "1847670755",
          "author": "Brian Ashcraft",
          "description": "On September 14, 2001, the GameCube went on sale for the first time in Japan. Two months later, on November 18, the console was released in North America. Can you believe it’s been twenty years? \nFacing off against the PlayStation 2 and the Xbox, the GameCube was the first Nintendo console to use optical discs—though,…\nRead more...",
          "link": "https://kotaku.com/the-nintendo-gamecube-is-now-twenty-years-old-1847670755",
          "publishedOn": "2021-09-14T09:30:00.000Z",
          "wordCount": 618,
          "title": "The Nintendo GameCube Turns Twenty Today"
        },
        {
          "id": "1847669211",
          "author": "Luke Plunkett",
          "description": "Deathloop is out, and by all accounts it’s pretty good! It’s a shame, then, that it’s also the reason we’re revisiting the topic of, “Video games people being weirdly shitty about who makes it into the credits and who doesn’t.”\n\nRead more...",
          "link": "https://kotaku.com/everyone-who-worked-on-a-game-should-be-in-the-credits-1847669211",
          "publishedOn": "2021-09-14T01:20:00.000Z",
          "wordCount": 845,
          "title": "Everyone Who Worked On A Game Should Be In The Credits"
        },
        {
          "id": "1847669373",
          "author": "Luke Plunkett",
          "description": "These have been teased by sneaker types for months now, but over the last few days Nike has finally come out and made them official: over the next few weeks we’re getting not one but two pairs of Dunk Highs paying homage to Gundam.\n\nRead more...",
          "link": "https://kotaku.com/nikes-gundam-sneakers-look-badass-1847669373",
          "publishedOn": "2021-09-14T00:00:00.000Z",
          "wordCount": 659,
          "title": "Nike's 'Gundam' Sneakers Look Badass"
        },
        {
          "id": "1847668782",
          "author": "Zack Zwiezen",
          "description": "Games today are massive, taking up dozens of gigabytes. Some recent bigger games, like Call of Duty Black Ops Cold War, cracked 250GB in total. That’s too big. But a new free mini-shooter out today, Q1K3, is a blast and only needs 13KB of JavaScript. It’s also part of a contest dedicated to devs making smaller games…\nRead more...",
          "link": "https://kotaku.com/wow-this-quake-clone-is-smaller-than-a-word-doc-1847668782",
          "publishedOn": "2021-09-13T22:30:00.000Z",
          "wordCount": 553,
          "title": "Wow, This Quake Clone Is Smaller Than A Word Doc"
        },
        {
          "id": "1847668755",
          "author": "Ian Walker",
          "description": "It’s easy to understand why Nickelodeon All-Star Brawl made waves when it was first announced in July.\nRead more...",
          "link": "https://kotaku.com/nickelodeon-all-star-brawl-s-true-power-is-in-its-fanse-1847668755",
          "publishedOn": "2021-09-13T22:15:00.000Z",
          "wordCount": 511,
          "title": "Nickelodeon All-Star Brawl’s True Power Is In Its Fanservice"
        },
        {
          "id": "1847667386",
          "author": "Ian Walker",
          "description": "I’ve often said that anything with a cast of unique characters can be turned into a fighting game. Case in point: Among Us Arena, which takes the multi-colored crewmates of the popular Mafia-like and places them in a surprisingly fun one-on-one combat system.\n\nRead more...",
          "link": "https://kotaku.com/someone-made-an-among-us-fighting-game-because-why-not-1847667386",
          "publishedOn": "2021-09-13T19:35:00.000Z",
          "wordCount": 412,
          "title": "Someone Made An Among Us Fighting Game Because Why Not"
        },
        {
          "id": "1847666558",
          "author": "Zack Zwiezen",
          "description": "LittleBigPlanet fans have a bit of a good news/bad news situation this morning. After months of downtime, the PS4 servers for LittleBigPlanet 3 are back online, with all the community content restored and working as before. However, servers for all prior PS3 and Vita versions will remain offline indefinitely, having…\nRead more...",
          "link": "https://kotaku.com/classic-littlebigplanet-servers-shut-down-permanently-f-1847666558",
          "publishedOn": "2021-09-13T18:15:00.000Z",
          "wordCount": 584,
          "title": "Classic LittleBigPlanet Servers Shut Down Permanently Following Hacks"
        },
        {
          "id": "1847664756",
          "author": "Ari Notis",
          "description": "Like an ancient Norse myth that sat dormant for years before seeping into the zeitgeist, God of War Ragnarok is coming. First teased last year, the much-anticipated sequel to 2018’s God of War finally popped up last week as the splashy capstone of a PlayStation showcase.\n\nRead more...",
          "link": "https://kotaku.com/five-things-to-know-about-god-of-war-ragnarok-1847664756",
          "publishedOn": "2021-09-13T17:00:00.000Z",
          "wordCount": 753,
          "title": "Five Things To Know About God Of War Ragnarok"
        },
        {
          "id": "1847665322",
          "author": "Renata Price",
          "description": "Today, the popular video streaming service YouTube committed a murder most foul. Two stalwart members of any Discord server worth its salt, stolen away from us in the night. Groovy and Rythm are dead, and I will mourn my beautiful robot companions with all of my heart.\n\nRead more...",
          "link": "https://kotaku.com/youtube-kills-two-big-discord-music-bots-and-that-suck-1847665322",
          "publishedOn": "2021-09-13T16:30:00.000Z",
          "wordCount": 1291,
          "title": "YouTube Kills Two Big Discord Music Bots, And That Sucks"
        }
      ]
    },
    {
      "title": "Nintendo Life | Latest Updates",
      "feedUrl": "https://www.nintendolife.com/feeds/latest",
      "siteUrl": "https://www.nintendolife.com/feeds/latest",
      "articles": [
        {
          "id": "https://www.nintendolife.com/#article-120935",
          "author": null,
          "description": "Is this a stealth campaign for veganism?\nHey, remember that Make-A-Wish nightmare burger restaurant that a kid made in Minecraft? If not, that sentence probably seems pretty wild, but the point is that Happy's Humble Burger Farm is that nightmare burger restaurant made reality. Or virtual reality, at least, because it's a video game.\n\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/happys_humble_burger_farm_is_a_first-person_horror_that_would_make_gordon_ramsay_barf",
          "publishedOn": "2021-09-14T21:00:00.000Z",
          "wordCount": 841,
          "title": "Happy's Humble Burger Farm Is A First-Person Horror That Would Make Gordon Ramsay Barf"
        },
        {
          "id": "https://www.nintendolife.com/#article-120914",
          "author": null,
          "description": "Car carnage.\nHappy birthday, GameCube! It's been twenty years since your gorgeous, chunky indigo shape graced our TV stands, and we were all introduced to that beedle-deedle-deedle-deedle-beedle-deedle-beedly-beep, BLUMP. You know the one I mean.\nThe GameCube's catalogue is so stellar that I've already written several features about its games, from my favourite game, Paper Mario: The Thousand-Year Door, to the grim realities of Harvest Moon: A Wonderful Life. But there are still so many other games to talk about! Luigi's Mansion! Super Mario Sunshine! The Legend of Zelda: Wind Waker!\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/memory_pak_if_crashing_in_burnout_is_wrong_then_i_donrt_want_to_be_right",
          "publishedOn": "2021-09-14T20:00:00.000Z",
          "wordCount": 1911,
          "title": "Memory Pak: If Crashing In Burnout Is Wrong, Then I Don’t Want To Be Right"
        },
        {
          "id": "https://www.nintendolife.com/#article-120841",
          "author": null,
          "description": "14 games we're dying to (re)play.\nIt's an odd phenomenon when new hardware comes along which makes you delve into your back catalogue for gems you might have missed, or perhaps just revisit classic titles to see how they look and perform on your shiny new system. It's something that PS5 and Xbox Series X gamers have encountered over the last year, with a slim selection of brand new, bespoke titles prompting players to revisit their existing library on the new consoles and see how the classics look on the new machine.\n\nNintendo Switch OLED Model - Price, Release Date, Specs, Battery Life And Where It Leaves 'Switch Pro'\n\nWhile Switch OLED might not have any performance benefits over its normal LCD-screened siblings, we're still itching to replay our favourite games on the new console and see how they look on that gorgeous new screen — to enjoy the richer, deeper blacks and popping colours the new screen will offer. Some of us are, in fact, putting off collecting Korok seeds or starting something new from our back catalogue just so we get to play on the new Switch when it finally arrives.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/talking_point_what_games_are_you_looking_forward_to_playing_on_switch_oled",
          "publishedOn": "2021-09-14T18:00:00.000Z",
          "wordCount": 4302,
          "title": "Talking Point: What Games Are You Looking Forward To Playing On Switch OLED?"
        },
        {
          "id": "https://www.nintendolife.com/#article-120930",
          "author": null,
          "description": "In an insane world, it was the sanest choice.\nAs you may have noticed, today marks 20 years since the Nintendo GameCube launched in Japan and we (along with the rest of the internet) have been getting all nostalgic for Nintendo's purple box.\nAs is customary on these significant anniversaries (or any anniversary when it comes to social media — gotta mark those 17th and 36th birthdays, too), the Twitterverse and Facebookverse and other variously dystopian ‘verses have been quite rightly celebrating, with Gamecube trending in gamers' thoughts in a way Nintendo wishes it might have two decades back.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/random_xboxs_phil_spencer_reveals_his_favourite_gamecube_game",
          "publishedOn": "2021-09-14T17:30:00.000Z",
          "wordCount": 1973,
          "title": "Random: Xbox's Phil Spencer Reveals His Favourite GameCube Game"
        },
        {
          "id": "https://www.nintendolife.com/#article-120863",
          "author": null,
          "description": "I have the high ground, Arachnid.\nThe Switch eShop isn't short of chaotic multiplayer games, but there's always room for one more. Especially when it features nimble spiders fighting with lightsabers - or 'laser swords' as the developer is legally obliged to call them - and guns.\nSpiderHeck is from solo developer Neverjam (Uvis Zviedris), and it's been picked up for publishing by TinyBuild and confirmed for an assortment of systems - including the Switch. It's heading into a Steam playtest today, so hopefully it's not too far away, though naturally there'll be time taken to work on player feedback, develop ports and so on.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/spiderheck_is_a_chaotic_brawler_with_lightsabers_and_guns",
          "publishedOn": "2021-09-14T17:05:00.000Z",
          "wordCount": 931,
          "title": "SpiderHeck Is A Chaotic Brawler With Lightsabers And Guns"
        },
        {
          "id": "https://www.nintendolife.com/#article-111995",
          "author": null,
          "description": "Update: My Nintendo Store UK pre-orders are live, with bonuses.\nUpdate (Tue 14th Sep, 2021 17:15 BST): The UK My Nintendo Store now has Pokémon Legends: Arceus pre-orders up for grabs. Purchasing from Nintendo's official store will net you a free SteelBook and an Arceus figurine, too:\n\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/guides/where-to-pre-order-pokemon-legends-arceus-on-switch",
          "publishedOn": "2021-09-14T16:15:00.000Z",
          "wordCount": 1518,
          "title": "Guide: Where To Pre-Order Pokémon Legends: Arceus On Switch"
        },
        {
          "id": "https://www.nintendolife.com/#article-120828",
          "author": null,
          "description": "A Blast from the past.\nLong-time Nintendo fans will know that the Cruis’n series has an interesting history with the company. The original arcade version of the first game, Cruis’n USA, was said to be the first title running on Nintendo's upcoming Ultra 64 hardware, a claim which ultimately turned out to be a bit of a porky pie.\nIts subsequent Nintendo 64 port was generally criticised (a bit unfairly) for not really being up to scratch, but that wasn’t enough to stop sequels Cruis’n World and Cruis’n Exotica making their way to the N64, followed by a GBA spin-off, before the series was quietly mothballed (we don’t talk about Cruis’n on the Wii). Cruis’n Blast is an attempt to resurrect the series, and we’re absolutely delighted that attempt has been made because it's successful in a way we could never have dreamt would be possible.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/reviews/nintendo-switch/cruisn_blast",
          "publishedOn": "2021-09-14T16:00:00.000Z",
          "wordCount": 4609,
          "title": "Review: Cruis'n Blast - An Arcade Racing Icon Returns In Spectacular Fashion"
        },
        {
          "id": "https://www.nintendolife.com/#article-120876",
          "author": null,
          "description": "Happy happy! Joy joy!\nUpdate:\nAs promised new characters for the Nickelodeon All-Star Brawl roster have been confirmed, and it's Ren & Stimpy! You can check out some footage and screens below.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/nickelodeon_all-star_brawl_adds_ren_and_stimpy_to_roster",
          "publishedOn": "2021-09-14T15:50:00.000Z",
          "wordCount": 3876,
          "title": "Nickelodeon All-Star Brawl Adds Ren & Stimpy To Roster"
        },
        {
          "id": "https://www.nintendolife.com/#article-120919",
          "author": null,
          "description": "Pre-order and get 6 tracks now.\nThe Pokémon Company has been rather busy promoting the franchises' 25th Anniversary, and one of the biggest projects has definitely been Pokémon 25: The Album. With multiple videos featuring major artists (including Katy Perry with 'Electric', above) and EP releases, there's been a steady flow of new music. Now the full release - Pokémon 25: The Album - has a release date; it arrives on 15th October.\nThe digital version is definitely being pushed, with that version getting four exclusive tracks to take the total to 14. You can see the full list below.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/pokemon_25_the_album_gets_a_release_date_includes_14_tracks",
          "publishedOn": "2021-09-14T15:30:00.000Z",
          "wordCount": 1045,
          "title": "Pokémon 25: The Album Gets A Release Date, Includes 14 Tracks"
        },
        {
          "id": "https://www.nintendolife.com/#article-120902",
          "author": null,
          "description": "Out in Q2 2022, will have a Kickstarter for \"pre-orders and early fan bonuses\".\nFor every game that sets out its stall as an action platformer with pixel-based visuals there's the challenge of trying to stand out from the crowd. Another that'll aim to do that next year (Q2) is Last Soul, the work of Canadian studio WULUM with publishing by Bonus Stage.\nIt actually has an imminent Kickstarter campaign (which the video above is also teasing) but the latest press release highlights the publishing deal, confirms the game for Switch and various platforms while pitching the crowdfunding as primarily being for 'pre-orders and early fan bonuses'.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/last_soul_is_an_upcoming_action_platformer_with_a_heroic_robot",
          "publishedOn": "2021-09-14T15:00:00.000Z",
          "wordCount": 911,
          "title": "Last Soul Is An Upcoming Action Platformer With A Heroic Robot"
        },
        {
          "id": "https://www.nintendolife.com/#article-119929",
          "author": null,
          "description": "Update: Amazon Spain sets a new target.\nUpdate (14th September):\nA member of the Nintendo Life team received an order update from Amazon in Spain, stating that it will be delivered on 11th October or later, so there's still quite a wait in that case.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/sonic_colours_ultimate_physical_editions_delayed_in_europe_look_set_for_october",
          "publishedOn": "2021-09-14T14:30:00.000Z",
          "wordCount": 2318,
          "title": "Sonic Colours Ultimate Physical Editions Delayed In Europe, Look Set For October"
        },
        {
          "id": "https://www.nintendolife.com/#article-90886",
          "author": null,
          "description": "Indigo, Spice and all things nice.\nIn celebration of the GameCube's 20th birthday, we're republishing this look back at Nintendo’s little box of tricks...\nIn many ways, the GameCube was a console out of time, arguably arriving too late (or perhaps too early) to realise its true potential. We can look back now and appreciate its quirks, admire its design and excellent software library, and lust after the variants that never made it to western shores, but in the early 2000s it was a big, defiantly colourful block with a chunky handle at a time when sleek multimedia units were all the rage. It was a square peg in the round hole, an embarrassingly sore thumb that stood out against the laser-targeted ‘cool’ of the competition. It’s not by accident that the decade-long period straddling the millennium is looked back on as the ‘PlayStation generation’.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/hardware_classics_nintendo_gamecube",
          "publishedOn": "2021-09-14T14:00:00.000Z",
          "wordCount": 7085,
          "title": "Hardware Classics: Nintendo GameCube"
        },
        {
          "id": "https://www.nintendolife.com/#article-120907",
          "author": null,
          "description": "Keep your ego in it.\nNIS America continues to bring some intriguing games to the Switch, and a JRPG from the publisher that's definitely on our radar is MONARK, which has developers with history in the Shin Megami Tensei franchise working on the project. Due in early 2022, it has a new trailer (above) that introduced ally characters along with some new footage.\nYou awaken in an academy, met by your allies as implied by this cutscene, and you seemingly have alternative identities for the 'Otherworld' as you try to keep EGO and madness in check.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/jrpg_monark_introduces_key_characters_along_with_new_footage",
          "publishedOn": "2021-09-14T13:30:00.000Z",
          "wordCount": 914,
          "title": "JRPG 'MONARK' Introduces Key Characters Along With New Footage"
        },
        {
          "id": "https://www.nintendolife.com/#article-120886",
          "author": null,
          "description": "It seems a small 't' keeps the takedowns at bay.\nEarlier in the year we shared the announcement of Youtubers Life 2, which either has an unannounced deal with Google to use the YouTube brand or gets away with it courtesy of a non-capitalised 'T'. Either way, the original shifted well over a million copies, showing there's an appetite for the concept of an influencer-sim. The new entry looks like a step-up in terms of scope, and we'll be able to see for ourselves when it launches on 19th October; it'll be priced at $39.99/£34.99.\nIn the new entry you get out of the bedroom and hit the streets of 'NewTube City', and it's very much a 'content creator sim' as you post on various platforms in the quest for likes, subscribers and sweet, sweet sponsorship deals (ok, we may have made the last one up, but it might be in the game). It looks like it could be fun - if the concept appeals to you - as you can explore, complete quests and seemingly get up to all sorts of activities.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/youtubers_life_2_hopes_to_rack_up_the_likes_with_an_october_release",
          "publishedOn": "2021-09-14T13:00:00.000Z",
          "wordCount": 1142,
          "title": "Youtubers Life 2 Hopes To Rack Up The Likes With An October Release"
        },
        {
          "id": "https://www.nintendolife.com/#article-120882",
          "author": null,
          "description": "Games should be available to \"everyone who wants to play them\".\nThe way we play and consume classic video games has become a hot topic of late, thanks largely to some rather shady practices being employed by collectors to boost the value of certain titles.\nWhile some people are keen to increase the value of their collection while it sits on the shelf, those of us who simply want to play and enjoy video games are losing out – because, in a lot of cases, the reason retro games are worth so much is down to the fact that there's literally no other means of playing a certain game other than in its original form.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/unavailability_of_classic_titles_is_holding_game_culture_back_says_platinums_hideki_kamiya",
          "publishedOn": "2021-09-14T12:00:00.000Z",
          "wordCount": 7895,
          "title": "Unavailability Of Classic Titles Is \"Holding Game Culture Back\", Says Platinum's Hideki Kamiya"
        },
        {
          "id": "https://www.nintendolife.com/#article-120891",
          "author": null,
          "description": "Sumo Group is in the process of a major takeover by Tencent.\nIt's been a year with multiple major takeovers in the gaming industry, with Microsoft, EA and Tencent being notable companies investing in acquisitions. Today brings an example of how these acquisitions filter down to small but successful publishers and developers, with Sumo Group confirming an acquisition of Auroch Digital for ' at least £6 million ($8.32 million).'\nAuroch Digital has developed and published some enjoyable titles on Switch in recent years, including The Colonists and Mars Horizon; the latter is a rather detailed and fascinating simulation of the space race. Sumo Group 'considers Auroch's 48 staff a complementary development team to support Secret Mode', which is the group's own publishing division. Nevertheless Auroch will retain its name and continue to be led by company founder Tomas Rawlings.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/sumo_group_acquires_auroch_digital_in_latest_notable_gaming_takeover",
          "publishedOn": "2021-09-14T11:30:00.000Z",
          "wordCount": 870,
          "title": "Sumo Group Acquires Auroch Digital In Latest Notable Gaming Takeover"
        },
        {
          "id": "https://www.nintendolife.com/#article-90877",
          "author": null,
          "description": "As ranked by you lovely people.\n\nIn celebration of the GameCube's 20th anniversary, we're republishing this reader-ranked list of the Top 50 GameCube games ever.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/guides/best-gamecube-games",
          "publishedOn": "2021-09-14T11:00:00.000Z",
          "wordCount": 11762,
          "title": "Guide: Best GameCube Games"
        },
        {
          "id": "https://www.nintendolife.com/#article-120897",
          "author": null,
          "description": "Time is the enemy.\nYou know how it is. One minute you're a youthful, exuberant 20-something, looking forward to being unleashed into the world and making your way; forging new relationships, getting a job, perhaps renting your first home. Your whole life is ahead of you! Then – BOOM – you're suddenly past 40, the last two decades have been a blur and to make matters worse, some crazy person on the internet tells you that the Nintendo GameCube is 20 years old.\nThat can't be right; we still vividly recall reading about the box-like console in magazines and getting unreasonably excited before pre-ordering that gorgeous box of gaming goodness only a few years back! Rogue Leader. Luigi's Mansion. Zelda: Wind Waker! All of those games feel so new, so recent; and now you're telling me this thing is a whole two decades old? That it's old enough to drink, smoke, get married and join the armed forces (in some countries, at least)?\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/anniversary_goodness_me_is_the_gamecube_really_20_years_old",
          "publishedOn": "2021-09-14T10:45:00.000Z",
          "wordCount": 3108,
          "title": "Anniversary: Goodness Me, Is The GameCube Really 20 Years Old?"
        },
        {
          "id": "https://www.nintendolife.com/#article-120888",
          "author": null,
          "description": "No, really.\nBack in 2013, speedrunner DOTA_Teabag was dashing through Super Mario 64's Tick Tock Clock stage when the titular plumber suddenly shot upwards through the floor and ended up on a higher platform.\nThis totally unexpected and previously unseen glitch quickly became the trick other speedrunners wanted to emulate, but despite a $1,000 bounty being offered to anyone who could replicate it, it was never seen again. However, fast-forward to the present day, and pannenkoek12 – the same person who offered the aforementioned cash bounty – has come up with a pretty convincing theory on why it happened, even if it is somewhat \"far-out\". As far-out as space, in fact.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/random_a_rogue_space_particle_could_be_responsible_for_this_unsolved_super_mario_64_speedrun_glitch",
          "publishedOn": "2021-09-14T10:00:00.000Z",
          "wordCount": 2101,
          "title": "Random: A Rogue Space Particle Could Be Responsible For This Unsolved Super Mario 64 Speedrun Glitch"
        },
        {
          "id": "https://www.nintendolife.com/#article-120877",
          "author": null,
          "description": "Update: Nvidia responds to confirm list, states they're 'speculative titles'.\nUpdate:\nNvidia has responded to the leak and confirmed its authenticity, however in a statement provided to wccftech it has made clear that the list is 'speculative' and was used internally. The full statement is below.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/huge_nvidia_database_leak_lists_unannounced_third-party_games",
          "publishedOn": "2021-09-14T09:40:00.000Z",
          "wordCount": 4421,
          "title": "Huge Nvidia Database Leak Lists Unannounced Third-Party Games"
        },
        {
          "id": "https://www.nintendolife.com/#article-120881",
          "author": null,
          "description": "\"He’s working on something, but we can’t say what it is\".\nPlatinumGames' boss Atsushi Inaba has recently been speaking to VGC (alongside Hideki Kamiya) about a wide range of topics – including Star Fox Zero and Bayonetta 3 – and another subject that has cropped up is the current work status of Takahisa Taura, the director of the Switch exclusive Astral Chain.\nKamiya revealed that Taura – who also has games like Madworld, The Wonderful 101, Metal Gear Rising: Revengeance and NieR: Automata on his impressive CV – is indeed working on something new, but the company isn't ready to reveal what it is just yet.\n\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/astral_chains_superstar_director_is_working_on_a_new_unannounced_game",
          "publishedOn": "2021-09-14T09:00:00.000Z",
          "wordCount": 1396,
          "title": "Astral Chain's \"Superstar\" Director Is Working On A New, Unannounced Game"
        },
        {
          "id": "https://www.nintendolife.com/#article-120880",
          "author": null,
          "description": "Come on, get Cruis'n.\nToday marks a very special day for retro arcade racing fans - with the return of the Cruis'n series. Yes, that's right, the latest 2017 arcade entry Cruis'n Blast is now available on the Nintendo Switch.\nIt includes a total of 29 thrilling tracks, up to 23 upgradable vehicles and supports four players on the same console or separate consoles via local wireless play. There's a physical release, too.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/poll_cruisn_blast_is_out_today_on_switch_are_you_getting_it",
          "publishedOn": "2021-09-14T04:30:00.000Z",
          "wordCount": 3843,
          "title": "Poll: Cruis'n Blast Is Out Today On Switch, Are You Getting It?"
        },
        {
          "id": "https://www.nintendolife.com/#article-120878",
          "author": null,
          "description": "Coming to all major platforms.\n\nForever Entertainment - the same company behind remakes of Panzer Dragoon and House of the Dead - has signed an agreement with G-Mode to create a remake of the 1993 Data East beat 'em up Night Slashers for all major platforms.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/forever_entertainment_is_remaking_the_1993_data_east_beat_em_up_night_slashers",
          "publishedOn": "2021-09-14T03:00:00.000Z",
          "wordCount": 1596,
          "title": "Forever Entertainment Is Remaking The 1993 Data East Beat 'Em Up Night Slashers"
        },
        {
          "id": "https://www.nintendolife.com/#article-120872",
          "author": null,
          "description": "A double delay for North America.\n\nIf you've been holding out for the North American physical release of Doki Doki Literature Club Plus! on Nintendo Switch, unfortunately, it's been delayed again.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/doki_doki_literature_club_plus_physical_switch_release_gets_delayed_again",
          "publishedOn": "2021-09-13T23:30:00.000Z",
          "wordCount": 1208,
          "title": "Doki Doki Literature Club Plus! Physical Switch Release Gets Delayed (Again)"
        },
        {
          "id": "https://www.nintendolife.com/#article-120867",
          "author": null,
          "description": "Character fates are in your hands.\nIt's not arriving in time for Halloween, but The Letter: A Horror Visual Novel does a good job at signposting what to expect - it's now confirmed to be coming to Switch eShop in December, while there'll be a run of 2000 physical copies in a Limited Edition, which will be unveiled on 15th September on Play-Asia.\nThe Letter is the work of Yangyang Mobile, the development team behind the rather good Love Esquire. Like that project this new title is definitely a mature game, with the Steam listing (on which it has very positive user reviews) going so far as to give a detailed content warning. For horror fans, though, it may certainly be worth a look.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/the_letter_a_horror_visual_novel_brings_its_scares_to_switch_this_year",
          "publishedOn": "2021-09-13T21:00:00.000Z",
          "wordCount": 980,
          "title": "The Letter: A Horror Visual Novel Brings Its Scares To Switch This Year"
        }
      ]
    },
    {
      "title": "Rock Paper Shotgun Latest Articles Feed",
      "feedUrl": "https://www.rockpapershotgun.com/feed",
      "siteUrl": "https://www.rockpapershotgun.com/feed",
      "articles": [
        {
          "id": "https://www.rockpapershotgun.com/stellaris-31-is-out-and-adds-new-content-to-old-dlc-alongside-many-balance-tweaks",
          "author": "Graham Smith",
          "description": "Scifi grand strategy Stellaris's free 3.1 update, titled \"Lem\", is out now. This is the first update created by \"The Custodians\", a new team formed within developers PDS Green focused on free, quarterly updates which tweak game balance, add new content to old DLC and fix bugs.\r\n\nThe \"Lem\" update does all three, changing how tradition trees work, adding new features to old species packs such as 2016's Planetoids, and rebalancing some Civics and Origins.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/stellaris-31-is-out-and-adds-new-content-to-old-dlc-alongside-many-balance-tweaks",
          "publishedOn": "2021-09-14T22:01:42.000Z",
          "wordCount": 966,
          "title": "Stellaris 3.1 is out and adds new content to old DLC"
        },
        {
          "id": "https://www.rockpapershotgun.com/wds-sn850-1tb-ssd-is-down-to-145-with-a-free-heatsink",
          "author": "Will Judd",
          "description": "The WD Black SN850 is a tremendously fast PCIe 4.0 SSD, capable of hitting some outrageous speeds - up to 7000MB/s reads and 5300MB/s writes. That makes it a great choice for any PC that can handle it (as well as the PS5, which gets external SSD support tomorrow). It's been discounted on Scan to £145 today, where you'll also get a free Akasa NVMe heatsink in the bargain. \nRead more",
          "link": "https://www.rockpapershotgun.com/wds-sn850-1tb-ssd-is-down-to-145-with-a-free-heatsink",
          "publishedOn": "2021-09-14T21:43:56.000Z",
          "wordCount": 968,
          "title": "WD's SN850 1TB SSD is down to £145 with a free heatsink"
        },
        {
          "id": "https://www.rockpapershotgun.com/deep-rock-galactic-now-has-official-mod-support-and-a-mod-that-gives-spiders-beards",
          "author": "Graham Smith",
          "description": "Mods are amazing and can never get enough love, so I'm glad to see that co-operative cave-diving FPS Deep Rock Galactic now has official mod support. It includes mod.io integration for browsing and installing mods, an in-game mod manager, and clearer communication for players joining modded servers, among a lot of other changes.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/deep-rock-galactic-now-has-official-mod-support-and-a-mod-that-gives-spiders-beards",
          "publishedOn": "2021-09-14T21:14:46.000Z",
          "wordCount": 835,
          "title": "Deep Rock Galactic now has official mod support"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-top-rated-dell-s2721dgfa-fast-ips-monitor-is-20-off-today",
          "author": "Will Judd",
          "description": "Dell's S2721DGFA has had a storied history, starting out as a critically acclaimed 27-in gaming monitor that no one could actually buy, to slowly becoming available over the months and finally now to being a great value option in the wake of several big price cuts. \nToday, the S2721DGFA has hit a historic low thanks to a code at the Dell UK site: using the phrase DAE40S at the checkout will knock the price from its usual £329 to just £265.94, a £63 savings and more than £100 cheaper than the same monitor at Amazon. That's an incredible price for one of the best gaming monitors on the planet. \nRead more",
          "link": "https://www.rockpapershotgun.com/the-top-rated-dell-s2721dgfa-fast-ips-monitor-is-20-off-today",
          "publishedOn": "2021-09-14T21:07:35.000Z",
          "wordCount": 1030,
          "title": "The top-rated Dell S2721DGFA Fast IPS monitor is 20% off today"
        },
        {
          "id": "https://www.rockpapershotgun.com/funcom-acquires-the-conan-and-mutant-year-zero-ip",
          "author": "Graham Smith",
          "description": "Funcom have acquired the Cabinet Group, the company which owns the intellectual properties Conan The Barbarian and Mutant Year Zero. Funcom have already developed several Conan games by licensing the IP, including the MMO Age Of Conan and more recently the survival game Conan Exiles. \r\n\nThe announcement also mentioned that a new game is currently in development which will star Conan and \"many of the characters in the Robert E. Howard universe.\"\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/funcom-acquires-the-conan-and-mutant-year-zero-ip",
          "publishedOn": "2021-09-14T20:46:50.000Z",
          "wordCount": 913,
          "title": "Funcom acquires the Conan and Mutant Year Zero IP"
        },
        {
          "id": "https://www.rockpapershotgun.com/cyberpunk-2077s-131-update-is-small-but-has-substantial-fixes",
          "author": "Graham Smith",
          "description": "The latest Cyberpunk 2077 patch is small, but the bugs it fixes aren't. 1.31 addresses issues that only affected some users, but they include issues that would halt progress on critical quests if they happened. The patch is live now.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/cyberpunk-2077s-131-update-is-small-but-has-substantial-fixes",
          "publishedOn": "2021-09-14T20:01:09.000Z",
          "wordCount": 1059,
          "title": "Cyberpunk 2077's 1.31 update is small but has substantial fixes"
        },
        {
          "id": "https://www.rockpapershotgun.com/hopes-for-god-of-war-on-pc-stoked-by-leaked-nvidia-list",
          "author": "Alice O'Connor",
          "description": "Ever since Sony began releasing PlayStation-exclusive games on PC too, many have been clamouring for more of the big'uns: God Of War, Spider-Man, chuffing Bloodborne for god's sake please Bloodborne. While Sony are still being coy about which games are coming our way, hopes were raised by a recent leaked list of games pulled from the digital guts of GeForce Now, which included a mention of God Of War for Steam. I wouldn't get too excited just yet. While Nvidia have confirmed the list itself was real, they say some games on the list were \"speculative\".\nRead more",
          "link": "https://www.rockpapershotgun.com/hopes-for-god-of-war-on-pc-stoked-by-leaked-nvidia-list",
          "publishedOn": "2021-09-14T17:25:11.000Z",
          "wordCount": 957,
          "title": "Hopes for God Of War on PC stoked by leaked Nvidia list"
        },
        {
          "id": "https://www.rockpapershotgun.com/pc-gaming-weekspot-podcast-053-deathloop",
          "author": "Colm Ahern",
          "description": "Yes, we all know the game has a very cool look, and all of us enjoy playing a good time loop game, but what actually is Deathloop? Thankfully, Matthew's played the first few hours and is here to enlighten both you and I.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/pc-gaming-weekspot-podcast-053-deathloop",
          "publishedOn": "2021-09-14T16:00:00.000Z",
          "wordCount": 837,
          "title": "The Weekspot podcast #053: in the loop"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-to-install-an-ssd",
          "author": "James Archer",
          "description": "Welcome to the RPS guide on how to install an SSD, which you’ll note is not titled “How to install an SSD or hard drive”. Yes yes, old-timey mechanical drives are cheaper, and better if you need terrabytes upon terabytes of space, but when you can buy a good-quality NVMe SSD like the WD Blue SN550 at £70 for 1TB…I mean, you should probably do that instead.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/how-to-install-an-ssd",
          "publishedOn": "2021-09-14T15:52:40.000Z",
          "wordCount": 1731,
          "title": "How to install an SSD"
        },
        {
          "id": "https://www.rockpapershotgun.com/met-gala-2021-outfits-remind-me-of-video-game-heroes-and-villains",
          "author": "Kaan Serin",
          "description": "The annual Met Gala event took place last night as some of the world's most famous people gathered to celebrate fashion. This year's theme was \"In America: A Lexicon of Fashion\", which is wildly inaccurate since most of the attendees decided to dress as video game heroes and villains. Fashion brands like Balenciaga and Versace designed outfits that wouldn't be out of place on a JRPG antagonist or in a Platinum game. Let's look at which celebrities decided to take the Paragon route and dress as a hero and who decided to go full Renegade, dressing as a video game boss.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/met-gala-2021-outfits-remind-me-of-video-game-heroes-and-villains",
          "publishedOn": "2021-09-14T15:21:13.000Z",
          "wordCount": 1275,
          "title": "Met Gala 2021 outfits remind me of video game heroes and villains"
        },
        {
          "id": "https://www.rockpapershotgun.com/total-war-warhammer-3-reveals-grand-cathays-army-created-for-the-game",
          "author": "Alice O'Connor",
          "description": "The mysterious army of Grand Cathay have finally been revealed for Total War: Warhammer 3, wearing their Chinese influences plainly. Grand Cathay have existed in the world of Warhammer (Warlore? Lorehammer?) for almost 30 years but not fielded a full plastic army, so one had to be created for Creative Assembly's fantasy strategy game. Led by dragons in human form, they field forces including Jade Warriors, towering Terracotta Sentinels, and the Celestial Dragon Guard. Come meet 'em in the new trailer below.\nRead more",
          "link": "https://www.rockpapershotgun.com/total-war-warhammer-3-reveals-grand-cathays-army-created-for-the-game",
          "publishedOn": "2021-09-14T14:07:05.000Z",
          "wordCount": 909,
          "title": "Total War: Warhammer 3 reveals Grand Cathay's army, created for the game"
        },
        {
          "id": "https://www.rockpapershotgun.com/dying-light-2-delayed-again-shambling-into-february-2022",
          "author": "Alice O'Connor",
          "description": "Parkour enthusiasts will need to wait two months longer to prance around an open-world city full of zombies (and zombies-to-be), because Dying Light 2 has been delayed again. Previously due December 7th, and spring 2020 before that, Dying Light 2 is now scheduled to launch on February 4th, 2022. The developers, Techland say they need extra time to make it good, yeah?\nRead more",
          "link": "https://www.rockpapershotgun.com/dying-light-2-delayed-again-shambling-into-february-2022",
          "publishedOn": "2021-09-14T13:17:55.000Z",
          "wordCount": 765,
          "title": "Dying Light 2 delayed again, shambling into February 2022"
        },
        {
          "id": "https://www.rockpapershotgun.com/come-and-gawp-at-clash-artifacts-of-chaos-gorgeous-sketchy-planet-in-this-new-dev-diary",
          "author": "Katharine Castle",
          "description": "The first-person brawler Zeno Clash games have been long-time favourites here at RPS, and when Chilean developers ACE Team announced they were making a new game set in their weird and wonderful Clash universe back in July, we were over the moon. Admittedly, Clash: Artifact Of Chaos' reveal trailer left a lot of unanswered questions at the time, but the good news is that we've got an early sneak peak at a new developer diary that tells us all about the game's story and what to expect when it eventually releases next year.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/come-and-gawp-at-clash-artifacts-of-chaos-gorgeous-sketchy-planet-in-this-new-dev-diary",
          "publishedOn": "2021-09-14T13:15:17.000Z",
          "wordCount": 962,
          "title": "Come and gawp at Clash: Artifacts Of Chaos' gorgeous, sketchy planet in this new dev diary"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-slabs-abilities",
          "author": "Rebecca Jones",
          "description": "Wondering how to collect and fully upgrade all the slabs in Deathloop? Slab abilities are the paranormal powers in Deathloop, the game's take on Dishonored's Void Powers and Prey's Neuromods. When playing as Colt or Julianna there are five of these slabs to pick up, as well as several levels of upgrades for each.\nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-slabs-abilities",
          "publishedOn": "2021-09-14T13:14:28.000Z",
          "wordCount": 2484,
          "title": "Deathloop slabs and abilities: how to obtain and fully upgrade all paranormal powers in Deathloop"
        },
        {
          "id": "https://www.rockpapershotgun.com/eastward-review",
          "author": "Katharine Castle",
          "description": "Wrangling flying pigs, saving a nerdy kid from the school bullies, cooking up exquisite dishes to appease a local casino boss whose slot machines you accidentally rinsed with your trusted lucky coin... These are the stories most adventure RPGs would stuff into their ever-growing sidequest menus - distractions meant to provide extra flavour to the world you're meant to be saving, or which hold bountiful supplies of EXP to level up your skills and weapons. Not so in Eastward.\nIn this impressive debut from Shanghai developers Pixpil, these humdrum slices of life are placed front and centre, forming much of the narrative backbone that drives the game forward. This is still a game that's ultimately about saving the world from a mysterious and all-consuming miasma, but it's also one that makes damn sure you know what you're doing it all for - and that's its striking cast of NPCs. As you busy yourself with the minutiae of their everyday lives, Eastward makes every person (and robot) count in this deadly post-apocalypse, and the result is an affecting, detail-rich tale that owes as much to the action of top-down Zelda games as it does to the role-playing intimacy of Earthbound. \nRead more",
          "link": "https://www.rockpapershotgun.com/eastward-review",
          "publishedOn": "2021-09-14T13:00:00.000Z",
          "wordCount": 2084,
          "title": "Eastward review: a stunning, but slow burning post-apocalypse adventure"
        },
        {
          "id": "https://www.rockpapershotgun.com/diablo-2-remaster-cutscenes-look-like-how-i-remember-the-originals",
          "author": "Alice O'Connor",
          "description": "I appreciate when a remaster of an old game looks like my memories of the original, a rose-tinted vision which would crumble if I looked at even one screenshot. Blizzard and Vicarious Visions have managed that with Diablo 2: Resurrected, from what I've seen, and a new trailer focuses on the redone cutscenes. And yeah, this is how I remember D2 cutscenes looking? They were dead fancy and high-tech, yeah? Must have looked like this?\nRead more",
          "link": "https://www.rockpapershotgun.com/diablo-2-remaster-cutscenes-look-like-how-i-remember-the-originals",
          "publishedOn": "2021-09-14T11:19:25.000Z",
          "wordCount": 858,
          "title": "Diablo 2 remaster cutscenes look like how I remember the originals"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-worlds-open-beta-hasnt-convinced-me-to-drop-final-fantasy-xiv",
          "author": "Ed Thorn",
          "description": "The last time I got some brief hands-on time with Amazon's upcoming MMO New World, I emerged from Aeternum feeling pretty positive about this new kid on the massively multiplayer block. Crafting, in particular, had me pretty excited. But having spent a big chunk of time in its open beta, I've come away feeling a bit, I don't know, bleh? If anything, I just wanted to go back to my beloved Final Fantasy XIV.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-worlds-open-beta-hasnt-convinced-me-to-drop-final-fantasy-xiv",
          "publishedOn": "2021-09-14T11:00:00.000Z",
          "wordCount": 1515,
          "title": "New World's open beta hasn't convinced me to drop Final Fantasy XIV"
        },
        {
          "id": "https://www.rockpapershotgun.com/apex-legends-will-keep-tap-strafing-at-least-for-now",
          "author": "Imogen Beckhelling",
          "description": "A couple of weeks ago, Respawn Entertainment said they were going to get rid of tap-strafing in Apex Legends, but now it seems they've changed their minds. Tap-strafing is a movement exploit that allows players to keep their momentum after slide-jumping, letting them make speedier turns than they should. Unfortunately for Respawn, they say getting rid of this tech has some \"unexpected side effects\", so tap-strafing gets to stay in the game, for now.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/apex-legends-will-keep-tap-strafing-at-least-for-now",
          "publishedOn": "2021-09-14T10:11:52.000Z",
          "wordCount": 966,
          "title": "Apex Legends will keep tap-strafing, at least for now"
        },
        {
          "id": "https://www.rockpapershotgun.com/amd-radeon-software-update-simplifies-overclocking-brings-smart-access-memory-to-older-gpus",
          "author": "James Archer",
          "description": "AMD have launched a big update for their Radeon Software app and Adrenalin drivers, unlocking a clutch of potentially frame rate-boosting features for those with recent AMD graphics cards and CPUs. The new version, 21.9.1, also includes a Windows 11 driver that gets Radeon Boost, Radeon Anti-Lag and Radeon Image Sharpening ready for Microsoft’s next big OS launch.\r\n\n\n\r\nIn the meantime, those with both a Ryzen 5000 series CPU and a Radeon RX 6000 series graphics card – those lucky enough to have found one in stock, I should say –  can take advantage of Radeon Software 21.9.1’s updated overclocking feature. In previous versions, it was possible to instantly overclock your graphics card with a single click; now you can do the same with both the GPU and CPU at once. Provided they’re from these specific product lines, mind.\r\n \nRead more",
          "link": "https://www.rockpapershotgun.com/amd-radeon-software-update-simplifies-overclocking-brings-smart-access-memory-to-older-gpus",
          "publishedOn": "2021-09-14T10:05:49.000Z",
          "wordCount": 1045,
          "title": "AMD Radeon Software update simplifies overclocking, brings Smart Access Memory to older GPUs"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-is-out-now-but-some-pc-players-report-stuttering",
          "author": "Alice O'Connor",
          "description": "Dishonored and Prey devs Arkane have released their latest superpowered sneak-o-shooter, the time-looping Deathloop. It's good, everyone tells me. However, one word of warning: a fair number of PC players are complaining about stuttering framerates, enough to bring it down to a 'Mixed' review rating on Steam. That's the sort of wonky time you don't want. If you want your initial loop o' death to be as slick as blood, maybe wait a bit in the hope of a fix?\nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-is-out-now-but-some-pc-players-report-stuttering",
          "publishedOn": "2021-09-14T09:46:23.000Z",
          "wordCount": 959,
          "title": "Deathloop is out now, but some PC players report stuttering"
        },
        {
          "id": "https://www.rockpapershotgun.com/craftopia-the-everything-game-is-on-xbox-game-pass-now",
          "author": "Graham Smith",
          "description": "The description under the latest trailer for Craftopia explains that its developers \"combined many features we find enjoyable, such as hunting, farming, hack-and-slash, building, [and] automation\" in making the game. It does not explain whether catching giraffes in Pokéball-like traps counts as \"hunting\", or whether blasting cows into space with a baseball bat is \"hack-and-slash.\"\r\n\nCraftopia remains every game that has ever existed, from Zelda to Factorio, just as it was last year - only now it's available via Xbox Game Pass.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/craftopia-the-everything-game-is-on-xbox-game-pass-now",
          "publishedOn": "2021-09-13T22:38:11.000Z",
          "wordCount": 787,
          "title": "Craftopia, the everything game, is on Xbox Game Pass now"
        },
        {
          "id": "https://www.rockpapershotgun.com/darkest-dungeon-2-will-launch-in-early-access-on-october-26th",
          "author": "Graham Smith",
          "description": "Darkest Dungeon 2 will launch in early access via the Epic Games Store on October 26th. Developers Red Hook announced the date via Twitter earlier today, after first announcing a 2021 release date in October of last year.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/darkest-dungeon-2-will-launch-in-early-access-on-october-26th",
          "publishedOn": "2021-09-13T21:39:53.000Z",
          "wordCount": 770,
          "title": "Darkest Dungeon 2 will launch in early access on October 26th"
        },
        {
          "id": "https://www.rockpapershotgun.com/twitch-are-suing-two-users-for-leading-hate-raids",
          "author": "Graham Smith",
          "description": "Twitch, the livestreaming platform, are suing two users for allegedly organising \"hate raids\" against streamers. According to the complaint, these users began in August 2021 to \"attack these streamers by flooding their chats with bot-powered Twitch accounts that spew racist, sexist, and homophobic language and content\" in violation of the Twitch terms of service.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/twitch-are-suing-two-users-for-leading-hate-raids",
          "publishedOn": "2021-09-13T21:01:02.000Z",
          "wordCount": 885,
          "title": "Twitch are suing two users for leading \"hate raids\""
        },
        {
          "id": "https://www.rockpapershotgun.com/the-winner-of-the-us-open-did-the-best-fifa-celebration",
          "author": "Graham Smith",
          "description": "The winner of the men's US Open tennis final called me a legend yesterday during post-match interviews. Daniil Medvedev was explaining the strange celebration he did immediately after his victory. \"Only legends will understand what I did after the match is 'L2 + Left'.\"\r\n\nAnd I did understand. L2 + Left is the best celebration from the FIFA series.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-winner-of-the-us-open-did-the-best-fifa-celebration",
          "publishedOn": "2021-09-13T20:16:40.000Z",
          "wordCount": 815,
          "title": "The winner of the US Open did the best FIFA celebration"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-samsung-980-pro-pcie-40-1tb-ssd-is-36-off-today",
          "author": "Will Judd",
          "description": "The Samsung 980 Pro SSD is one of the very fastest drives on the market, thanks to its PCIe 4.0 connection and 7000MB/s flash memory, and today it's been heavily discounted... on Amazon Germany. I know what you're thinking, but with a bare minimum of effort you can get the 1TB drive for £136, way below the current UK price of £172. Here's how it works. \nRead more",
          "link": "https://www.rockpapershotgun.com/the-samsung-980-pro-pcie-40-1tb-ssd-is-36-off-today",
          "publishedOn": "2021-09-13T18:40:53.000Z",
          "wordCount": 963,
          "title": "The Samsung 980 Pro PCIe 4.0 1TB SSD is £36 off today"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-nvidia-rtx-3080-ti-graphics-card-is-shockingly-available-to-purchase-in-the-uk",
          "author": "Will Judd",
          "description": "The Nvidia RTX 3080 Ti is currently available for purchase at its recommended retail price, a headline that would have ludicrous to write a few years ago but now constitutes major news. Scan in the UK have stock of the high-end card at its £1049 RRP, stock that has seemingly persisted for a few hours - one of only a handful of times that an Nvidia RTX graphics card at RRP hasn't sold out immediately. If you're building a high-end rig, I'd say this is a great option - as long as you can't find an RTX 3080, at least. \nRead more",
          "link": "https://www.rockpapershotgun.com/the-nvidia-rtx-3080-ti-graphics-card-is-shockingly-available-to-purchase-in-the-uk",
          "publishedOn": "2021-09-13T18:06:20.000Z",
          "wordCount": 948,
          "title": "The Nvidia RTX 3080 Ti graphics card is shockingly available to purchase in the UK"
        },
        {
          "id": "https://www.rockpapershotgun.com/paradox-ceo-admits-inappropriate-behaviour-towards-employee-in-2018",
          "author": "Alice O'Connor",
          "description": "Fredrik Wester, the CEO of Paradox Interactive, has publicly expressed regret for \"inappropriate behaviour\" towards an employee at a company event in 2018. This comes shortly after someone leaked the results of a union survey which revealed many employees felt they'd been mistreated at the company behind games including Crusader Kings and Hearts Of Iron. \"Accountability starts from the top,\" said Wester.\nRead more",
          "link": "https://www.rockpapershotgun.com/paradox-ceo-admits-inappropriate-behaviour-towards-employee-in-2018",
          "publishedOn": "2021-09-13T17:08:49.000Z",
          "wordCount": 915,
          "title": "Paradox CEO admits \"inappropriate behaviour\" towards employee in 2018"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-pc-performance-best-settings",
          "author": "James Archer",
          "description": "If you’ve read Brendan’s Deathloop review, you’ll know Arkane Lyon’s latest is a frequently hilarious time-loop shooter that’s worth getting trapped in. And if you’ve seen its official PC system requirements, you’ll also know it makes some big asks of your hardware. At least, in theory. After a few hours of testing it appears the minimum requirements aren’t quite so minimum, and it’s possible to get slick frame rates in Deathloop even on older graphics hardware – especially if you make a few choice settings adjustments. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-pc-performance-best-settings",
          "publishedOn": "2021-09-13T15:51:17.000Z",
          "wordCount": 2717,
          "title": "Deathloop: PC performance guide and the best settings to use"
        },
        {
          "id": "https://www.rockpapershotgun.com/total-war-warhammer-3-delayed-into-2022",
          "author": "Alice O'Connor",
          "description": "Alright, someone has to apologise to the neighbours and round up the dogs of war, because Total War: Warhammer 3 has been delayed. Previously expected late this year, the trilogy-concluding strategy game based on Games Workshop's fantasy plastic world is now due in 2022. The developers, Creative Assembly say they want to make sure it's good, yeah?\nRead more",
          "link": "https://www.rockpapershotgun.com/total-war-warhammer-3-delayed-into-2022",
          "publishedOn": "2021-09-13T15:43:11.000Z",
          "wordCount": 807,
          "title": "Total War: Warhammer 3 delayed into 2022"
        },
        {
          "id": "https://www.rockpapershotgun.com/epic-games-appealing-the-apple-app-store-battle-ruling",
          "author": "Alice O'Connor",
          "description": "Though a judge largely ruled against Epic Games on Friday in their App Store legal battle with Apple sparked by Fortnite in-app purchases on iOS, clearly that wouldn't be the end. It isn't. On Sunday, Epic filed a notice that yes, they're appealing the ruling. At this point they haven't said precisely what they object to and why but, y'know, they want it to go their way.\nRead more",
          "link": "https://www.rockpapershotgun.com/epic-games-appealing-the-apple-app-store-battle-ruling",
          "publishedOn": "2021-09-13T15:03:50.000Z",
          "wordCount": 888,
          "title": "Epic Games appealing the Apple app store battle ruling"
        },
        {
          "id": "https://www.rockpapershotgun.com/things-left-on-my-office-desk-after-18-months-of-working-from-home",
          "author": "Alice Bell",
          "description": "Apparently I am one of about six people in the entire world who hates working from home. I can't do it. At home I am lazy, unproductive, and I accidentally do hours of overtime despite this, because I have no place where work ends and home begins. In March 2020, we were all officially sent home for a temporary office closure, the definition of \"temporary\" soon being stretched as far as I allow my credulity to when I watch The Prestige. It's magical! David Bowie makes thousands of hats!\nAnyway, at the tail end of last week I returned to the office, which it turns out is still almost entirely empty. It's like working from home except I have to wear trousers (also Graham is here too so I can kick his chair and throw stuff at him). I spent a few hours on the first day creeping about looking at everything that had been left here for 18 months, and concluded that if our office were a level in a post-apocalyptic game, or a scene in 28 Days later, it would be pretty embarrassing.\nRead more",
          "link": "https://www.rockpapershotgun.com/things-left-on-my-office-desk-after-18-months-of-working-from-home",
          "publishedOn": "2021-09-13T15:00:12.000Z",
          "wordCount": 796,
          "title": "Things left on my office desk after 18 months of working from home"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-among-us-mods",
          "author": "Craig Pearson",
          "description": "Among Us made a hit out of some very basic minigames and complex social interaction. Surviving against the Imposters as they stab and lie their way through a game might rely more on the players than on the game, but you can craft a more complex base game with a few mod additions - the best of which we've rounded up right here. While you can’t mod your friends, you can mod the game, building on the anxiety-ridden camaraderie crusher by adding new roles and new modes to the basic format. Below, you’ll find out how to fall in love or enact the rule of law (by killing) with our guide to the best Among Us mods. \nRead more",
          "link": "https://www.rockpapershotgun.com/best-among-us-mods",
          "publishedOn": "2021-09-13T14:00:00.000Z",
          "wordCount": 2004,
          "title": "Best Among Us mods"
        },
        {
          "id": "https://www.rockpapershotgun.com/toem-review",
          "author": "Alice Bell",
          "description": "Remember that brief period in the 00s where everyone had a mobile phone, but none of them could take decent photos, so at least one girl per friendship group also had to have a small digital camera? Laboriously uploading and tagging. These are the photos that come up on your Facebook Memories, reminding you that for a brief period during your final year of school you started wearing 50s-ish neck scarves, for some reason. \nThe little black-and-white puzzle adventure game Toem, in which all problems are solved with a camera, reminds me of that. Not because you are able to make disasterous or whimisical fashion choices - you very much are, mostly in the hat department - but because you just take photos of everything, for the fun of it, to remember this thing you saw. Wonky-focused snaps of a flower, or a ladybird, or a nice building (poorly framed because you can't get all of it in shot). This isn't really photography for the camera nerds interested in lenses or different exposures. This is photography as a joyful insta-record of your life. I was here, I did this thing, it was good.\nRead more",
          "link": "https://www.rockpapershotgun.com/toem-review",
          "publishedOn": "2021-09-13T13:00:00.000Z",
          "wordCount": 1402,
          "title": "Toem review: a modern, yet nostalgic photography adventure"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-review",
          "author": "Brendan Caldwell",
          "description": "William Blake once wrote: \"Hold Infinity in the palm of your hand, and Eternity in an hour.\" Shut up, Blake. This is Deathloop. It is a full-blown action-comedy with a double jump. You get a sideways dash and a gun that splits to become two, smaller guns. If I see anyone trying to be too smart about this game, in which a time-looping assassin tries to break free of hilarious eternity by murdering many people who deserve it, I will look at them with hollow eyes and say: \"In Deathloop you regularly snap necks by 270 degrees.\" Turn away, poets and stealth likers. This is not your daddy's Dishonored.\nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-review",
          "publishedOn": "2021-09-13T12:01:00.000Z",
          "wordCount": 2455,
          "title": "Deathloop review: this is not your daddy's Dishonored"
        },
        {
          "id": "https://www.rockpapershotgun.com/destiny-2s-revamped-trials-of-osiris-is-great-and-hugely-popular",
          "author": "Alice O'Connor",
          "description": "When Bungie announced last year that they were reviving Destiny 2's serious PvP weekend event mode, Trials, they said \"It's important that this doesn't go out half-baked.\" Reader dear, it went out half-baked. But! Seventeen months and one revamp later, Trials Of Osiris is good now. Really good. With generous new reward systems, the option to queue solo, and a few anti-cheater measures, the return of Trials this weekend has seen a huge surge in player numbers and been, like, actually fun.\nRead more",
          "link": "https://www.rockpapershotgun.com/destiny-2s-revamped-trials-of-osiris-is-great-and-hugely-popular",
          "publishedOn": "2021-09-13T11:37:13.000Z",
          "wordCount": 1403,
          "title": "Destiny 2's revamped Trials Of Osiris is great, and hugely popular"
        },
        {
          "id": "https://www.rockpapershotgun.com/oxenfree-2s-villains-are-sending-spooky-signals-to-the-original-game",
          "author": "Imogen Beckhelling",
          "description": "The makers of Oxenfree have started teasing the upcoming sequel via audio transmissions in the original game. Oxenfree 2: Lost Signals is set to arrive sometime next year, and it'll feature villains who're causing mysterious radio signals that mess with electronics. But it seems they're already up to no good, because an update to the original Oxenfree has introduced these spooky transmissions, which you can hear in several different areas in the supernatural thriller. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/oxenfree-2s-villains-are-sending-spooky-signals-to-the-original-game",
          "publishedOn": "2021-09-13T11:31:03.000Z",
          "wordCount": 938,
          "title": "Oxenfree 2's villains are sending spooky signals to the original game"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-to-fish-in-genshin-impact",
          "author": "Amelia Zollner",
          "description": "Looking to learn how to fish in Genshin Impact? Genshin Impact’s 2.1 update is finally here, and it introduces an entirely new mechanic that will gives you something else to procrastinate searching for your missing sibling with: fishing! Before you can become Teyvat’s most accomplished angler, though, you’ll need to complete a short quest and become familiar with the fishing mechanic. Here’s everything you’ll need to know about fishing in Genshin Impact.\nRead more",
          "link": "https://www.rockpapershotgun.com/how-to-fish-in-genshin-impact",
          "publishedOn": "2021-09-13T11:00:55.000Z",
          "wordCount": 2374,
          "title": "How to fish in Genshin Impact"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-sunday-papers-610",
          "author": "Ed Thorn",
          "description": "Sundays are for staring at Mr Muscle, debating for a second whether you could take him, then coming to the conclusion that you absolutely couldn't. Before you consider things, let's read this week's best writing about games.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-sunday-papers-610",
          "publishedOn": "2021-09-12T10:00:00.000Z",
          "wordCount": 1390,
          "title": "The Sunday Papers"
        },
        {
          "id": "https://www.rockpapershotgun.com/star-dynasties-aka-crusader-kings-in-space-is-out-now",
          "author": "Graham Smith",
          "description": "It's always been a surprise that more games haven't followed in the footsteps of Crusader Kings, but Star Dynasties looks to give it a go. It's a space strategy game about growing your space empire, getting space married, and having space affairs. It left early access at the beginning of the month.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/star-dynasties-aka-crusader-kings-in-space-is-out-now",
          "publishedOn": "2021-09-11T20:47:36.000Z",
          "wordCount": 785,
          "title": "Star Dynasties aka 'Crusader Kings in space' is out now"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-eternal-cylinder-will-roll-onto-hard-drives-on-september-30th",
          "author": "Graham Smith",
          "description": "The Eternal Cylinder was first shown as a prototype six years ago. Back then, Adam described it as \"Billy Hatcher and the Giant Egg by way of Philip José Farmer, Icepick Lodge and Hieronymus Bosch, all set in the shadow of a hungry horizon.\" The prototype was a personal project of ACE Team co-founder Carlos Bordeu, who said that he wasn't yet sure what you would do in the game moment to moment.\r\n\nNow the game is reaching the end of its journey. ACE Team have announced you'll be able to flee the planetary rolling pin on September 30th.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-eternal-cylinder-will-roll-onto-hard-drives-on-september-30th",
          "publishedOn": "2021-09-11T19:02:31.000Z",
          "wordCount": 776,
          "title": "The Eternal Cylinder will roll onto hard drives on September 30th"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-epic-vs-apple-court-has-a-great-definition-of-video-games",
          "author": "Graham Smith",
          "description": "Epic's court case against Apple reached a conclusion yesterday, at least temporarily, but the judge's ruling didn't only address the big issues of app stores and payment systems. Judge Yvonne Gonzalez also offered an answer to a question raised during the trial: what is a game? Most surprisingly, Gonzalez's definition is pretty great.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-epic-vs-apple-court-has-a-great-definition-of-video-games",
          "publishedOn": "2021-09-11T18:34:34.000Z",
          "wordCount": 1005,
          "title": "The Epic vs. Apple court has a great definition of video games"
        },
        {
          "id": "https://www.rockpapershotgun.com/epic-vs-apple-us-court-rules-apple-must-allow-third-party-payment-systems",
          "author": "Graham Smith",
          "description": "iOS app developers must be allowed to direct users towards payment options other than those provided by Apple, a US judge has ruled in the Epic v. Apple case. Apple have 90 days, until December 9th, to comply. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/epic-vs-apple-us-court-rules-apple-must-allow-third-party-payment-systems",
          "publishedOn": "2021-09-11T17:27:40.000Z",
          "wordCount": 1178,
          "title": "Epic vs. Apple: US court rules Apple must allow third-party payment systems"
        },
        {
          "id": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-161",
          "author": "Alice Bell",
          "description": "I thought the air would be cleared by the tremendous thunderstorm that rattled my windows this week, but no. We are still all muggy. This is the worst of between times, where it is not quite warm enough to go without a hoody or a light cardigan, but definitely not cool enough that your t-shirt doesn't get stuck to both your back and your rucksack because of the sweat. Even though the rucksack said it had a special 'moisture wicking' bit of material on it to avoid this situation. WELL! I shall just cast my rucksack down this weekend and play games instead.\nRead more",
          "link": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-161",
          "publishedOn": "2021-09-11T08:00:00.000Z",
          "wordCount": 990,
          "title": "What are we all playing this weekend?"
        },
        {
          "id": "https://www.rockpapershotgun.com/rainbow-six-extractions-latest-trailer-shows-more-gadgets-and-operators",
          "author": "Graham Smith",
          "description": "I loved the wall-busting, door-blocking, remote-camera-ing gadgets that Rainbow Six Siege gave players, but the community quickly outpaced my ability to compete with them. That's why I'm looking forward to Tom Clancy's Rainbow Six Extraction. It broadly gives you the same toys, but you're using them against AI-controlled alien mutants. I'm traditionally alright at competing with those.\r\n\nThere was a new trailer showing the gadgets and operators in action during last night's PlayStation event, and you'll find it below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/rainbow-six-extractions-latest-trailer-shows-more-gadgets-and-operators",
          "publishedOn": "2021-09-10T20:22:55.000Z",
          "wordCount": 730,
          "title": "Rainbow Six Extraction's latest trailer shows more gadgets and operators"
        },
        {
          "id": "https://www.rockpapershotgun.com/what-videogame-would-you-like-to-look-at-outside-your-window",
          "author": "Graham Smith",
          "description": "'Frasier looking at video games' is the latest single-purpose Twitter account spreading across the games industry. Each tweet features the same still from the sitcom Frasier featuring Frasier Crane looking out his apartment windows, but in each the Seattle skyline has been replaced by a different videogame landscape.\r\n\nSo I ask you, if you were Frasier Crane, what videogame would you like to gaze upon from your fabulously expensive apartment?\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/what-videogame-would-you-like-to-look-at-outside-your-window",
          "publishedOn": "2021-09-10T19:27:30.000Z",
          "wordCount": 776,
          "title": "What videogame would you like to look at outside your window?"
        },
        {
          "id": "https://www.rockpapershotgun.com/konami-have-released-some-lofi-remixes-to-chillstudy-to",
          "author": "Graham Smith",
          "description": "It's the 35th anniversary of the Konami code, the string of button presses that first activated cheats in Gradius on the NES in 1986, but which would feature in many later Konami games as well. To celebrate the birthday of up up down down left right left right BA, Konami have produced some lofi hip hop to chill, study and/or relax to.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/konami-have-released-some-lofi-remixes-to-chillstudy-to",
          "publishedOn": "2021-09-10T18:49:09.000Z",
          "wordCount": 738,
          "title": "Konami have released some lofi remixes to chill/study to"
        },
        {
          "id": "https://www.rockpapershotgun.com/forza-horizon-5s-confirmed-car-list-is-enormous",
          "author": "Graham Smith",
          "description": "I don't know my carburetor from my timing belt drive pulley, so much so that I had to Google \"car engine parts\" in order to find a second reference for this sentence. The Forza Horizon series mostly operates on my wavelength, letting me be excited by cars because they're shiny and have smooth lines and go fast, without me needing to know their innards.\r\n\nThe list of cars so far confirmed for Forza Horizon 5 might mean different things to you than it does to me, then. To me it means that the Jaguar XJ220 I had as a toy when I was 8 is in there, but maybe you have opinions about different kinds of Land Rover.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/forza-horizon-5s-confirmed-car-list-is-enormous",
          "publishedOn": "2021-09-10T18:23:10.000Z",
          "wordCount": 796,
          "title": "Forza Horizon 5 sure has a lot of cars"
        },
        {
          "id": "https://www.rockpapershotgun.com/of-all-the-retro-final-fantasy-games-you-should-definitely-make-time-for-ff4",
          "author": "Katharine Castle",
          "description": "I came to Final Fantasy IV (or II, if you're American) pretty late in the day. At the time, back in the mists of 1991, it was never actually released in the UK. I was also just three-years-old then, but that's besides the point. Instead, we had to wait another decade until it got a proper UK release, where it landed on the original PlayStation in 2002. However, because I was young and naive and far too wrapped up playing Final Fantasies VII-IX at that point, it never even occurred to me to look back down the Roman numeral line and pick it up. Heck, I even missed its appearance on the GBA in 2006 - arguably the last 'best' version of this early 90s classic. It wasn't until the 3D Remake arrived on the Nintendo DS in 2008 that I finally sat up and took notice - a whole 17 years after it first came out. \nBut cor, I'm glad I did, because Final Fantasy IV is still arguably one of the best Final Fantasy games ever made, and is easily the best (or second best, depending on who you ask) of the older retro ones. If there's one Final Fantasy game you make time for over the next few months, make it FFIV. \nRead more",
          "link": "https://www.rockpapershotgun.com/of-all-the-retro-final-fantasy-games-you-should-definitely-make-time-for-ff4",
          "publishedOn": "2021-09-10T18:04:25.000Z",
          "wordCount": 900,
          "title": "Of all the retro Final Fantasy games, you should definitely make time for FF4"
        },
        {
          "id": "https://www.rockpapershotgun.com/tfi-friday-3-new-indie-games-for-back-to-school-season",
          "author": "Alice Bell",
          "description": "The past week or so has been Back To School time in the UK, also known as the season of adverts on TV about protractors and pencil cases, and posts on Facebook showing a six-year-old standing by a front door and wearing their new school uniform. A dance as old as time. I remember getting a blue jumper that was two sizes too big for me so I could grow into it. Remember it like it was yesterday.\nBut enough about school itself, a time in my life that I hated to an extraordinary extent and shudder to think of even now. We move to happier things, i.e. games, and in particular the assumption I'm making that now your kids are out of the house for most of the day, you'll have more time to play games. Here are three new indie games that came out in the last month or so, that I feel are apposite for a back-to-school theme.\nRead more",
          "link": "https://www.rockpapershotgun.com/tfi-friday-3-new-indie-games-for-back-to-school-season",
          "publishedOn": "2021-09-10T15:11:55.000Z",
          "wordCount": 1646,
          "title": "TFI Friday: 3 new indie games for back-to-school season"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-baddies-in-ghostwire-tokyos-new-trailer-look-like-buffys-the-gentlemen",
          "author": "Imogen Beckhelling",
          "description": "It must be a typical human fear to not like things with deathly pale faces, shadowy eyes, and suits. I know I'm certainly not a fan, but this specific type of villain has a habit of showing up in spooky games, films and TV series. Last night, paranormal action-RPG Ghostwire: Tokyo got a new trailer as part of the PlayStation showcase stream, and it's chock-full of these baddies that look an awful lot like the Gentlemen from Buffy The Vampire Slayer.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-baddies-in-ghostwire-tokyos-new-trailer-look-like-buffys-the-gentlemen",
          "publishedOn": "2021-09-10T14:43:52.000Z",
          "wordCount": 813,
          "title": "The baddies in Ghostwire Tokyo's new trailer look like Buffy's The Gentlemen"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-to-use-a-ps5-dualsense-controller-on-pc",
          "author": "James Archer",
          "description": "Sony’s DualSense pad is a lovely bit of peripheral design; it’s a shame, then, that figuring out how to use the PS5 controller on PC is a right old pain in the thumbstick. Without the Microsoft-masterminded, plug-and-play sensibilities of Xbox controllers, the PS5 controller often needs some help to get working on a Windows machine. It’s all doable, though, and this here guide will walk you through the setup process as well as how to get the most out of different games.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/how-to-use-a-ps5-dualsense-controller-on-pc",
          "publishedOn": "2021-09-10T14:40:08.000Z",
          "wordCount": 2152,
          "title": "How to use a PS5 DualSense controller on PC"
        },
        {
          "id": "https://www.rockpapershotgun.com/you-should-play-axis-football-2021-in-coach-mode",
          "author": "Sin Vega",
          "description": "The sport of Americaball was about the last thing I was expecting to enjoy in 2019. Since then, I've skipped an entry but come back for Axis Football 2021 and found myself impressed despite having higher standards now.\nIt may have taken a long iterative route, but this is becoming a strong sport series even if you're not a fan of pooting the old dogskin.\nRead more",
          "link": "https://www.rockpapershotgun.com/you-should-play-axis-football-2021-in-coach-mode",
          "publishedOn": "2021-09-10T14:30:00.000Z",
          "wordCount": 662,
          "title": "You should play Axis Football 2021 in coach mode"
        },
        {
          "id": "https://www.rockpapershotgun.com/tchia-had-the-best-trailer-in-the-playstation-showcase",
          "author": "Kaan Serin",
          "description": "Previously announced at The Game Awards 2020, cute adventure game Tchia received a brand-new trailer at last night’s PlayStation livestream and it looked gorgeous.\nTchia is an open world game set in a fictional series of islands, inspired by New Caledonia - a collection of islands that are in the Pacific but remain a French-administered territory. Our latest glimpse at Tchia was light on new details about the game but it still gave us updated looks at the vibrant environments, modes of traversal and cast of characters. Take a look at the trailer below. \nRead more",
          "link": "https://www.rockpapershotgun.com/tchia-had-the-best-trailer-in-the-playstation-showcase",
          "publishedOn": "2021-09-10T14:28:59.000Z",
          "wordCount": 956,
          "title": "Tchia had the best trailer in the PlayStation Showcase"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-looks-as-vibrant-and-murderous-as-ever-in-its-new-story-trailer",
          "author": "Imogen Beckhelling",
          "description": "In just four days Arkane's new time-looping stealth 'em up Deathloop will be part of our lives, and last night the devs treated us to a new trailer telling us a few titbits about the game's story. Of course, like most of the other trailers, it's also full of sneaking, cool powers, lotsa guns, and excellent fashion. It's almost like we're stuck in a timeloop ourselves, watching main character Colt slay his way through semi-familiar areas in new ways. I can't get enough of it.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-looks-as-vibrant-and-murderous-as-ever-in-its-new-story-trailer",
          "publishedOn": "2021-09-10T12:46:21.000Z",
          "wordCount": 919,
          "title": "Deathloop looks as vibrant and murderous as ever in its new story trailer"
        },
        {
          "id": "https://www.rockpapershotgun.com/wartales-is-a-tactical-rpg-that-wont-bog-you-down-with-quests-you-never-wanted-to-do-in-the-first-place",
          "author": "Imogen Beckhelling",
          "description": "I didn't realise how annoying I found main quests in RPGs until I played a game that didn't force one on me. That game is Wartales, an upcoming tactical open world game from the developers of Northgard, Shiro Games. It plonks you into a fairly mundane medieval world - in the sense that there' are no wizards's no magic, elves, or grand drama for you to fix - where you can just exist as mercenary doing as you please. It's coming out in early access at some point in the near future, and after having a go of the demo, I spoke to game director Nicolas Cannasse about why they chose to make a game that sets you free, rather than railroading you into some giant mission.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/wartales-is-a-tactical-rpg-that-wont-bog-you-down-with-quests-you-never-wanted-to-do-in-the-first-place",
          "publishedOn": "2021-09-10T12:00:00.000Z",
          "wordCount": 1596,
          "title": "Wartales is a tactical RPG that won't bog you down with quests you never wanted to do in the first place"
        },
        {
          "id": "https://www.rockpapershotgun.com/say-hello-to-felisha-and-paolo-our-first-official-comments-moderators",
          "author": "Katharine Castle",
          "description": "Reader comments have always been an incredibly important part of RPS, but sifting through them all often fell to the RPS staff. Since we were only looking at them during work hours, we'd often be slow to respond, and sometimes miss out on discussions entirely. The good news is that we've now got proper official comments moderators to help keep the conversation going, both between yourselves and between you and the wider RPS team. So please give a warm welcome to Felisha Dela Cruz and Paolo Balmes.\nRead more",
          "link": "https://www.rockpapershotgun.com/say-hello-to-felisha-and-paolo-our-first-official-comments-moderators",
          "publishedOn": "2021-09-10T11:49:40.000Z",
          "wordCount": 1022,
          "title": "Say hello to Felisha and Paolo, our first official comments moderators"
        },
        {
          "id": "https://www.rockpapershotgun.com/radiohead-team-up-with-epic-games-for-a-virtual-exhibition",
          "author": "Imogen Beckhelling",
          "description": "Radiohead are releasing a digital exhibition to celebrate the 21-year anniversary of their Kid A and Amnesiac albums, and it'll be available on the Epic Games Store this November. It's called the Kid A Mnesia Exhibition, and from the sounds of things we'll be able to explore some sort of interactive environment while we listen to the band's old iconic tunes. This certainly wasn't an Epic exclusive I was expecting, but it sounds pretty cool nonetheless.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/radiohead-team-up-with-epic-games-for-a-virtual-exhibition",
          "publishedOn": "2021-09-10T11:11:14.000Z",
          "wordCount": 802,
          "title": "Radiohead team up with Epic Games for a virtual exhibition"
        },
        {
          "id": "https://www.rockpapershotgun.com/halo-infinites-next-multiplayer-preview-is-targeting-sep-24th",
          "author": "Kaan Serin",
          "description": "Developer 343 have announced that Halo Infinite’s next multiplayer technical preview is “targeted” to arrive on September 24th. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/halo-infinites-next-multiplayer-preview-is-targeting-sep-24th",
          "publishedOn": "2021-09-10T10:57:45.000Z",
          "wordCount": 769,
          "title": "Halo Infinite's next multiplayer preview is targeting Sep 24th"
        },
        {
          "id": "https://www.rockpapershotgun.com/lost-in-random-review",
          "author": "Ed Thorn",
          "description": "Given it's called Lost In Random, you'd expect Zoink Games' new game to be filled with all sorts of oddities and twists and turns and things. Well, it sort of is. And it sort of isn't. I had hoped it would surprise me more, actually. This is a strategy-combat-meets-adventure game that's solid fun and has some great personality, but it gets a little too comfortable to knock you for six.\nRead more",
          "link": "https://www.rockpapershotgun.com/lost-in-random-review",
          "publishedOn": "2021-09-10T09:00:00.000Z",
          "wordCount": 1716,
          "title": "Lost In Random review: a grand adventure with few surprises"
        },
        {
          "id": "https://www.rockpapershotgun.com/forspokens-story-has-a-sassy-cuff-big-writers-and-oddly-stiff-faces",
          "author": "Graham Smith",
          "description": "During tonight's PlayStation livestream, we got a longer look at Square Enix's Forspoken. It's a third-person, open world action game in which you can go free running across a fantasy world, but the new trailer focuses on combat and on protagonist \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/forspokens-story-has-a-sassy-cuff-big-writers-and-oddly-stiff-faces",
          "publishedOn": "2021-09-09T22:30:32.000Z",
          "wordCount": 720,
          "title": "Forspoken's story has a sassy cuff, big writers, and oddly stiff faces"
        },
        {
          "id": "https://www.rockpapershotgun.com/alan-wake-remastered-will-launch-on-october-5th",
          "author": "Graham Smith",
          "description": "For a sleepy guy, Alan Wake is moving at high speed. From leaked news of a remaster last week to an official announcement this week to tonight, when we got a first trailer and an imminent release date: October 5th. Watch the trailer below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/alan-wake-remastered-will-launch-on-october-5th",
          "publishedOn": "2021-09-09T21:41:50.000Z",
          "wordCount": 675,
          "title": "Alan Wake Remastered will launch on October 5th"
        },
        {
          "id": "https://www.rockpapershotgun.com/uncharted-legacy-of-thieves-collection-confirmed-for-pc",
          "author": "Graham Smith",
          "description": "We already knew that Uncharted 4 was headed to PC thanks to its inclusion in an investor report earlier this year. Now it's official. Uncharted: Legacy Of Thieves Collection is headed to PC, and it contains not only Uncharted 4: A Thief's End, but Uncharted The Lost Legacy, too. There's a new trailer below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/uncharted-legacy-of-thieves-collection-confirmed-for-pc",
          "publishedOn": "2021-09-09T21:23:02.000Z",
          "wordCount": 730,
          "title": "Uncharted: Legacy Of Thieves Collection confirmed for PC"
        },
        {
          "id": "https://www.rockpapershotgun.com/star-wars-knights-of-the-old-republic-remake-announced",
          "author": "Graham Smith",
          "description": "Star Wars: Knights Of The Old Republic Remake was announced during tonight's PlayStation livestream. This is confirmation of what had been long rumoured, including the detail that the remake would be developed by Aspyr. There's a teaser trailer below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/star-wars-knights-of-the-old-republic-remake-announced",
          "publishedOn": "2021-09-09T21:06:52.000Z",
          "wordCount": 730,
          "title": "Star Wars: Knights Of The Old Republic Remake announced"
        },
        {
          "id": "https://www.rockpapershotgun.com/nioh-is-free-to-keep-from-the-epic-games-store-right-now",
          "author": "Graham Smith",
          "description": "Samurai yokai battler Nioh is free to download and keep from now until September 16th via the Epic Games Store. It's the latest in Epic's endless line of freebies, but if you're desperate to pay some money for a game, there's also a big September Savings sale underway.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/nioh-is-free-to-keep-from-the-epic-games-store-right-now",
          "publishedOn": "2021-09-09T20:05:14.000Z",
          "wordCount": 764,
          "title": "Nioh is free to keep from the Epic Games Store right now"
        },
        {
          "id": "https://www.rockpapershotgun.com/football-manager-2022-will-be-available-on-day-one-from-xbox-game-pass",
          "author": "Graham Smith",
          "description": "Every year, I ask: is this the one? Is this the year where I get back into Football Manager? Throw all my books and films and other games away and boil my cultural consumption down to the media equivalent of Huel. Everything I need in one entertaining paste. \r\n\nI'm asking it again right now. Football Manager 2022 will release on November 9th, and Sports Interactive have announced that this year it'll also be available on day one via Xbox Game Pass.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/football-manager-2022-will-be-available-on-day-one-from-xbox-game-pass",
          "publishedOn": "2021-09-09T19:38:40.000Z",
          "wordCount": 840,
          "title": "Football Manager 2022 will be available on day one from Xbox Game Pass"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-to-clean-your-keyboard",
          "author": "James Archer",
          "description": "Welcome to the RPS guide on how to clean your keyboard, something Graham specifically told us to do a while back, complete with a look at the revolting crud medley that had accumulated within his own mechanical board. His cleaning technique was pretty good too, though having recently Kim and Aggie’d my way through a guide on how to clean a PC, I reckon we can do better – no wet wipes required. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/how-to-clean-your-keyboard",
          "publishedOn": "2021-09-09T16:32:00.000Z",
          "wordCount": 1453,
          "title": "How to clean your keyboard"
        },
        {
          "id": "https://www.rockpapershotgun.com/dice-legacy-review-a-plate-spinning-nightmare-in-disguise",
          "author": "Sin Vega",
          "description": "I used to hate dice in games. If I wanted to play Dingoes & Daggers I'd play it, you know? Even with those choose your own adventure books as kids, we'd just sort of assume that things went a particular way, because who has the time to start again for no reason? And now every game in the world (all of them) has cards in. Ach. I've even played several building games with cards, and I still can't decide if it really works.\nDice Legacy is, on the surface, a building game based entirely on rolling dice. Dice and cards obviously aren't the same, but they share a big chunk of territory. And after living there for most of this week, I am prepared to lie down and let Death take me from here. Dice Legacy drove me goddamn insane.\nRead more",
          "link": "https://www.rockpapershotgun.com/dice-legacy-review-a-plate-spinning-nightmare-in-disguise",
          "publishedOn": "2021-09-09T16:30:00.000Z",
          "wordCount": 2278,
          "title": "Dice Legacy review: a plate-spinning nightmare in disguise"
        },
        {
          "id": "https://www.rockpapershotgun.com/splitgate-review",
          "author": "Brendan Caldwell",
          "description": "You might have heard Splitgate described as \"Halo meets Portal\", a useful shorthand for those of us with brains too tired to describe it more colourfully as \"a gun learns physics\" or \"Benny Hill gets a battle rifle\". However you describe it, Splitgate is a belter of a multiplayer arena shooter, born of gimmickry, yet graduating with honours, it's a grin-delivering game of tight, gun gymnastics and wacky Loony Tunes doorways, and just the right amount of frustrating to make you sweat and launch into another scramble for the bazooka in the middle of the map. \nRead more",
          "link": "https://www.rockpapershotgun.com/splitgate-review",
          "publishedOn": "2021-09-09T15:30:00.000Z",
          "wordCount": 1977,
          "title": "Splitgate review: a raucous FPS that's much more than Halo meets Portal"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-electronic-wireless-show-podcast-episode-155-the-best-puzzles-in-games-special",
          "author": "Alice Bell",
          "description": "We here at the Electronic Wireless Show podcast have done an episode about puzzles before, but Matthew and I just love puzzles a whole lot. We're talking about our favourite puzzle, as well, not puzzle game. This means that nate can bring up games about orcs, or whatever, that also happen to have a puzzle in them somewhere. Also yes, I got the number of the podcast wrong again, I know I keep doing this, let's just all move on together.\nWhat is a surprise is that we don't really need to spend ages arguing over what the definition of a puzzle is, which I think shows personal growth. Well done us! Asides this week include what role Matthew you fill on the team in a heist movie, Nate vs. Rufus Hound, and what the hell is the Riddler's whole deal about, anyway? Also: please give us creative control of all major IPs in cinema and games, so we can remake them to be about the drink Rio Tropical.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-electronic-wireless-show-podcast-episode-155-the-best-puzzles-in-games-special",
          "publishedOn": "2021-09-09T15:00:00.000Z",
          "wordCount": 885,
          "title": "EWS podcast episode 155: the best puzzles special"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-warzone-type-63-loadout",
          "author": "Kevin Foley",
          "description": "Looking for the best Type 63 loadout to bring into Warzone? This Tactical Rifle has excellent damage that allows it to quickly kill with several well-placed shots. Thanks to its available attachments, it can easily outmatch some of the best SMGs in Warzone. This loadout capitalizes on that potential so that you can bring the Type 63 into any close-quarters Warzone engagement with the confidence that you'll come out on top.\nRead more",
          "link": "https://www.rockpapershotgun.com/best-warzone-type-63-loadout",
          "publishedOn": "2021-09-09T14:47:47.000Z",
          "wordCount": 1045,
          "title": "Best Type 63 loadout in Warzone Season 5"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-r1-shadowhunter-loadout-warzone",
          "author": "Kevin Foley",
          "description": "Looking for the best R1 Shadowhunter Crossbow loadout to bring into Warzone? Then you must be looking to score some flashy kills and to troll some enemies. In truth, this crossbow has great damage potential, but its slow firerate and limited range are far too impractical to be useful in Warzone. If you're trying to figure out how to get better at this battle royale, you should skip this weapon and check out our guide on the best guns in Warzone. For those determined to become elite archers, we've still got you covered.\nRead more",
          "link": "https://www.rockpapershotgun.com/best-r1-shadowhunter-loadout-warzone",
          "publishedOn": "2021-09-09T14:42:23.000Z",
          "wordCount": 899,
          "title": "Best R1 Shadowhunter loadout for Warzone Season 5"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-tips-and-tricks-beginners-guide",
          "author": "Ollie Toms",
          "description": "Looking for tips and tricks on surviving in New World? Amazon's behemoth of an MMORPG took Steam by storm during its closed beta period back in July. Now it's out again in open beta, and with it has arrived a great surge in questions asked by new players on what they should be doing, how to gather, how to craft, how to fight, and so much more.\nWe get it. It's an MMO. It can be overwhelming. But follow the below tips and tricks on getting started in New World and you'll find firm footing from which you can begin your character's journey across the mystical, dangerous, and fascinating land of Aeturnum.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-tips-and-tricks-beginners-guide",
          "publishedOn": "2021-09-09T14:36:32.000Z",
          "wordCount": 1554,
          "title": "New World tips and tricks"
        },
        {
          "id": "https://www.rockpapershotgun.com/cloud-gardens-review-zen-gardening-in-the-middle-of-the-wasteland",
          "author": "Kaan Serin",
          "description": "The post-apocalypse is often accompanied by violence, grit and gore when it comes to video games. So many titles use the inevitable wasteland to emotionally torture their characters or as a playground to squash some monsters – or both. Cloud Gardens abandons all the blood and tears. Refreshingly, the game doesn’t rely on any drama or conflict. Instead, Cloud Gardens is solely focused on the idea of revitalisation and nature taking back spaces… after we’re gone.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/cloud-gardens-review-zen-gardening-in-the-middle-of-the-wasteland",
          "publishedOn": "2021-09-09T13:30:00.000Z",
          "wordCount": 1491,
          "title": "Cloud Gardens review: zen gardening in the middle of the wasteland"
        },
        {
          "id": "https://www.rockpapershotgun.com/pathfinder-wrath-of-the-righteous-is-a-crpg-belter-if-you-can-handle-your-fantasy-admin",
          "author": "Nate Crowley",
          "description": "I had high hopes of reviewing Pathfinder: Wrath Of The Righteous this week. However, somewhere around six hours into the game, when I realised I was still honking great tracts of story away from even unlocking most of the game's core mechanics, reality set in. Without properly no-lifing it for at least the rest of the week, I knew there was no way I was going to see enough of it to give any kind of overall verdict. It's months' worth of game, before even starting on replay potential. And honestly? If you're a certain kind of CRPG player, that should be all the recommendation you need. \nRead more",
          "link": "https://www.rockpapershotgun.com/pathfinder-wrath-of-the-righteous-is-a-crpg-belter-if-you-can-handle-your-fantasy-admin",
          "publishedOn": "2021-09-09T13:22:06.000Z",
          "wordCount": 1838,
          "title": "Pathfinder: Wrath Of The Righteous is a CRPG belter, if you can handle your fantasy admin"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-leveling",
          "author": "Ollie Toms",
          "description": "Want to learn how to level up fast in New World? With the game's launch into open beta, Amazon's ambitious foray into the world of MMORPGs has taken its next step towards engulfing the lives of many a player who wishes to level up their character as quickly as possible. But it's a long, slow process for most players to reach the highest levels - that is, unless you follow the tips below and learn all the fastest leveling methods available in New World.\nBelow we'll walk you through the best sources of XP in New World, from Main Quests to Town Missions; and we'll also go through small things that you can do to boost the XP you gain over time. We'll also explain how to improve your Trade Skill levels and your weapon masteries as efficiently as possible.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-leveling",
          "publishedOn": "2021-09-09T12:46:49.000Z",
          "wordCount": 2003,
          "title": "How to level up quickly in New World"
        },
        {
          "id": "https://www.rockpapershotgun.com/valorants-new-defender-centred-map-fracture-has-arrived",
          "author": "Imogen Beckhelling",
          "description": "Valorant has a new map now, its name is Fracture, and it scares me. Unlike any of the other Valo maps in Riot's tactical FPS, Fracture is designed so the defending team starts in the middle, and attackers can come at you from either side - and they can slide under the map on cool ropes too! On top of that, there are a few tweaks to character's abilities and more in the game's latest act.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/valorants-new-defender-centred-map-fracture-has-arrived",
          "publishedOn": "2021-09-09T11:23:55.000Z",
          "wordCount": 931,
          "title": "Valorant's new defender-centred map Fracture has arrived"
        },
        {
          "id": "https://www.rockpapershotgun.com/heres-when-new-worlds-open-beta-kicks-off-today",
          "author": "Imogen Beckhelling",
          "description": "Back in July, thousands upon thousands of players descended upon New World's last beta, suggesting that Amazon might actually have a winner with their upcoming MMO. Unfortunately, they delayed it just a week later, making players wait an extra month to get their hands on it again. You'll be able to get a little bit of a fix this weekend though, because New World is getting an open beta that starts later this very day. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/heres-when-new-worlds-open-beta-kicks-off-today",
          "publishedOn": "2021-09-09T10:29:33.000Z",
          "wordCount": 910,
          "title": "Here's when New World's open beta kicks off today"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-system-requirements-confirmed-along-with-amd-fidelityfx-super-resolution-support",
          "author": "James Archer",
          "description": "Deathloop, or Deeaaaaaaathlooooooooooop as it’s called in the absolute banger of a theme song, has some official PC system requirements out ahead of release on September 14th. In a blog post, publishers Bethesda have also detailed some of the PC-only graphics settings you’ll be able to tinker with, while confirming support for AMD’s FidelityFX Super Resolution upscaling tech.\nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-system-requirements-confirmed-along-with-amd-fidelityfx-super-resolution-support",
          "publishedOn": "2021-09-09T10:14:28.000Z",
          "wordCount": 1133,
          "title": "Deathloop system requirements confirmed, along with AMD FidelityFX Super Resolution support"
        },
        {
          "id": "https://www.rockpapershotgun.com/fallout-76s-customisable-worlds-update-is-now-live",
          "author": "Graham Smith",
          "description": "After launching public tests back in July, Fallout 76's 'Fallout Worlds' update is now available to all. \r\n\nFallout Worlds offers players the ability to edit the settings of the game, removing build restrictions and upending game balance, then inviting friends along to play.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/fallout-76s-customisable-worlds-update-is-now-live",
          "publishedOn": "2021-09-08T22:30:07.000Z",
          "wordCount": 780,
          "title": "Fallout 76's customisable Worlds update is now live"
        },
        {
          "id": "https://www.rockpapershotgun.com/final-fantasy-ivs-pixel-remaster-is-out-now-on-steam",
          "author": "Graham Smith",
          "description": "Final Fantasy IV's pixel remaster is now available on Steam. It follows the release of the pixel remasters of I-III in July, with V and VI both due in the near future. It's also arguably the first Final Fantasy to resemble what the series would become, in terms of characters and its battle system.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/final-fantasy-ivs-pixel-remaster-is-out-now-on-steam",
          "publishedOn": "2021-09-08T21:38:24.000Z",
          "wordCount": 819,
          "title": "Final Fantasy IV's pixel remaster is out now on Steam"
        },
        {
          "id": "https://www.rockpapershotgun.com/kitaria-fables-action-rpg-stardew-with-cats-is-out-now",
          "author": "Graham Smith",
          "description": "Yes, Kitaria Fables might better be described as \"Rune Factory with cats\", but let's make the useful comparison to the game most folks have heard of. Kitaria Fables is a game in which you, a cat, biff monsters in classless combat to gather resources, and then spend time planting crops and chatting to NPCs at home. It's out now.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/kitaria-fables-action-rpg-stardew-with-cats-is-out-now",
          "publishedOn": "2021-09-08T21:03:34.000Z",
          "wordCount": 743,
          "title": "Kitaria Fables, action RPG Stardew with cats, is out now"
        },
        {
          "id": "https://www.rockpapershotgun.com/hideo-kojima-is-a-luxury-brand",
          "author": "Graham Smith",
          "description": "Hideo Kojima has been tweeting about the final trailer for Death Stranding: Director's Cut for weeks now. He wants you to know that it was \"self-edited\", \"handmade\", that he obsessed over it. He sounds more like someone selling artisinally roasted coffee beans than a Sony-funded blockbuster that contains Monster Energy product placement. \r\n\nThe trailer is out now and you can watch it below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/hideo-kojima-is-a-luxury-brand",
          "publishedOn": "2021-09-08T20:16:40.000Z",
          "wordCount": 878,
          "title": "Hideo Kojima is a luxury brand"
        },
        {
          "id": "https://www.rockpapershotgun.com/life-is-strange-true-colors-review",
          "author": "Alice Bell",
          "description": "Whenever a new Life Is Strange game comes out I sometimes wonder how my life would manifest as an ironic and metaphorical super power. I usually stop quite quickly, because I have a feeling the answer would be somewhat disappointing. In the first game, Max Caulfield discovered she could rewind time or travel back to the past via photographs. In Life Is Strange 2, we shaped the outlook of young Daniel Diaz and how he used his somewhat fraught telekinetic powers. Now, in Life Is Strange: True Colors, we step into the shoes of Alex Chen, who can step into the hearts and minds of others.\nAlex is a 21-year-old product of the foster system who can feel, manipulate or even absorb the intense emotions of those around her. We join Alex just as she steps off the bus into a remote Colorado mining town called Haven Springs to start a new life with her brother Gabe. Things - as they typically do during weddings in soap operas, the opening ten minutes of a hospital drama, or the end of the first chapter of a Life Is Strange game - go terribly wrong. What follows is simultaneously my most and least favourite Life Is Strange game.\nRead more",
          "link": "https://www.rockpapershotgun.com/life-is-strange-true-colors-review",
          "publishedOn": "2021-09-08T16:00:00.000Z",
          "wordCount": 2109,
          "title": "Life Is Strange: True Colors review: a more mature LIS, but one still beset by narrative growing pains"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-artful-escape-review",
          "author": "Matthew Castle",
          "description": "They call me the Slippery Matthew Castle. Or at least they do aboard the Cosmic Lung, an intergalactic concert hall overseen by a brainstem in a cloak voiced by Jason Schwartzman. Impressively, this is one of the more rote happenings in The Artful Escape, a quest that also takes in astral highways, rock-powered butterflies and - steel yourself - a passive aggressive skiffle group. Its creator, the fabulously named Johnny Galvatron, describes it as what would happen if David Bowie had gone on a literal space trip to become Ziggy Stardust, and that seems about right.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-artful-escape-review",
          "publishedOn": "2021-09-08T16:00:00.000Z",
          "wordCount": 1598,
          "title": "The Artful Escape review: musical odyssey is a one hit wonder"
        },
        {
          "id": "https://www.rockpapershotgun.com/marvels-midnight-suns-new-gameplay-video",
          "author": "Kaan Serin",
          "description": "After announcing their new tactical RPG at Gamescom the other week, Firaxis held a 20 minute livestream for Marvel’s Midnight Suns yesterday, giving us a brand-new look at the game’s card-based combat system, its RPG elements and a deep-dive on how Wolverine, Sabretooth and big bad Lilith will play in-game. And from the looks of things, it's all shaping up very nicely indeed.\nRead more",
          "link": "https://www.rockpapershotgun.com/marvels-midnight-suns-new-gameplay-video",
          "publishedOn": "2021-09-08T15:56:20.000Z",
          "wordCount": 1113,
          "title": "Marvel's Midnight Suns new gameplay video reveals how this deckbuilding XCOM-like will actually play"
        },
        {
          "id": "https://www.rockpapershotgun.com/whatever-you-do-dont-listen-to-dokevs-trailer-song-before-bed",
          "author": "Ed Thorn",
          "description": "I reckon I'm not too bad at winding down in the evenings. Often I'll chill in Discord with some friends and treat myself to a Müller Corner, maybe even a banana as a special treat. Afterwards (or before, depending on how young the night is), if I'm feeling particularly decadent, I'll run myself a bath and use the special \"Muscle Therapy\" bubble bath mixture that looks suspiciously like blood.\nI'd say most of the time this ritual leads to a solid night's sleep. But for some reason, I got cocky last night. Just before beddy-byes I listened to that music from the DokeV Geoffscom reveal trailer, purely because I thought \"why not, huh?\". And I've not been the same since.\nRead more",
          "link": "https://www.rockpapershotgun.com/whatever-you-do-dont-listen-to-dokevs-trailer-song-before-bed",
          "publishedOn": "2021-09-08T15:55:17.000Z",
          "wordCount": 770,
          "title": "Whatever you do, don't listen to DokeV's trailer song before bed"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-concept-art-shows-its-characters-being-absolute-fashion-icons",
          "author": "Imogen Beckhelling",
          "description": "Hello, who is the stylist that designs the Deathloop characters' outfits and will you come to my house and design me some too, please? We're less than a week away from playing Arkane's 60s-themed stealth 'em up, and I'm utterly enamoured with the excellent clothes main characters Colt and Juliana get to wear. \r\n\n\r\nIn a recent blog post, assistant art director and lead character artist Jean-Baptiste Ferder shared a little bit of background on how Colt and Juliana were designed, along with some concept art showing various outfits for the stylish duo. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-concept-art-shows-its-characters-being-absolute-fashion-icons",
          "publishedOn": "2021-09-08T15:45:39.000Z",
          "wordCount": 1055,
          "title": "Deathloop concept art shows its characters being absolute fashion icons"
        },
        {
          "id": "https://www.rockpapershotgun.com/bloodhunt-blood-resonance-types",
          "author": "Ollie Toms",
          "description": "Want to learn what the different Blood Resonance types in Bloodhunt do? It's possibly the most complex and novel system in Sharkmob's new vampiric Battle Royale, but it's important to understand, because the choice of mortals upon whom you feed will determine how your character grows in strength throughout a match.\nBelow we'll walk you through the four different types of Blood Resonance in Bloodhunt, the effects that each one bestows upon you, and which are the best types of blood for each vampire type. We'll also explain how to increase the number of Blood Resonance points you can obtain over the course of a match.\nRead more",
          "link": "https://www.rockpapershotgun.com/bloodhunt-blood-resonance-types",
          "publishedOn": "2021-09-08T15:17:26.000Z",
          "wordCount": 1360,
          "title": "Bloodhunt Blood Resonance types explained"
        },
        {
          "id": "https://www.rockpapershotgun.com/razer-basilisk-v3-review",
          "author": "James Archer",
          "description": "Razer have launched a new version of its customisation-focused wired mouse, the Basilisk V3. Outwardly it looks much like a retread of last year’s Basilisk V2 – the pointy click buttons married to smooth curves, the grippy thumb rest, the stark black-and-RGB colour scheme – but there are enough tweaks to the V3 model that it feels and acts like a very different rodent. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/razer-basilisk-v3-review",
          "publishedOn": "2021-09-08T15:02:24.000Z",
          "wordCount": 1283,
          "title": "Razer Basilisk V3 review: A faster, smarter gaming mouse"
        },
        {
          "id": "https://www.rockpapershotgun.com/tales-of-arise-review",
          "author": "Nadia Oxford",
          "description": "Many Japanese role-playing games boast unprecedented realism thanks to modern development tools that are capable of building dragons scale-by-scale. But not everyone thrives on a strict diet of grit and grime. I, for one, occasionally break away and indulge the urge to jump into bright, busy JRPGs that check off every anime cliche ever devised. \nThese are the JRPGs that actively make me seek battles because it just feels good to leap a metre off the ground and punch an eagle in the face. These are the JRPGs that make me wonder why the protagonist wears a heavy, half-broken mask that probably screws with his peripheral vision. (Then I tell myself that my dumb anime son can do whatever he wants.) These are among my favourite kinds of JRPGs, and Bandai Namco's Tales of Arise keeps good company with them.\nRead more",
          "link": "https://www.rockpapershotgun.com/tales-of-arise-review",
          "publishedOn": "2021-09-08T14:00:00.000Z",
          "wordCount": 1653,
          "title": "Tales Of Arise review: a tale worth telling"
        },
        {
          "id": "https://www.rockpapershotgun.com/diablo-2-resurrected-is-limiting-ultrawide-support-because-it-breaks-the-game",
          "author": "James Archer",
          "description": "The Diablo 2: Resurrected beta opened its fiery gates to everyone last month, and by Alice B’s account it was quite the enjoyable nostalgia trip. Some players, however, may have been having a little too much fun – specifically though the use of ultrawide monitors, which Blizzard say will no longer receive full 21:9 aspect ratio support in the remaster.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/diablo-2-resurrected-is-limiting-ultrawide-support-because-it-breaks-the-game",
          "publishedOn": "2021-09-08T11:54:12.000Z",
          "wordCount": 994,
          "title": "Diablo 2: Resurrected is limiting ultrawide support because it breaks the game"
        },
        {
          "id": "https://www.rockpapershotgun.com/battlefield-2042-shows-off-new-specialists-who-all-seem-very-familiar",
          "author": "Ed Thorn",
          "description": "EA have dropped new gameplay showing off five of Battlefield 2042's specialists doing things like pulling the trigger, laying down turrets, pulling the trigger, and healing friends with a needle gun. They look good, if very, very predictable.\nRead more",
          "link": "https://www.rockpapershotgun.com/battlefield-2042-shows-off-new-specialists-who-all-seem-very-familiar",
          "publishedOn": "2021-09-08T11:38:21.000Z",
          "wordCount": 997,
          "title": "Battlefield 2042 shows off new specialists, who all seem very familiar"
        },
        {
          "id": "https://www.rockpapershotgun.com/fortnite-now-has-an-unreal-engine-5-tech-demo-lady-skin-for-some-reason",
          "author": "Imogen Beckhelling",
          "description": "Last year, Epic Games revealed Unreal Engine 5 with a pretty Tomb Raider-style tech demo, showing a Lara Croft-like lady travelling through some ancient caves and ruins. At the time, I thought: \"Ooh, wouldn't it be great to play through that!\" Though sadly, it wasn't an actual game. However, you can become the cool, previously unnamed character in Fortnite now, because they've added a skin of her, named Windwalker Echo. Better than her sitting in limbo in a trailer forever, I suppose. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/fortnite-now-has-an-unreal-engine-5-tech-demo-lady-skin-for-some-reason",
          "publishedOn": "2021-09-08T11:34:56.000Z",
          "wordCount": 851,
          "title": "Fortnite now has an Unreal Engine 5 tech demo lady skin, for some reason"
        },
        {
          "id": "https://www.rockpapershotgun.com/project-downfalls-stylish-demo-is-like-a-hotline-miami-fps",
          "author": "Ed Thorn",
          "description": "Nope, despite appearances, Project Downfall isn't like Doom. This is an early access FPS that's got a lot more in common with Hotline Miami than it does with id's big, brash Doom Slayer. In its short demo, available now on Steam, I popped pills, blasted thugs, and wracked up stylish combos, all to some pounding synth beats. And I have to say, it felt really good.\nRead more",
          "link": "https://www.rockpapershotgun.com/project-downfalls-stylish-demo-is-like-a-hotline-miami-fps",
          "publishedOn": "2021-09-08T10:38:54.000Z",
          "wordCount": 1065,
          "title": "Project Downfall's stylish demo is like a Hotline Miami FPS"
        },
        {
          "id": "https://www.rockpapershotgun.com/quick-surviving-mars-is-free-to-keep-for-the-next-few-hours",
          "author": "Imogen Beckhelling",
          "description": "This is a PSA to all you fans of city-building sims: Surviving Mars is free to keep on Steam right now, and you have until the end of the day to grab it. To be fair, Surviving Mars is less a \"city\" builder and more a colony builder, where it's your job to set up a home on the little red planet for humans to populate. It's a good time too, we reckon it's one of the best management games and best building games on PC, so you might as well take this opportunity to add it to your library. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/quick-surviving-mars-is-free-to-keep-for-the-next-few-hours",
          "publishedOn": "2021-09-08T10:32:12.000Z",
          "wordCount": 807,
          "title": "Quick! Surviving Mars is free to keep for the next few hours"
        },
        {
          "id": "https://www.rockpapershotgun.com/alan-wake-was-the-first-game-i-upgraded-my-pc-for-and-id-do-it-again-for-alan-wake-remastered",
          "author": "Katharine Castle",
          "description": "All right folks, hands up: who's ever been excited about that hip new video game, only to find their PC's so old and decrepit that simply trying to turn the camera risks smothering your monitor screen with remnants of your leftover lunch? It's something we've probably all experienced over the years as PC games get ever more demanding, but for me, that game was Alan Wake, Remedy's spooky third-person shooter from the bygone era of 2010, and I'd do it all again to play the newly-announced Alan Wake Remastered, too. Would you?\nRead more",
          "link": "https://www.rockpapershotgun.com/alan-wake-was-the-first-game-i-upgraded-my-pc-for-and-id-do-it-again-for-alan-wake-remastered",
          "publishedOn": "2021-09-08T09:30:00.000Z",
          "wordCount": 1594,
          "title": "Alan Wake was the first game I upgraded my PC for, and I'd do it again for Alan Wake Remastered"
        },
        {
          "id": "https://www.rockpapershotgun.com/call-of-duty-warzone-is-headed-to-the-pacific-for-its-new-map",
          "author": "Graham Smith",
          "description": "Call Of Duty: Warzone is headed to the Pacific for its next map. It'll launch alongside Call Of Duty: Vanguard, and the first footage of the new locale was shown during tonight's Vanguard multiplayer reveal. You can watch the full video below, which has details of new modes and maps that will be included in this weekend's beta.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/call-of-duty-warzone-is-headed-to-the-pacific-for-its-new-map",
          "publishedOn": "2021-09-07T23:18:45.000Z",
          "wordCount": 860,
          "title": "Call Of Duty: Warzone is headed to the Pacific for its new map"
        },
        {
          "id": "https://www.rockpapershotgun.com/microsoft-flight-simulators-world-update-6-has-refined-germany-austria-and-switzerland",
          "author": "Graham Smith",
          "description": "Has any game done more for the representation of bridges than Microsoft Flight Simulator? Every new world update brings with it new, realistically rendered points of interest, and this time it's the turn of the viaducts and suspension bridges of Austria, Germany and Switzerland. World Update 6 is live now, and you can find the trailer below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/microsoft-flight-simulators-world-update-6-has-refined-germany-austria-and-switzerland",
          "publishedOn": "2021-09-07T22:03:13.000Z",
          "wordCount": 720,
          "title": "Microsoft Flight Simulator's world update 6 has refined Germany, Austria and Switzerland"
        },
        {
          "id": "https://www.rockpapershotgun.com/ubisofts-autumn-sale-is-underway-with-far-cry-3-for-free",
          "author": "Graham Smith",
          "description": "Ubisoft's autumn sale is underway, with substantial discounts on recent games. They're also offering Far Cry 3 for the biggest discount, free. That's a fair price for RPS's game of the year 2012.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/ubisofts-autumn-sale-is-underway-with-far-cry-3-for-free",
          "publishedOn": "2021-09-07T21:31:06.000Z",
          "wordCount": 810,
          "title": "Ubisoft's autumn sale is underway, with Far Cry 3 for free"
        },
        {
          "id": "https://www.rockpapershotgun.com/free-to-play-vampire-the-masquerade-battle-royale-is-out-in-early-access",
          "author": "Graham Smith",
          "description": "Vampire: The Masquerade - Bloodhunt felt too early to be played when Alice B previewed it back in June. How much of a difference does three months make? Sharkmob's free-to-play battle royale is now in early access, so you can find out.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/free-to-play-vampire-the-masquerade-battle-royale-is-out-in-early-access",
          "publishedOn": "2021-09-07T20:49:03.000Z",
          "wordCount": 823,
          "title": "Free-to-play Vampire: The Masquerade battle royale is out in early access"
        }
      ]
    },
    {
      "title": "Root.cz - články",
      "feedUrl": "https://www.root.cz/rss/clanky/",
      "siteUrl": "https://www.root.cz/clanky/",
      "articles": [
        {
          "id": "www.root.cz-text-15664",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Největší setkání bastlířů, vynálezců a inovátorů v Česku se konalo v Průmyslovém paláci pražského Výstaviště. Představilo 150 makerských expozic, workshopů a přednášek, včetně zahraničních hostů.",
          "link": "https://www.root.cz/clanky/maker-faire-prague-2021-obrazem-setkani-bastliru-vynalezcu-a-inovatoru/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-14T22:00:10.000Z",
          "wordCount": 235,
          "title": "Maker Faire Prague 2021 obrazem: setkání bastlířů, vynálezců a inovátorů",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/588/maker-faire-prague-2021-1.jpg",
            "length": "70872",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15663",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Sonda do světa otevřeného softwaru. Dnes si řekneme o svobodné alternativě k Discordu, vyzkoušíme si aplikaci pro ovládání ITUSB1 USB Test Switch, dáme si dohromady knihovnu obrázků a stáhneme si do počítače instalační balíčky pro Android.",
          "link": "https://www.root.cz/clanky/softwarova-sklizen-15-9-2021/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-14T22:00:05.000Z",
          "wordCount": 1004,
          "title": "Softwarová sklizeň (15. 9. 2021)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/root/368/kombajn-sklizen.jpg",
            "length": "394618",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15641",
          "author": "redakce@root.cz (Root.cz: Michal Tauchman)",
          "description": "Některé z mnou napsaných článků o legendárních počítačích končily zmínkou o nutnosti vrácení jejich původního vzhledu pomocí metody zvané retrobrighting. Výsledky svého letošního snažení bych rád krátce představil.",
          "link": "https://www.root.cz/clanky/projekt-retrobrighting/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-13T22:00:10.000Z",
          "wordCount": 2250,
          "title": "Retrobrighting: vraťte starému počítači původní vzhled",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/304/projekt-retrobrighting-perex-1.jpg",
            "length": "62590",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15659",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "Spirály se v různé podobě objevují na mnoha místech v přírodě, a to jak v malých škálách (ulity, popínavé rostliny), tak i na škálách odpovídajících planetám (víry v atmosféře) či dokonce celým galaxiím (spirální galaxie).",
          "link": "https://www.root.cz/clanky/krivky-v-prirode-i-v-pocitacove-grafice-svet-spiral/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-13T22:00:05.000Z",
          "wordCount": 7577,
          "title": "Křivky v přírodě i v počítačové grafice – svět spirál",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/507/krivka-perex-1.jpg",
            "length": "74201",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15661",
          "author": "redakce@root.cz (Root.cz: CESNET CERTS)",
          "description": "Dnes postřehneme zranitelnou VPN od Fortinetu, návrat starých a příchod nových známých, vykradené OSN i nového člena advisory boardu ProtonMailu. V rychlosti pak nové zranitelnosti Microsoft nástrojů či zamyšlení nad biometrickými údaji.",
          "link": "https://www.root.cz/clanky/postrehy-z-bezpecnosti-fortigate-pod-palbou/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-12T22:00:10.000Z",
          "wordCount": 1362,
          "title": "Postřehy z bezpečnosti: FortiGate pod palbou",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/573/fortinet-1.jpg",
            "length": "42840",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15658",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Projekt Pumpkin má za cíl oživit ukončený systém PalmOS na moderních strojích. Linux Mint se hodlá zaměřit na přepracování témat vzhledu. Na serveru OSNews vyšla obsáhlá recenze KDE Slimbooku. Program unzip na openSUSE poškozuje soubory.",
          "link": "https://www.root.cz/clanky/pumpkin-ozivuje-palmos-linux-mint-pracuje-na-vzhledu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-12T22:00:05.000Z",
          "wordCount": 1156,
          "title": "Pumpkin oživuje PalmOS, Linux Mint pracuje na vzhledu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/619/linux-mint-dark-1.jpg",
            "length": "59621",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15660",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "LG představila River OS, nový operační systém pro TV protkaný reklamou, VESA přidává certifikaci DisplayHDR True Black 600, vychází Wine 6.17 a také GNOME 41 Release Candidate s řadou vylepšení.",
          "link": "https://www.root.cz/clanky/apple-nabira-experty-na-risc-v-ibm-uvedla-prvni-servery-s-power10/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-11T22:00:10.000Z",
          "wordCount": 1618,
          "title": "Apple nabírá experty na RISC-V, IBM uvedla první servery s POWER10",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/485/risc-v-logo-1.png",
            "length": "49146",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-text-15657",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Nové ARM platformy, syscall pro rychlejší uvolnění paměti, AMD RDNA2 a Van Gogh, kernelový SMB3 File Server, Suspend/Resume u AMD, nová GPU, mountování FUSE pro CERN, lepší podpora platformy RISC-V.",
          "link": "https://www.root.cz/clanky/co-se-chysta-pro-linux-5-15-cast-druha-nove-platformy-i-rychlejsi-reseni-oom/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-09T22:00:10.000Z",
          "wordCount": 2058,
          "title": "Co se chystá pro Linux 5.15, část druhá: nové platformy i rychlejší řešení OOM",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/357/tucnak-cisarsky-tux-linux-1.jpg",
            "length": "34098",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15625",
          "author": "redakce@root.cz (Root.cz: Pavel Stěhule)",
          "description": "V předchozím článku jsem se snažil obecně někam zařadit knihovnu ncurses. V tomto článku se snažím o vysvětlení nebo popis zpracování vstupů a snažím se komentovat (a zdokumentovat) problémy, se kterými jsem se setkal při psaní pspg.",
          "link": "https://www.root.cz/clanky/psani-aplikaci-pro-terminal-osetreni-vstupu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-08T22:00:10.000Z",
          "wordCount": 4702,
          "title": "Psaní aplikací pro terminál: ošetření vstupů",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/245/ncurses-1.jpg",
            "length": "59451",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15656",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "Na několik článků o Spacemacsu a taktéž o Doom Emacsu dnes navážeme pohledem na druhou stranu pomyslné barikády. Popíšeme si totiž projekt SpaceVim, který byl sice inspirován Spacemacsem, ovšem je kompletně postaven na Vimu.",
          "link": "https://www.root.cz/clanky/projekt-spacevim-moderni-distribuce-vimu-inspirovana-spacemacsem/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-08T22:00:05.000Z",
          "wordCount": 5910,
          "title": "Projekt SpaceVim – moderní distribuce Vimu inspirovaná Spacemacsem",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/356/spacevim-1.jpg",
            "length": "40820",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "Root.cz - zprávičky",
      "feedUrl": "https://www.root.cz/rss/zpravicky/",
      "siteUrl": "https://www.root.cz/zpravicky/",
      "articles": [
        {
          "id": "www.root.cz-actuality-42817",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Jedna z posledních změn v rámci vývoje příští verze jádra Linux 5.15 povyšuje minimální verzi GCC pro kompilaci. Až dosud stačilo GCC 4.9, nyní bude pro sestavení jádra potřeba minimálně GCC 5.1. Jde současně o verzi, která je už delší dobu potřebná pro build na architektuře Aarch64 (64bit ARM).",
          "link": "https://www.root.cz/zpravicky/linux-5-15-uz-nezkompilujete-s-gcc-4-9-a-starsim/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-14T22:00:00.000Z",
          "wordCount": 843,
          "title": "Linux 5.15 už nezkompilujete s GCC 4.9 a starším",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/71/linus-torvalds-nvidia-fuck-1.jpg",
            "length": "20845",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42816",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Nová cenovka telefonu Librem 5 bude od listopadu tohoto roku 1199 dolarů. Telefon přitom v rámci kampaně šlo v roce 2017 předplatit za 599 dolarů, tedy poloviční částku. Dnes ještě stojí 899 dolarů, plus existuje verze vyráběná v USA s cenovkou 1999 dolarů. Hlavním důvodem dalšího výrazného růstu ceny je samozřejmě situace na trhu s komponentami a materiály.",
          "link": "https://www.root.cz/zpravicky/otevreny-telefon-librem-5-zdrazi-na-1199-usd/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-14T14:48:16.000Z",
          "wordCount": 1408,
          "title": "Otevřený telefon Librem 5 zdraží na 1199 USD",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/563/librem-5-1.jpg",
            "length": "28645",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42815",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Ladislav Lhotka, vedoucí Laboratoří CZ.NIC, je spoluautorem nového internetového standardu (RFC 9108), který v září vydala organizace IETF. Toto RFC převádí dva IANA registry do podoby vhodné pro datové modelování v jazyku YANG. Jde o dva důležité parametry služby DNS – třídy a typy zdrojových záznamů (resource records).",
          "link": "https://www.root.cz/zpravicky/organizace-ietf-schvalila-novy-internetovy-standard-spoluautorem-je-ladislav-lhotka-z-cz-nic/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-14T10:43:13.000Z",
          "wordCount": 832,
          "title": "Organizace IETF schválila nový internetový standard, spoluautorem je Ladislav Lhotka z CZ.NIC",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/595/ladislav-lhotka-1.jpg",
            "length": "32317",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42814",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "S dalším vydáním v rámci LTS řady 18.04 se už po loňské verzi 18.04.5 nepočítalo, nicméně revokace klíčů si vyžaduje vydání aktualizovaných instalačních obrazů této stále podporované LTS verze Ubuntu.",
          "link": "https://www.root.cz/zpravicky/neocekavane-vydani-ubuntu-18-04-6-lts-resi-revokaci-klicu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-14T09:59:32.000Z",
          "wordCount": 1021,
          "title": "Neočekávané vydání Ubuntu 18.04.6 LTS řeší revokaci klíčů",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/588/ubuntu-18-04-1.jpg",
            "length": "44398",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42813",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Jonathan Thomas informuje o nové verzi střižny OpenShot. Ta slouží primárně jako vydání opravující nahlášené chyby předchozí verze 2.6.0 z doby před pár týdny. Najdeme zde ale také automatickou migraci klíčových snímků u ořezu z projektů verze 2.5.1. Zpětná kompatibilita je zde 100%. Opraveny jsou také chyby v některých překladech (včetně slovenštiny) a mnoho překladů bylo vylepšeno.",
          "link": "https://www.root.cz/zpravicky/openshot-2-6-1-prinasi-vylepseni-orezu-a-opravy-chyb/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-13T22:00:00.000Z",
          "wordCount": 845,
          "title": "OpenShot 2.6.1 přináší vylepšení ořezu a opravy chyb",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/446/openshot-2-5-1-1.png",
            "length": "63448",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42812",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Střídání času se mělo podle Evropského parlamentu zastavit již letos. Jenže plány překřížila pandemie COVID-19. Dnes naše vláda schválila nařízení, že střídání času bude probíhat dalších pět let.",
          "link": "https://www.root.cz/zpravicky/stridani-casu-jeste-minimalne-pet-let-na-zruseni-neni-shoda/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-13T16:00:10.000Z",
          "wordCount": 13339,
          "title": "Střídání času ještě minimálně pět let, na zrušení není shoda",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/220/posun-casu-1.jpg",
            "length": "50077",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42811",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "V již rok trvajícím sporu Epic vs. Apple kvůli hře Fortnite byl v pátek vynesen 185 stránkový rozsudek kalifornským soudem. Ten dává většinou za pravdu Apple a Epic tak bude muset platit náhradu za platby Fortnite, které šly mimo AppStore. To dělá přes 3,6 milionů dolarů. A k tomu další náhrady.",
          "link": "https://www.root.cz/zpravicky/apple-musi-otevrit-platby-v-appstore/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-13T13:54:41.000Z",
          "wordCount": 3022,
          "title": "Apple musí otevřít platby v AppStore",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/289/apple-logo-1.jpg",
            "length": "11210",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42810",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Všichni jistě znáte GNU Wget, jednoduchý stahovač pro HTTPS, HTTP a FTP do příkazové řádky. Včera vyšel GNU Wget2 ve verzi 2.0.0 Jde o nové přepsání nástroje okolo knihovny libwget. Wget2 by měl být rychlejší než Wget, protože podporuje více vláken, HTTP/2, HTTP kompresi, TCP fast open a hlavičky If-Modified-Since.",
          "link": "https://www.root.cz/zpravicky/vysel-gnu-wget2-rychlejsi-wget/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-13T12:20:56.000Z",
          "wordCount": 795,
          "title": "Vyšel GNU Wget2, rychlejší Wget",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/582/prikazova-radka-termial-1.jpg",
            "length": "79556",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42809",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Vyhledávací stránku Google.com je možné nyní přepnout do tmavého vzhledu. Je potřeba být přihlášen a na stránce s výsledky zmáčknout ozubené kolečko vpravo nahoře. V nastavení vyhledávání se vám možná objeví nová položka vzhled. Tam je možné přepnout na tmavý, světlý a výchozí podle zařízení.",
          "link": "https://www.root.cz/zpravicky/vyhledavac-google-ma-tmavy-vzhled-zatim-ale-ne-pro-vsechny/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-13T08:32:12.000Z",
          "wordCount": 2308,
          "title": "Vyhledávač Google má tmavý vzhled, zatím ale ne pro všechny",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/473/tmavy-google-1.jpg",
            "length": "12818",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42808",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Linuxové jádro mírně „rozvolní“ opatření proti Spectre V2 a  V4 (Speculative Store Bypass) pro uživatelské úlohy. Od jádra 4.20 je výchozím chováním spec_store_bypass_disable=seccomp a spectre_v2_user=seccomp  , tedy jen pro úlohy používající SECCOMP (secure computing mode). Nově by mělo být nastaveno prctl, tedy jen pro procesy, které to mají nastaveno.",
          "link": "https://www.root.cz/zpravicky/linux-mirne-rozvolni-opatreni-proti-spectre/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-13T08:05:00.000Z",
          "wordCount": 870,
          "title": "Linux mírně rozvolní opatření proti Spectre",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/558/spectre-meltdown-1.jpg",
            "length": "35642",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-40574",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Linuxových systémů přibývá, každý den se spouštějí nové servery a někdo se o ně musí starat. To znamená spoustu různých dovedností specifických právě pro linuxové prostředí. Jak to zprovoznit, kudy bezpečně dovnitř, co tam najdeme, jak se o to postaráme a jak to nastavíme nebo rozšíříme.",
          "link": "https://www.root.cz/zpravicky/naucte-se-pouzivat-linux-spravne-a-bezpecne-online-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-13T06:30:35.000Z",
          "wordCount": 824,
          "title": "Naučte se používat Linux správně a bezpečně (online školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/440/skoleni-1.jpg",
            "length": "61676",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42807",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Některé notebooky s novými procesory AMD mají problémy s probuzením ze spánku s2idle. Mezi nimi například HP Envy x360. Po probuzení například nesvítí dioda napájení, nefunguje ovládání jasnosti displeje či dokonce nefunguje ventilátor.",
          "link": "https://www.root.cz/zpravicky/oprava-uspavani-notebooku-s-amd-bude-v-jadre-5-15/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-10T12:26:01.000Z",
          "wordCount": 3105,
          "title": "Oprava uspávání notebooků s AMD bude v jádře 5.15",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/23/hp-envy-x360-1.jpg",
            "length": "32282",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42806",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Procesory AMD Zen 2 a 3 budou mít lepší ovladač frekvencí amd_pstate místo doposud používaného acpi_cpufreq. Nový ovladač bude lépe využívat možností procesoru podobně jako u Intelu intel_pstate. Používat bude rozhraní ACPI CPPC (Collaborative Processor Performance Controls), které umožňuje jemnější řízení než staré ACPI. Z počátku bude podpora pouze pro Zen 3, později bude přidána podpora Zen 2.",
          "link": "https://www.root.cz/zpravicky/amd-bude-mit-ovladac-frekvenci-procesoru-amd-pstate-o-11-lepsi-vykon-na-watt/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-10T11:33:16.000Z",
          "wordCount": 1852,
          "title": "AMD bude mít ovladač frekvencí procesoru amd_pstate, o 11 % lepší výkon na Watt",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/276/ryzen-9-5950x.jpg",
            "length": "24776",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-38836",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Automatizace pomocí continuous integration přímo v Gitlabu. CI vám pomůže automatizovat rutinní procesy a ušetří vám hromadu času. Pomůže vám od automatického testování, buildy po nasazování. Chcete vědět víc? Přijďte na naše školení, které se uskuteční 29. září a proběhne plně online. Školí Ondřej Sika.",
          "link": "https://www.root.cz/zpravicky/gitlab-ci-automatizujte-primo-v-gitlabu-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-10T09:04:04.000Z",
          "wordCount": 798,
          "title": "Gitlab CI: automatizujte přímo v Gitlabu (školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/214/gitlab-ci-1.png",
            "length": "75559",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42805",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Švýcarská šifrovaná e-mailová služba ProtonMail dříve prohlašovala, že ve výchozím stavu neloguje IP adresy ani další detaily uživatelů.",
          "link": "https://www.root.cz/zpravicky/protonmail-predal-ip-adresu-francouzskych-aktivistu-policii/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-10T08:27:51.000Z",
          "wordCount": 10075,
          "title": "ProtonMail předal IP adresu francouzských aktivistů policii, doporučuje používat tor",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/root/323/protonmail-1.png",
            "length": "349157",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42804",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Distribuce Manjaro Linux Cinnamon změní výchozí prohlížeč. Původní Firefox bude nahrazen prohlížečem Vivaldi. Vývojáři distribuce vysvětlují, proč ke změně přikročili: Aby měl Vivaldi větší pozornost, kterou si zaslouží, rozhodli jsme se jej zahrnout jako výchozí prohlížeč do naší oblíbené Cinnamon Community Edition. Díky pozoruhodné rychlosti, výjimečné přizpůsobitelnosti a zejména způsobu, jakým hodnotí soukromí uživatelů.",
          "link": "https://www.root.cz/zpravicky/manjaro-linux-cinnamon-meni-vychozi-prohlizec-namisto-firefoxu-nasadi-vivaldi/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-10T07:41:44.000Z",
          "wordCount": 2590,
          "title": "Manjaro Linux Cinnamon mění výchozí prohlížeč, namísto Firefoxu nasadí Vivaldi",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/159/vivaldi-1.jpg",
            "length": "12784",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42803",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Nový botnet nazvaný Mēris, který během léta získával na síle, vytrvale útočí na ruskou společnost Yandex. Ta nyní ohlásila rekordní útok, který ve špičce představoval 21,8 milionů požadavků za sekundu (RPS). V srpnu přitom CloudFlare ohlásil předchozí rekord ve výši 17,2 milionů RPS – za ním stojí úplně stejný botnet.",
          "link": "https://www.root.cz/zpravicky/botnet-m-ris-vytvoril-rekordni-utok-s-21-8-miliony-pozadavku-za-sekundu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-10T07:28:20.000Z",
          "wordCount": 951,
          "title": "Botnet Mēris vytvořil rekordní útok s 21,8 miliony požadavků za sekundu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/545/botnet-1.jpg",
            "length": "80819",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42802",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Rocky Linux umožňuje získat oficiální placenou podporu pro firemní zákazníky, kteří chtějí operační systém používat ve své infrastruktuře. Službu oznámila společnost Ctrl IQ (zkráceně CIQ), kterou nedávno založil Gregory Kurtzer, zakladatel Rocky Linuxu a také původního projektu CentOS.",
          "link": "https://www.root.cz/zpravicky/rocky-linux-nabizi-oficialni-placenou-podporu-pro-firmy/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-10T07:03:32.000Z",
          "wordCount": 850,
          "title": "Rocky Linux nabízí oficiální placenou podporu pro firmy",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/523/rocky-linux-1.jpg",
            "length": "19958",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42801",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Microsoft nedávno vytvořil vlastní distribuci CBL-Mariner. Distribuci založenou na balíčcích RPM používá například ve WSL a Azure. Včera vyšla srpnová aktualizace 1.0. Největší novinkou je možnost stažení ISO souboru.",
          "link": "https://www.root.cz/zpravicky/linuxova-distribuce-microsoftu-cbl-mariner-ma-iso/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-10T06:23:55.000Z",
          "wordCount": 980,
          "title": "Linuxová distribuce Microsoftu CBL-Mariner má ISO",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/398/microsoft-1.jpg",
            "length": "58052",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42800",
          "author": "redakce@root.cz (Root.cz: Zdenek Henek)",
          "description": "Ne-konference jOpenSpace 2021 se koná 8. – 10. října 2021 v Hotelu Antoň v Telči. jOpenSpace je česká ne-konference. Konference typu OpenSpace jsou specifické tím, že se jejich program dopředu příliš neplánuje. Mluví se zkrátka o tom, co účastníky zajímá. Nikdo není jen pasivním divákem, každý přispěje svou desetiminutovou prezentací.",
          "link": "https://www.root.cz/zpravicky/spustena-registrace-na-jopenspace-2021/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-08T20:19:28.000Z",
          "wordCount": 805,
          "title": "Spuštěna registrace na jOpenSpace 2021",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/138/jopenspace-1.jpg",
            "length": "22917",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42798",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Na světě je nová verze webového prohlížeče Firefox. Dvaadevadesátka už automaticky přejde na HTTPS spojení s použitím HTTPS RR jako Alt-Svc hlaviček, dále nově podporuje plné spektrum barevných úrovní na mnoha systémech (blíže neupřesněno), na macOS pak v souborovém menu nabízí systémové volby pro sdílení a na témže OS jsou podporovány obrázky obsahující barevné profily ICC v4.",
          "link": "https://www.root.cz/zpravicky/firefox-92-vylepsuje-podporu-https/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-08T10:07:01.000Z",
          "wordCount": 2231,
          "title": "Firefox 92 vylepšuje podporu HTTPS",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/56/firefox-proton-1.jpg",
            "length": "41027",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42797",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Nové vydání operačního systému GhostBSD, uživatelsky přívětivě variace na FreeBSD, přechází od init systému OpenRC zpět do lůna rc.d z projektu FreeBSD. Sice vlastnosti jako service status v OpenRC jsou fajn, ale udržování jeho podpory v systému je nad síly projektu GhostBSD, a tak bude init řízen pomocí v tomto smyslu bezúdržbového rc.d. OpenRC bude nadále ve zdrojovém stromu GhostBSD minimálně do příštího roku.",
          "link": "https://www.root.cz/zpravicky/ghostbsd-21-09-06-nahrazuje-openrc-za-puvodni-rc-d-z-freebsd/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-08T09:59:24.000Z",
          "wordCount": 841,
          "title": "GhostBSD 21.09.06 nahrazuje OpenRC za původní rc.d z FreeBSD",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/306/ghostbsd-19-09-1.jpg",
            "length": "23751",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42796",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Sešlo se několik problémů s novým asistentem pro připojení, tedy Tor Connection, a na ně se právě soustředí nová verze operačního systému Tails. Řeší chyby týkající se nastavení vlastního bridge, umožněno je ukládat jeden takový do persistentního úložiště, uživatel dále může ručně upravit hodiny, když připojení k Toru selže (zejména to prý pomůže lidem na východ od Londýna, kteří se připoují přes obfs4 bridge a obecně je nyní způsob připojení k Toru robustnější).",
          "link": "https://www.root.cz/zpravicky/tails-4-22-opravuje-chyby-v-asistentu-tor-connection/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-08T05:00:00.000Z",
          "wordCount": 908,
          "title": "Tails 4.22 opravuje chyby v asistentu Tor Connection",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/618/tails-hacker.jpg",
            "length": "37364",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42795",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Světem již kolují vzorky procesorů od Ampere, které nesou 128 ARM CPU jader Neoverse N1. Jedná se dle fotografií o obří procesory rozměrově přesahující cokoli od Intelu či AMD, kde se ale bavíme o maximálně polovičním počtu jader, doprovázených HT. Doplňme, že AMD chystá plnohodnotně 128jádrový EPYC (tedy předpoklad 256 vláken) zhruba na rok 2023, právě jako konkurenci pro tyto mnohojádrové ARMy. Ampere nabídne několik verzí svých ARMů, přičemž u 128jádrových modelů bude na výběr s TDP 190, 230 a 250 W.",
          "link": "https://www.root.cz/zpravicky/128jadrovy-ampere-altra-max-m128-30-se-ukazuje/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-07T22:00:00.000Z",
          "wordCount": 1316,
          "title": "128jádrový Ampere Altra Max M128-30 se ukazuje",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/36/arm-1.jpg",
            "length": "31735",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42794",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Po řadě vývojových verzí je na světě finální vydání OpenSSL 3.0, všeobecně používané SSL knihovny. Oproti verzi 1.1 přináší velké možnosti v rozšiřitelnosti, vyčištění kódu projektu zejména od zastaralých věcí a také rozličná vylepšení v architektuře knihovny. OpenSSL 3.0 také přechází na licenci Apache 2.0.",
          "link": "https://www.root.cz/zpravicky/openssl-3-0-nejen-podpora-linux-kernel-tls/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-07T14:15:00.000Z",
          "wordCount": 891,
          "title": "OpenSSL 3.0, nejen podpora Linux Kernel TLS",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/429/openssl-1.jpg",
            "length": "23026",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "abclinuxu - aktuální články",
      "feedUrl": "http://www.abclinuxu.cz/auto/abc.rss",
      "siteUrl": "http://www.abclinuxu.cz/clanky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/clanky/distribucni-novinky-34-35-2021",
          "author": "Redakce",
          "description": "Závěr letních prázdnin a začátek školního roku přinesly několik významných vydání, LibreELEC s novým Kodi, příručky Linux From Scratch nebo novou stabilní větev OpenWrt, a také aktualizace Clonezilly, Ubuntu LTS, EndeavourOS či EasyOS.",
          "link": "http://www.abclinuxu.cz/clanky/distribucni-novinky-34-35-2021",
          "publishedOn": "2021-09-13T23:00:00.000Z",
          "wordCount": 1787,
          "title": "Distribuční novinky 34-35/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-sprava-a-analyza-dat-tlaci-podniky-do-cloudu",
          "author": "Redakce",
          "description": "Lenovo představuje hybridní tablety budoucnosti. Canon rozšiřuje nabídku A3 multifunkcí pro hybridní pracovní prostředí. Správa a analýza dat tlačí podniky do cloudu.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-sprava-a-analyza-dat-tlaci-podniky-do-cloudu",
          "publishedOn": "2021-09-12T22:01:00.000Z",
          "wordCount": 1392,
          "title": "Týden na ITBiz: Správa a analýza dat tlačí podniky do cloudu"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-dokazali-prepnout-vodivost-z-2d-na-1d",
          "author": "Redakce",
          "description": "Topologické izolátory. Janusovský grafen a baterie. Zachycen nový typ gravitačních vln. Dvojvrstvý borofen. Hledání mimozemských civilizací. Dysonovy sféry u černých děr. Planeta Devět. Oblečení z umělých svalových vláken.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-dokazali-prepnout-vodivost-z-2d-na-1d",
          "publishedOn": "2021-09-11T22:01:00.000Z",
          "wordCount": 1741,
          "title": "Týden na ScienceMag.cz: Dokázali přepnout vodivost z 2D na 1D"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-36-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-36-2021",
          "publishedOn": "2021-09-10T22:01:00.000Z",
          "wordCount": 2395,
          "title": "Událo se v týdnu 36/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/originalni-dozivotni-aktivacni-klic-windows-10-pro-za-pouhych-12-52-eur-odgoodoffer24.com",
          "author": "Reklama",
          "description": "Získejte doživotní aktivační klíč k Windows 10 za 12,52 EUR na prodejním portálu GoodOffer24.com. Kromě toho zde můžete získat mnohem více, od dalších nástrojů produktivity od Microsoftu, až po hry. Nezapomeňte zadat před dokončením nákupu slevový kód  AX30.",
          "link": "http://www.abclinuxu.cz/clanky/originalni-dozivotni-aktivacni-klic-windows-10-pro-za-pouhych-12-52-eur-odgoodoffer24.com",
          "publishedOn": "2021-09-10T20:30:00.000Z",
          "wordCount": 1527,
          "title": "Originální doživotní aktivační klíč Windows 10 Pro za pouhých 12,52 EUR od Goodoffer24.com"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/jaderne-noviny-prehled-za-srpen-2021",
          "author": "Redakce",
          "description": "Přehled srpnových vydání Jaderných novin: stav vydání jádra, citáty týdne a seznam článků týkajících se jádra.",
          "link": "http://www.abclinuxu.cz/clanky/jaderne-noviny-prehled-za-srpen-2021",
          "publishedOn": "2021-09-06T22:01:00.000Z",
          "wordCount": 2189,
          "title": "Jaderné noviny – přehled za srpen 2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-co-prozradi-mys",
          "author": "Redakce",
          "description": "Grafen vrací do hry pevné disky, hustota dat může vzrůst až 10krát. Hlavní chyby digitální transformace. Kontejnery jsou klíčová technologie při vývoji podnikových aplikací. Co prozradí myš.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-co-prozradi-mys",
          "publishedOn": "2021-09-05T22:01:00.000Z",
          "wordCount": 1476,
          "title": "Týden na ITBiz: Co prozradí myš"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-zachytili-rozpad-elektronu-na-chargon-a-spinon",
          "author": "Redakce",
          "description": "Kvantové spinové kapaliny. Delší dolet dronů díky palivovým článkům. Po 12 letech ukončuje provoz český tokamak COMPASS. Odhady hmotností černých děr. Pozornost si zaslouží i měsíce Uranu.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-zachytili-rozpad-elektronu-na-chargon-a-spinon",
          "publishedOn": "2021-09-04T22:01:00.000Z",
          "wordCount": 1777,
          "title": "Týden na ScienceMag.cz: Zachytili rozpad elektronu na chargon a spinon"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-35-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-35-2021",
          "publishedOn": "2021-09-03T22:01:00.000Z",
          "wordCount": 2670,
          "title": "Událo se v týdnu 35/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/cdkdeals-back-to-school-se-softwarem-produktivity-za-cenu-obeda",
          "author": "Reklama",
          "description": "Nový školní rok je tady, tak neváhejte a pořiďte softwarové nástroje produktivity z nabídky CDKDeals za ceny, které byste mohli přirovnat k platbě za oběd nebo večeři v restauraci! Kdybyste pak chtěli více, třeba hry, vyberete si také. Když před dokončením nákupu zadáte slevový kód AX30, máte dalších 30 % z ceny dolů!",
          "link": "http://www.abclinuxu.cz/clanky/cdkdeals-back-to-school-se-softwarem-produktivity-za-cenu-obeda",
          "publishedOn": "2021-09-01T14:00:00.000Z",
          "wordCount": 1411,
          "title": "CDKDeals: Back to School se softwarem produktivity za cenu oběda"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/distribucni-novinky-31-33-2021",
          "author": "Redakce",
          "description": "V srpnu byl vydán nejen stabilní Debian 11 „Bullseye“, ale i nový OSMC, elementary OS, Zorin OS, IPFire nebo Sparky Linux. Aktualizací se dočkaly také Tails, Manjaro či KaOS.",
          "link": "http://www.abclinuxu.cz/clanky/distribucni-novinky-31-33-2021",
          "publishedOn": "2021-08-31T20:00:00.000Z",
          "wordCount": 1999,
          "title": "Distribuční novinky 31-33/2021"
        }
      ]
    },
    {
      "title": "abclinuxu - čerstvé zprávičky",
      "feedUrl": "http://www.abclinuxu.cz/auto/zpravicky.rss",
      "siteUrl": "http://www.abclinuxu.cz/zpravicky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/zpravicky/kali-linux-2021.3.-nethunter-pro-chytre-hodinky-ticwatch-pro",
          "author": "Ladislav Hagara",
          "description": "Byla vydána nová verze 2021.3 průběžně aktualizované linuxové distribuce navržené pro digitální forenzní analýzu a penetrační testování Kali Linux (Wikipedie). Přehled novinek i s náhledy a seznamem nových nástrojů v oficiálním oznámení. Kali NetHunter běží nově také na chytrých hodinkách TicWatch Pro.",
          "link": "http://www.abclinuxu.cz/zpravicky/kali-linux-2021.3.-nethunter-pro-chytre-hodinky-ticwatch-pro",
          "publishedOn": "2021-09-14T19:52:52.000Z",
          "wordCount": 994,
          "title": "Kali Linux 2021.3. NetHunter pro chytré hodinky TicWatch Pro"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/java-17-jdk-17-lts",
          "author": "Ladislav Hagara",
          "description": "Byla vydána Java 17 / JDK 17. Nových vlastností (JEP - JDK Enhancement Proposal) je 14. Nová Java / JDK vychází každých 6 měsíců. Java 17 / JDK 17 je LTS verze. Předchozí LTS verze je verze 11. Porovnání verze 17 s verzí 11.",
          "link": "http://www.abclinuxu.cz/zpravicky/java-17-jdk-17-lts",
          "publishedOn": "2021-09-14T19:17:20.000Z",
          "wordCount": 981,
          "title": "Java 17 / JDK 17 LTS"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/links-2.24",
          "author": "Ladislav Hagara",
          "description": "Byla vydána verze 2.24 svobodného webového prohlížeče pracujícího v grafickém i textovém módu Links (Wikipedie). Přehled novinek v seznamu změn. Řešeny jsou chyby v X, na OS/2 i Minix 3.",
          "link": "http://www.abclinuxu.cz/zpravicky/links-2.24",
          "publishedOn": "2021-09-14T10:42:37.000Z",
          "wordCount": 1120,
          "title": "Links 2.24"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/pouzivame-opencv-na-fedore",
          "author": "Ladislav Hagara",
          "description": "Na MojeFedora.cz vyšel zatím dvoudílný článek Používáme OpenCV na Fedoře (část 2) věnovaný použití knihovny OpenCV (Open Source Computer Vision Library) pro počítačové vidění na Linuxu, konkrétně na Fedoře a v Pythonu. Jedná se o lehce upravený překlad anglického originálu z Fedora Magazine.",
          "link": "http://www.abclinuxu.cz/zpravicky/pouzivame-opencv-na-fedore",
          "publishedOn": "2021-09-14T10:22:53.000Z",
          "wordCount": 979,
          "title": "Používáme OpenCV na Fedoře"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/gnu-debugger-aneb-gdb-11.1",
          "author": "Ladislav Hagara",
          "description": "GNU Debugger aneb GDB byl vydán ve verzi 11.1. Podrobný přehled novinek v souboru NEWS.",
          "link": "http://www.abclinuxu.cz/zpravicky/gnu-debugger-aneb-gdb-11.1",
          "publishedOn": "2021-09-14T09:56:40.000Z",
          "wordCount": 951,
          "title": "GNU Debugger aneb GDB 11.1"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/web-privacytools-pod-novym-jmenem-privacy-guides",
          "author": "Fluttershy, yay!",
          "description": "Webové stránky privacytools.io, populární kompilace doporučení softwaru a poskytovatelů online služeb s ohledem na ochranu soukromí, jsou dostupné na doméně privacyguides.org pod novým jménem Privacy Guides. Příčinou změny (diskuse na Redditu) je, že původní zakladatel projektu věnoval jen málo času a na podněty rostoucí komunity reagoval pouze příležitostně, a to včetně aktualizací doporučení na webu, ale původní doménu si chtěl ponechat. Další služby jako Matrix či Mastodon budou přesunuty postupně.",
          "link": "http://www.abclinuxu.cz/zpravicky/web-privacytools-pod-novym-jmenem-privacy-guides",
          "publishedOn": "2021-09-14T03:34:40.000Z",
          "wordCount": 1015,
          "title": "Web PrivacyTools pod novým jménem Privacy Guides"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/letni-cas-i-v-letech-2022-az-2026",
          "author": "Ladislav Hagara",
          "description": "Z dnešních výsledků jednání vlády: Návrh nařízení vlády o zavedení letního času v letech 2022 až 2026 – čj. 938/21 – Schváleno. Cestování časem dalších pět let.",
          "link": "http://www.abclinuxu.cz/zpravicky/letni-cas-i-v-letech-2022-az-2026",
          "publishedOn": "2021-09-13T18:29:59.000Z",
          "wordCount": 2372,
          "title": "Letní čas i v letech 2022 až 2026"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/veloren-0.11",
          "author": "Ladislav Hagara",
          "description": "Byla vydána nová verze 0.11 počítačové hry Veloren. Jedná se o open source open world multiplayer voxel RPG. Hra je inspirována hrami Cube World, Legend of Zelda: Breath of the Wild, Dwarf Fortress a Minecraft. Videoukázka na YouTube. Zdrojové kódy jsou ke stažení na GitLabu pod licencí GNU GPL 3.0. Veloren je k dispozici také na Flathubu a Snapcraftu.",
          "link": "http://www.abclinuxu.cz/zpravicky/veloren-0.11",
          "publishedOn": "2021-09-13T14:22:31.000Z",
          "wordCount": 995,
          "title": "Veloren 0.11"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/european-astro-pi-challenge-2021-2022",
          "author": "Ladislav Hagara",
          "description": "Evropská kosmická agentura (ESA) s nadací Raspberry Pi vyhlásily další ročník soutěže pro studenty s názvem European Astro Pi Challenge o co nejzajímavější využití letos vylepšených počítačů Astro Pi na Mezinárodní vesmírné stanici (ISS).",
          "link": "http://www.abclinuxu.cz/zpravicky/european-astro-pi-challenge-2021-2022",
          "publishedOn": "2021-09-13T12:13:13.000Z",
          "wordCount": 968,
          "title": "European Astro Pi Challenge 2021-2022"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/cena-telefonu-librem-5-opet-vzroste",
          "author": "Ladislav Hagara",
          "description": "Cena telefonu Librem 5 opět vzroste. Aktuálně jej lze předobjednat za 899 dolarů. Od 1. listopadu za 1 199 dolarů. Od března 2022 za 1 299 dolarů. Při spuštění kampaně v srpnu 2017 to bylo 599 dolarů. Librem 5 USA, tj. Librem 5 vyráběný v USA, lze předobjednat za 1 999 dolarů.",
          "link": "http://www.abclinuxu.cz/zpravicky/cena-telefonu-librem-5-opet-vzroste",
          "publishedOn": "2021-09-12T22:45:10.000Z",
          "wordCount": 3864,
          "title": "Cena telefonu Librem 5 opět vzroste"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-RadeonSI-Lower-CPU",
          "author": null,
          "description": "Following portions of the merge request landing, the rest of the RadeonSI CPU-overhead-lowering work was just merged to Mesa 21.3...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-RadeonSI-Lower-CPU",
          "publishedOn": "2021-09-14T20:35:40.000Z",
          "wordCount": 720,
          "title": "RadeonSI Lands Big Batch Of Improvements To Lower CPU Overhead"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=oneAPI-Level-Zero-Loader-1.5",
          "author": null,
          "description": "Intel has released a new version of their loader for oneAPI Level Zero for loading the Level Zero software driver components...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=oneAPI-Level-Zero-Loader-1.5",
          "publishedOn": "2021-09-14T18:22:37.000Z",
          "wordCount": 752,
          "title": "oneAPI Level Zero Loader v1.5 Released With VPU Driver Recognition, Multi-Driver Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=OpenJDK-17-Java-17",
          "author": null,
          "description": "Java 17 has made it to general availability status today with a number of improvements...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=OpenJDK-17-Java-17",
          "publishedOn": "2021-09-14T17:48:18.000Z",
          "wordCount": 867,
          "title": "Java 17 / OpenJDK 17 Hits GA With Maturing Vector API, Removal Planned For Applet API"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30523",
          "author": null,
          "description": "While NVIDIA has been supporting Resizable BAR for a while now with their GeForce RTX 30 series graphics cards, for those exclusively using Linux it remains more of a challenge due to AIB partners generally not releasing any vBIOS updates for ReBAR support that can be easily applied under Linux. But if you do carry out an update -- such as under Windows -- the performance uplift can be worthwhile if using a game that can benefit from the support.",
          "link": "https://www.phoronix.com/vr.php?view=30523",
          "publishedOn": "2021-09-14T13:09:13.000Z",
          "wordCount": 923,
          "title": "NVIDIA RTX 30 Series Resizable BAR Support Continues Helping Performance On Linux"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Seamless-Update",
          "author": null,
          "description": "\"Intel Seamless Update\" is a forthcoming feature for Intel platforms seemingly first being exposed by their new Linux kernel patches working on the functionality... Intel is working on being able to carry out system firmware upates such as UEFI updates but doing so at run-time and being able to avoid the reboot in the process...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Seamless-Update",
          "publishedOn": "2021-09-14T10:05:13.000Z",
          "wordCount": 938,
          "title": "Intel Seamless Update: Intel Preparing For System Firmware Updates Without The Reboot"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=libinput-1.19",
          "author": null,
          "description": "Libinput 1.19 is now available as the newest version of this Linux input handling library commonly used these days by both X.Org and Wayland desktops...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=libinput-1.19",
          "publishedOn": "2021-09-14T09:42:51.000Z",
          "wordCount": 803,
          "title": "Libinput 1.19 Released With Hold Gestures & High Resolution Wheel Scrolling"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Raising-GCC",
          "author": null,
          "description": "While Linux 5.15-rc1 was released on Sunday with its many changes, landing on Monday was a late change to raise the baseline GCC version requirement for building the Linux kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Raising-GCC",
          "publishedOn": "2021-09-14T07:00:00.000Z",
          "wordCount": 908,
          "title": "Linux 5.15 Raises Its GCC Compiler Version Requirement"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-Vulkan-WSI-No-Wait-XWay",
          "author": null,
          "description": "Mesa 21.3 today landed a debug option that can help with the XWayland-based gaming performance around latency and for power management as well...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-Vulkan-WSI-No-Wait-XWay",
          "publishedOn": "2021-09-14T00:48:47.000Z",
          "wordCount": 969,
          "title": "Mesa Lands Option That Can Help XWayland-Based Gaming On The Steam Deck"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-RFC-x86-User-Interrupts",
          "author": null,
          "description": "In addition to the big Advanced Matrix Extensions support still being in flux and the kernel-side AMX code not yet being merged, another feature of next year's Xeon \"Sapphire Rapids\" that we are only now seeing in early published form for the Linux kernel is handling of x86 user interrupts...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-RFC-x86-User-Interrupts",
          "publishedOn": "2021-09-13T20:38:01.000Z",
          "wordCount": 943,
          "title": "Intel Posts Initial Code For x86 User Interrupts On Linux  - Shows Great Performance Potential"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=FUTEX2-v3-Patches",
          "author": null,
          "description": "While Linux 5.15 has many new features and improvements, one of the patch series we have been eager to see land is the work introducing the new FUTEX2 system call. FUTEX2 can help improve the performance of newer Windows games running on Linux via Wine / Steam Play's Proton by better matching the Windows kernel behavior, but while it didn't land for Linux 5.15, at least a new version of the patches were posted...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=FUTEX2-v3-Patches",
          "publishedOn": "2021-09-13T18:45:11.000Z",
          "wordCount": 844,
          "title": "FUTEX2 System Call Updated To Work On ARM"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Zink-September-Games",
          "author": null,
          "description": "After last month landing the Zink sub-allocator code for improved performance and also enabling OpenGL ES 3.2 support for Zink, lead developer Mike Blumenkrantz at Valve has been spending time this month working to get more games running on this OpenGL-over-Vulkan Mesa driver...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Zink-September-Games",
          "publishedOn": "2021-09-13T17:54:34.000Z",
          "wordCount": 785,
          "title": "Zink OpenGL-On-Vulkan Tackling Support For More Games"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GDB-11.1-Released",
          "author": null,
          "description": "GDB 11.1 is now available as the latest feature update to the GNU Debugger...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GDB-11.1-Released",
          "publishedOn": "2021-09-13T17:34:49.000Z",
          "wordCount": 708,
          "title": "GNU Debugger 11.1 Released With MTE Support, Core File Debugging For 64-bit Cygwin Apps"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30519",
          "author": null,
          "description": "Feature development is over on the Linux 5.15 kernel with Linux 5.15-rc1 being issued. It's now on to testing and bug fixing over the next two months before the kernel is christened as stable. Here is our original Linux 5.15 feature overview about all of the big changes in this next kernel version.",
          "link": "https://www.phoronix.com/vr.php?view=30519",
          "publishedOn": "2021-09-13T13:16:01.000Z",
          "wordCount": 1079,
          "title": "Linux 5.15 Delivers Many Features With New NTFS Driver, In-Kernel SMB3 Server, New Hardware"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-18.04.6-LTS-Coming",
          "author": null,
          "description": "While Ubuntu 18.04.5 LTS shipped one year ago as the last planned point release to the \"Bionic Beaver\", an emergency issue is leading to Ubuntu 18.04.6 now being prepared...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-18.04.6-LTS-Coming",
          "publishedOn": "2021-09-13T12:56:17.000Z",
          "wordCount": 836,
          "title": "Ubuntu 18.04.6 LTS Special Being Prepared To Deal With Unbootable Media"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-PSF-Control-September",
          "author": null,
          "description": "Of all the great stuff for AMD in Linux 5.15, one of the patches still not having yet been mainlined is the control support around Predictive Store Forwarding (PSF) with Zen 3 processors. It's been six months since AMD published their security whitepaper around PSF while the Linux patch has yet to be mainlined while now it seems will be updated for a reduced focus on KVM usage...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-PSF-Control-September",
          "publishedOn": "2021-09-13T12:40:51.000Z",
          "wordCount": 1184,
          "title": "Still-Pending AMD PSF Control Patch To Be Retailored For KVM"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Accel-Drivers-2021-Discussion",
          "author": null,
          "description": "On and off for years has been talk of an accelerator subsystem for the Linux kernel considering that for now most AI training/inference accelerator drivers end up lodged within the \"char/misc\" area of the kernel. That accelerator subsystem discussion has been restarted with talks of having such a subsystem or moving those drivers within the GPU/DRM subsystem space...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Accel-Drivers-2021-Discussion",
          "publishedOn": "2021-09-13T09:57:14.000Z",
          "wordCount": 859,
          "title": "Linux Developers Talk Again About An Accelerator Subsystem - Or Moving Them Into The GPU/DRM Area"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-rc1",
          "author": null,
          "description": "As expected this evening the Linux 5.15-rc1 kernel was released to top off the two week merge window that saw many changes to the kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-rc1",
          "publishedOn": "2021-09-13T00:22:40.000Z",
          "wordCount": 841,
          "title": "Linux 5.15-rc1 Brings New NTFS Driver, In-Kernel SMB3 Server, AMD Changes, Intel DG2"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-AMD",
          "author": null,
          "description": "While working on my usual Linux kernel feature overview that summarizes the many articles over the past two weeks outlining all of the new features and changes merged, one area that particularly stands out for Linux 5.15 are all of AMD's upstream contributions that happened to make it in this kernel. There is a lot of new enablement on the AMD side -- both for CPUs and Radeon graphics -- but also improving existing hardware support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-AMD",
          "publishedOn": "2021-09-12T18:00:00.000Z",
          "wordCount": 1367,
          "title": "Linux 5.15 Is A Very Exciting Kernel For AMD"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Apache-FY2021-Report",
          "author": null,
          "description": "The Apache Software Foundation recently published their FY2021 report for their year-ended 30 April. Even with the ongoing pandemic, the Apache Software Foundation managed to raise more than $3M USD and enjoyed a host of software successes...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Apache-FY2021-Report",
          "publishedOn": "2021-09-12T11:11:29.000Z",
          "wordCount": 955,
          "title": "Apache Software Foundation Saw $3M In Revenue, ~134M Changed Lines Of Code Last Year"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Folios-Pagesets-MIA-5.15",
          "author": null,
          "description": "We are now down to the last day of the Linux 5.15 merge window and one of the patch series we have been waiting to see if it would land during this two week period was the \"folios\" code -- or that also was recently renamed to \"pagesets\" to address some concerns over the name...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Folios-Pagesets-MIA-5.15",
          "publishedOn": "2021-09-12T10:20:03.000Z",
          "wordCount": 972,
          "title": "It's Looking Like Folios / Pagesets Might Miss Making It Into Linux 5.15"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=RISC-V-Better-Stack-Rand",
          "author": null,
          "description": "In addition to the RISC-V changes merged last week for the Linux 5.15 kernel, a second batch of patches was merged this weekend...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=RISC-V-Better-Stack-Rand",
          "publishedOn": "2021-09-12T10:04:52.000Z",
          "wordCount": 760,
          "title": "RISC-V Gets Expanded Stack Randomization With Linux 5.15"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Spectre-V2-V4-Going-Prctl-Def",
          "author": null,
          "description": "A change first proposed last year to the Linux kernel's Spectre mitigation defaults looks like it will soon be sent in for the mainline kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Spectre-V2-V4-Going-Prctl-Def",
          "publishedOn": "2021-09-12T04:00:00.000Z",
          "wordCount": 987,
          "title": "Linux Preparing To Slightly Loosen Its Spectre Defaults"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Rust-Linux-Kernel-Linaro-2021",
          "author": null,
          "description": "While the Rust programming language support for usage within the kernel isn't landing for the Linux 5.15 merge window ending this weekend, that effort remains ongoing. A status update on the effort was shared this week about Rust usage for the Linux kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Rust-Linux-Kernel-Linaro-2021",
          "publishedOn": "2021-09-11T18:30:14.000Z",
          "wordCount": 752,
          "title": "The Latest Progress On Rust For The Linux Kernel"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=RadeonSI-More-For-Mesa-21.3",
          "author": null,
          "description": "Another batch of minor optimizations were merged to Mesa 21.3 for the RadeonSI Gallium3D driver...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=RadeonSI-More-For-Mesa-21.3",
          "publishedOn": "2021-09-11T17:15:07.000Z",
          "wordCount": 811,
          "title": "Another Batch Of RadeonSI Optimizations Land In Mesa 21.3"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Alder-Lake-TCC-Linux-5.15",
          "author": null,
          "description": "While much of Intel's next-gen Alder Lake processor support appears to be in good shape for Linux 5.14, some remaining items are landing for the current Linux 5.15 cycle. The latest Alder Lake support hitting the kernel is for Intel's TCC cooling driver...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Alder-Lake-TCC-Linux-5.15",
          "publishedOn": "2021-09-11T13:00:28.000Z",
          "wordCount": 1039,
          "title": "Alder Lake Support Added To Intel's TCC Driver In Linux 5.15"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=CoreCtl-1.2-Released",
          "author": null,
          "description": "CoreCtrl 1.2 was released this week as the open-source, independently-developed application for exposing more sensor support on Linux and offering various controls aroudnd over/under-clocking and other tuning. At the moment CoreCtrl is primarily focused on making the most use of AMD Radeon GPUs under Linux with some options not otherwise readily available on the platform...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=CoreCtl-1.2-Released",
          "publishedOn": "2021-09-11T11:45:12.000Z",
          "wordCount": 867,
          "title": "CoreCtrl 1.2 Brings Support For More Sensors, Voltage Offsets"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=OpenShot-2.6.1",
          "author": null,
          "description": "Released in August was the big OpenShot 2.6 video editor update while this weekend has been succeeded by its first point release...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=OpenShot-2.6.1",
          "publishedOn": "2021-09-11T10:37:52.000Z",
          "wordCount": 730,
          "title": "OpenShot 2.6.1 Released For This Open-Source Video Editor"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-Plasma-5.23-Soft-Freeze",
          "author": null,
          "description": "It's been a busy start to September for the KDE project and is now under its soft feature freeze for Plasma 5.23...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-Plasma-5.23-Soft-Freeze",
          "publishedOn": "2021-09-11T10:13:51.000Z",
          "wordCount": 887,
          "title": "KDE Sees More Plasma Wayland Fixes As Plasma 5.23 Hits Its Soft Feature Freeze"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Wine-6.17-Released",
          "author": null,
          "description": "Wine 6.17 is out as the latest bi-weekly development release as we move closer towards the Wine 7.0 release around the start of the new year...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Wine-6.17-Released",
          "publishedOn": "2021-09-10T20:30:43.000Z",
          "wordCount": 819,
          "title": "Wine 6.17 Released With Better HiDPI Support For Built-In Apps"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Habana-Labs-Linux-5.15-Changes",
          "author": null,
          "description": "While last week was the main \"char/misc\" pull request for the Linux 5.15 merge window, the Habana Labs driver changes were previously reverted from there due to opposition from the upstream kernel developers in the Direct Rendering Manager  space. The concerning patches around DMA-BUF have now been removed and a new pull request submitted with updates to this AI driver for Linux 5.15...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Habana-Labs-Linux-5.15-Changes",
          "publishedOn": "2021-09-10T17:57:29.000Z",
          "wordCount": 1025,
          "title": "Habana Labs AI Driver Updates Submitted For Linux 5.15"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30514",
          "author": null,
          "description": "With less than one month out from the official release of Microsoft Windows 11, I was curious to run some fresh benchmarks of the latest Windows 11 Insider Preview build against Windows 10 21H1 to see how the performance is looking. Of course, also to see how Windows 11 is shaping up against Ubuntu 21.10 also due for release in October.",
          "link": "https://www.phoronix.com/vr.php?view=30514",
          "publishedOn": "2021-09-10T11:55:19.000Z",
          "wordCount": 807,
          "title": "Ubuntu 21.10 Performance Still Pushing Ahead Of Windows 10, Latest Windows 11 Build"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Hababa-Labs-Open-Compiler-AI",
          "author": null,
          "description": "Intel-owned Habana Labs now has the most open software stack among AI accelerators! While Habana Labs has long provided an open-source, upstream kernel driver for their Gaudi AI training and Goya AI inference accelerators, the user-space portions including their code compiler and run-time library have been closed-source. This has been a thorn for upstream kernel developers and their standards, but now Habana Labs has open-sourced their user-space components too...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Hababa-Labs-Open-Compiler-AI",
          "publishedOn": "2021-09-10T10:00:00.000Z",
          "wordCount": 909,
          "title": "Habana Labs Opens Up The Code To Their AI Compiler, SynapseAI Core"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/rss.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2515/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2515/",
          "publishedOn": "2021-09-13T04:00:00.000Z",
          "wordCount": 185,
          "title": "Vaccine Research"
        },
        {
          "id": "https://xkcd.com/2514/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2514/",
          "publishedOn": "2021-09-10T04:00:00.000Z",
          "wordCount": 185,
          "title": "Lab Equipment"
        },
        {
          "id": "https://xkcd.com/2513/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2513/",
          "publishedOn": "2021-09-08T04:00:00.000Z",
          "wordCount": 185,
          "title": "Saturn Hexagon"
        },
        {
          "id": "https://xkcd.com/2512/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2512/",
          "publishedOn": "2021-09-06T04:00:00.000Z",
          "wordCount": 183,
          "title": "Revelation"
        }
      ]
    }
  ],
  "cliVersion": "1.11.0"
}