{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": [
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "author": null,
          "description": "Fixed: Unexpected nested element in author field crashes the parser\nThank you @ad-m",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "publishedOn": "2021-09-16T06:39:32.000Z",
          "wordCount": 348,
          "title": "v1.11.1"
        }
      ]
    },
    {
      "title": "Kotaku",
      "feedUrl": "https://kotaku.com/rss",
      "siteUrl": "https://kotaku.com",
      "articles": [
        {
          "id": "1847737350",
          "author": "Brian Ashcraft",
          "description": "Dad jokes are universal. In Japanese, dad jokes are called “oyagi gyagu,”  with oygai meaning “one’s father” and gyagu meaning “gag” or “joke.”  Like anywhere, these tend to be cheesy puns, but who can resist them? You you can, but I  sure can’t, and it seems Nintendo’s Yoshiaki Koizumi cannot, either. \nSplatoon…\nRead more...",
          "link": "https://kotaku.com/nintendos-low-key-dad-joke-for-splatoon-3-was-pretty-go-1847737350",
          "publishedOn": "2021-09-24T10:30:00.000Z",
          "wordCount": 423,
          "title": "Nintendo's Low-Key Dad Joke For Splatoon 3 Was Pretty Good"
        },
        {
          "id": "1847735522",
          "author": "Luke Plunkett",
          "description": "One of Nintendo’s cuter little announcements during the latest Direct was that, with N64 games coming soon to the system, the company will also start selling recreations of the console’s controller for you to play them on.\n\nRead more...",
          "link": "https://kotaku.com/you-cant-make-me-use-the-n64-controller-again-nintendo-1847735522",
          "publishedOn": "2021-09-24T01:45:00.000Z",
          "wordCount": 661,
          "title": "You Can't Make Me Use The N64 Controller Again, Nintendo"
        },
        {
          "id": "1847735687",
          "author": "Jeremy Winslow",
          "description": "Sometimes, during these surprise Nintendo Direct presentations, developers will just do the darnedest things. This includes the Splatoon 3 studio Nintendo Entertainment Planning & Development (Nintendo EDP) whose nondescript “squid researcher” dazzled us with both late-breaking research findings and his impressive…\nRead more...",
          "link": "https://kotaku.com/why-the-splatoon-3-devs-are-the-best-in-one-gif-1847735687",
          "publishedOn": "2021-09-24T00:45:00.000Z",
          "wordCount": 500,
          "title": "Why The Splatoon 3 Devs Are The Best, In One GIF"
        },
        {
          "id": "1847735646",
          "author": "Luke Plunkett",
          "description": "Late last year it was announced that The Initiative, a new Xbox Game Studio, was starting work an all-new Perfect Dark game. Today, they’ve said that they’re now getting some help, in the form of Tomb Raider developers Crystal Dynamics.\n\nRead more...",
          "link": "https://kotaku.com/square-enixs-crystal-dynamics-also-working-on-the-new-p-1847735646",
          "publishedOn": "2021-09-24T00:00:00.000Z",
          "wordCount": 450,
          "title": "Square Enix's Crystal Dynamics Also Working On The New Perfect Dark Game"
        },
        {
          "id": "1847735359",
          "author": "Luke Plunkett",
          "description": "I’m still physically recovering from the Mario movie cast announcement, mostly because if you’d given me 100 guesses to try and pick who would play the role of Mario—a short, thicc Italian-American—I would not have picked the ripped dude who is a Guardian of the Galaxy.\n\nRead more...",
          "link": "https://kotaku.com/somebody-tried-to-warn-us-about-chris-pratt-as-mario-in-1847735359",
          "publishedOn": "2021-09-23T23:45:00.000Z",
          "wordCount": 482,
          "title": "Somebody Tried To Warn Us About Chris Pratt As Mario In 2020"
        },
        {
          "id": "1847735249",
          "author": "John Walker",
          "description": "Today’s surprise Nintendo Direct offered 40 packed minutes of forthcoming Switch games, new content for old ones, and, er, teasers for forthcoming Directs about specific games like Smash and Animal Crossing. Below you’ll find all the big stories that came out of the presentation.\n\nRead more...",
          "link": "https://kotaku.com/all-the-biggest-announcements-from-nintendos-big-septem-1847735249",
          "publishedOn": "2021-09-23T23:40:00.000Z",
          "wordCount": 927,
          "title": "All The Biggest Announcements From Nintendo's Big September Direct"
        },
        {
          "id": "1847098247",
          "author": "Ash Parrish",
          "description": "Let’s go boys! During today’s Nintendo’s Direct event, we finally got a more in-depth look at Bayonetta 3. And as you can see above, the titular witch has a fresh new look and a 2022 release date.\n\nRead more...",
          "link": "https://kotaku.com/oh-shit-bayonettas-got-braids-in-third-game-1847098247",
          "publishedOn": "2021-09-23T22:40:00.000Z",
          "wordCount": 588,
          "title": "Oh Snap, Bayonetta's Got Braids In Third Game"
        },
        {
          "id": "1847734853",
          "author": "Isaiah Colbert",
          "description": "During the Nintendo Direct, Shigeru Miyamoto made a surprise appearance to discuss the full-length Mario movie in the works from Illumination studios. The release date in North America is December 21, 2022 and release dates for Japan and other regions will be announced at a later date.\nRead more...",
          "link": "https://kotaku.com/shigeru-miyamoto-announces-cast-for-upcoming-mario-movi-1847734853",
          "publishedOn": "2021-09-23T22:28:00.000Z",
          "wordCount": 373,
          "title": "The Super Mario Movie Coming In 2022 Has Quite The Cast"
        },
        {
          "id": "1847727594",
          "author": "Ian Walker",
          "description": "Some of the greatest Castlevania games of all time are coming to PlayStation, Xbox, Switch, and PC later today thanks to the new Castlevania Advance Collection. It bundles all three Game Boy Advance classics—as well as Dracula X, the Super Nintendo’s interesting Rondo of Blood port—into one complete package for the…\nRead more...",
          "link": "https://kotaku.com/castlevania-advance-collection-is-real-and-it-s-out-to-1847727594",
          "publishedOn": "2021-09-23T22:25:00.000Z",
          "wordCount": 485,
          "title": "Castlevania Advance Collection Is Real, And It’s Out Today"
        },
        {
          "id": "1847733166",
          "author": "Jeremy Winslow and Alexandra Hall",
          "description": "During today’s Direct presentation Nintendo finally confirmed what a lot of observers already suspected: Nintendo 64 games are coming to the Nintendo Switch Online service this October. Sega Genesis games will also join the service at the same time in a new membership plan called the “Expansion Pack.” What’s more,…\nRead more...",
          "link": "https://kotaku.com/nintendo-switch-gets-n64-and-genesis-collection-comple-1847733166",
          "publishedOn": "2021-09-23T22:25:00.000Z",
          "wordCount": 831,
          "title": "Nintendo Switch Online Gets N64, Genesis Collection, Along With Special Controllers"
        },
        {
          "id": "1847734750",
          "author": "Ari Notis",
          "description": "The Square Enix tactics game formerly known as Project Triangle Strategy is now officially known as...Triangle Strategy. It’s out March 4, 2022, for Nintendo Switch. Square Enix announced the news at today’s out-of-the-blue Nintendo Direct. Here’s a trailer:\nRead more...",
          "link": "https://kotaku.com/switch-rpg-triangle-strategy-out-march-still-a-looker-1847734750",
          "publishedOn": "2021-09-23T22:19:00.000Z",
          "wordCount": 454,
          "title": "Switch RPG Triangle Strategy Out March, Still A Looker"
        },
        {
          "id": "1847734667",
          "author": "Ian Walker",
          "description": "After a surprise leak earlier today, we got our first look at the next Kirby game during today’s Nintendo Direct presentation. Not only is Kirby and the Forgotten Land the series’ first mainline release since 2018, but it’s also the pink puffball’s first foray into full 3D gameplay.\n\nRead more...",
          "link": "https://kotaku.com/kirbys-next-game-goes-3d-for-first-time-and-it-looks-s-1847734667",
          "publishedOn": "2021-09-23T22:15:00.000Z",
          "wordCount": 427,
          "title": "Kirby's Next Game Goes 3D For First Time, And It Looks Sick"
        },
        {
          "id": "1847732298",
          "author": "Ethan Gach",
          "description": "Nintendo announced Super Smash Bros. Ultimate’s final DLC fighter will be shown off by director Masahiro Sakurai in a video stream on October 5, capping off months of speculation and bringing years of roster expansion to an end.\nRead more...",
          "link": "https://kotaku.com/nintendo-will-reveal-last-smash-bros-ultimate-fighter-1847732298",
          "publishedOn": "2021-09-23T22:14:00.000Z",
          "wordCount": 423,
          "title": "Smash Bros. Reveals Last Fighter In Dedicated October Nintendo Direct"
        },
        {
          "id": "1847734742",
          "author": "Ethan Gach",
          "description": "Disco Elysium: The Final Cut finally has a release date on Switch. The funky futurist RPG where words matter more than hit points will be playable on Nintendo’s hybrid handheld starting October 12.\nRead more...",
          "link": "https://kotaku.com/disco-elysium-hits-nintendo-switch-on-october-12-1847734742",
          "publishedOn": "2021-09-23T22:10:00.000Z",
          "wordCount": 428,
          "title": "Disco Elysium's Out On Switch Soon, So Now You've Got No Excuse"
        },
        {
          "id": "1847734623",
          "author": "Zack Zwiezen",
          "description": "Square Enix announced today a new entry in the Final Fantasy franchise, but it might not be what you expect. It’s a racing game called Chocobo GP and it’s out on Switch next year. \nRead more...",
          "link": "https://kotaku.com/final-fantasy-gets-racing-game-in-2022-1847734623",
          "publishedOn": "2021-09-23T22:10:00.000Z",
          "wordCount": 405,
          "title": "Final Fantasy Is Now A Full-On Chocobo Racing Game, Out 2022"
        },
        {
          "id": "1847100703",
          "author": "Lisa Marie Segarra",
          "description": "Nintendo announced  at its September 23 Direct that Animal Crossing: New Horizons will get an update in November and an Animal Crossing Direct in October.\nRead more...",
          "link": "https://kotaku.com/animal-crossing-has-a-direct-in-october-more-free-cont-1847100703",
          "publishedOn": "2021-09-23T22:00:00.000Z",
          "wordCount": 584,
          "title": "Animal Crossing Has October Direct Show, Brewster Confirmed"
        },
        {
          "id": "1847734603",
          "author": "Luke Plunkett",
          "description": "Square Enix’s latest RPG is called Voice Of Cards: The Isle Of Dragon Roars, and is coming out on the Nintendo Switch next month.\n\nRead more...",
          "link": "https://kotaku.com/niers-yoko-taro-is-making-a-card-based-rpg-for-the-nint-1847734603",
          "publishedOn": "2021-09-23T22:00:00.000Z",
          "wordCount": 224,
          "title": "Nier's Yoko Taro Is Making A Card-Based RPG For The Nintendo Switch"
        },
        {
          "id": "1847730060",
          "author": "Sisi Jiang",
          "description": "Nintendo revealed more details about Splatoon 3 at today’s Nintendo Direct, straight from a “squid researcher.”\n\nRead more...",
          "link": "https://kotaku.com/splatoon-3-details-revealed-at-nintendo-direct-1847730060",
          "publishedOn": "2021-09-23T22:00:00.000Z",
          "wordCount": 514,
          "title": "Splatoon 3 Details Revealed at Nintendo Direct"
        },
        {
          "id": "1847734454",
          "author": "Ethan Gach",
          "description": "Loot. Some live by it. Others die by it. It makes the world go round, or at least the worlds of dungeon crawlers like Diablo 2: Resurrected. So why won’t the remaster have a modern loot system? Short answer: it’s more complicated than it sounds.\nRead more...",
          "link": "https://kotaku.com/diablo-2-dev-explains-why-the-loot-system-wasn-t-update-1847734454",
          "publishedOn": "2021-09-23T21:45:00.000Z",
          "wordCount": 623,
          "title": "Diablo 2 Dev Explains Why The Loot System Wasn’t Updated At Launch"
        },
        {
          "id": "1847467401",
          "author": "Kotaku Staff",
          "description": "Let’s get this out of the way: Given all the ~everything~, simply releasing a game in 2021 is nothing short of a miracle. Every single one deserves a round of applause. But some, let’s face it, are better than others. As summer wraps, we thought it’d be fun to shine a light on the games that have excited us, moved us,…\nRead more...",
          "link": "https://kotaku.com/the-best-video-games-of-2021-so-far-1847467401",
          "publishedOn": "2021-09-23T21:00:00.000Z",
          "wordCount": 3560,
          "title": "The Best Video Games Of 2021 So Far"
        },
        {
          "id": "1847732467",
          "author": "Jeremy Winslow",
          "description": "The Game Devs of Color Expo, an event showcasing the diverse talent in games while providing a platform for creators of color, is officially underway. The 6th annual festival runs from September 23-27 and gives way to a host of happenings, from panels and talks to demos and trailers. There’s four days’ worth of stuff,…\nRead more...",
          "link": "https://kotaku.com/game-devs-of-color-expo-is-full-of-great-free-steam-dem-1847732467",
          "publishedOn": "2021-09-23T18:30:00.000Z",
          "wordCount": 483,
          "title": "Game Devs Of Color Expo Is Full Of Great Free Steam Demos, Melanin"
        },
        {
          "id": "1847731730",
          "author": "Isaiah Colbert",
          "description": "While the average game director would have players simply port their saves from the PlayStation 4 to the PlayStation 5 via some unobtrusive menu, Hideo Kojima is built different. No, players who want to play Death Stranding Director’s Cut on PS5 for high framerates and fast load times will have to lace up their boots…\nRead more...",
          "link": "https://kotaku.com/death-stranding-directors-cuts-save-transfer-system-is-1847731730",
          "publishedOn": "2021-09-23T18:00:00.000Z",
          "wordCount": 459,
          "title": "Death Stranding Director's Cut's Save Transfer System Is Kojima At His Best"
        },
        {
          "id": "1847731789",
          "author": "Sisi Jiang",
          "description": "Timberborn is a city builder simulation game with an unusual twist: You’re building a settlement for beavers. \nRead more...",
          "link": "https://kotaku.com/lumberpunk-beaver-city-building-game-becomes-steam-top-1847731789",
          "publishedOn": "2021-09-23T17:30:00.000Z",
          "wordCount": 399,
          "title": "Lumberpunk Beaver City Building Game Becomes Steam Top Seller"
        },
        {
          "id": "1847731501",
          "author": "Ian Walker",
          "description": "According to a listing we can only assume was accidentally pushed live, the next Kirby game is coming to Switch in spring 2022.\nRead more...",
          "link": "https://kotaku.com/nintendo-accidentally-leaks-next-kirby-game-coming-spr-1847731501",
          "publishedOn": "2021-09-23T16:55:00.000Z",
          "wordCount": 426,
          "title": "Nintendo Accidentally Leaks Next Kirby Game, Coming Spring 2022"
        },
        {
          "id": "1847731172",
          "author": "Ethan Gach",
          "description": "Arkane Studio’s latest game is its biggest yet, with esoteric puzzles, cutthroat combat, and an entire loot system all wrapped around a repeating time loop. If Deathloop seems overwhelming at first, that’s because it is.\nRead more...",
          "link": "https://kotaku.com/before-you-start-tips-for-playing-deathloop-1847731172",
          "publishedOn": "2021-09-23T16:30:00.000Z",
          "wordCount": 2456,
          "title": "Before You Start: Tips For Playing Deathloop"
        }
      ]
    },
    {
      "title": "Nintendo Life | Latest Updates",
      "feedUrl": "https://www.nintendolife.com/feeds/latest",
      "siteUrl": "https://www.nintendolife.com/feeds/latest",
      "articles": [
        {
          "id": "https://www.nintendolife.com/#article-121373",
          "author": null,
          "description": "Kirby x Nier! Bayonetta 3 exists! Mario movie! More stuff!\nWell well well, Nintendo sure put on quite a show in its September 2021 Nintendo Direct. Whether you liked it or not is the purpose of this poll, but it sure had some notable reveals, updates and big moments.\n\nRound Up: Here's Everything That Was Revealed In Nintendo Direct September 2021\n\nAs you can see in the round up above it was a rather packed show, and one of Nintendo's longer efforts clocking in at 40 minutes. It perhaps speaks to the strength of the line-up that it's hard to pick just a few key moments; there was a lot going on. We had the announcement of a new tier for Nintendo Switch Online, adding Nintendo 64 and Mega Drive / Genesis games and introducing a couple of neat new controllers; pricing for the subscription update is still under wraps. There was the Mario movie cast. Kirby going back into a large 3D world, that looks like an intriguing and impressive spin for the series. Splatoon 3 is looking like more wonderful Splatoon gaming. Brewster.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/poll_what_did_you_think_of_yesterdays_nintendo_direct",
          "publishedOn": "2021-09-24T12:00:00.000Z",
          "wordCount": 3209,
          "title": "Poll: What Did You Think Of Yesterday's Nintendo Direct?"
        },
        {
          "id": "https://www.nintendolife.com/#article-121381",
          "author": null,
          "description": "But we'll have to wait to hear the voice.\nOne of the biggest surprises from yesterday's Nintendo Direct wasn't even a game at all. During a special segment of the show, Nintendo legend Shigeru Miyamoto took to the stage to announce new details regarding the upcoming Super Mario movie, including our first look at the English-language cast.\nFan reaction to the casting has been mixed so far, although pleasing an entire fanbase as large as Mario's would have been impossible no matter who was picked, and it's the lead role which has turned the most heads so far.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/dreams_come_true_chris_pratt_talks_about_his_new_role_as_super_mario",
          "publishedOn": "2021-09-24T11:30:00.000Z",
          "wordCount": 3329,
          "title": "\"Dreams Come True\": Chris Pratt Talks About His New Role As Super Mario"
        },
        {
          "id": "https://www.nintendolife.com/#article-118174",
          "author": null,
          "description": "Update: In addition to the free gift bundle, you'll be entered into a prize draw.\n\nUpdate (Fri 24th Sep, 2021 12:30 BST): Anybody who pre-orders Metroid Dread or any bundle featuring the game from My Nintendo Store UK will now automatically be entered into a prize draw to win one of 10 Metroid Dread accessories bundles which, as you can see above, look to include a bespoke swish wired controller and Switch carry case emblazoned with Samus in her Dread guise.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/deals_my_nintendo_store_uk_adds_an_accessories_bundle_prize_draw_for_anyone_pre-ordering_metroid_dread",
          "publishedOn": "2021-09-24T11:15:00.000Z",
          "wordCount": 2983,
          "title": "Deals: My Nintendo Store UK Adds An Accessories Bundle Prize Draw For Anyone Pre-Ordering Metroid Dread"
        },
        {
          "id": "https://www.nintendolife.com/#article-121378",
          "author": null,
          "description": "\"It’s been a long four years for us too\".\nPinch yourselves – yes, we really did get treated to the first ever look at Bayonetta 3 yesterday. It's real. It has actual gameplay. And relax...\nIt's no secret that Bayonetta 3's grand reveal has been a long time coming – the fact that the game was first announced almost four years ago was even apologetically addressed during yesterday's Nintendo Direct – so finally seeing it in action was very welcome indeed.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/platinumgames_hideki_kamiya_bayonetta_3_will_exceed_all_your_expectations",
          "publishedOn": "2021-09-24T11:00:00.000Z",
          "wordCount": 1989,
          "title": "PlatinumGames' Hideki Kamiya: Bayonetta 3 Will 'Exceed All Your Expectations'"
        },
        {
          "id": "https://www.nintendolife.com/#article-121375",
          "author": null,
          "description": "Playable for anyone with a sub and a JP Nintendo Account.\nThe announcement during the recent Nintendo Direct that N64 games are coming to Nintendo Switch Online's new 'Expansion Pack' tier — with games like Banjo-Kazooie and F-Zero X soon to be playable on Switch — got 64-bit retro gamers excited. Japanese gamers have a couple of extra reasons to look forward to this new library landing from October, though.\nRegional exclusive games are nothing new on the Nintendo Switch Online service, of course, and Japanese subscribers will be getting Custom Robo and Custom Robo V2 in addition to the announced lineup in the West.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/n64_gems_custom_robo_and_its_sequel_are_coming_to_nintendo_switch_online_in_japan",
          "publishedOn": "2021-09-24T10:30:00.000Z",
          "wordCount": 1479,
          "title": "N64 Gems Custom Robo And Its Sequel Are Coming To Nintendo Switch Online In Japan"
        },
        {
          "id": "https://www.nintendolife.com/#article-121377",
          "author": null,
          "description": "You won't BELIEVE what verse 2 looks like today.\nAs part of yesterday's Nintendo Direct, we were treated to a fresh look at Splatoon 3, the latest instalment in Nintendo's squid-kid shooter franchise that's set to launch next year.\nIt all looked rather exciting as you'd expect (catch up on it here if you missed it), but the new gameplay footage wasn't the only thing to come out of yesterday's show. Supporting it in style was what appeared to be a brand new song, pleasing our grateful earholes as we soaked up the new action on-screen – but was it really new? And how can we listen to it on repeat?\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/random_heres_some_clickbait_-_no_really_splatoon_3s_latest_song_is_called_clickbait",
          "publishedOn": "2021-09-24T10:15:00.000Z",
          "wordCount": 887,
          "title": "Random: Here's Some Clickbait - No Really, Splatoon 3's Latest Song Is Called 'Clickbait'"
        },
        {
          "id": "https://www.nintendolife.com/#article-121370",
          "author": null,
          "description": "And rewatch the full show here!\nThe latest Nintendo Direct came and went with a bang yesterday, showing off plenty of footage for games we know about, footage for games we didn't know about, and a fair few surprises that we're still trying to wrap our heads around.\nBelow, we've put together a list of all the show's highlights as well as the full show itself – ideal if you missed it the first time around.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/round_up_heres_everything_that_was_revealed_in_nintendo_direct_september_2021",
          "publishedOn": "2021-09-24T09:30:00.000Z",
          "wordCount": 5141,
          "title": "Round Up: Here's Everything That Was Revealed In Nintendo Direct September 2021"
        },
        {
          "id": "https://www.nintendolife.com/#article-121369",
          "author": null,
          "description": "Just two weeks to go!\nWith Metroid Dread's 8th October release date looming ever closer, it was hardly surprising to see the game featured in yesterday's Nintendo Direct – hype for the title has been sustained by not one, but two brand new trailers that aired during the show.\nAs expected, the game still looks like it'll be an incredible outing for our favourite bounty hunter. \"What is the dread that waits for Samus? Stranded on Planet ZDR, when the E.M.M.I. are approaching, Samus’ only option is to survive.\" Chills.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/nintendo_direct_offers_up_even_more_metroid_dread_footage_and_its_still_looking_epic",
          "publishedOn": "2021-09-24T08:45:00.000Z",
          "wordCount": 1249,
          "title": "Nintendo Direct Offers Up Even More Metroid Dread Footage, And It's Still Looking Epic"
        },
        {
          "id": "https://www.nintendolife.com/#article-121365",
          "author": null,
          "description": "The \"superior\" gamepad.\nOne of the highlights of the latest Nintendo Direct was the announcement Nintendo 64 and Sega Genesis (Mega Drive) games will be coming to the Switch Online service next month as an 'Expansion Pack' service.\nThis includes the addition of new (but old) controllers that are now wireless. There's a Nintendo 64 controller and a three-button Sega Genesis controller. If you're located in Japan though and happen to be an NSO member, it seems you'll actually be able to get your hands on the six-button version of Sega's wireless GamePad.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/japans_switch_online_service_gets_the_six-button_sega_mega_drive_controller",
          "publishedOn": "2021-09-24T03:45:00.000Z",
          "wordCount": 2324,
          "title": "Japan's Switch Online Service Gets The Six-Button Sega Mega Drive Controller"
        },
        {
          "id": "https://www.nintendolife.com/#article-121363",
          "author": null,
          "description": "Landing on Switch next month.\n\nNext month is looking pretty busy on the gaming front, and if the likes of Metroid Dread and the Switch OLED model isn't already enough, towards the end of October we're getting Mario Party Superstars.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/nintendo_reveals_three_more_classic_boards_for_mario_party_superstars",
          "publishedOn": "2021-09-24T01:15:00.000Z",
          "wordCount": 2195,
          "title": "Nintendo Reveals Three More Classic Boards For Mario Party Superstars"
        },
        {
          "id": "https://www.nintendolife.com/#article-121360",
          "author": null,
          "description": "Bayonetta's great and all, but B-K's back baby!\nYou could be forgiven for missing the biggest news buried in the latest Nintendo Direct — the real megaton that turned it into the finest 40-minute presentation Nintendo has ever assembled.\nNo, we're not talking about a gameplay reveal for the elusive Bayonetta 3 or the long-awaited return of Brewster to Animal Crossing: New Horizons. Nope, hidden in the part where upcoming N64 games planned for the expanded Nintendo Switch Online membership were briefly mentioned was a little 3D platformer by Rare: Banjo-Kazooie.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/banjo-kazooie_is_coming_home_to_a_nintendo_console_via_switch_online",
          "publishedOn": "2021-09-24T01:00:00.000Z",
          "wordCount": 4917,
          "title": "Banjo-Kazooie Is 'Coming Home' To A Nintendo Console Via Switch Online"
        },
        {
          "id": "https://www.nintendolife.com/#article-121359",
          "author": null,
          "description": "Mickey! Minnie! Donald Duck! It's basically Kingdom Hearts.\nOne of the more surprising reveals of the Nintendo Direct, but one that probably not many people particularly cared about, was the re-release of Disney Magical World 2 for Switch.\nOriginally, the game came out for 3DS as a sequel to the popular first game, also on 3DS, in 2016. It's basically a Disneyfied, pared-back version of Animal Crossing, in which you run a café and have to collect and craft materials to improve your menu, your outfits, and the decor. So, imagine Animal Crossing, but everyone in your town is a celebrity from your childhood, and there are light RPG elements, and that's basically Disney Magical World.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/disney_magical_world_2_is_getting_re-released_for_the_switch",
          "publishedOn": "2021-09-24T00:30:00.000Z",
          "wordCount": 1859,
          "title": "Disney Magical World 2 Is Getting Re-Released For The Switch"
        },
        {
          "id": "https://www.nintendolife.com/#article-121361",
          "author": null,
          "description": "Download it now!\n\nGuess what? There's more free content available now for Mario Golf: Super Rush on the Nintendo Switch.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/the_second_free_update_for_mario_golf_super_rush_swings_onto_switch_today",
          "publishedOn": "2021-09-24T00:15:00.000Z",
          "wordCount": 1708,
          "title": "The 'Second Free Update' For Mario Golf: Super Rush Swings Onto Switch Today"
        },
        {
          "id": "https://www.nintendolife.com/#article-121357",
          "author": null,
          "description": "'Return of the Mammalians' is a big theme.\nThough it currently has a vague 2022 release window, Splatoon 3 had a notable appearance in the latest Nintendo Direct, with a look at the classic 4v4 Turf War mode and a sneak peak at the story content.\nIn terms of the Turf War clips we can see a new arena in the environment, some interesting weapons and - most intriguingly - a crab-like mech.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/splatoon_3_gets_a_new_trailer_story_footage_and_has_a_crab_mech",
          "publishedOn": "2021-09-24T00:00:00.000Z",
          "wordCount": 1775,
          "title": "Splatoon 3 Gets A New Trailer, Story Footage And Has A Crab Mech"
        },
        {
          "id": "https://www.nintendolife.com/#article-121358",
          "author": null,
          "description": "Use the Force this November.\nStar Wars fans got quite surprised during the latest Nintendo Direct - with Aspyr lifting the lid on its Switch port of BioWare's iconic RPG, Star Wars: Knights of the Old Republic. It'll be arriving on 11th November.\n\n\"A beloved Star Wars game is coming to Nintendo Switch! Blast off to captivating planets and join forces with Jedi, droids and outcasts in this blend of action, role-playing and adventure. STAR WARS: Knights of the Old Republic launches for Nintendo Switch on Nov. 11. Pre-orders for the game start later today!\"\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/aspyr_is_bringing_the_classic_bioware_rpg_star_wars_knights_of_the_old_republic_to_switch",
          "publishedOn": "2021-09-23T23:55:00.000Z",
          "wordCount": 3127,
          "title": "Aspyr Is Bringing The Classic BioWare RPG Star Wars: Knights Of The Old Republic To Switch"
        },
        {
          "id": "https://www.nintendolife.com/#article-121356",
          "author": null,
          "description": "'Voice of Cards: The Isle Dragon Roars'.\nIn a shockingly weird twist during today's Nintendo Direct, Kirby is now in the world of NieR Automata (sort of) and NieR Automata developer Yoko Taro is making... a card game?\nYes, this new Yoko-Tarot game is called Voice of Cards: The Isle Dragon Roars, and Square Enix has been teasing it for a while. Finally, we know what it is... except we also kind of don't.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/yoko_taros_new_game_is_a_swords-and-sorcery_strategy_rpg_with_cards",
          "publishedOn": "2021-09-23T23:45:00.000Z",
          "wordCount": 1699,
          "title": "Yoko Taro's New Game Is A Swords-And-Sorcery Strategy RPG With Cards"
        },
        {
          "id": "https://www.nintendolife.com/#article-121341",
          "author": null,
          "description": "Defend Hyrule as Purah & Robbie.\n\nThere was some Zelda coverage in the latest Nintendo Direct, and apart from the reveal about Ocarina of Time coming to Switch Online, the main chunk of it was focused on the second wave of Hyrule Warriors: Age of Calamity Expansion DLC (Guardian of Remembrance).\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/hyrule_warriors_age_of_calamity_wave_2_dlc_arrives_on_switch_next_month",
          "publishedOn": "2021-09-23T23:40:00.000Z",
          "wordCount": 1419,
          "title": "Hyrule Warriors: Age Of Calamity Wave 2 DLC Arrives On Switch Next Month"
        },
        {
          "id": "https://www.nintendolife.com/#article-121355",
          "author": null,
          "description": "With changes influenced by demo surveys.\nWell, the team that brought us Octopath Traveler likes being literal with its game names, and so the final name of Triangle Strategy after its rather marvellous demo earlier in the year is... Triangle Strategy. Name aside, it's looking great and arrives on 4th March 2022.\nThe trailer above gives a rather flashy introduction to the game, and we think this tactics title is looking pretty darn nice. In the Nintendo Direct broadcast it was explained that surveys from the demo earlier this year led to changes in the flow of gameplay, user interface, camera controls and more besides.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/triangle_strategy_has_a_silly_name_but_looks_great_out_in_march",
          "publishedOn": "2021-09-23T23:35:00.000Z",
          "wordCount": 2189,
          "title": "Triangle Strategy Has A Silly Name But Looks Great, Out In March"
        },
        {
          "id": "https://www.nintendolife.com/#article-121352",
          "author": null,
          "description": "Racing to the finish in 2022.\nSquare Enix's rumoured Chocobo Racing sequel has been revealed, and it really looks like Mario Kart.\nChocobo GP launches exclusively on Switch in 2022 and features a cast of Square Enix characters power-sliding around circuits that wouldn't look out of place in Mario Kart 8. Mario Kart's signature slide-boost is also present, but then again, it's been in practically every kart-based racing game for the past decade, so we can't grumble too much.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/switch_exclusive_chocobo_gp_sure_wants_to_be_mario_kart_doesnt_it",
          "publishedOn": "2021-09-23T23:30:00.000Z",
          "wordCount": 3262,
          "title": "Switch Exclusive Chocobo GP Sure Wants To Be Mario Kart, Doesn't It?"
        },
        {
          "id": "https://www.nintendolife.com/#article-120989",
          "author": null,
          "description": "Following on from last week's surprise reveal.\nUpdate : During the latest Nintendo Direct presentation, Deltarune's second chapter was confirmed for the Switch. You should be able to update your existing copy right now. Enjoy!\n\nUpdate : Deltarune Chapter 2 is now available on PC. It seems Nintendo Switch owners will have to wait a little bit longer. On the plus side, creator Toby Fox has confirmed the second chapter has been released for free:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/deltarune_chapter_2_is_available_now_on_switch_as_a_free_update",
          "publishedOn": "2021-09-23T23:25:00.000Z",
          "wordCount": 3570,
          "title": "Deltarune Chapter 2 Is Available Now On Switch As A Free Update"
        },
        {
          "id": "https://www.nintendolife.com/#article-121326",
          "author": null,
          "description": "Well, it's better than nothing.\nUpdate:\nDuring today's Nintendo Direct there was an appearance for Dying Light Platinum Edition, with a 19th October release date confirmed.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/dying_light_platinum_edition_dated_dying_light_2_stay_human_-_cloud_version_confirmed",
          "publishedOn": "2021-09-23T23:20:00.000Z",
          "wordCount": 2262,
          "title": "Dying Light Platinum Edition Dated, Dying Light 2: Stay Human - Cloud Version Confirmed"
        },
        {
          "id": "https://www.nintendolife.com/#article-121334",
          "author": null,
          "description": "Slated for 2022.\n:\nWell, who could have guessed: there's a new Kirby game in the works, and it's called Kirby and the Forgotten Land. It's a 3D open world game set in a post-apocalyptic city, with Super Mario Odyssey-meets-The Last of Us vibes.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/nintendo_officially_reveals_kirby_and_the_forgotten_land",
          "publishedOn": "2021-09-23T23:15:00.000Z",
          "wordCount": 10686,
          "title": "Nintendo Officially Reveals Kirby And The Forgotten Land"
        },
        {
          "id": "https://www.nintendolife.com/#article-121351",
          "author": null,
          "description": "November can't come soon enough.\nNintendo has announced in today's Nintendo Direct that new content is finally on the way for Animal Crossing: New Horizons, including the return of caffeine purveyor and fan-favourite character Brewster.\nAn Animal Crossing Direct was announced for October (exact date TBA) which will feature more details about the upcoming free content which is scheduled for sometime in November 2021.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/theres_an_animal_crossing_new_horizons_update_coming_soon_and_brewsters_back",
          "publishedOn": "2021-09-23T23:10:00.000Z",
          "wordCount": 4316,
          "title": "There's An Animal Crossing: New Horizons Update Coming Soon, And Brewster's Back"
        },
        {
          "id": "https://www.nintendolife.com/#article-121349",
          "author": null,
          "description": "Chris Pratt! Jack Black! Seth Rogan! Charles Martinet!\nThe upcoming Super Mario movie now has a solid release date.\nAs was revealed during today's Nintendo Direct, the movie will launch in North America on the 21st of December, 2022. We also got our first look at the cast, and there are some big names involved.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/the_super_mario_movies_release_date_and_cast_are_revealed",
          "publishedOn": "2021-09-23T23:05:00.000Z",
          "wordCount": 8182,
          "title": "The Super Mario Movie's Release Date And Cast Are Revealed"
        },
        {
          "id": "https://www.nintendolife.com/#article-121350",
          "author": null,
          "description": "Arriving alongside the NSO 'Expansion Pack'.\n\nAlongside the announcement of the Nintendo 64 and Sega Genesis 'Expansion Pack' for the Switch Online service, Nintendo's Yoshiaki Koizumi revealed two new (but old) controllers.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/nintendo_is_releasing_n64_and_sega_genesis_wireless_controllers",
          "publishedOn": "2021-09-23T23:01:00.000Z",
          "wordCount": 3847,
          "title": "Nintendo Is Releasing N64 And Sega Genesis Wireless Controllers"
        }
      ]
    },
    {
      "title": "Rock Paper Shotgun Latest Articles Feed",
      "feedUrl": "https://www.rockpapershotgun.com/feed",
      "siteUrl": "https://www.rockpapershotgun.com/feed",
      "articles": [
        {
          "id": "https://www.rockpapershotgun.com/minecraft-tower-ideas",
          "author": "Hayden Hefford",
          "description": "Looking for a cool tower to build in Minecraft? This list is filled with exciting tower ideas that you can try out in Minecraft, with everything from a simple base to a magical Wizard tower.\nTake a look through all of these suggestions to get inspired, or follow along with one of the videos and get building right now!\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-tower-ideas",
          "publishedOn": "2021-09-24T11:56:37.000Z",
          "wordCount": 1324,
          "title": "7 Minecraft tower ideas to build in 1.17"
        },
        {
          "id": "https://www.rockpapershotgun.com/valheim-crystal-shards",
          "author": "Rebecca Jones",
          "description": "Where do you get Crystal Shards in Valheim, and what are they used for? Crystal has existed as a resource in Valheim for a while, but like many crafting materials in this Early Access cult hit, it's only recently been given a use. The Hearth & Home update has added Crystal Battleaxe and Crystal Wall recipes, and now this previously purely decorative resource is in high demand.\nRead more",
          "link": "https://www.rockpapershotgun.com/valheim-crystal-shards",
          "publishedOn": "2021-09-24T11:39:34.000Z",
          "wordCount": 1203,
          "title": "Valheim Crystal: how to get crafting materials for the Crystal Battleaxe and Crystal Wall"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-incense-pots-puzzle-toshis-fear",
          "author": "Ollie Toms",
          "description": "Wondering how to solve the Incense Pots puzzle in Kena: Bridge Of Spirits? If you've followed the Mask Maker path as part of the Toshi's Fear quest and you're stuck on these infernal Incense Pots, you've come to exactly the right place. There's not much to say here, so let's jump right into our walkthrough of how to solve this particular puzzle in Kena: Bridge Of Spirits.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-incense-pots-puzzle-toshis-fear",
          "publishedOn": "2021-09-24T11:34:27.000Z",
          "wordCount": 1052,
          "title": "Kena: Bridge Of Spirits Incense Pots puzzle"
        },
        {
          "id": "https://www.rockpapershotgun.com/valheim-obliterator-thunder-stones",
          "author": "Rebecca Jones",
          "description": "How do you craft and use the Obliterator in Valheim? The Obliterator was added to Valheim with the Hearth & Home update, and exists to address a recurring problem experienced by Valheim players in older iterations of the Early Access smash hit. Previously, there was no way to actually get rid of items you didn't need — which could include a surplus of crafting materials and even trophies made from the body parts of slain enemies. The Obliterator gives you the option to neatly dispose of all the inventory junk you don't want to display or store.\n Read more",
          "link": "https://www.rockpapershotgun.com/valheim-obliterator-thunder-stones",
          "publishedOn": "2021-09-24T10:37:56.000Z",
          "wordCount": 1092,
          "title": "Valheim Obliterator: how to craft and use an Obliterator"
        },
        {
          "id": "https://www.rockpapershotgun.com/monster-hunter-rise-announces-sunbreak-expansion-before-even-hitting-pc",
          "author": "Alice O'Connor",
          "description": "Though Monster Hunter Rise isn't even out on PC for months yet, Capcom have announced an expansion is coming our way. During last night's Nintendo Direct stream they revealed Monter Hunter Rise: Sunbreak, which will launch simultaneously on Switch and PC in summer 2022. Hey, at least that means while consoleers had to wait over a year for the expansion, we'll have it after only a few months. Have a peek in the announcement trailer.\nRead more",
          "link": "https://www.rockpapershotgun.com/monster-hunter-rise-announces-sunbreak-expansion-before-even-hitting-pc",
          "publishedOn": "2021-09-24T10:37:31.000Z",
          "wordCount": 803,
          "title": "Monster Hunter Rise announces Sunbreak expansion before even hitting PC"
        },
        {
          "id": "https://www.rockpapershotgun.com/voice-of-cards-the-isle-dragon-roars-is-yoko-taros-new-card-based-rpg",
          "author": "Imogen Beckhelling",
          "description": "Nier director Yoko Taro is making a new role-playing game in which everything is depicted through cards, and somehow it's not called Yoko Tarot. Story? There are cards for that. Combat? Turn-based card battles, of course. Travelling through the world? Flip over some cards, see what you find! It's called Voice Of Cards: The Isle Dragon Roars, and it's set to release this October. On top of that, a demo will be available later today if you fancy trying it out. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/voice-of-cards-the-isle-dragon-roars-is-yoko-taros-new-card-based-rpg",
          "publishedOn": "2021-09-24T10:07:35.000Z",
          "wordCount": 980,
          "title": "Voice Of Cards: The Isle Dragon Roars is Yoko Taro's new card-based RPG"
        },
        {
          "id": "https://www.rockpapershotgun.com/warhammer-40000-space-marine-adds-dlc-in-surprise-anniversary-edition",
          "author": "Alice O'Connor",
          "description": "Rise, brothers, to venerate Warhammer 40,000: Space Marine as it celebrates its tenth birthday this month. Relic Entertainment and Sega have a surprise for us all too, turning the third-person ork-smasher into an 'Anniversary Edition' which includes all the DLC as well as bonuses like the soundtrack. That's all for free, which is nice.\nRead more",
          "link": "https://www.rockpapershotgun.com/warhammer-40000-space-marine-adds-dlc-in-surprise-anniversary-edition",
          "publishedOn": "2021-09-24T09:43:46.000Z",
          "wordCount": 884,
          "title": "Warhammer 40,000: Space Marine adds DLC in surprise 'Anniversary Edition'"
        },
        {
          "id": "https://www.rockpapershotgun.com/steam-deck-compatibility-conundrum-partially-solved-with-easy-anti-cheat-support",
          "author": "James Archer",
          "description": "The Steam Deck has just broken through a major compatibility barrier: one that would have made it difficult for some of Steam’s most-played multiplayer games to properly function on the Valve handheld. Gabe and co. have Epic to thank for this one, though, as the latter’s Easy Anti-Cheat (EAC) tech is now extending support to Linux and it Wine and Proton compatibility layers. The same layers, you may recall, that the Steam Deck relies on to run games without native Linux ports. In other words, games with multiplayer components that wouldn’t have worked on the Steam Deck - because their use of EAC precluded Linux/Wine/Proton compatibility - should, in theory, be able to run in full.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/steam-deck-compatibility-conundrum-partially-solved-with-easy-anti-cheat-support",
          "publishedOn": "2021-09-24T09:17:41.000Z",
          "wordCount": 990,
          "title": "Steam Deck compatibility conundrum partially solved with Easy Anti-Cheat support"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-slimes-how-to-find-slimes-make-slime-farm",
          "author": "Hayden Hefford",
          "description": "Want to know how to find Slimes in Minecraft? Slimes can vary in size from annoying little blobs to giant monstrosities, but there’s one thing they all have in common. They all drop Slimeballs, which are extremely useful in Minecraft.\nThis guide will take you through everything that you need to know about Slimes, including how to find them, what you can use Slimeballs for, and how to make your own Slime farm.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-slimes-how-to-find-slimes-make-slime-farm",
          "publishedOn": "2021-09-24T08:49:34.000Z",
          "wordCount": 1573,
          "title": "How to find Slimes and make a Slime Farm in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/fuga-memories-of-steel-is-a-strategy-rpg-with-a-giant-child-powered-tank",
          "author": "Graham Smith",
          "description": "Fuga: Melodies Of Steel is set during an anthropomorphic animal anime World War 2 in which your parents have been taken by the dog Nazis. Still with me? You and your fellow cat children find Howl's Moving Tank in a cave and set about getting your families back, with turn-based, RPG battles.\r\n\nYou also discover at the end of the tutorial that your giant angry house has a \"Soul Cannon\", which is a gun that only fires if you feed it the soul - and permanently kill - one of the children.\r\n\nStill with me?\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/fuga-memories-of-steel-is-a-strategy-rpg-with-a-giant-child-powered-tank",
          "publishedOn": "2021-09-23T23:05:15.000Z",
          "wordCount": 902,
          "title": "Fuga: Melodies Of Steel is a strategy RPG with a giant child-powered tank"
        },
        {
          "id": "https://www.rockpapershotgun.com/halo-infinites-multiplayer-test-will-go-ahead-as-planned",
          "author": "Graham Smith",
          "description": "Breaking news: everything is normal and fine. Yesterday Halo Infinite developers 343 Industries mentioned during a livestream that they might need to delay this weekend's beta. Today they confirmed that's not the case, and posted an overview of what to expect.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/halo-infinites-multiplayer-test-will-go-ahead-as-planned",
          "publishedOn": "2021-09-23T21:58:40.000Z",
          "wordCount": 936,
          "title": "Halo Infinite's multiplayer test will go ahead as planned"
        },
        {
          "id": "https://www.rockpapershotgun.com/csgos-operation-riptide-revives-the-riot-shield-and-makes-a-major-change-to-dust2",
          "author": "Graham Smith",
          "description": "The riot shield was probably the most divisive item ever added to Counter-Strike - and now it's back. New update Operation Riptide, out now, introduces the defensive item to Counter-Strike: Global Offensive's casual mode, alongside major tweaks to Dust2, new missions, shorter matches, and private matchmaking queues.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/csgos-operation-riptide-revives-the-riot-shield-and-makes-a-major-change-to-dust2",
          "publishedOn": "2021-09-23T20:52:02.000Z",
          "wordCount": 1008,
          "title": "CS:GO's Operation Riptide revives the riot shield"
        },
        {
          "id": "https://www.rockpapershotgun.com/diablo-2-resurrected-characters-keep-disappearing-among-many-launch-issues",
          "author": "Graham Smith",
          "description": "Diablo 2: Resurrected launched earlier today, offering players the chance to relive the classic hack-and-slasher. But why recreate the experience of one Diablo game when you could recreate the experience of two? Resurrected is also experiencing a bunch of launch issues related to its online mode, just like Diablo 3 before it.\r\n\nThose issues include players being unable to see their existing characters, create new characters, or launch the game. Some might say essential features.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/diablo-2-resurrected-characters-keep-disappearing-among-many-launch-issues",
          "publishedOn": "2021-09-23T19:24:31.000Z",
          "wordCount": 942,
          "title": "Diablo 2: Resurrected characters keep disappearing, among many launch issues"
        },
        {
          "id": "https://www.rockpapershotgun.com/diablo-2-resurrected-hotkeys-are-still-a-goddamn-mess",
          "author": "Alice Bell",
          "description": "Terrible news continues to pour out of Blizzard like pus from of a festering wound around a splinter you forgot about and left for way too long. You should really get that looked at. Still, they must be drawing some comfort from the fact that Diablo II: Resurrected is out today, one of Blizz's most beloved games of all time.\nNaturally, a lot of people will be excited for the remastered version. But if my tone is more immediately aggro than the last time I wrote about Diablerrected, that's because I was previously playing the beta through the rose-tinted haze of this game being very important to me and a big part of my childhood, and bonding with my older brother, and so on. This time, I have been playing the final version for several hours, and am cross.\nRead more",
          "link": "https://www.rockpapershotgun.com/diablo-2-resurrected-hotkeys-are-still-a-goddamn-mess",
          "publishedOn": "2021-09-23T16:30:00.000Z",
          "wordCount": 1376,
          "title": "Diablo 2: Resurrected's hotkeys are still a goddamn mess"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-rally-point-putting-mech-engineer-on-trial-and-error",
          "author": "Sin Vega",
          "description": "When you've played a lot of games, or seen a lot of films, or probably eaten at a lot of restaurants or generally oversaturated your life with one subject, it's easy to start making rules and codes for How It Should Be. I given a lot of games a hard time for being opaque and failing to explain themselves. And yet here I am, finally writing about Mech Engineer after watching and playing it for nine months, waiting for it to hit the point where I can almost, sort of, not exactly recommend it... but share my fascination with it.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-rally-point-putting-mech-engineer-on-trial-and-error",
          "publishedOn": "2021-09-23T16:05:50.000Z",
          "wordCount": 2237,
          "title": "The Rally Point: Putting Mech Engineer on trial (and error)"
        },
        {
          "id": "https://www.rockpapershotgun.com/call-of-duty-vanguard-will-sadly-fix-dognados",
          "author": "Alice O'Connor",
          "description": "The primary function of ragdoll physics in video games, everyone knows, is to freak out and make people laugh. Everyone knows this. The technology was created explicitly to bring a subversive touch of merry mayhem to po-faced murdergames. Everyone knows this. But developers are wary of overdoing it or openly acknowledging this fact which everyone knows. This is why, sadly, Call Of Duty: Vanguard will indeed 'fix' the 'bug' which could make attack dogs turn into a giant maelstrom of limbs, teeth, and mashing meat noises, a phenomenom known as the 'dognado'. Tragic.\nRead more",
          "link": "https://www.rockpapershotgun.com/call-of-duty-vanguard-will-sadly-fix-dognados",
          "publishedOn": "2021-09-23T15:50:50.000Z",
          "wordCount": 872,
          "title": "Call Of Duty: Vanguard will, sadly, fix dognados"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-to-set-up-two-monitors",
          "author": "James Archer",
          "description": "It’s funny to think how different the use cases are for setting up two monitors for your gaming PC, compared to setting up three. A trio of displays lets you play in ultrawide with a wraparound effect that even most purpose-built ultrawide monitors can’t match, but while you can configure a dual-monitor setup to run games across displays, it doesn’t make nearly as much sense. With the borders of each screen running straight down the middle, most of the best ultrawide PC games would be nigh-unplayable. Still! If you can budget for it, two remains better than one. It’s an expanded but focused setup for when you’re playing a full-screen game but also want a browser tab, video, or streaming controls visible at the same time.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/how-to-set-up-two-monitors",
          "publishedOn": "2021-09-23T15:23:38.000Z",
          "wordCount": 1553,
          "title": "How to set up two monitors"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-diablo-2-resurrected-classes-and-builds",
          "author": "Charlie Biggerstaff",
          "description": "Looking for the best classes and builds in Diablo 2: Resurrected? The shiny new remaster is finally here, but the gameplay of Diablo 2: Resurrected will be very familiar to veterans. If you’re playing for the first time, however, the game’s complex character progression can seem overwhelming. The foundations of your experience are your choice of class, and the skill(s) you build around on that class. Each of Diablo 2’s seven classes features multiple talent trees that grant you new abilities and define how you approach the game.\nIf you’re planning to play on Hardcore mode or push deep into Hell difficulty, you will want a quality build. Blizzard has not made balance adjustments to Diablo 2: Resurrected, so the long-established meta still holds in the remaster. Prepare for Hell with our guide to the best classes and builds in Diablo 2: Resurrected.\nRead more",
          "link": "https://www.rockpapershotgun.com/best-diablo-2-resurrected-classes-and-builds",
          "publishedOn": "2021-09-23T15:20:53.000Z",
          "wordCount": 2532,
          "title": "Best Diablo 2: Resurrected classes and builds"
        },
        {
          "id": "https://www.rockpapershotgun.com/diablo-2-resurrected-runes-runewords",
          "author": "Charlie Biggerstaff",
          "description": "Trying to wrap your head around Runes in Diablo 2: Resurrected? Runes are the cornerstone of Diablo 2’s gear system. As there are no balance changes in Diablo 2: Resurrected, longtime players will be familiar. If you’re new, however, this system will look entirely unfamiliar, even if you’ve played Diablo 3 or Path of Exile. There’s nothing quite like Diablo 2’s Rune system in the ARPG genre. If you’re having trouble wrapping your head around the quirks of Runes and Runewords, we’re here to help.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/diablo-2-resurrected-runes-runewords",
          "publishedOn": "2021-09-23T15:20:49.000Z",
          "wordCount": 2165,
          "title": "Diablo 2: Resurrected Runes and Runewords"
        },
        {
          "id": "https://www.rockpapershotgun.com/diablo-2-resurrected-farming-level-85",
          "author": "Charlie Biggerstaff",
          "description": "Looking for the best farming spots in Diablo 2? An ARPG would be nothing without a grind. The grind in Diablo 2 is the foundation of the genre’s last 20 years. The genre-defining classic has seen very few changes for the remastered version, Diablo 2: Resurrected, so veterans of the original will have their strategies in place. If you’re a new player looking to optimize your character after beating the game though, you’ll need to know where to farm your gear. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/diablo-2-resurrected-farming-level-85",
          "publishedOn": "2021-09-23T15:20:45.000Z",
          "wordCount": 1316,
          "title": "Diablo 2: Resurrected farming spots"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-electronic-wireless-show-episode-157-the-best-animal-companions-in-games-special",
          "author": "Alice Bell",
          "description": "This week on The Electronic Wireless Show podcast I was inspired by the extremely cute little monsters the Rot, who are you besties in Kena: Bridge Of Spirits, to ask Matthew and Nate about their favourite animal companions in video games. You will probably be able to predict some of their answers. Others, not so much.\nA big digression about trains and commuter rage this week, as well as a shocking update from Matthew re. the farewell fizzy drink tour. But most exciting is that the Cavern Of Lies is replaced this week by a Cavern Of Announcements! Yes, we have very special news indeed, and you have to listen to at least two thirds of the podcast to find out what it is. But it is genuinely incredible.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-electronic-wireless-show-episode-157-the-best-animal-companions-in-games-special",
          "publishedOn": "2021-09-23T15:00:00.000Z",
          "wordCount": 895,
          "title": "EWS podcast episode 157: the best animal companions special"
        },
        {
          "id": "https://www.rockpapershotgun.com/valheim-tar-pits",
          "author": "Rebecca Jones",
          "description": "Where can you find Tar Pits in Valheim? Tar is a new resource introduced in Valheim's Hearth & Home update. It's a versatile crafting resource that you'll need before you can make many of the update's new items, including Darkwood furniture and building materials, Raven and Wolf Adornments, and — last but never least — the hot tub.\nRead more",
          "link": "https://www.rockpapershotgun.com/valheim-tar-pits",
          "publishedOn": "2021-09-23T14:42:51.000Z",
          "wordCount": 1151,
          "title": "Valheim Tar: how to find Tar Pits"
        },
        {
          "id": "https://www.rockpapershotgun.com/sea-of-thieves-explores-the-sunken-kingdom-in-new-season-today",
          "author": "Alice O'Connor",
          "description": "A new Sea Of Thieves content update heralds the start of a new season today, encouraging pirates to plunge overboard and explore the beautiful halls and mysteries of the Sunken Kingdom. All sorts of coral-y PvE surprises await, with Shrines to quietly explore and Treasures to plunder by force. As beautiful as the game's water is from above, I'm very keen to see more from below.\nRead more",
          "link": "https://www.rockpapershotgun.com/sea-of-thieves-explores-the-sunken-kingdom-in-new-season-today",
          "publishedOn": "2021-09-23T14:11:43.000Z",
          "wordCount": 952,
          "title": "Sea Of Thieves explores the Sunken Kingdom in new season today"
        },
        {
          "id": "https://www.rockpapershotgun.com/chorus-is-an-exhilarating-space-combat-shooter-with-a-rhythm-all-its-own",
          "author": "Katharine Castle",
          "description": "Ever since Chorus first broke out of hyperspace during Microsoft's Xbox Series X showcase last year, Fishlabs' enigmatic space shooter has been a tricky thing to pin down. The first trailer gave us a taste of its high speed combat and third-person battles, but its deep, ominous narration, hints of a mysterious cosmic power, and that final image of a planet being sucked into a black hole almost looked like it was verging into horror territory rather than plain sci-fi. Having now played around an hour of Chorus, I can safely say it's very much a pure breed of space combat shooter, following in the same, adrenalin-fuelled vein as EVE: Valkyrie and Star Wars Squadrons. \nForsaken, the sentient ship you control in Chorus that's piloted by the rebel cultist Nara, is probably a similarly slippery thing to nail down in the eyes of your enemies, too. Thanks to one of Nara's special Rite powers, bestowed on her by that aforementioned cosmic power you'll be hunting down over the course of the game, Forsaken is able to shift and teleport right behind enemy ships for brutal, bullet-ridden takedowns. It's immensely satisfying, and can also make for daring, last-minute escapes from incoming crosshairs. But you'll need much more than Nara's crafty Rite powers to survive Chorus' unforgiving dogfights. Forsaken went up in flames more times than I care to admit in my hour of hands on time, but I'm very much looking forward to going back for more when it finally launches on Steam and the Epic Games Store on December 3rd later this year.\nRead more",
          "link": "https://www.rockpapershotgun.com/chorus-is-an-exhilarating-space-combat-shooter-with-a-rhythm-all-its-own",
          "publishedOn": "2021-09-23T14:00:00.000Z",
          "wordCount": 2130,
          "title": "Chorus is an exhilarating space combat shooter with a rhythm all its own"
        },
        {
          "id": "https://www.rockpapershotgun.com/discord-testing-youtube-integration-to-let-you-watch-videos-with-pals",
          "author": "Imogen Beckhelling",
          "description": "Discord has started testing official YouTube integration, rolling out a new feature named Watch Together which, well, allows users watch YouTube vids together. It comes just a few weeks after Google's lawyers shut down several third-party Discord bots with a similar function. Watch Together has reportedly been enabled in a limited number of Discord servers for now, with plans to roll it out to everyone by the end of October.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/discord-testing-youtube-integration-to-let-you-watch-videos-with-pals",
          "publishedOn": "2021-09-23T13:43:55.000Z",
          "wordCount": 963,
          "title": "Discord testing YouTube integration to let you watch videos with pals"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-tales-of-arise-rose-up-for-a-new-audience",
          "author": "Nadia Oxford",
          "description": "Bandai Namco's first Tales Of game, Tales Of Phantasia, weighed in at a previously unheard of 48MB when it released in 1995. That's a mere wisp of data nowadays, but a veritable beast for a Super Famicom game cartridge. The cost of these high capacity carts, combined with westerners' ho-hum attitude towards RPGs at the time, likely axed any chance it had of being translated. Later Tales games have had better success in the west - 2003's Tales Of Symphonia was arguably its first breakout hit outside Japan - but the series as a whole has always seemed to exist on the fringes of the JRPG dynasty. While the Tales games certainly have a following outside Japan, western JRPG fans still tend to gravitate toward Square Enix's Final Fantasy and Dragon Quest games, or Atlus' Persona series. \nBut the Tales series' low-key existence is seemingly coming to an end thanks to the recently released Tales Of Arise. With its bright, eye-catching visuals and its uniquely frantic battle system, it turns monster slaying from a chore into an addiction, and has won the hearts of many curious newcomers in the process (including yours truly). With this influx of new blood, Tales might stand a chance of grabbing a throne at the heart of the JRPG genre. I recently talked to Arise producer Yusuke Tomizawa, who worked hard to tailor the adventure for a new Tales audience as much as its established fans. He explains how Arise's development went down a long, risky road, but it paid off in excellent review scores, happy fans, and a refreshing new direction for Tales.\nRead more",
          "link": "https://www.rockpapershotgun.com/how-tales-of-arise-rose-up-for-a-new-audience",
          "publishedOn": "2021-09-23T12:00:00.000Z",
          "wordCount": 1905,
          "title": "How Tales of Arise rose up for a new audience"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-storehouse-door-puzzle",
          "author": "Ollie Toms",
          "description": "Puzzled about how to open the Storehouse Door in Kena: Bridge Of Spirits? The smallest area of the game, the Storehouse, is also one of the more confusing and puzzle-dense areas of the world - and the confusion isn't helped by the fact that you've just been given a new power and must quickly learn how it works in order to get through the Storehouse in one piece.\nBelow we'll walk you through exactly how to activate the two Power Crystals and open the Storehouse Door in Kena: Bridge Of Spirits. You'll find both a written and a video walkthrough of the Storehouse puzzle below, so what are you waiting for? Let's dive in.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-storehouse-door-puzzle",
          "publishedOn": "2021-09-23T11:39:05.000Z",
          "wordCount": 1293,
          "title": "How to open the Storehouse Door in Kena: Bridge Of Spirits"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-long-darks-story-campaign-continues-with-episode-4-in-october",
          "author": "Alice O'Connor",
          "description": "Splendid snowy survival sandbox The Long Dark will launch the much-anticipated fourth episode of its story campaign on the 6th of October, developers Hinterland Studio have announced. Named 'Fury, Then Silence', episode 4 of the 'Wintermute' campaign sees one of our protagonists captured by murderers sheltering from the strange superfreeze in a prison complex. Have a peek at that in the new trailer below.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-long-darks-story-campaign-continues-with-episode-4-in-october",
          "publishedOn": "2021-09-23T11:05:10.000Z",
          "wordCount": 888,
          "title": "The Long Dark's story campaign continues with Episode 4 in October"
        },
        {
          "id": "https://www.rockpapershotgun.com/apex-legends-still-has-stability-issues-after-patch-that-shouldve-fixed-them",
          "author": "Imogen Beckhelling",
          "description": "If you've tried to play Apex Legends over the last week or so and noticed that things have been pretty slow, you're not alone. Since the game's Evolution Collection event launched last week, the battle royale and its servers have been struggling, and Respawn Entertainment have been tinkering away to try and sort it all out. Yesterday, they issued a patch to resolve a number of bugs and improve stability, but having played a few matches myself last night, it seems we're not out of the woods just yet.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/apex-legends-still-has-stability-issues-after-patch-that-shouldve-fixed-them",
          "publishedOn": "2021-09-23T10:34:09.000Z",
          "wordCount": 1085,
          "title": "Apex Legends still has stability issues after patch that should've fixed them"
        },
        {
          "id": "https://www.rockpapershotgun.com/steam-deck-faq-confirms-you-can-use-it-as-a-giant-pc-controller",
          "author": "James Archer",
          "description": "While Valve haven't been overly secretive with the Steam Deck, there are still plenty of burning questions to ask about the upcoming handheld PC. For me, these are usually along the lines of “Will it slip into my big coat pockets as easily as the Switch does?” or “Will it survive my cat pushing it off literally any flat surface?” but the newly-launched Steam Deck FAQ covers enquiries of a generally more techy nature.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/steam-deck-faq-confirms-you-can-use-it-as-a-giant-pc-controller",
          "publishedOn": "2021-09-23T10:10:21.000Z",
          "wordCount": 987,
          "title": "Steam Deck FAQ confirms you can use it as a giant PC controller"
        },
        {
          "id": "https://www.rockpapershotgun.com/i-beg-you-enable-multiplayer-in-deathloop-and-embrace-mortality",
          "author": "Brendan Caldwell",
          "description": "The dastardly multiplayer invasions of Deathloop are some murderous hijinks. But not everybody wants to see a player-controlled assassin with vicious human instincts pop up as they sneak through their time loop adventure. That's fine, say developers Arkane, you can simply switch to single player mode, which will replace player incursions with periodic visits from an NPC Julianna who is (let's be diplomatic) a less feisty opponent. I am here to ask, nay, beg: do not do this. Leave it in Online mode. Welcome malice, embrace pain, receive with warmth that sudden mortal stab in the back. You are strong and capable of overcoming such things. I'm not just giving you an ego boost here. As the tenacious Colt, the fight is fixed in your favour.\nRead more",
          "link": "https://www.rockpapershotgun.com/i-beg-you-enable-multiplayer-in-deathloop-and-embrace-mortality",
          "publishedOn": "2021-09-23T10:00:00.000Z",
          "wordCount": 1931,
          "title": "I beg you, enable multiplayer in Deathloop and embrace mortality"
        },
        {
          "id": "https://www.rockpapershotgun.com/blood-bowl-3-delays-early-access-launch-following-beta-feedback",
          "author": "Alice O'Connor",
          "description": "Fantasy sports management sim Blood Bowl 3 is delayed again, with the early access launch now pushed out of September and into the nebulous future. The official word is that after beta feedback, they realised yeah it wasn't ready. They say, \"our teams are more committed than ever to make Blood Bowl 3 the most comprehensive and polished instalment in the series yet.\" Yeah go on, please do that.\nRead more",
          "link": "https://www.rockpapershotgun.com/blood-bowl-3-delays-early-access-launch-following-beta-feedback",
          "publishedOn": "2021-09-23T09:49:04.000Z",
          "wordCount": 817,
          "title": "Blood Bowl 3 delays early access launch following beta feedback"
        },
        {
          "id": "https://www.rockpapershotgun.com/brewing-and-haggling-sim-potion-craft-opens-for-business-in-early-access",
          "author": "Lauren Morton",
          "description": "Step on in and please don't mind the badly-labelled vials I've left lying about the shop. Potion Craft is now in early access with all its myserious brewing and haggling and alchemy-ing. I've been quite taken with the demos and playtests for this one so far, not least because it brings some spirit back to the act of crafting. It's out now in early access, during which Niceplay Games will be adding even more crafting options to toy with before its full launch.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/brewing-and-haggling-sim-potion-craft-opens-for-business-in-early-access",
          "publishedOn": "2021-09-22T22:52:54.000Z",
          "wordCount": 973,
          "title": "Brewing and haggling sim Potion Craft opens for business in early access"
        },
        {
          "id": "https://www.rockpapershotgun.com/sable-review",
          "author": "Alice Bell",
          "description": "As you might expect from a game set on a desert planet, Sable has a lot of sand. You traverse it on your floating motorbike as the titular character, a young woman who's part of a nomadic culture where adolescents leave home to complete their Gliding. During this gap year of sorts, the Glider does odd jobs and explores the world until they figure out what they want to be for the rest of their life. Sand is a feature. But as they say, sand is coarse and rough and irritating, and it gets everywhere. Each individual grain of sand is small, but a pinch of sand in your bed will change how you feel about your entire sleep experience.\nRead more",
          "link": "https://www.rockpapershotgun.com/sable-review",
          "publishedOn": "2021-09-22T22:01:00.000Z",
          "wordCount": 2131,
          "title": "Sable review: a beautiful adventure beset by troubling bugs"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-chose-to-boot-its-melee-system-in-favor-of-that-excellent-kick",
          "author": "Lauren Morton",
          "description": "Time-looping murder puzzle Deathloop sure seems like it's worth putting on repeat. For all the usual action romp reasons that Arkane are good with, but also for some of its sillier bits. Kicking baddies off ledges sounds like it's the real backbone of Deathloop's comedy. Colt has one damn powerful boot and, according to a new chat with Deathloop director Dinga Bakaba, it's all thanks to Arkane's choice to scrap most of their melee combat system. Here's why Colt traded arm day for leg day. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-chose-to-boot-its-melee-system-in-favor-of-that-excellent-kick",
          "publishedOn": "2021-09-22T21:44:12.000Z",
          "wordCount": 900,
          "title": "Deathloop chose to boot its melee system in favor of that excellent kick"
        },
        {
          "id": "https://www.rockpapershotgun.com/apple-wont-let-fortnite-back-on-the-app-store-until-they-run-out-of-appeals",
          "author": "Lauren Morton",
          "description": "The legal battle between Epic Games and Apple continues as it seems that both are probably willing to cut the proverbial Fortnite baby in half. Earlier this month, the court ruled that Apple must allow third-party payment systems, which was apparently not enough for Epic, who decided to submit an appeal last week. Now, Apple have informed Epic that they will not be allowing Fortnite back into the App Store clubhouse until they've exhausted all their own avenues to appeal. Which means Fortnite could remain off the store for years yet, according to Epic.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/apple-wont-let-fortnite-back-on-the-app-store-until-they-run-out-of-appeals",
          "publishedOn": "2021-09-22T20:32:56.000Z",
          "wordCount": 850,
          "title": "Apple won't let Fortnite back on the App Store until they run out of appeals"
        },
        {
          "id": "https://www.rockpapershotgun.com/lesbian-road-trip-rpg-get-in-the-car-loser-has-just-hit-the-road",
          "author": "Lauren Morton",
          "description": "Get In The Car, Loser! begins as all RPGs about young protagonists with magical powers do—just a lot more bluntly. The world is being threatened by the evil Machine Devil and the Machine Devil cultists, and apparently no one is going to save it if not your plucky party of heroes. So hop on in the back seat, you dork. Get In The Car, Loser!, a free game written by Christine Love of Ladykiller In A Bind fame, is now fueled up and headed out on its self-proclaimed \"lesbian road trip RPG\".\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/lesbian-road-trip-rpg-get-in-the-car-loser-has-just-hit-the-road",
          "publishedOn": "2021-09-22T18:58:07.000Z",
          "wordCount": 885,
          "title": "\"Lesbian road trip RPG\" Get In The Car, Loser! has just hit the road"
        },
        {
          "id": "https://www.rockpapershotgun.com/jett-the-far-shores-fictional-language-started-life-as-gibberish-choral-music",
          "author": "Imogen Beckhelling",
          "description": "Lots of good sci-fi has made up languages, but I don't think many could claim their fictional languages were developed through song. Enter Jett: The Far Shore. It's an upcoming interstellar adventure made by Sword & Sworcery developers Superbrothers with Pine Scented Software, in which a team of scouts take off in their jetts to explore an uncharted planet. Better yet, it features its very own language that sound designer Priscilla Snow developed after finding meaning in the gibberish words she used to form the game's music. \r\n\n\r\nWhile the initial plan was never to have their own in-game language, the Jett team now have a dictionary around 2000 words strong, and I had a chance to talk to them about how it all came to be. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/jett-the-far-shores-fictional-language-started-life-as-gibberish-choral-music",
          "publishedOn": "2021-09-22T17:00:00.000Z",
          "wordCount": 2647,
          "title": "Jett: The Far Shore's fictional language started life as gibberish choral music"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-sims-4-just-added-a-massive-1200-new-color-swatches-to-149-build-items",
          "author": "Lauren Morton",
          "description": "Oh rejoice, a Sims 4 update that's all for me. Maxis have just dropped a free update which they say their art team totally took over by whipping up around 1200 new color swatches for 149 different Buy and Build Mode objects. There are tons of new window drape colors, new countertop swatches, wood furniture choices, and even plants. That is a lot of new color choices for a lot of items and oh boy I will probably use them all. Fellow builders, this one is for us. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-sims-4-just-added-a-massive-1200-new-color-swatches-to-149-build-items",
          "publishedOn": "2021-09-22T16:27:42.000Z",
          "wordCount": 901,
          "title": "The Sims 4 just added a massive 1200 new color swatches to 149 build items"
        },
        {
          "id": "https://www.rockpapershotgun.com/whats-better-unit-designers-or-handcrafted-art",
          "author": "Alice O'Connor",
          "description": "Last time, you decided that fiddling with environmental objects (henceforth known as fiddlebits) is better than rocket jumping. A toughie there, no doubt; I thank you for your careful deliberation. Next up, we're settling an issue of whose hand shapes  game, whether you're getting hands-on with your mens or having someone else lovingly handcraft the entire world for you.\r\nWhat's better: unit designers, or handcrafted art?\nRead more",
          "link": "https://www.rockpapershotgun.com/whats-better-unit-designers-or-handcrafted-art",
          "publishedOn": "2021-09-22T16:16:15.000Z",
          "wordCount": 1110,
          "title": "What's better: unit designers, or handcrafted art?"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-beacon-how-to-make-activate-beacon",
          "author": "Hayden Hefford",
          "description": "Want to know how to make and activate a Beacon in Minecraft? Beacons have two very important uses in Minecraft, as they give you status effects whilst also emitting a beam of light that can act as a waypoint marker to guide you and your friends home.\nThis guide will walk you through everything you need to know to make and use a Beacon in Minecraft, including how to get a Nether Star, which is one of the ingredients you will need.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-beacon-how-to-make-activate-beacon",
          "publishedOn": "2021-09-22T14:39:54.000Z",
          "wordCount": 1581,
          "title": "How to make and activate a Beacon in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/an-ode-to-cutting-off-boss-tails-in-dark-souls",
          "author": "Ed Thorn",
          "description": "Happy 10th anniversary Dark Souls! Here's to you, Sin the Slumbering Dragon. And to you, Crossbreed Priscilla. Chin-chin! Oi, not to you Ornstein, or to you, Smough. How did you even get in, anyway? This is an invitation only event for bosses who have cuttable tails.\nThere's a tinge of sadness to this celebration, though. Cuttable tails were all the rage back in the original Dark Souls but now they're lost to time, never to be seen again, just like the tails you cut off themselves. Although a part of me hopes that the cycle will renew (like the sort of tails that grow back after you cut them off). And just like skinny jeans are slowly going out of fashion in favour of the 90s wide leg, I'm hoping FromSoftware's bosses won't cling so closely to their tails in Elden Ring and maybe, just maybe, they'll let us lop them off again.\nRead more",
          "link": "https://www.rockpapershotgun.com/an-ode-to-cutting-off-boss-tails-in-dark-souls",
          "publishedOn": "2021-09-22T14:30:00.000Z",
          "wordCount": 823,
          "title": "An ode to cutting off boss tails in Dark Souls"
        },
        {
          "id": "https://www.rockpapershotgun.com/marvels-guardians-of-the-galaxys-chaotic-combat-owes-more-to-jrpgs-than-you-think",
          "author": "Ed Thorn",
          "description": "I went hands-on with roughly an hour's worth of Marvel's Guardians Of The Galaxy last week, and I have come away pleasantly surprised. I'll admit, I judged a book by its cover on this one, thinking it would be an action adventure game only Marvel stans with decades worth of MCU facts beamed into their brains could rally behind. But no, even I, who's watched precisely three Marvel films in the last ten years, had a lot of fun with it. Good fun, at that.\nMainly, I liked how the game's combat takes cues from JRPGs, of all things, cribbing off the likes of Final Fantasy XV and Tales Of Arise so your fellow guardians feel just as - if not more - important than yourself.\nRead more",
          "link": "https://www.rockpapershotgun.com/marvels-guardians-of-the-galaxys-chaotic-combat-owes-more-to-jrpgs-than-you-think",
          "publishedOn": "2021-09-22T13:00:00.000Z",
          "wordCount": 1742,
          "title": "Marvel's Guardians Of The Galaxy's chaotic combat owes more to JRPGs than you think"
        },
        {
          "id": "https://www.rockpapershotgun.com/what-are-your-favourite-autumn-games",
          "author": "Alice O'Connor",
          "description": "Today brings the autumn equinox and the start of the season where things, like, fall. It's a good season! I will always mourn the end of summer but I relish the brief window to hike through golden forests, swimming through shoals of leaves in rivers, cosy up around bonfires with cocoa, and break out the warm duvet again. But while we wait for the season to properly kick in, I'm curious: which autumns in video games do you enjoy? Yes, Halloween included.\nRead more",
          "link": "https://www.rockpapershotgun.com/what-are-your-favourite-autumn-games",
          "publishedOn": "2021-09-22T12:40:44.000Z",
          "wordCount": 815,
          "title": "What are your favourite autumn games?"
        },
        {
          "id": "https://www.rockpapershotgun.com/valorants-latest-patch-nerfed-the-floating-knife-fiend-jett",
          "author": "Imogen Beckhelling",
          "description": "If you play Valorant, you undoubtedly know one of those Jett players. The sort that will very un-tactfully launch all three of their smokes in a messy line so they can dash into or out of fights, bamboozling their teammates just as much as the enemy team. It should be a little harder for these speedy knife-slingers to perform such daft feats in the future, because Riot Games have taken away one of Jett's smokes, and they've nerfed her knives to boot.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/valorants-latest-patch-nerfed-the-floating-knife-fiend-jett",
          "publishedOn": "2021-09-22T11:00:27.000Z",
          "wordCount": 1300,
          "title": "Valorant's latest patch nerfed the floating knife-fiend Jett"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-wither-how-to-spawn-defeat-wither",
          "author": "Hayden Hefford",
          "description": "Want to know how to spawn and defeat the Wither boss in Minecraft? The Wither is one of the most formidable enemies in Minecraft, and is one of only two boss mobs that can be encountered in the game.\nIf you’re ready to fight the terrifying monster then gear up and read on, as this guide will walk you through everything that you need to know to find and beat the Wither in Minecraft.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-wither-how-to-spawn-defeat-wither",
          "publishedOn": "2021-09-22T10:27:39.000Z",
          "wordCount": 1604,
          "title": "How to find and defeat the Wither in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/dark-souls-bosses-rated-by-how-much-money-theyd-owe-you-after-a-night-out",
          "author": "Nic Reuben",
          "description": "So, thought you’d take all your great Lordran chums out for a drink to celebrate the 10th anniversary of Dark Souls, did you? Bad times, pal. Sure, they’ll take care of any everlasting dragons you happen to have hanging around on your lawn, but when it comes to a night on the bevvies, they might well be the sorriest bunch of cheapskates since Final Fantasy VIII’s GFs. Consider this your one and only warning before these fantasy grifters clear you out for the month. \nRead more",
          "link": "https://www.rockpapershotgun.com/dark-souls-bosses-rated-by-how-much-money-theyd-owe-you-after-a-night-out",
          "publishedOn": "2021-09-22T10:00:00.000Z",
          "wordCount": 1309,
          "title": "Dark Souls bosses rated by how much money they’d owe you after a night out"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-pc-patch-addresses-framerate-stuttering",
          "author": "Alice O'Connor",
          "description": "New Arkane Studios sneak-o-shooter Deathloop is a good'un, but the PC launch was marred by technical problems which caused the framerate to stutter for many players. One week later, they've put out a patch which should fix the stuttering for many folks playing with a mouse. However, you might not find the game hunky-dory now, as they say they're still investigating another potential stutterorama. Always tricky when multiple issues create similar-looking outcomes.\nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-pc-patch-addresses-framerate-stuttering",
          "publishedOn": "2021-09-22T09:23:30.000Z",
          "wordCount": 788,
          "title": "Deathloop PC patch addresses framerate stuttering"
        },
        {
          "id": "https://www.rockpapershotgun.com/heros-hour-is-a-strategy-rpg-with-huge-automatic-battles",
          "author": "Graham Smith",
          "description": "I spend roughly 90% of my free time watching what the YouTube algorithm offers me. I've not been radicalised yet, although I do now refer to any shopping I buy as a \"haul\" and end all my conversations by thanking Skillshare. \r\n\nTo my surprise, the algorithm has recently started throwing indie games my way. Hero's Hour is among the most interesting it's shown me: a strategy RPG in which you construct armies of pixelated fantasy beasts who then have automated battles.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/heros-hour-is-a-strategy-rpg-with-huge-automatic-battles",
          "publishedOn": "2021-09-21T22:25:50.000Z",
          "wordCount": 817,
          "title": "Hero's Hour is a strategy RPG with huge automatic battles"
        },
        {
          "id": "https://www.rockpapershotgun.com/phoenix-points-corrupted-horizons-will-open-up-on-october-1st",
          "author": "Graham Smith",
          "description": "Phoenix Point's fourth DLC is due on October 1st. Corrupted Horizons adds a new corruption mechanic which can sap the will of your squad, as well as new Mutoid soldiers, pictured above. The Mutoids are immune to corruption, can learn any class's skills, but are unable to heal.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/phoenix-points-corrupted-horizons-will-open-up-on-october-1st",
          "publishedOn": "2021-09-21T21:26:27.000Z",
          "wordCount": 783,
          "title": "Phoenix Point's Corrupted Horizons will open up on October 1st"
        },
        {
          "id": "https://www.rockpapershotgun.com/death-of-the-reprobate-will-complete-a-point-and-click-triptych",
          "author": "Graham Smith",
          "description": "I feel as if the header image successfully conveys the appeal of Joe Richardson's work. He makes point-and-click adventures which take real Renaissance paintings, animate them in cut-out style (think Monty Python), and juxtapose them with modern vernacular.\r\n\nHis next game was announced today. It's called Death Of The Reprobate, and there's a trailer showing both pointing and clicking below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/death-of-the-reprobate-will-complete-a-point-and-click-triptych",
          "publishedOn": "2021-09-21T21:01:59.000Z",
          "wordCount": 772,
          "title": "Death Of The Reprobate will complete a point and click triptych"
        },
        {
          "id": "https://www.rockpapershotgun.com/you-can-once-again-check-whether-your-pc-will-run-windows-11",
          "author": "Graham Smith",
          "description": "Microsoft have put their PC Health Check app back online. The simple tool is designed to tell you whether Windows 11 is compatible with your computer, but it was pulled offline back in June when it kept telling people with modern PCs that they couldn't run the new operating system, with little information as to why not. It's more recently been available to members of the Windows Insider program, but it's back now for all.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/you-can-once-again-check-whether-your-pc-will-run-windows-11",
          "publishedOn": "2021-09-21T20:24:45.000Z",
          "wordCount": 824,
          "title": "You can once again check whether your PC will run Windows 11"
        },
        {
          "id": "https://www.rockpapershotgun.com/neo-the-world-ends-with-you-comes-to-you-on-pc-next-week",
          "author": "Alice O'Connor",
          "description": "Following its debut on PlayStation 4 and Switch in July, Square Enix plan to bring Neo: The World Ends With You over to PC on the 28th of September. That's next Tuesday, day dudes. It's the sequel to an RPG from the Nintendo DS in 2007, set inside a colourful and weird version of Tokyo where young'uns get drawn into a deadly game.\nRead more",
          "link": "https://www.rockpapershotgun.com/neo-the-world-ends-with-you-comes-to-you-on-pc-next-week",
          "publishedOn": "2021-09-21T17:07:49.000Z",
          "wordCount": 766,
          "title": "Neo: The World Ends With You comes to you on PC next week"
        },
        {
          "id": "https://www.rockpapershotgun.com/pc-gaming-weekspot-podcast-054-deathloop-kena",
          "author": "Colm Ahern",
          "description": "After getting a taste last week, both myself and Matthew have spent the last few days in Blackreef. We've been enjoying doing the same things over and over. Yeah, Deathloop is pretty good.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/pc-gaming-weekspot-podcast-054-deathloop-kena",
          "publishedOn": "2021-09-21T16:00:00.000Z",
          "wordCount": 820,
          "title": "The Weekspot podcast #054: bridge of spies"
        },
        {
          "id": "https://www.rockpapershotgun.com/halo-infinite-will-have-back-to-back-tech-previews-this-weekend-and-next",
          "author": "Imogen Beckhelling",
          "description": "If you're not too busy Deathlooping, Kena: Bridge Of Spiriting, or Diablo 2: Resurrecting this weekend, perhaps you'll have a spare moment to drop into Halo Infinite's next technical preview. Between Thursday and Sunday, players registered as a Halo Insider will have a chance to try out the sci-fi FPS's 4v4 Arena mode. But that's not all! 343 have announced that the following weekend, Insiders can jump into another tech test, and have a crack at the game's 12v12 Big Team Battle mode too.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/halo-infinite-will-have-back-to-back-tech-previews-this-weekend-and-next",
          "publishedOn": "2021-09-21T15:54:31.000Z",
          "wordCount": 1097,
          "title": "Halo Infinite will have back-to-back tech previews this weekend and next"
        },
        {
          "id": "https://www.rockpapershotgun.com/call-of-duty-vanguards-open-beta-feels-like-modern-warfare-with-a-lick-of-ww2-paint",
          "author": "Ed Thorn",
          "description": "Call Of Duty: Vanguard's multiplayer feels familiar, have I been here before? Yes, in the past, but also in the future. Despite its World War II setting, Vanguard's open beta has me thinking back to the days of Call Of Duty: Modern Warfare. Having played a sizable chunk of it now, I'm not kidding when I say that it's like the Modern Warfare lot LARPING on a WWII set. For some this will be good. For others this will be bad. For me? It needs Warzone.\nRead more",
          "link": "https://www.rockpapershotgun.com/call-of-duty-vanguards-open-beta-feels-like-modern-warfare-with-a-lick-of-ww2-paint",
          "publishedOn": "2021-09-21T15:30:00.000Z",
          "wordCount": 1536,
          "title": "Call Of Duty: Vanguard's open beta feels like Modern Warfare with a lick of WW2 paint"
        },
        {
          "id": "https://www.rockpapershotgun.com/diablo-2-resurrected-cow-level",
          "author": "Charlie Biggerstaff",
          "description": "Looking for the secret cow level in Diablo 2: Resurrected? The cow level became Diablo 2’s worst-kept secret in the decades following its release. This infamous hidden zone contains armies of halberd-wielding Hell Bovines that swarm players, plus the goofily named Cow King boss. The cow level is a fun little side area to run, and it will of course be present in Diablo 2: Resurrected. If you missed out on the original and don’t know how to find the portal, we’re here to help.\nRead more",
          "link": "https://www.rockpapershotgun.com/diablo-2-resurrected-cow-level",
          "publishedOn": "2021-09-21T15:21:56.000Z",
          "wordCount": 862,
          "title": "How to access the secret cow level in Diablo 2: Resurrected"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-crossbow-loadout-warzone",
          "author": "Kevin Foley",
          "description": "Looking for the best Crossbow loadout to bring into Warzone? It's certainly a unique option to consider in a game all about firearms and high tech weaponry. Still there's fun to be had when wielding this modern take on a medieval weapon, and it's more than capable of one-shotting enemies if you have the skills to wield it. Just don't take the Crossbow into Warzone with the expectation of dominating. It's a novelty at best, and you should be using the best guns in Warzone if your goal is to win.  \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/best-crossbow-loadout-warzone",
          "publishedOn": "2021-09-21T15:07:11.000Z",
          "wordCount": 1022,
          "title": "Best Crossbow loadout in Warzone Season 5"
        },
        {
          "id": "https://www.rockpapershotgun.com/jackbox-party-pack-8-arriving-in-time-to-spook-your-halloween-party",
          "author": "Alice O'Connor",
          "description": "You've got a checklist for Halloween: peeled grapes (eyeballs); cold spaghetti (worms); 12-foot skeleton (skeleton); 25 metre bolt of black cotton (costume). But wait, what will people play? Friendo, you're in lucko. Jackbox Games have announced that The Jackbox Party Pack 8, their latest collection of funny party games, will launch on October 14th. It'll pack five games, from murder mystery to a new version of fan-favourite Drawful, this time having players animate their drawings.\nRead more",
          "link": "https://www.rockpapershotgun.com/jackbox-party-pack-8-arriving-in-time-to-spook-your-halloween-party",
          "publishedOn": "2021-09-21T15:04:54.000Z",
          "wordCount": 894,
          "title": "Jackbox Party Pack 8 arriving in time to spook your Halloween party"
        },
        {
          "id": "https://www.rockpapershotgun.com/rogue-lords-is-a-devilishly-fun-roguelike-where-cheating-is-considered-a-virtue",
          "author": "Imogen Beckhelling",
          "description": "Everything about Rogue Lords is very Halloween-y. It's an upcoming gothic roguelike in which you, the devil, send disciples out into the world to wage war with demon hunters and cause general mischief in the mortal world. Having played a bit myself, I already feel the need to start carving pumpkins and hanging up fake cobwebs around my house. It reminds me of all the spooky animated films you see on the telly throughout October, which makes sense because the developers at Cyanide and Leikir Studios tell me the game's art style is partially inspired by Tim Burton films.\nRead more",
          "link": "https://www.rockpapershotgun.com/rogue-lords-is-a-devilishly-fun-roguelike-where-cheating-is-considered-a-virtue",
          "publishedOn": "2021-09-21T15:00:00.000Z",
          "wordCount": 1783,
          "title": "Rogue Lords is a devilishly fun roguelike where cheating is considered a virtue"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-how-to-make-a-book",
          "author": "Hayden Hefford",
          "description": "Want to know how to make a Book in Minecraft? Books are very important, as you will need them to enchant your armour and weapons with various effects. You can also make pretty bookshelves to spruce up your home, if you aren’t interested in becoming an all-powerful wizard.\nThis guide will walk you through everything that you need to know to make a Book in Minecraft, including how to get Paper and Leather, which you will need.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-how-to-make-a-book",
          "publishedOn": "2021-09-21T14:39:27.000Z",
          "wordCount": 1422,
          "title": "How to make a Book in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-genshin-impact-sangonomiya-kokomi-build",
          "author": "Rebecca Jones",
          "description": "Want to learn how to create the best build for Sangonomiya Kokomi in Genshin Impact? Kokomi has been present in Genshin Impact since August's V2.0 update as an NPC, but a playable version of the character is now available as part of the Drifting Luminescence event (running from September 21st to October 12th).\n Read more",
          "link": "https://www.rockpapershotgun.com/best-genshin-impact-sangonomiya-kokomi-build",
          "publishedOn": "2021-09-21T14:17:21.000Z",
          "wordCount": 2018,
          "title": "The best Genshin Impact Sangonomiya Kokomi build"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-bosses-boss-fights",
          "author": "Ollie Toms",
          "description": "Want to learn about all the boss fights in Kena: Bridge Of Spirits? There is a grand total of 16 boss fights (that is, fights with big boss health bars at the top) in Kena: Bridge Of Spirits - and like everything else in Ember Lab's marvellous action-adventure game, each one offers some true spectacle. If you're looking for a list of all the boss fights and some advice on how to beat each one, you've come to the right place.\nKeep scrolling to check out all 16 bosses in Kena: Bridge Of Spirits. I've also included footage of myself beating each boss on Master Spirit Guide difficulty.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-bosses-boss-fights",
          "publishedOn": "2021-09-21T13:42:37.000Z",
          "wordCount": 2907,
          "title": "Kena: Bridge Of Spirits bosses and how to beat them"
        },
        {
          "id": "https://www.rockpapershotgun.com/activision-blizzard-are-now-being-investigated-by-the-us-government",
          "author": "Imogen Beckhelling",
          "description": "The US government's Securities and Exchange Commission (SEC) are investigating Activision Blizzard over the company's handling of sexual misconduct and harassment allegations. This comes just two months after the Call Of Duty publishers were sued by a State department for alleged workplace harassment, discrimination, and retaliation. Now, The SEC have subpoenaed a number of high-level executives, reportedly including CEO Bobby Kotick, and have requested internal documents relating to the allegations. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/activision-blizzard-are-now-being-investigated-by-the-us-government",
          "publishedOn": "2021-09-21T12:59:42.000Z",
          "wordCount": 973,
          "title": "Activision Blizzard are now being investigated by the US government"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-fishing-shrine",
          "author": "Ollie Toms",
          "description": "Wondering how to restore the Fishing Shrine in Kena: Bridge Of Spirits? Each of the other Shrines in the Forgotten Forest of Kena: Bridge Of Spirits are guarded by enemies, but the Fishing Shrine is guarded by a puzzle. And at first glance this puzzle may be a confusing one, because you may not even realise that a puzzle needs to be solved.\nFollow the steps below to learn how to restore the Fishing Shrine in Kena: Bridge Of Spirits!\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-fishing-shrine",
          "publishedOn": "2021-09-21T11:01:29.000Z",
          "wordCount": 1085,
          "title": "How to restore the Fishing Shrine in Kena: Bridge Of Spirits"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-invasion-is-a-zero-sum-mind-game-i-cant-stop-playing",
          "author": "Jeremy Peel",
          "description": "As I pass the eroding façade of a fisherman’s hut, a beret-topped goon strides by in the opposite direction, casually swinging a machete. They’d be conspicuous were it not for the fact that there are no fishermen in this village anymore. If anyone were to bother putting up a welcome sign, it’d read ‘Population: Goons’. They like me, though. This thug’s two-tone mask might be impassive, but the voice beneath it betrays starstruck awe. “Julianna,” they say. “It’s an honour, really.”\n“Shut the fuck up,” I hiss under my breath. “I’m in disguise. If the player hears you, we’re both mince. And thanks.”\nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-invasion-is-a-zero-sum-mind-game-i-cant-stop-playing",
          "publishedOn": "2021-09-21T11:00:00.000Z",
          "wordCount": 1558,
          "title": "Deathloop invasion is a zero-sum mind game I can't stop playing"
        },
        {
          "id": "https://www.rockpapershotgun.com/de-exit-is-about-a-voxel-skeleton-investigating-spooky-goo-in-the-afterlife",
          "author": "Imogen Beckhelling",
          "description": "De-Exit is an upcoming voxel puzzle platformer where you play as a skeleton person investigating strange happenings in the afterlife. You died and landed yourself in the in-between part, not quite heaven and not quite hell, but it's clear that something is a bit wrong. You'll need to explore ruins, collect artifacts and figure out why spooky goo is trying to engulf parts of the world. It's a bit Zelda-y and a bit Tomb Raider-y, but if both those games were filled with cubes.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/de-exit-is-about-a-voxel-skeleton-investigating-spooky-goo-in-the-afterlife",
          "publishedOn": "2021-09-21T10:20:00.000Z",
          "wordCount": 959,
          "title": "De-Exit is about a voxel skeleton investigating spooky goo in the afterlife"
        },
        {
          "id": "https://www.rockpapershotgun.com/scarf-is-a-journey-like-puzzle-platformer-with-a-magic-dragon-scarf",
          "author": "Imogen Beckhelling",
          "description": "Do you ever see something in a game and think, \"Man, I wish that was real\"? And I don't mean magic or spaceships because obviously those are great, but a specific item that would just be so cool to have. I want the scarf from Scarf, an upcoming puzzle platformer about a little blue dude trying to get home. This character has a firey red scarf that does dragon things! When you double jump, it turns into little dragon wings! 10/10 winter wear. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/scarf-is-a-journey-like-puzzle-platformer-with-a-magic-dragon-scarf",
          "publishedOn": "2021-09-21T10:05:00.000Z",
          "wordCount": 883,
          "title": "Scarf is a Journey-like puzzle platformer with a magic dragon scarf"
        },
        {
          "id": "https://www.rockpapershotgun.com/endling-is-a-game-about-a-mama-fox-protecting-her-cubs-in-a-human-ravaged-world",
          "author": "Imogen Beckhelling",
          "description": "Endling is going to break my heart. It's a game about a mama fox trying to look after her pups in an unpleasant future where forests are being destroyed, pollution is rife and these poor animals have been hunted to near-extinction. It's sad, because it really doesn't seem to distant a future from real life, but that's kind of the point. Endling looks gorgeous and poignant, the sort of game that seems important to play, even if it does break my heart.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/endling-is-a-game-about-a-mama-fox-protecting-her-cubs-in-a-human-ravaged-world",
          "publishedOn": "2021-09-21T09:53:31.000Z",
          "wordCount": 1142,
          "title": "Endling is a game about a mama fox protecting her cubs in a human-ravaged world"
        },
        {
          "id": "https://www.rockpapershotgun.com/older-xbox-wireless-controllers-are-getting-quick-switching-between-devices",
          "author": "James Archer",
          "description": "One of the cool things about the official Xbox Series X/S wireless controllers – if we’re using a dramatically expanded definition of the word “cool” – is that they can pair to both the console and a Bluetooth-enabled PC or laptop, then switch between both sources with a double-tap or hold of the pairing button. In what could be good news for owners of older, Xbox One-era wireless controllers, Microsoft are now rolling out a firmware update that brings this same quick-switch functionality to the more aged pads.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/older-xbox-wireless-controllers-are-getting-quick-switching-between-devices",
          "publishedOn": "2021-09-21T09:41:52.000Z",
          "wordCount": 1035,
          "title": "Older Xbox wireless controllers are getting quick-switching between devices"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-map-collectible-locations",
          "author": "Ollie Toms",
          "description": "Looking for a map of Kena: Bridge Of Spirits which shows the locations of all collectibles and hidden areas? Well, you're in luck, because I've spent a painstaking number of hours hundred-percenting Ember Lab's marvellous story-driven action-adventure game, and during my travels I jotted down the exact locations of every single Rot, Hat, Flower Shrine, Meditation Spot, Cursed Chest, and Spirit Mail in the game.\nBelow you'll find ten maps of various areas in Kena: Bridge Of Spirits, annotated with the locations of every single collectible and hidden area in the game, so you can have a far easier time hunting down those pesky remaining achievements. Take a look!\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-map-collectible-locations",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1743,
          "title": "Kena: Bridge Of Spirits map of all collectibles"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-long-is-kena-bridge-of-spirits",
          "author": "Ollie Toms",
          "description": "Wondering how long it'll take you to complete Kena: Bridge Of Spirits? It's a question that's preyed on the minds of many a prospective player since Ember Lab, the developers of this outrageously gorgeous new action-adventure game, previously stated in a tweet that \"you should be able to finish the game over a weekend\".\nBut a weekend of gaming means different things to different people. Does it mean you can blitz through Kena: Bridge Of Spirits in only a few hours, or will it take a solid 20 hours to complete? And does this take into account the many side activities and collectibles, or were Ember Lab simply talking about how quickly you can rush through the main story? Find out exactly how long it takes to complete Kena: Bridge Of Spirits below.\nRead more",
          "link": "https://www.rockpapershotgun.com/how-long-is-kena-bridge-of-spirits",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1083,
          "title": "How long is Kena: Bridge Of Spirits?"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-difficulty-levels",
          "author": "Ollie Toms",
          "description": "Want to know about the four difficulty levels in Kena: Bridge Of Spirits? Or perhaps you simply want to figure out which difficulty is right for you before you get stuck into playing? Kena: Bridge Of Spirits offers a choice of four different difficulty levels which change the game up in various ways to make Kena's journey safer or more perilous, depending on which you choose. Keep reading to find out how to change the difficulty level before and during a playthrough, and what each of the difficulty levels change about the game.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-difficulty-levels",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1207,
          "title": "Kena: Bridge Of Spirits difficulty levels"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-bow",
          "author": "Ollie Toms",
          "description": "Wondering how to unlock the bow in Kena: Bridge Of Spirits? The bow is an extremely useful part of Kena's toolkit, not only as a powerful weapon but also as a traversal tool, as it can be used as a grappling hook when fired at particular blue flowers dotted about the landscape of Kena: Bridge Of Spirits. Read on to find out where, when, and how to unlock the bow so you can get it as quickly as possible.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-bow",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1124,
          "title": "How to unlock the Bow in Kena: Bridge Of Spirits"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-abilities-upgrades-skill-tree",
          "author": "Ollie Toms",
          "description": "Want to learn more about Kena's abilities and upgrades in Kena: Bridge Of Spirits? Early on in Ember Lab's story-driven action-adventure game, you'll learn more about how you can use Karma to upgrade your abilities. Each of these abilities are well worth getting, but some are definitely worth prioritising over others, because they'll help you make quick work of nearly any enemy with some practice.\nBelow we'll walk you through every ability and upgrade in Kena: Bridge Of Spirits and what each one does, along with how to unlock abilities, how to gain Karma, and how to increase your Rot Level to make use of these new abilities.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-abilities-upgrades-skill-tree",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 2145,
          "title": "Kena: Bridge Of Spirits abilities and upgrades"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-spirit-mail-locations",
          "author": "Ollie Toms",
          "description": "Looking for all the Spirit Mail in Kena: Bridge Of Spirits? One of several different types of collectible in Ember Lab's story-focused action-adventure game, Spirit Mail can be collected and delivered back to certain houses in the central Village in order to unlock new areas and gain rewards. But finding them is often far easier said than done, and these puzzles don't get easier just by changing the difficulty level.\nBelow we'll walk you through where to find all 10 Spirit Mail locations in Kena: Bridge Of Spirits, so you can get to work purifying the land of the corruption which has spread across it before you arrived. After you've collected each Spirit Mail you can then see on the map the house in the Village to which it must be delivered.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-spirit-mail-locations",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 2010,
          "title": "Kena: Bridge Of Spirits Spirit Mail locations"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-hay-piles",
          "author": "Ollie Toms",
          "description": "Wondering what to do with Hay Piles in Kena: Bridge Of Spirits? You'll find Hay Piles scattered about various areas of the Kena: Bridge Of Spirits map, and it's very unclear at first glance what you're meant to do about them. And it is important that you do something, because sometimes these Hay Piles must be cleared in order to reveal something valuable inside, such as a Rot to add to your growing army of adorable spirits.\nLearn how to destroy Hay Piles in Kena: Bridge Of Spirits below!\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-hay-piles",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1043,
          "title": "How to destroy Hay Piles in Kena: Bridge Of Spirits"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-achievements",
          "author": "Ollie Toms",
          "description": "Looking for a full list of all Kena: Bridge Of Spirits achievements? There is a grand total of 41 achievements to collect in Ember Lab's beautiful and incredibly enjoyable action-adventure title, and they run the gamut in challenge. Some require you to simply play through the story, so you'll unlock them either way eventually. Others require you to go out of your way collecting or setting up particular combat encounters to complete them.\nIn the below trophy guide you'll find a full list of all 41 achievements you can earn in Kena: Bridge Of Spirits, along with a few bits of advice on how to unlock some of the more challenging ones.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-achievements",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1326,
          "title": "Kena: Bridge Of Spirits achievements and trophy guide"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-hats",
          "author": "Ollie Toms",
          "description": "Looking for a list of all the Hats in Kena: Bridge Of Spirits? Yes, you can find Hats for your bouncy little spirit friends in Kena: Bridge Of Spirits, and you can purchase these hats at Hat Carts in order to dress your Rot army up exactly how you'd like. Have you ever heard of anything so sickeningly adorable? I sure haven't.\nBelow you'll be able to take a look at every single Rot Hat in the game, along with their cost in Gems and some information on how these cosmetic items can be procured at a Hat Cart.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-hats",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1318,
          "title": "Kena: Bridge Of Spirits Hats"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-tips",
          "author": "Ollie Toms",
          "description": "Looking for some top tips on beating the puzzles and quests of Kena: Bridge Of Spirits? Ember Lab's sumptuous-looking action-adventure game, Kena: Bridge Of Spirits, throws you into a bright, beautiful, and bittersweet world where Kena, a Spirit Guide, is trying to reach a sacred mountain shrine. But first she needs to cleanse the lands of corruption and uncover the mystery of how nature came to be so unbalanced in this part of the world.\nKena is a tough game at times, filled with dangerous combat segments, tricky platforming areas, and numerous puzzles you must complete with the help of your spirit friends, the Rot. This beginner's guide to Kena: Bridge Of Spirits will walk you through some top tips which will help you conquer (and enjoy) every aspect of Kena's journey.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-tips",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 2004,
          "title": "Kena: Bridge Of Spirits tips and tricks"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-review",
          "author": "Amelia Hansford",
          "description": "Atmosphere can feel almost superfluous in video games at the moment. Despite its very obvious importance, there’s sometimes an assumption that if the more mechanical parts of a game serve their purpose - and do so reliably - then elements like immersion, environment and art style are merely contributors to a solid product. But my view is to the contrary; I think it’s usually those elements that turn a game into a phenomenon. This is very clearly proven by Kena: Bridge Of Spirits.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-review",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1607,
          "title": "Kena: Bridge Of Spirits review: a beautiful action-adventure full of joy and wonder"
        },
        {
          "id": "https://www.rockpapershotgun.com/a-new-free-to-play-online-pokemon-trading-card-game-is-coming-to-pc",
          "author": "Lauren Morton",
          "description": "There's been a Pokémon card game on PC for years now which, I suspect, will come as news to some of us who were always more into the Pokémon RPGs. You TCG fans will want to know that the newly-announced Pokémon Trading Card Game Live will be replacing the current Pokémon Trading Card Game Online. Pokémon TCG Live is coming with upgrades like a ranked ladder, 3D avatars, and battle passes. It will also remove some major features such as in-game chat and—crucially—card trading. You can catch the announcement and the details here in the reveal trailer for Pokémon TCG Live.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/a-new-free-to-play-online-pokemon-trading-card-game-is-coming-to-pc",
          "publishedOn": "2021-09-20T23:32:57.000Z",
          "wordCount": 865,
          "title": "A new free-to-play online Pokémon trading card game is coming to PC"
        },
        {
          "id": "https://www.rockpapershotgun.com/swerys-the-good-life-finally-fetches-a-launch-date-for-october",
          "author": "Lauren Morton",
          "description": "Small towns always seem to have secrets afoot and it's no different in The Good Life. This mystery adventure led by Hidetaka 'Swery' Suehiro of Deadly Premonition fame has been publicly kicking about for a while now. It's dug up a date at last, proudly fetching us back an October 15th launch. That's when you'll be headed to the British countryside to photograph your way out of debt and try to learn the secrets of the town where everyone turns into animals.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/swerys-the-good-life-finally-fetches-a-launch-date-for-october",
          "publishedOn": "2021-09-20T20:47:42.000Z",
          "wordCount": 821,
          "title": "Swery's The Good Life finally fetches a launch date for October"
        },
        {
          "id": "https://www.rockpapershotgun.com/deltarune-chapter-2-launched-for-free-because-the-world-is-tough-enough",
          "author": "Lauren Morton",
          "description": "Unlike the cheeky surprise release of its first free chapter back in 2018, we got a warning about Deltarune Chapter 2. It's out now, also free, because creator Toby Fox says the world has been tough enough lately. The not-a-sequel-or-prequel-but-sort-of-related game to Fox's hit RPG Undertale is still a work in progress, but the newest chunk of story should hopefully keep fans busy chatting and hunting for secrets for a while yet. It may indeed be a while, once again. Fox plans to release chapters three through five as a paid release when they're finished but even he doesn't know when that will be just yet.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/deltarune-chapter-2-launched-for-free-because-the-world-is-tough-enough",
          "publishedOn": "2021-09-20T18:13:50.000Z",
          "wordCount": 983,
          "title": "Deltarune Chapter 2 launched for free because the world is tough enough"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-introduces-more-big-bosses-and-adorable-photo-mode",
          "author": "Lauren Morton",
          "description": "The first game from former animation studio Ember Lab heads out on its spirit saving adventure tomorrow. Kena: Bridge Of Spirits definitely looks like it's made by an animation house, complete with excessively adorable little sidekick characters and all. Ahead of tomorrow's launch, Ember Lab have shown off another story trailer to peek a couple more of the big spirit bosses that Kena will be putting to rest along with the photo mode that you'll have to take full advantage of all that big screen-inspired character design.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-introduces-more-big-bosses-and-adorable-photo-mode",
          "publishedOn": "2021-09-20T16:38:56.000Z",
          "wordCount": 1046,
          "title": "Kena: Bridge Of Spirits introduces more big bosses and adorable photo mode"
        },
        {
          "id": "https://www.rockpapershotgun.com/well-need-new-imperial-units-for-the-digital-age",
          "author": "Alice O'Connor",
          "description": "To distract from the ongoing dire consequences of leaving the European Union with all the grace and finesse of a child uninviting someone from their seventh birthday party, the UK government plan to revive imperial units. You know: 66 gallons to a hogshead, 6 hogsheads to a rod, 22 ounces to a watt, 9 Rodneys to a Del Boy, that sort of nostalgic masturbation. But a lot has changed since the dark days of the British Empire. If the obtuse unit system is to return (lol), we need new units for modern technologies. I have ideas.\nRead more",
          "link": "https://www.rockpapershotgun.com/well-need-new-imperial-units-for-the-digital-age",
          "publishedOn": "2021-09-20T16:24:04.000Z",
          "wordCount": 1161,
          "title": "We'll need new imperial units for the digital age"
        },
        {
          "id": "https://www.rockpapershotgun.com/rps-user-avatars-have-arrived",
          "author": "Katharine Castle",
          "description": "Ever since RPS was redesigned at the beginning of the year, our tech team has been hard at work improving our comments system and user ID features. The first of those updates arrives today. Behold, you can now assign an avatar to your Reedpop ID account. \nRead more",
          "link": "https://www.rockpapershotgun.com/rps-user-avatars-have-arrived",
          "publishedOn": "2021-09-20T16:18:38.000Z",
          "wordCount": 892,
          "title": "RPS user avatars have arrived"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-nvidia-rtx-30-series-one-year-on-should-you-upgrade",
          "author": "James Archer",
          "description": "Even if they don’t recall the exact date, plenty of gaming PC owners will remember what they were doing on September 17th 2020. They, and I, were staring at a black-and-green storefront, mashing F5 until a “Notify me” button changed to read “Out of stock”. This was the Nvidia GeForce RTX 3080 launch, and what initially looked like a one-off failure of Nvidia’s anti-bot measures ended up heralding the worst year in memory to upgrade a graphics card.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-nvidia-rtx-30-series-one-year-on-should-you-upgrade",
          "publishedOn": "2021-09-20T15:53:33.000Z",
          "wordCount": 1583,
          "title": "The Nvidia RTX 30 series, one year on: should you upgrade?"
        },
        {
          "id": "https://www.rockpapershotgun.com/rumour-quantic-dream-are-making-a-star-wars-game",
          "author": "Alice O'Connor",
          "description": "Here's a rumour that's wildly unsupported but so horrible that oh god you can imagine it being true: Quantic Dream are secretly making a Star Wars game. According to two separate Internauts, the French studio behind Heavy Rain and Detroit: Become Human have become pally with Disney and are working on some sort of game set in the galaxy which gave us Baby Yoda and probably some other stories or something too idk. Take this all with the hugest pinch of spacesalt, of course.\nRead more",
          "link": "https://www.rockpapershotgun.com/rumour-quantic-dream-are-making-a-star-wars-game",
          "publishedOn": "2021-09-20T14:25:12.000Z",
          "wordCount": 836,
          "title": "Rumour: Quantic Dream are making a Star Wars game"
        },
        {
          "id": "https://www.rockpapershotgun.com/frogwares-and-microids-are-escalating-the-war-for-sexiest-young-detective-in-games",
          "author": "Alice Bell",
          "description": "A few months ago I brought it to your attention that Microids are making a new video game called Agatha Christie - Hercule Poirot: The First Cases, in which Poirot is a young and and hot detective solving his first case. I made a comparison to Sherlock Holmes Chapter One, the also upcoming new entry in Frogwares' long-running detect 'em up series, in which Sherlock Holmes is young and hot and solving his first case. Last week, both developers released new videos for their respective games, and the timing of it all was almost enough to make me believe they were baiting me, specifically.\nLast week was Agatha Christie's birthday, you see, so Microids dropped a more in-depth gameplay video and a new dev diary talking about they were making \"a unique new moustache\", just after they make hot young Poirot wink. Then, the very next day - the next day! The. Next. Day. Frogwares put out a release date trailer that may as well have been called Sherlock Holmes: Eyes Wide Shut. And I'm absolutely here for this escalting sexy war.\nRead more",
          "link": "https://www.rockpapershotgun.com/frogwares-and-microids-are-escalating-the-war-for-sexiest-young-detective-in-games",
          "publishedOn": "2021-09-20T14:00:00.000Z",
          "wordCount": 837,
          "title": "Frogwares and Microids are escalating the war for sexiest young detective in games"
        },
        {
          "id": "https://www.rockpapershotgun.com/nvidia-dlss-now-supported-in-over-100-games-thanks-to-indie-push",
          "author": "James Archer",
          "description": "Nvidia DLSS is usually worth turning on for an easy frame rate bump, but even after DLSS 2.0 made it easier for developers to implement, the list of games that actually support the AI-powered anti-aliasing tech has never exactly been running off the page. That said, Nvidia can now claimed to have reached the milestone of 100 DLSS-compatible games, thanks in large part to a recent adoption wave from indie games.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/nvidia-dlss-now-supported-in-over-100-games-thanks-to-indie-push",
          "publishedOn": "2021-09-20T13:11:01.000Z",
          "wordCount": 946,
          "title": "Nvidia DLSS now supported in over 100 games, thanks to indie push"
        },
        {
          "id": "https://www.rockpapershotgun.com/call-of-duty-vanguards-open-beta-is-extended-so-how-are-you-liking-it",
          "author": "Alice O'Connor",
          "description": "Hey, you, you played the Call Of Duty: Vanguard multiplayer open beta this weekend? You like it? You wanna play more? If you do want more, or thought you'd missed your chance to play, good news: the open beta has (probably predictably) been extended. Originally due to end today, it'll now end Wednesday. More time to see CoD's latest return to World War 2.\nRead more",
          "link": "https://www.rockpapershotgun.com/call-of-duty-vanguards-open-beta-is-extended-so-how-are-you-liking-it",
          "publishedOn": "2021-09-20T12:37:28.000Z",
          "wordCount": 789,
          "title": "Call Of Duty: Vanguard's open beta is extended, so how are you liking it?"
        },
        {
          "id": "https://www.rockpapershotgun.com/valve-are-removing-32-bit-support-from-dota-2",
          "author": "Alice O'Connor",
          "description": "If you have an ancient PC, you may soon be ejected from Valve's wonderful world of warwizards. They have announced plans to strip Dota 2 of \"support for some older systems and configurations\", including 32-bit operating systems, saying it's so they can \"keep the game and the Source 2 engine fresh\". DirectX 9 and OpenGL are on the chopping block too (but Vulkan support will stand, obvs).\nRead more",
          "link": "https://www.rockpapershotgun.com/valve-are-removing-32-bit-support-from-dota-2",
          "publishedOn": "2021-09-20T11:01:50.000Z",
          "wordCount": 922,
          "title": "Valve are removing 32-bit support from Dota 2"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-sks-loadout-warzone",
          "author": "Kevin Foley",
          "description": "Looking for the best SKS loadout to bring into Warzone? It certainly offers a unique role as a Marksman Rifle with its semi-automatic fire rate capability. The SKS performs the odd role of being underpowered compared to Sniper Rifles, and slow to shoot compared to Tactical Rifles, but you may see that as a worthwhile tradeoff for times when Warzone matches require you to play a ranged support role that can consistently land accurate shots. For this reason, we've put together what we consider to be the best SKS loadout to bring into Warzone.\nRead more",
          "link": "https://www.rockpapershotgun.com/best-sks-loadout-warzone",
          "publishedOn": "2021-09-20T10:48:34.000Z",
          "wordCount": 1080,
          "title": "Best SKS loadout in Warzone Season 5"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-sunday-papers-611",
          "author": "Ed Thorn",
          "description": "Sundays are for treating yourself to some fancy hand sanitiser that smells like citrus. Before you press the pump, let's read this week's best writing about games.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-sunday-papers-611",
          "publishedOn": "2021-09-19T10:00:00.000Z",
          "wordCount": 1279,
          "title": "The Sunday Papers"
        },
        {
          "id": "https://www.rockpapershotgun.com/story-of-seasons-pioneers-of-olive-town-has-sprouted-on-steam",
          "author": "Graham Smith",
          "description": "Every Story Of Seasons game starts the same way, with a young person fleeing the big city for a more relaxing and simple life. Good luck to them, sez I, but personally I find takeaway delivery services much more relaxing and simple than growing my own beets. \r\n\nStory Of Seasons: Pioneers Of Olive Town repeats the myth, though I admit its pastoral greens and funny hats make a strong argument for country living. It's out on Steam now.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/story-of-seasons-pioneers-of-olive-town-has-sprouted-on-steam",
          "publishedOn": "2021-09-18T12:51:00.000Z",
          "wordCount": 824,
          "title": "Story Of Seasons: Pioneers Of Olive Town has sprouted on Steam"
        },
        {
          "id": "https://www.rockpapershotgun.com/dicey-spaceship-crisis-sim-tharsis-is-the-latest-epic-games-store-freebie",
          "author": "Graham Smith",
          "description": "Tharsis is a turn-based spaceship management game where your ability to deal with a Sandra Bullock of disasters is determined by a dice roll. Alec once sung its praises while calling it \"cruel as hell\" - and it's one of this week's free games from the Epic Games Store.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/dicey-spaceship-crisis-sim-tharsis-is-the-latest-epic-games-store-freebie",
          "publishedOn": "2021-09-18T11:13:00.000Z",
          "wordCount": 805,
          "title": "Dicey spaceship crisis sim Tharsis is the latest Epic Games Store freebie"
        },
        {
          "id": "https://www.rockpapershotgun.com/fifa-22-ultimate-team-will-let-you-see-inside-loot-boxes-from-launch",
          "author": "Graham Smith",
          "description": "EA have detailed how FIFA Ultimate Team is changing for FIFA 22 when it launches on September 26th. Chief among the new features is the adoption of Preview Packs, which let you see the contents of one of Ultimate Team's lucrative loot boxes before you decide whether to buy it.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/fifa-22-ultimate-team-will-let-you-see-inside-loot-boxes-from-launch",
          "publishedOn": "2021-09-18T10:30:00.000Z",
          "wordCount": 836,
          "title": "FIFA 22 Ultimate Team will let you see inside loot boxes from launch"
        },
        {
          "id": "https://www.rockpapershotgun.com/victoria-iii-details-its-approach-to-slavery-in-new-dev-diary",
          "author": "Graham Smith",
          "description": "The latest development diary post for Victoria III talks in detail about how Paradox's empire builder will deal with the topic of slavery. Extremely carefully, is the answer.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/victoria-iii-details-its-approach-to-slavery-in-new-dev-diary",
          "publishedOn": "2021-09-18T09:25:00.000Z",
          "wordCount": 921,
          "title": "Victoria III details its approach to slavery in new dev diary"
        },
        {
          "id": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-162",
          "author": "Alice O'Connor",
          "description": "Hold tight, it's still summer! Four more days and then you can put on as many jumps as you want and chug pumpkin spice lattes until you hurl but for now please, don't deny me the dregs of summer. I need this. You're probably indoors playing video games anyway, so what does it matter to you? Tell me: what are you playing this weekend?\nRead more",
          "link": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-162",
          "publishedOn": "2021-09-18T08:00:00.000Z",
          "wordCount": 1048,
          "title": "What are we all playing this weekend?"
        }
      ]
    },
    {
      "title": "Root.cz - články",
      "feedUrl": "https://www.root.cz/rss/clanky/",
      "siteUrl": "https://www.root.cz/clanky/",
      "articles": [
        {
          "id": "www.root.cz-text-15678",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Exekutivě Evropské unie došla trpělivost a chystá nařízení, kterým sjednotí roztříštěný svět nabíječek (nejen) smartphonů. Postihne to všechny, kdo se vymykají standardu USB-C, v čele s Apple.",
          "link": "https://www.root.cz/clanky/evropska-komise-chce-jednotnou-nabijecku-s-usb-c-a-power-delivery/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-23T22:00:10.000Z",
          "wordCount": 2059,
          "title": "Evropská komise chce jednotnou nabíječku s USB-C a Power Delivery",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/485/usb-c-1.jpg",
            "length": "22817",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15675",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Na konci září vyprší platnost kořenového certifikátu DST Root CA X3, na kterém od začátku stála podpora certifikační autority Let's Encrypt. Ta už sice používá nový kořen, ale staré systémy budou mít problém.",
          "link": "https://www.root.cz/clanky/koren-let-s-encrypt-na-konci-mesice-vyprsi-dotkne-se-to-starsich-klientu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T22:00:10.000Z",
          "wordCount": 1766,
          "title": "Kořen Let's Encrypt na konci měsíce vyprší, dotkne se to starších klientů",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/102/cerveny-zamek-1.jpg",
            "length": "46645",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15676",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "V první polovině osmdesátých let patřilo k dobrému vychování dodávat domácí i osobní počítače vybavené nějakým dialektem programovacího jazyka BASIC. Výjimkou není ani IBM PC, pro které byl dodáván mj. i GW-BASIC, později QBasic.",
          "link": "https://www.root.cz/clanky/pc-basic-reinkarnace-popularniho-i-zatracovaneho-gw-basicu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T22:00:05.000Z",
          "wordCount": 8480,
          "title": "PC-BASIC: reinkarnace populárního i zatracovaného GW-BASICu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/567/pc-basic-1.jpg",
            "length": "61248",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15662",
          "author": "redakce@root.cz (Root.cz: Ferenc Lengyel)",
          "description": "Platforma Arduino sa stala veľmi rozšírenou najmä vďaka tomu, že umožňuje veľmi jednoducho naprogramovať rôzne typy kontrolérov pre najrozmanitejšie úlohy. Zároveň využívame väčšinu výhod kontrolérov.",
          "link": "https://www.root.cz/clanky/arduino-mega-na-zbernici-s-pc/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-21T22:00:10.000Z",
          "wordCount": 2060,
          "title": "Arduino Mega na zbernici s PC",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/532/arduino-mega-1.jpg",
            "length": "76480",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15671",
          "author": "redakce@root.cz (Root.cz: Jiří Sluka)",
          "description": "Dnes si představíme jednoduchý editor odvozený z projektu lite, budeme optimalizovat velikost obrázků, začneme si vést vlastní deník a nakonec využijeme průzkumníka slovníků EPWING, LingvoDSL a StarDict.",
          "link": "https://www.root.cz/clanky/softwarova-sklizen-22-9-2021/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-21T22:00:05.000Z",
          "wordCount": 976,
          "title": "Softwarová sklizeň (22. 9. 2021)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/root/368/kombajn-sklizen.jpg",
            "length": "394618",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15642",
          "author": "redakce@root.cz (Root.cz: Michal Tauchman)",
          "description": "V druhé části článků o retrobrightingu se podíváme na samotné výsledky mého snažení. Ve většině případů je výsledek velmi uspokojivý, ale jak uvidíte v jednom případě, ne vždy je vše dokonalé.",
          "link": "https://www.root.cz/clanky/retrobrightin-g-vysledky-procesu-beleni-plastu-a-jeden-prusvih/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T22:00:10.000Z",
          "wordCount": 2684,
          "title": "Retrobrightin­g: výsledky procesu bělení plastu a jeden průšvih",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/324/amiga-retrobrighting-1.jpg",
            "length": "54531",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15668",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "V dnešní části seriálu o křivkách, které nalezneme v přírodě, architektuře, technice i v počítačové grafice, dokončíme popis různých typů spirál. Zabývat se budeme například klotoidou a evolventou.",
          "link": "https://www.root.cz/clanky/krivky-v-prirode-i-v-pocitacove-grafice-svet-spiral-dokonceni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T22:00:05.000Z",
          "wordCount": 7309,
          "title": "Křivky v přírodě i v počítačové grafice – svět spirál (dokončení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/507/krivka-perex-1.jpg",
            "length": "74201",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15667",
          "author": "redakce@root.cz (Root.cz: CSIRT.CZ)",
          "description": "V dnešním díle Postřehů se podíváme na další malý krok směřující ke konci hesel, na agenty NSA, kteří si přivydělávali jako námezdní hackeři, na eskalaci privilegií v HP Omen nebo nový návrh OWASP Top 10.",
          "link": "https://www.root.cz/clanky/postrehy-z-bezpecnosti-ukuste-to-bez-hesel-mily-marconi/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-19T22:00:10.000Z",
          "wordCount": 1427,
          "title": "Postřehy z bezpečnosti: zkuste to bez hesel, milý Marconi!",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/662/mobil-pocitac-1.jpg",
            "length": "40499",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15666",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Firefox Snap bude výchozím prohlížečem v Ubuntu 21.10. Kali Linux 2021.3 NetHunter běží na hodinkách TicWatch Pro. Společnost Jolla oznámila vydání nové verze operačního systému pro chytré telefony Sailfish OS 4.2.0 „Verla“.",
          "link": "https://www.root.cz/clanky/firefox-snap-bude-vychozi-v-ubuntu-kali-linux-na-hodinkach-ticwatch-pro/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-19T22:00:05.000Z",
          "wordCount": 1179,
          "title": "Firefox Snap bude v Ubuntu výchozí, Kali Linux na hodinkách TicWatch Pro",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/172/firefox-ubuntu-1.jpg",
            "length": "19494",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15669",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Objevily se podrobné informace o připravovaných procesorech z dílen firem Intel a AMD. Red Hat chce konečně pořádně vyřešit podporu HDR na linuxovém desktopu. Xiaomi má nový telefon 11T Pro s 108Mpix foťákem.",
          "link": "https://www.root.cz/clanky/red-hat-resi-hdr-v-linuxu-uniky-informaci-od-intelu-a-amd/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-18T22:00:10.000Z",
          "wordCount": 1366,
          "title": "Red Hat řeší HDR v Linuxu, úniky informací od Intelu a AMD",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/615/amd-epyc-64core-1.jpg",
            "length": "41676",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "Root.cz - zprávičky",
      "feedUrl": "https://www.root.cz/rss/zpravicky/",
      "siteUrl": "https://www.root.cz/zpravicky/",
      "articles": [
        {
          "id": "www.root.cz-actuality-42849",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Vývojáři uvolnili konečnou betaverzi připravovaného Ubuntu 21.10 s kódovým označením Impish Indri (rošťácký lemur). Vše jde podle připraveného časového harmonogramu, čeká nás ještě kandidát na vydání a poté přijde 14. října ostrá verze.",
          "link": "https://www.root.cz/zpravicky/vysla-konecna-betaverze-ubuntu-21-10-vydani-je-planovano-na-14-rijna/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-24T10:35:29.000Z",
          "wordCount": 800,
          "title": "Vyšla konečná betaverze Ubuntu 21.10, vydání je plánováno na 14. října",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/537/ubuntu-21-10-impish-indri-1.jpg",
            "length": "13671",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-40036",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Na internetu píšou, že začít s automatizací správy serverů můžete do půl hodiny. Dokážeme vám, že s Ansible to je pravda. Stačí navštívit naše pražské školení Ansible – úvod do automatizace a pak navazující Ansible – role a AWX.",
          "link": "https://www.root.cz/zpravicky/ansible-uvod-do-automatizace-role-a-awx-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-24T09:51:46.000Z",
          "wordCount": 779,
          "title": "Ansible: úvod do automatizace, role a AWX (školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/330/ansible-1.jpg",
            "length": "20637",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42848",
          "author": "redakce@root.cz (Root.cz: D.A. Tiger)",
          "description": "Sourcetrail je open-source program, který slouží k statické analýze a vizualizaci zdrojových kódů v jazycích C, C++ a Python. Dnes jeho vývojáři na svém blogu oznámili ukončení jeho vývoje.",
          "link": "https://www.root.cz/zpravicky/sourcetrail-konci-vyvoj-je-prilis-narocny/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-24T07:20:16.000Z",
          "wordCount": 1235,
          "title": "Sourcetrail končí, vývoj je příliš náročný",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/343/sourcetrail-1.jpg",
            "length": "23300",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42846",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Na základě článku laboratoře QRATOR labs firma MikroTik na svých stránkách upozorňuje na další vlnu DDoS útoků.",
          "link": "https://www.root.cz/zpravicky/mikrotik-zaziva-dalsi-vlnu-ddos-utoku/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-23T07:13:54.000Z",
          "wordCount": 4099,
          "title": "MikroTik zažívá další vlnu DDoS útoků",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/639/mikrotik-1.jpg",
            "length": "30507",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42847",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Vývojáři uvolnili pravidelnou půlroční aktualizaci desktopového prostředí GNOME, tentokrát s označením 41. Mezi hlavní novinky patří vylepšení správce software, nastavení multitaskingu a vylepšení power managementu. Kromě toho je tu nová aplikace Connections, aktualizovaná aplikace Music a vylepšení výkonu v celé řadě komponent.",
          "link": "https://www.root.cz/zpravicky/gnome-41-prinasi-vylepseni-vykonu-a-novinky-v-podpore-waylandu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-23T07:10:05.000Z",
          "wordCount": 779,
          "title": "GNOME 41 přináší vylepšení výkonu a novinky v podpoře Waylandu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/563/gnome-1.jpg",
            "length": "37205",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42845",
          "author": "redakce@root.cz (Root.cz: LD)",
          "description": "Včera večer byla vydána opravná verze VMware vCenter 6.5, 6.7 a 7.0. Tato nová sada verzí opravuje několik kritických zranitelností, od XSS, přístupu k skrytým endpointům API, neoprávněnou manipulaci s nastavením sítě virtuálních strojů, vzdálené mazání souborů na vCenteru až po asi nejzávažnější vzdálené spuštění kódu.",
          "link": "https://www.root.cz/zpravicky/rada-kritickych-chyb-ve-vmware-vcenter/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T20:42:02.000Z",
          "wordCount": 1064,
          "title": "Řada kritických chyb ve VMware vCenter",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/295/vmware-1.jpg",
            "length": "60135",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42844",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Možná nejvýznačnější novinkou v Chrome/Chromium 94 pro uživatele je to, že element canvas je nyní implicitně kalibrován na barevný prostor sRGB, nicméně stránka může specifikovat jiný, podporován je i DCI-P3. Pete LaPage dále doporučuje na web.dev věnovat pozornost textu Eugena Zemtsova o WebCodecs s příklady využití přímého videa pomocí hardwarově akcelerovaných kodeků, které již prohlížeč má (aneb blíží se konec nutnosti dodávat v kódu vlastní neakcelerovanou WASM verzi kodeků). Podpora kodeků skrze WebCodecs se týká jak přehrávání, tak komprese.",
          "link": "https://www.root.cz/zpravicky/chrome-94-nasazuje-srgb-u-elementu-canvas-a-pridava-webgpu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T15:45:46.000Z",
          "wordCount": 842,
          "title": "Chrome 94 nasazuje sRGB u elementu canvas a přidává WebGPU",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/328/chrome-1.jpg",
            "length": "14231",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-41285",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "VPN umožňuje bezpečně propojit různá zařízení pomocí šifrovaných tunelů. Umožňuje také zapojit uživatele do vnitřní sítě přes zabezpečený přístupový bod. Na našem školení VPN a bezpečné připojení k síti s OpenVPN si prakticky ukážeme, jak to celé nastavit a zprovoznit.",
          "link": "https://www.root.cz/zpravicky/vytvorte-si-bezpecnou-vpn-pomoci-openvpn-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T09:49:21.000Z",
          "wordCount": 736,
          "title": "Vytvořte si bezpečnou VPN pomocí OpenVPN (školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/102/openvpn-logo-1.jpg",
            "length": "18777",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42843",
          "author": "redakce@root.cz (Root.cz: spajk)",
          "description": "Test deseti webových prezentací politických stran odhalil v pěti případech kritické zranitelnosti, nejčastěji se jednalo o cross-site scripting, objevily se ale zranitelné zastaralé knihovny a v jednom případě také děravý jedenáct let starý Apache. Více ve zprávě na webu spajk.cz.",
          "link": "https://www.root.cz/zpravicky/webove-stranky-politickych-stran-obsahuji-zranitelnosti/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T08:12:18.000Z",
          "wordCount": 4345,
          "title": "Webové stránky politických stran obsahují zranitelnosti",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/208/xss-notebook-1.jpg",
            "length": "64540",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42841",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "V Linuxu 5.16 dojde ke změně v ovladači nct6775, který obstarává čtení dat ze senzorů mnohých základních desek značky ASUS. Ovladač dostane podporu přístupu k ASIC za použití funkcí ASUS WMI (desky od Asusteku nepoužívají standardní cestu přes ACPI, kterou ovladač disponuje již nyní). S úpravou pak logicky do jádra zamíří i podpora níže uvedeného seznamu základních desek:",
          "link": "https://www.root.cz/zpravicky/linux-5-16-prinese-podporu-senzoru-dalsich-zakladnich-desek-asus/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T06:00:00.000Z",
          "wordCount": 886,
          "title": "Linux 5.16 přinese podporu senzorů dalších základních desek ASUS",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/52/asus-rog-strix-x470-f-gaming-1.jpg",
            "length": "35903",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42840",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Na GIMP 3.0 si ještě chvíli počkáme, vezměmež tedy zavděk dalším, víceméně opravným vydání dva-desítkové řady. GIMP 2.10.28 totiž přináší solidní množství oprav.",
          "link": "https://www.root.cz/zpravicky/gimp-2-10-28-opravuje-dalsi-chyby/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T05:00:00.000Z",
          "wordCount": 823,
          "title": "GIMP 2.10.28 opravuje další chyby",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/158/gimp-2-10-20-1.jpg",
            "length": "50629",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42839",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Canonical rozhodl o prodloužení podpory starších LTS vydání operačního systému Ubuntu na 10 let od první vydané verze. To znamená, že řada Ubuntu 14.04 LTS „Trusty Tahr“ bude podporována až do dubna 2024 a řada Ubuntu 16.04 LTS „Xenial Xerus“ až do dubna 2026.",
          "link": "https://www.root.cz/zpravicky/podpora-ubuntu-14-04-lts-a-16-04-lts-se-prodluzuje-na-10-let/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-21T22:00:00.000Z",
          "wordCount": 1849,
          "title": "Podpora Ubuntu 14.04 LTS a 16.04 LTS se prodlužuje na 10 let",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/223/ubuntu-14-04-esm-1.jpg",
            "length": "22623",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42842",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Laboratoře CZ.NIC vydaly další verzi mobilní Datovky (1.13.0). Kromě oprav nalezených chyb, jako jsou oprava chyby při načítání uložených informací o datovém trezoru nebo vypnutí upozornění na vypršení platnosti hesla, pokud je zvoleno přihlašování Mobilním klíčem, byl podobně jako v případě desktopové aplikace přidán výběr způsobu platby za odesílané poštovní datové zprávy, pokud má uživatel k dispozici více možností.",
          "link": "https://www.root.cz/zpravicky/nova-mobilni-datovka-nabizi-dalsi-zpusob-platby-za-odesilane-postovni-datove-zpravy/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-21T20:00:08.000Z",
          "wordCount": 793,
          "title": "Nová mobilní Datovka nabízí další způsob platby za odesílané poštovní datové zprávy",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/556/datovka-cz-nic-1.jpg",
            "length": "16539",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42838",
          "author": "redakce@root.cz (Root.cz: Ondřej Nový)",
          "description": "Celodenní soutěžní hackathon pro programátory od české technologické společnosti Seznam.cz zná své vítěze. Nejlepší výkon předvedl tým s názvem EasyPeasy.Net ve složení Tomáš Jurásek, Michal Mrnuštík, Michal Motyčka a Adam Jež (zleva).",
          "link": "https://www.root.cz/zpravicky/v-seznamackem-hackathonu-zvitezil-tym-easypeasy-net/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-21T10:06:05.000Z",
          "wordCount": 2384,
          "title": "V seznamáckém hackathonu zvítězil tým EasyPeasy.Net",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/417/hackaton-seznam-cz-2021-1.jpg",
            "length": "67345",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42837",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Kolegové ze serveru Cnews.cz otestovali pět terabajtových SSD pro rozhraní PCIe 4.0. Konkrétně šlo o disky značek WD, Samsung, Adata, Seagate a Aorus, jejichž cena se pohybuje okolo 5500 Kč. Testován byl výkon po připojení na novou sběrnici PCIe 4.0, ale zároveň i ve zpětně kompatibilní PCIe 3.0.",
          "link": "https://www.root.cz/zpravicky/test-terabajtovych-ssd-pro-rozhrani-pcie-4-0-od-wd-samsung-adata-seagate-aorus/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-21T06:34:23.000Z",
          "wordCount": 2347,
          "title": "Test terabajtových SSD pro rozhraní PCIe 4.0 od WD, Samsung, Adata, Seagate, Aorus",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/282/ssd-1.jpg",
            "length": "64824",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42836",
          "author": "redakce@root.cz (Root.cz: Ondřej Caletka)",
          "description": "Chcete-li vytvořit bitovou kopii souborového systému, asi není úplně dobrý nápad používat nástroje jako dd, je-li disk zároveň připojen. Vytváření obrazu bude určitou dobu trvat a pokud se během této doby na disk zapisuje, bude výsledný obraz velmi poškozený.",
          "link": "https://www.root.cz/zpravicky/hot-clone-nastroj-umoznujici-ziskat-obraz-pripojeneho-disku/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T14:58:07.000Z",
          "wordCount": 822,
          "title": "Hot-clone: nástroj umožňující získat obraz připojeného disku",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/508/hdd-pevny-disk-1.jpg",
            "length": "27164",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42835",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "SMB3 server implementovaný v jádře s názvem KSMBD, za kterým stojí Samsung, se dostal do jádra 5.15. To ještě ani nevyšlo a už se v KSMBD objevila závažná zranitelnost, kdy pomocí znaků .. v cestě je možné přistupovat k souborům mimo sdílené adresáře.",
          "link": "https://www.root.cz/zpravicky/smb3-server-v-jadre-5-15-ksmbd-uz-ma-prvni-vaznou-opravu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T14:22:13.000Z",
          "wordCount": 4112,
          "title": "SMB3 server v jádře 5.15 KSMBD už má první vážnou opravu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/567/linux-windows-tux.png",
            "length": "121771",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42834",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Fedora 35 beta by měla vyjít každým dnem. Ostrá verze se očekává 19. října, nebo o týden později. Na serveru mojefedora.cz vyšel dnes článek shrnující novinky očekávané ve Fedoře 35 Workstation.",
          "link": "https://www.root.cz/zpravicky/co-ocekavame-ve-fedore-35/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T14:06:01.000Z",
          "wordCount": 759,
          "title": "Co očekáváme ve Fedoře 35",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/682/fedora-1.jpg",
            "length": "24750",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42833",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Edward Snowden se minulý týden na Twitteru vyjádřil, že nedporučuje používat ExpressVPN. Důvodem je, že bývalý CIO ExpressVPN Daniel Gericke spolu s dalšími dvěma bývalými zaměstnanci NSA pracovali jako nájemní hackeři mezi lety 2016 a 2019 pro firmu DarkMatter ve Spojených arabských emirátech. Za porušení exportních zákonů, jim soud uložil pokutu více jak 1,5 milionů dolarů. Navíc dostali doživotní zákaz bezpečnostní prověrky.",
          "link": "https://www.root.cz/zpravicky/edward-snowden-nedporucuje-pouzivat-expressvpn/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T09:13:40.000Z",
          "wordCount": 2428,
          "title": "Edward Snowden nedoporučuje používat ExpressVPN",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/683/edward-snowden-1.jpg",
            "length": "33281",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-40574",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Linuxových systémů přibývá, každý den se spouštějí nové servery a někdo se o ně musí starat. To znamená spoustu různých dovedností specifických právě pro linuxové prostředí. Jak to zprovoznit, kudy bezpečně dovnitř, co tam najdeme, jak se o to postaráme a jak to nastavíme nebo rozšíříme.",
          "link": "https://www.root.cz/zpravicky/naucte-se-pouzivat-linux-spravne-a-bezpecne-online-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T07:38:28.000Z",
          "wordCount": 762,
          "title": "Naučte se používat Linux správně a bezpečně (online školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/440/skoleni-1.jpg",
            "length": "61676",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42832",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Vývojář jádra Jens Axboe si minulý čtvrtek postěžoval na Lenovo X1 Carbon Gen 9, protože mu při paralelním překladu jádra ( make -j4) notebook sníží frekvenci procesoru až na 400 MHz a stane se prakticky nepoužitelný. Jde o thermal throttling, který má zabránit přehřívání čím dál tenčích a lehčích notebooků.",
          "link": "https://www.root.cz/zpravicky/jak-zabranit-castemu-snizovani-frekvence-u-notebooku/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T06:48:30.000Z",
          "wordCount": 989,
          "title": "Jak zabránit častému snižování frekvence u notebooků",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/230/fedora-lenovo-thinkpad-x1-carbon-1.jpg",
            "length": "33800",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42831",
          "author": "redakce@root.cz (Root.cz: Calculon)",
          "description": "Byla vydána verze 0.5.0 jazyka Idris 2. Z větších změn lze zmínit přidání inkrementálního překladu a zrychlení typové kontroly omezením redukcí v době překladu.",
          "link": "https://www.root.cz/zpravicky/nova-verze-jazyka-idris-2-pridava-inkrementalni-preklad-a-zrychluje-typovou-kontrolu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-19T19:23:50.000Z",
          "wordCount": 746,
          "title": "Nová verze jazyka Idris 2 přidává inkrementální překlad a zrychluje typovou kontrolu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/388/idris-1.jpg",
            "length": "21059",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42829",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Od 23. do 25. září bude probíhat online konference LibreOffice 2021. Během tří dnů je připraveno okolo padesáti přednášek, workshopů a komunitních setkání s tématy týkající se kancelářského balíku, komunity a open source.",
          "link": "https://www.root.cz/zpravicky/online-konference-libreoffice-2021/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-18T10:47:18.000Z",
          "wordCount": 719,
          "title": "Online konference LibreOffice 2021",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/534/libreoffice-1.jpg",
            "length": "14082",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42828",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Český LibreOffice tým vydává překlad příručky LibreOffice Impress 7.0. Tato příručka je určena pro začátečníky i pokročilé uživatele aplikace Impress, prezentační komponenty v LibreOffice. S její pomocí můžete vytvářet snímky, které obsahují text, číslované a odrážkové seznamy, tabulky, grafy, videoklipy, kliparty a další objekty. Impress přichází s předdefinovanými textovými styly a předlohami snímků; můžete si také vytvořit vlastní. Příručka je ke stažení na stránce dokumentace. Tým nyní pracuje na překladu příruček Draw a Base.",
          "link": "https://www.root.cz/zpravicky/cesky-preklad-prirucky-libreoffice-impress-7-0/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-18T06:12:43.000Z",
          "wordCount": 759,
          "title": "Český překlad příručky LibreOffice Impress 7.0",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/534/libreoffice-1.jpg",
            "length": "14082",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42827",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "ČTÚ má nový měřič rychlosti připojení k internetu NetTest. Starý NetMetr bude dál fungovat pod CZ.NIC. NetTest nabízí testování jen přes webové rozhraní, NetMetr měl i mobilní aplikace. NetTest je stejně jako NetMetr založen na open-source řešení rakouského telekomunikačního regulátora RTR. Licence NetTestu by měla být Apache 2.0, ale kód zatím zveřejněn nebyl.",
          "link": "https://www.root.cz/zpravicky/ctu-ma-novy-certifikovany-meric-rychlosti/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-17T15:58:20.000Z",
          "wordCount": 2058,
          "title": "ČTÚ má nový certifikovaný měřič rychlosti NetTest",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/430/tachometr-1.jpg",
            "length": "31442",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "abclinuxu - aktuální články",
      "feedUrl": "http://www.abclinuxu.cz/auto/abc.rss",
      "siteUrl": "http://www.abclinuxu.cz/clanky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-planety-v-centru-mlecne-drahy",
          "author": "Redakce",
          "description": "Moudrost davu. Dokážeme úspěšně předpovědět, kdy k nám dorazí světlo supernovy? Kvasary jako standardní svíčky. Neutron má na povrchu záporný náboj. Proč se zlato vyskytuje vedle arsenu.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-planety-v-centru-mlecne-drahy",
          "publishedOn": "2021-09-23T22:30:00.000Z",
          "wordCount": 1608,
          "title": "Týden na ScienceMag.cz: Planety v centru Mléčné dráhy"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-komunikace-ma-zvysovat-produktivitu-vyvojaru",
          "author": "Redakce",
          "description": "Hlavní trendy umělé inteligence: Malá a rozprostřená data. Nový typ kybernetických útoků – zneužívání proxyware platforem. Roboti, kteří udělají přesnou díru do hlavy, zachraňují životy. O vstupu do nebe rozhoduje sv. Petr, pro síť je tu ClearPass. Kouzla zbavené? Nepravděpodobné řešení hrozící personální krize ve finančních službách. Honeywell u nás investuje do R&D. Komunikace má zvyšovat produktivitu vývojářů.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-komunikace-ma-zvysovat-produktivitu-vyvojaru",
          "publishedOn": "2021-09-19T22:01:00.000Z",
          "wordCount": 1788,
          "title": "Týden na ITBiz: Komunikace má zvyšovat produktivitu vývojářů"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-prepinane-zrcadlo-z-roztaveneho-kovu",
          "author": "Redakce",
          "description": "Černá díra vyžrala hvězdu. Nanotechnologie s černým oxidem titaničitým. Život v atmosféře subneptunů. Maličké hory na neutronových hvězdách.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-prepinane-zrcadlo-z-roztaveneho-kovu",
          "publishedOn": "2021-09-18T22:01:00.000Z",
          "wordCount": 1595,
          "title": "Týden na ScienceMag.cz: Přepínané zrcadlo z roztaveného kovu"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-37-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-37-2021",
          "publishedOn": "2021-09-17T22:01:00.000Z",
          "wordCount": 2594,
          "title": "Událo se v týdnu 37/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/goodoffer24-dozivotni-licence-windows-10-pouze-za-12-super-slevy-az-91",
          "author": "Reklama",
          "description": "Pořiďte si doživotní aktivační klíč k Windows 10 za 12,52 EUR na prodejním portálu GoodOffer24.com. Kromě toho nástrojů produktivity od Microsoftu zde lze získat i hry a další software. Nezapomeňte zadat před dokončením nákupu slevový kód  AX30.",
          "link": "http://www.abclinuxu.cz/clanky/goodoffer24-dozivotni-licence-windows-10-pouze-za-12-super-slevy-az-91",
          "publishedOn": "2021-09-17T16:00:00.000Z",
          "wordCount": 1383,
          "title": "GoodOffer24: Doživotní licence Windows 10 pouze za 12 €, super slevy až 91%!"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/distribucni-novinky-34-35-2021",
          "author": "Redakce",
          "description": "Závěr letních prázdnin a začátek školního roku přinesly několik významných vydání, LibreELEC s novým Kodi, příručky Linux From Scratch nebo novou stabilní větev OpenWrt, a také aktualizace Clonezilly, Ubuntu LTS, EndeavourOS či EasyOS.",
          "link": "http://www.abclinuxu.cz/clanky/distribucni-novinky-34-35-2021",
          "publishedOn": "2021-09-13T23:00:00.000Z",
          "wordCount": 1656,
          "title": "Distribuční novinky 34-35/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-sprava-a-analyza-dat-tlaci-podniky-do-cloudu",
          "author": "Redakce",
          "description": "Lenovo představuje hybridní tablety budoucnosti. Canon rozšiřuje nabídku A3 multifunkcí pro hybridní pracovní prostředí. Správa a analýza dat tlačí podniky do cloudu.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-sprava-a-analyza-dat-tlaci-podniky-do-cloudu",
          "publishedOn": "2021-09-12T22:01:00.000Z",
          "wordCount": 1366,
          "title": "Týden na ITBiz: Správa a analýza dat tlačí podniky do cloudu"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-dokazali-prepnout-vodivost-z-2d-na-1d",
          "author": "Redakce",
          "description": "Topologické izolátory. Janusovský grafen a baterie. Zachycen nový typ gravitačních vln. Dvojvrstvý borofen. Hledání mimozemských civilizací. Dysonovy sféry u černých děr. Planeta Devět. Oblečení z umělých svalových vláken.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-dokazali-prepnout-vodivost-z-2d-na-1d",
          "publishedOn": "2021-09-11T22:01:00.000Z",
          "wordCount": 1609,
          "title": "Týden na ScienceMag.cz: Dokázali přepnout vodivost z 2D na 1D"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-36-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-36-2021",
          "publishedOn": "2021-09-10T22:01:00.000Z",
          "wordCount": 2264,
          "title": "Událo se v týdnu 36/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/originalni-dozivotni-aktivacni-klic-windows-10-pro-za-pouhych-12-52-eur-odgoodoffer24.com",
          "author": "Reklama",
          "description": "Získejte doživotní aktivační klíč k Windows 10 za 12,52 EUR na prodejním portálu GoodOffer24.com. Kromě toho zde můžete získat mnohem více, od dalších nástrojů produktivity od Microsoftu, až po hry. Nezapomeňte zadat před dokončením nákupu slevový kód  AX30.",
          "link": "http://www.abclinuxu.cz/clanky/originalni-dozivotni-aktivacni-klic-windows-10-pro-za-pouhych-12-52-eur-odgoodoffer24.com",
          "publishedOn": "2021-09-10T20:30:00.000Z",
          "wordCount": 1395,
          "title": "Originální doživotní aktivační klíč Windows 10 Pro za pouhých 12,52 EUR od Goodoffer24.com"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/jaderne-noviny-prehled-za-srpen-2021",
          "author": "Redakce",
          "description": "Přehled srpnových vydání Jaderných novin: stav vydání jádra, citáty týdne a seznam článků týkajících se jádra.",
          "link": "http://www.abclinuxu.cz/clanky/jaderne-noviny-prehled-za-srpen-2021",
          "publishedOn": "2021-09-06T22:01:00.000Z",
          "wordCount": 2058,
          "title": "Jaderné noviny – přehled za srpen 2021"
        }
      ]
    },
    {
      "title": "abclinuxu - čerstvé zprávičky",
      "feedUrl": "http://www.abclinuxu.cz/auto/zpravicky.rss",
      "siteUrl": "http://www.abclinuxu.cz/zpravicky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/zpravicky/cinska-centralni-banka-prohlasila-transakce-kryptomenami-za-nezakonne",
          "author": "Ladislav Hagara",
          "description": "Čínská centrální banka prohlásila transakce kryptoměnami za nezákonné.",
          "link": "http://www.abclinuxu.cz/zpravicky/cinska-centralni-banka-prohlasila-transakce-kryptomenami-za-nezakonne",
          "publishedOn": "2021-09-24T11:57:06.000Z",
          "wordCount": 894,
          "title": "Čínská centrální banka prohlásila transakce kryptoměnami za nezákonné"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/ubuntu-21.10-impish-indri-final-beta",
          "author": "Ladislav Hagara",
          "description": "Byla vydána finální beta verze Ubuntu 21.10 s kódovým názvem Impish Indri. Přehled novinek v poznámkách k vydání. Dle plánu by Ubuntu 21.10 mělo vyjít 14. října 2021.",
          "link": "http://www.abclinuxu.cz/zpravicky/ubuntu-21.10-impish-indri-final-beta",
          "publishedOn": "2021-09-24T08:56:45.000Z",
          "wordCount": 909,
          "title": "Ubuntu 21.10 (Impish Indri) Final Beta"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/testovaci-vzorky-evropskeho-procesoru-epi-epac1.0-risc-v",
          "author": "Ladislav Hagara",
          "description": "Evropská procesorová iniciativa (European Processor Initiative, EPI) oznámila, že obdržela 143 testovacích vzorků procesoru EPI EPAC1.0 RISC-V. Cílem EPI jsou nízkoenergetické výkonné evropské procesory.",
          "link": "http://www.abclinuxu.cz/zpravicky/testovaci-vzorky-evropskeho-procesoru-epi-epac1.0-risc-v",
          "publishedOn": "2021-09-24T01:04:06.000Z",
          "wordCount": 1178,
          "title": "Testovací vzorky evropského procesoru EPI EPAC1.0 RISC-V"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/easy-anti-cheat-od-epic-games-take-pro-linux",
          "author": "Ladislav Hagara",
          "description": "Společnost Epic Games v souvislosti s přenosným herním PC Steam Deck se SteamOS oznámila, že její Epic Online Services nově nabízí Easy Anti-Cheat také pro vývojáře her pro Linux. Podporováno je Wine i Proton.",
          "link": "http://www.abclinuxu.cz/zpravicky/easy-anti-cheat-od-epic-games-take-pro-linux",
          "publishedOn": "2021-09-23T19:48:31.000Z",
          "wordCount": 846,
          "title": "Easy Anti-Cheat od Epic Games také pro Linux"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/waydroid-android-na-gnu-linuxu",
          "author": "Ladislav Hagara",
          "description": "Waydroid (GitHub) umožňuje spouštět aplikace pro Android na běžných linuxových distribucích. Běhové prostředí vychází z LineageOS. Jedná se o alternativu k Anboxu.",
          "link": "http://www.abclinuxu.cz/zpravicky/waydroid-android-na-gnu-linuxu",
          "publishedOn": "2021-09-23T13:46:27.000Z",
          "wordCount": 895,
          "title": "Waydroid, Android na GNU/Linuxu"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/the-official-raspberry-pi-handbook-2022",
          "author": "Ladislav Hagara",
          "description": "Byl vydán The Official Raspberry Pi Handbook 2022 (pdf), tj. oficiální dvousetstránková příručka k Raspberry Pi se spoustou nápadů, typů, projektů a recenzí.",
          "link": "http://www.abclinuxu.cz/zpravicky/the-official-raspberry-pi-handbook-2022",
          "publishedOn": "2021-09-23T12:59:28.000Z",
          "wordCount": 853,
          "title": "The Official Raspberry Pi Handbook 2022"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/lennart-poettering-bezpecne-bootovani-a-sifrovani-disku-v-linuxu",
          "author": "Ladislav Hagara",
          "description": "Lennart Poettering se v příspěvku na svém blogu podrobně věnuje bezpečnému bootování a šifrování disků v linuxových distribucích. Začíná kontroverzně: \"Linux již dlouho podporuje šifrování disků a technologie jako UEFI SecureBoot a TPM. Jejich nastavení ale ve většině linuxových distribucí pokulhává. Ve skutečnosti jsou data pravděpodobně bezpečněji uložena na zařízeních s ChromeOS, Android, Windows nebo MacOS než v běžných linuxových distribucích\".",
          "link": "http://www.abclinuxu.cz/zpravicky/lennart-poettering-bezpecne-bootovani-a-sifrovani-disku-v-linuxu",
          "publishedOn": "2021-09-23T11:19:41.000Z",
          "wordCount": 1608,
          "title": "Lennart Poettering: Bezpečné bootování a šifrování disků v Linuxu"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/nyxt-2.2.0",
          "author": "Ladislav Hagara",
          "description": "Byla vydána verze 2.2.0 webového prohlížeče Nyxt (GitHub). Dle vývojářů se jedná o prohlížeč pro pokročilé uživatele požadující ovladatelnost pomocí klávesnice.",
          "link": "http://www.abclinuxu.cz/zpravicky/nyxt-2.2.0",
          "publishedOn": "2021-09-23T08:55:53.000Z",
          "wordCount": 811,
          "title": "Nyxt 2.2.0"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/jupyterlab-app-3.1.12-1",
          "author": "Ladislav Hagara",
          "description": "Po třech letech byl restartován vývoj a vydána nová verze 3.1.12-1 desktopové aplikace JupyterLab App postavené na frameworku Electron. Jedná se o distribuci JupyterLabu v jednom balíku.",
          "link": "http://www.abclinuxu.cz/zpravicky/jupyterlab-app-3.1.12-1",
          "publishedOn": "2021-09-23T01:24:47.000Z",
          "wordCount": 819,
          "title": "JupyterLab App 3.1.12-1"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/gnome-41",
          "author": "Ladislav Hagara",
          "description": "Po půl roce vývoje od vydání verze 40 bylo vydáno GNOME 41 (YouTube). Přehled novinek i s náhledy v poznámkách k vydání a v novinkách pro vývojáře a správce systémů.",
          "link": "http://www.abclinuxu.cz/zpravicky/gnome-41",
          "publishedOn": "2021-09-22T15:47:40.000Z",
          "wordCount": 2491,
          "title": "GNOME 41"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=MidnightBSD-2.1-Released",
          "author": null,
          "description": "MidnightBSD 2.1 debuted this week as the latest version of one of the few desktop-focused BSD open-source operating system projects...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=MidnightBSD-2.1-Released",
          "publishedOn": "2021-09-24T09:46:49.000Z",
          "wordCount": 686,
          "title": "MidnightBSD 2.1 Released For This Desktop-Minded BSD"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-21.10-Beta",
          "author": null,
          "description": "Canonical has released the final beta of next month's Ubuntu 21.10 \"Impish Indri\" release...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-21.10-Beta",
          "publishedOn": "2021-09-24T09:16:12.000Z",
          "wordCount": 681,
          "title": "Ubuntu 21.10 Beta Released"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Chrome-95-Beta",
          "author": null,
          "description": "With Chrome 94 having shipped this week, Google has now promoted Chrome 95 to beta...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Chrome-95-Beta",
          "publishedOn": "2021-09-24T04:01:00.000Z",
          "wordCount": 789,
          "title": "Chrome 95 Beta Completely Removes Deprecated FTP Support, Reduced User Agent Info Trial"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Regression-Fixed",
          "author": null,
          "description": "As a follow-up to A Fix Is Pending For That Linux 5.15 Performance Regression, Linus Torvalds decided to pull the fix directly into Linux 5.15 Git today for addressing this real-world, measurable performance regression...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Regression-Fixed",
          "publishedOn": "2021-09-24T04:00:00.000Z",
          "wordCount": 805,
          "title": "Linux 5.15 Lands Memcg Performance Regression Fix"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=BPFILTER-2021",
          "author": null,
          "description": "Generating much excitement back in 2018 was bpfilter for the potential to better Linux's firewall and packet filtering by making it more robust and performance. Recently work on this BPF-based firewall solution was renewed and the performance potential over iptables and nftables is looking very good for the future...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=BPFILTER-2021",
          "publishedOn": "2021-09-23T20:00:00.000Z",
          "wordCount": 785,
          "title": "BPF-Based Linux Firewall \"bpfilter\" Shows Impressive Performance Potential"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Easy-Anti-Cheat-Linux",
          "author": null,
          "description": "Not too surprising given the Steam Deck is inching closer towards release and we've known Valve has been working to improve the anti-cheat situation for games on Linux, but today EAC owner Epic Games officially announced Easy Anti-Cheat for both Linux and macOS...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Easy-Anti-Cheat-Linux",
          "publishedOn": "2021-09-23T18:40:59.000Z",
          "wordCount": 768,
          "title": "Epic Games Announces Easy Anti-Cheat For Linux - Including Wine/Proton"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=FUTEX2-futex_waitv-v2",
          "author": null,
          "description": "The promising FUTEX2 work focused on improving the Linux performance for running Windows games via Wine/Proton by extending futex to wait on multiple locks is still moving forward...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=FUTEX2-futex_waitv-v2",
          "publishedOn": "2021-09-23T18:16:02.000Z",
          "wordCount": 797,
          "title": "Updated \"FUTEX2\" futex_waitv Patches Posted To Address Latest Feedback"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30536",
          "author": null,
          "description": "Last week was the article on noticing various workloads performing slower on the Linux 5.15 development kernel. There is now a patch pending that in testing so far does indeed correct the performance drop on this forthcoming kernel.",
          "link": "https://www.phoronix.com/vr.php?view=30536",
          "publishedOn": "2021-09-23T13:15:19.000Z",
          "wordCount": 684,
          "title": "A Fix Is Pending For That Linux 5.15 Performance Regression"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Microsoft-CLOn12-Mesa-SPIR-V",
          "author": null,
          "description": "Microsoft's \"CLOn12\" effort to allow OpenCL over DirectX 12 by leveraging Mesa now has landed a major rework to its code within Mesa...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Microsoft-CLOn12-Mesa-SPIR-V",
          "publishedOn": "2021-09-23T13:09:48.000Z",
          "wordCount": 714,
          "title": "Microsoft's \"CLOn12\" Mesa Code Adds SPIR/SPIR-V Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GCC-12-Better-Security",
          "author": null,
          "description": "Qing Zhao of Oracle presented yesterday during the LPC2021 GNU Tools Track around the work they and others have been engaged in for improving the security of the GNU Compiler Collection (GCC)...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GCC-12-Better-Security",
          "publishedOn": "2021-09-23T11:17:23.000Z",
          "wordCount": 825,
          "title": "GCC 12 Adds Stack Variable Auto-Initialization, Other Security Improvements Forthcoming"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-FDE-Auth-Boot-Lacking",
          "author": null,
          "description": "Most Linux distributions are currently coming up short from offering adequate security around full disk encryption and authenticated boot. Prominent Linux developer Lennart Poettering even argues that your data is \"probably more secure if stored on current ChromeOS, Android, Windows or macOS devices.\"..",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-FDE-Auth-Boot-Lacking",
          "publishedOn": "2021-09-23T10:23:47.000Z",
          "wordCount": 878,
          "title": "Lennart: Linux Comes Up Short Around Disk Encryption, Authenticated Boot Security"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.16-panel-edp",
          "author": null,
          "description": "The latest batch of miscellaneous Direct Rendering Manager changes are on their way to DRM-Next for Linux 5.16. Notable from this new drm-misc-next batch is the new \"panel-edp\" driver...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.16-panel-edp",
          "publishedOn": "2021-09-23T10:12:38.000Z",
          "wordCount": 767,
          "title": "\"panel-edp\" Driver On Its Way To Linux 5.16 To Make For Less Hard-Coded eDP Panel Configs"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=systemd-oomd-2021",
          "author": null,
          "description": "Systemd-oomd as the out-of-memory daemon originally developed by Facebook has been maturing nicely since being merged last year and then its most notable deployment to date has been with Fedora 34's debut earlier this year. Anita Zhang of Facebook provided an update today on the systemd-oomd effort...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=systemd-oomd-2021",
          "publishedOn": "2021-09-23T04:00:00.000Z",
          "wordCount": 917,
          "title": "systemd OOMD Maturing Nicely, Adds Support For User Services"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-Deck-FAQ",
          "author": null,
          "description": "Valve today published a \"Steam Deck FAQ\" page sharing some additional information on this forthcoming Arch Linux powered handheld game system that will begin shipping at the end of Q4...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-Deck-FAQ",
          "publishedOn": "2021-09-23T00:18:02.000Z",
          "wordCount": 779,
          "title": "Valve Publishes New Steam Deck FAQ With A Few New Details Shared"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Android-Linux-Upstream-First",
          "author": null,
          "description": "Google's Android had been notorious for all of its downstream patches carried by the mobile operating system as well as various vendor/device kernel trees while in recent years more of that code has been upstreamed. Google has also been shifting to the Android Generic Kernel Image (GKI) as the basis for all their product kernels to further reduce the fragmentation. Looking ahead, Google is now talking of an \"upstream first\" approach for pushing new kernel features...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Android-Linux-Upstream-First",
          "publishedOn": "2021-09-22T18:38:46.000Z",
          "wordCount": 923,
          "title": "Google Finally Shifting To \"Upstream First\" Linux Kernel Approach For Android Features"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-RADV-RT-For-Older-GPUs",
          "author": null,
          "description": "Merged yesterday for Mesa 21.3 was open-source Vulkan ray-tracing for AMD RDNA2 / RX 6000 series GPUs with the RADV driver. Opened today now is a merge request that would provide Vulkan ray-tracing with RADV to pre-RDNA2 GPUs on this driver going back to the likes of Polaris, granted the performance is another story...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-RADV-RT-For-Older-GPUs",
          "publishedOn": "2021-09-22T17:14:25.000Z",
          "wordCount": 902,
          "title": "Mesa Merge Pending For Vulkan Ray-Tracing On Older AMD GPUs"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GNOME-41-Released",
          "author": null,
          "description": "GNOME 41 is out as the latest half-year update to this open-source desktop environment...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GNOME-41-Released",
          "publishedOn": "2021-09-22T15:23:58.000Z",
          "wordCount": 706,
          "title": "GNOME 41 Released With Wayland Improvements, More Performance Tuning"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30535",
          "author": null,
          "description": "Earlier this month AMD posted their initial public patches for the AMD P-State CPU frequency scaling driver that leverages ACPI CPPC for ultimately aiming to provide better power efficiency and more responsive CPU frequency scaling / performance state decisions on Zen 3 (and Zen 2 eventually) processors. This is part of the effort around AMD and Valve collaborating for better Linux efficiency especially with the AMD-powered Steam Deck.",
          "link": "https://www.phoronix.com/vr.php?view=30535",
          "publishedOn": "2021-09-22T13:38:59.000Z",
          "wordCount": 901,
          "title": "An Early Look At The AMD P-State CPPC Driver Performance vs. ACPI CPUFreq"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GCC-Better-OpenACC-Performance",
          "author": null,
          "description": "While the GNU Compiler Collection has supported OpenACC for a few years now as this parallel programming standard popular with GPUs/accelerators, the current implementation has been found to be inadequate for many real-world HPC workloads leveraging OpenACC. Fortunately, Siemens has been working to improve GCC's OpenACC kernels support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GCC-Better-OpenACC-Performance",
          "publishedOn": "2021-09-22T10:40:26.000Z",
          "wordCount": 835,
          "title": "Better Support & Performance For OpenACC Kernels Is Coming To GCC"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Aya-LPC2021-Update",
          "author": null,
          "description": "Aya was presented during this week's Linux Plumbers Conference for improving the eBPF developer experience by allowing Rust programs to easily run within the kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Aya-LPC2021-Update",
          "publishedOn": "2021-09-22T09:57:22.000Z",
          "wordCount": 770,
          "title": "Aya Makes It Easy To Write Rust-Based eBPF Programs For The Linux Kernel"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-Touch-OTA-19",
          "author": null,
          "description": "UBports on Tuesday released Ubuntu Touch OTA-19 as the latest refinement to this Ubuntu Linux spin for smartphones and tablets...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-Touch-OTA-19",
          "publishedOn": "2021-09-22T07:40:00.000Z",
          "wordCount": 767,
          "title": "Ubuntu Touch OTA-19 Released - Still Based On Ubuntu 16.04"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.2.2",
          "author": null,
          "description": "Mesa point releases generally come every two weeks but for the past month have fallen off the wagon. Mesa 21.2.1 came in mid-August and on Tuesday was finally succeeded by Mesa 21.2.2 as a \"late and very large\" update...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.2.2",
          "publishedOn": "2021-09-22T04:00:00.000Z",
          "wordCount": 781,
          "title": "Mesa 21.2.2 Released \"Late & Very Large\""
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=X.Org-Server-21.1-RC1",
          "author": null,
          "description": "More than three years after X.Org Server 1.20 was released, it's set to finally be succeeded soon by X.Org Server 21.1 under its new versioning scheme. Out today is the X.org Server 21.1 release candidate...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=X.Org-Server-21.1-RC1",
          "publishedOn": "2021-09-21T22:55:00.000Z",
          "wordCount": 815,
          "title": "X.Org Server 21.1 RC1 Released With VRR Support For Modesetting Driver, Other Features"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMDGPU-Device-Enumeration-IP",
          "author": null,
          "description": "AMD's open-source Linux graphics driver engineers are working to overhaul how the initial driver loading with device enumeration happens to ultimately make it more robust. In the process though PCI IDs become less important and in turn less of an avenue for exposing possible indicators of new graphics cards...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMDGPU-Device-Enumeration-IP",
          "publishedOn": "2021-09-21T21:00:00.000Z",
          "wordCount": 1142,
          "title": "AMDGPU Linux Driver To Overhaul Its Approach To Device Enumeration"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Blender-3.0-Lands-Cycles-X",
          "author": null,
          "description": "Cycles X as a modernizing of Blender's Cycles rendering engine has now landed in the latest development code for Blender 3.0. Cycles X brings big performance improvements but does eliminate OpenCL support in the process...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Blender-3.0-Lands-Cycles-X",
          "publishedOn": "2021-09-21T19:33:07.000Z",
          "wordCount": 888,
          "title": "Cycles X Merged Into Blender 3.0 With NVIDIA CUDA/OptiX Support, AMD HIP Pending"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Chrome-94-Released",
          "author": null,
          "description": "Chrome 94 is available today as another exciting update for Google's web browser...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Chrome-94-Released",
          "publishedOn": "2021-09-21T18:48:29.000Z",
          "wordCount": 816,
          "title": "Chrome 94 Released With WebGPU For Testing, WebCodecs API Now Official"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GNU-Profiler-gprofng",
          "author": null,
          "description": "Oracle engineers have been working on \"gprofng\" as a next-generation GNU Profiler that can analyze production binaries. Oracle talked up Gprofng today during the GNU Tools Track as part of Linux Plumbers Conference 2021...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GNU-Profiler-gprofng",
          "publishedOn": "2021-09-21T18:21:41.000Z",
          "wordCount": 769,
          "title": "Oracle's Next-Generation GNU Profiler \"gprofng\" Is Looking Great For Developers"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Foundation-PaSh",
          "author": null,
          "description": "The Linux Foundation announced today they will be hosting the PaSh project that is focused on automatically parallelizing POSIX shell scripts...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Foundation-PaSh",
          "publishedOn": "2021-09-21T17:16:59.000Z",
          "wordCount": 789,
          "title": "Linux Foundation To Host PaSh For Automatic Parallelizing Of Shell Scripts"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Samba-4.15",
          "author": null,
          "description": "While there is now KSMBD with Linux 5.15 for offering an in-kernel SMB file server, its scope is much more limited than that of the Samba project in user-space. With that said, Samba 4.15 is out now with its latest batch of features and improvements for open-source SMB/CIFS support on Linux and other platforms...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Samba-4.15",
          "publishedOn": "2021-09-21T12:40:31.000Z",
          "wordCount": 762,
          "title": "Samba 4.15 Released With Improved CLI Experience, Modernized VFS Interface"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-14.04-16.04-Ten-Years",
          "author": null,
          "description": "Canonical is announcing this morning they are extending the Ubuntu 14.04 LTS \"Trusty Tahr\" and Ubuntu 16.04 LTS \"Xenial Xerus\" releases to a ten year lifespan...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-14.04-16.04-Ten-Years",
          "publishedOn": "2021-09-21T12:00:00.000Z",
          "wordCount": 812,
          "title": "Canonical Extending Ubuntu 14.04/16.04 LTS Support To Ten Years"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Vulkan-Video-XDC2021",
          "author": null,
          "description": "Going public back in April was the provisional specification around the Vulkan Video extensions as a new industry-standard video encode/decode interface. While several months have passed, there hasn't been much activity yet in the open-source space around Vulkan Video...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Vulkan-Video-XDC2021",
          "publishedOn": "2021-09-21T10:33:48.000Z",
          "wordCount": 827,
          "title": "Vulkan Video Decoding Still In The Early Stages For Open-Source"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-RADV-Ray-Tracing",
          "author": null,
          "description": "Landing overnight into Mesa 21.3 was experimentally enabling the Vulkan ray-tracing extensions within the open-source Radeon \"RADV\" driver...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-RADV-Ray-Tracing",
          "publishedOn": "2021-09-21T09:25:36.000Z",
          "wordCount": 723,
          "title": "Mesa 21.3 Lands Initial Radeon Ray-Tracing Support In Open-Source RADV Vulkan Driver"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/rss.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2519/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2519/",
          "publishedOn": "2021-09-22T04:00:00.000Z",
          "wordCount": 185,
          "title": "Sloped Border"
        },
        {
          "id": "https://xkcd.com/2518/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2518/",
          "publishedOn": "2021-09-20T04:00:00.000Z",
          "wordCount": 187,
          "title": "Lumpers and Splitters"
        },
        {
          "id": "https://xkcd.com/2517/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2517/",
          "publishedOn": "2021-09-17T04:00:00.000Z",
          "wordCount": 185,
          "title": "Rover Replies"
        },
        {
          "id": "https://xkcd.com/2516/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2516/",
          "publishedOn": "2021-09-15T04:00:00.000Z",
          "wordCount": 185,
          "title": "Hubble Tension"
        }
      ]
    }
  ],
  "cliVersion": "1.11.1"
}