{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": [
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.2",
          "author": null,
          "description": "Fixed: unicode characters in URL caused download error\nFixed: project root npm install error\nAdded: unit test library\nChore: Dependency updates\nThank you: @CaptNo1",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.2",
          "publishedOn": "2021-09-26T18:45:39.000Z",
          "wordCount": 354,
          "title": "v1.11.2"
        },
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "author": null,
          "description": "Fixed: Unexpected nested element in author field crashes the parser\nThank you @ad-m",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "publishedOn": "2021-09-16T06:39:32.000Z",
          "wordCount": 344,
          "title": "v1.11.1"
        }
      ]
    },
    {
      "title": "Kotaku",
      "feedUrl": "https://kotaku.com/rss",
      "siteUrl": "https://kotaku.com",
      "articles": [
        {
          "id": "1847849097",
          "author": "Ian Walker",
          "description": "Thanks to a recent fan translation of a nine-year-old PlayStation Portable game, every installment of the Suikoden role-playing franchise is now playable in English.\n\nRead more...",
          "link": "https://kotaku.com/suikoden-s-last-untranslated-game-is-finally-playable-i-1847849097",
          "publishedOn": "2021-10-12T19:20:00.000Z",
          "wordCount": 579,
          "title": "Last Untranslated Suikoden Game Is Finally Playable In English"
        },
        {
          "id": "1847847817",
          "author": "Ari Notis",
          "description": "Hey, wanna hear a ghost story? It’s short, just one act. Here you go: We’re already at Halloween season. I can tell this not by the seasonal weather (my weather app clocked a high of 73 F today) or pumpkin beer (there’s a shortage this year) but because Niantic recently unveiled the details of Pokémon Go’s annual…\nRead more...",
          "link": "https://kotaku.com/pokemon-go-s-halloween-update-adds-ghosts-very-large-p-1847847817",
          "publishedOn": "2021-10-12T17:30:00.000Z",
          "wordCount": 427,
          "title": "Pokémon Go’s Halloween Update Adds Ghosts, Very Large Pokémon"
        },
        {
          "id": "1847847438",
          "author": "Sisi Jiang",
          "description": "Not everyone is happy about Childe featuring heavily in the upcoming 2.2 update releasing on October 13, and I wish I could stop hearing about it. While he’s treated as a nuisance by characters in the game, it seems that the sentiment also carries over to the Genshin community. \nRead more...",
          "link": "https://kotaku.com/genshin-impact-villain-childe-deserves-all-the-events-a-1847847438",
          "publishedOn": "2021-10-12T17:05:00.000Z",
          "wordCount": 960,
          "title": "Genshin Impact Villain Childe Deserves All The Events And Reruns"
        },
        {
          "id": "1847846662",
          "author": "Ethan Gach",
          "description": "If it walks like Among Us, talks like Among Us, and quacks like Among Us, it was probably at the very least inspired by the runaway success of Innersloth’s murder mystery party game. Epic Games is now finally copping to that in the patch notes for a new update to Fornite’s Impostors mode.\nRead more...",
          "link": "https://kotaku.com/epic-finally-admits-among-us-inspired-fortnites-imposto-1847846662",
          "publishedOn": "2021-10-12T16:00:00.000Z",
          "wordCount": 595,
          "title": "Epic Finally Admits Among Us Inspired Fortnite's Impostors Mode [Update]"
        },
        {
          "id": "1847846422",
          "author": "Renata Price",
          "description": "As the legal maelstrom continues to grow in the multiple cases against Activision Blizzard, things have taken one of the most bizarre twists yet. The EEOC (with whom Activision Blizzard are attempting to settle) has accused the California DFEH (who are attempting to intervene in that settlement) of using its own…\nRead more...",
          "link": "https://kotaku.com/activision-blizzard-lawsuit-clusterfuck-gets-more-clust-1847846422",
          "publishedOn": "2021-10-12T15:45:00.000Z",
          "wordCount": 1117,
          "title": "Activision Blizzard Lawsuit Mess Gets Far Messier"
        },
        {
          "id": "1847846504",
          "author": "Ari Notis",
          "description": "We’re really gonna do this song and dance again, aren’t we? Far Cry 6 players are having trouble starting a new game file on PlayStation 4 and continuing that same save file on PlayStation 5. It’s a similar problem to the one that plagued blockbusters like Marvel’s Avengers and Final Fantasy VII Remake.\n\nRead more...",
          "link": "https://kotaku.com/far-cry-6s-playstation-save-transfers-are-a-pain-in-the-1847846504",
          "publishedOn": "2021-10-12T15:30:00.000Z",
          "wordCount": 599,
          "title": "Far Cry 6's PlayStation Save Transfers Are A Pain In The Ass"
        },
        {
          "id": "1847843623",
          "author": "Alexandra Hall",
          "description": "Last week, publisher City Connection released new versions of the arcade / Sega Saturn shmups Cotton 2, Cotton Boomerang, and Guardian Force for both PS4 and Switch. It wasn’t long before Switch tinkerers over on GBAtemp realized they could inject other Saturn games into City Connection’s emulator, which turned out…\nRead more...",
          "link": "https://kotaku.com/console-hackers-commandeer-switch-game-s-very-fast-sega-1847843623",
          "publishedOn": "2021-10-12T13:30:00.000Z",
          "wordCount": 666,
          "title": "Console Hackers Commandeer Switch Game’s Very Fast Sega Saturn Emulator"
        },
        {
          "id": "1847842937",
          "author": "Ian Walker",
          "description": "During a recent TechRadar interview, Fall Guys lead game designer Joe Walsh said the dev team at Mediatonic is currently toying with the idea of retrieving an unused minigame from the cutting-room floor. And it’s all thanks to Netflix’s latest original series, Squid Game.\nRead more...",
          "link": "https://kotaku.com/squid-game-s-success-is-giving-fall-guys-some-ideas-1847842937",
          "publishedOn": "2021-10-12T13:00:00.000Z",
          "wordCount": 527,
          "title": "Squid Game’s Success Is Giving Fall Guys Some Ideas"
        },
        {
          "id": "1847844603",
          "author": "Brian Ashcraft",
          "description": "The country of Japan is crisscrossed with train tracks. Many of them are memorable and great, but for me, one train stands apart as truly special—the Hankyu train. I’m not alone—it turns out Hideo Kojima agrees.\nIn his forthcoming book, The Creative Gene, Kojima has a chapter titled, “For Me, The Hankyu Railway Is A…\nRead more...",
          "link": "https://kotaku.com/hideo-kojima-on-japans-most-magical-and-wonderful-train-1847844603",
          "publishedOn": "2021-10-12T09:30:00.000Z",
          "wordCount": 918,
          "title": "Hideo Kojima On Japan's Most Magical And Wonderful Train"
        },
        {
          "id": "1847842962",
          "author": "Luke Plunkett",
          "description": "The Super Mario 64 you know and remember is the one that’s coded properly, and every surface in the game is pointing in the direction it’s supposed to be. Here is what happens when that is not the case.\nRead more...",
          "link": "https://kotaku.com/super-mario-64-only-every-corner-is-wrong-1847842962",
          "publishedOn": "2021-10-12T00:20:00.000Z",
          "wordCount": 118,
          "title": "Super Mario 64, Only Every Corner Is Wrong"
        },
        {
          "id": "1847842856",
          "author": "Alex Walker",
          "description": "Dungeons & Dragons has come a hell of a long way, except in one very precise area: units of measurement.\n\nRead more...",
          "link": "https://kotaku.com/d-d-fans-want-wizards-of-the-coast-to-use-the-metric-sy-1847842856",
          "publishedOn": "2021-10-12T00:00:00.000Z",
          "wordCount": 699,
          "title": "D&D Fans Want Wizards Of The Coast To Use The Metric System"
        },
        {
          "id": "1847842352",
          "author": "Luke Plunkett",
          "description": "Depending on how you count it, and break down the regional differences, Arabic is the fifth most-spoken language on Earth. And yet until very recently, Arabic speakers had no way of playing The Legend of Zelda: Breath of the Wild—a game released in 2017—in their native tongue.\n\nRead more...",
          "link": "https://kotaku.com/its-2021-and-breath-of-the-wild-is-finally-playable-in-1847842352",
          "publishedOn": "2021-10-11T22:30:00.000Z",
          "wordCount": 546,
          "title": "It's 2021, And Breath Of The Wild Is Finally Playable In Arabic"
        },
        {
          "id": "1847841896",
          "author": "Luke Plunkett",
          "description": "“Epic Games is considering launching an entertainment division focused on scripted video programming.” Funny how a sentence can feel both so absurd and yet so inevitable at the same time.\n\nRead more...",
          "link": "https://kotaku.com/i-have-seen-hell-and-it-is-epic-thinking-about-a-fortn-1847841896",
          "publishedOn": "2021-10-11T21:30:00.000Z",
          "wordCount": 473,
          "title": "I Have Seen Hell, And It Is Epic Thinking About A Fortnite Movie"
        },
        {
          "id": "1847841327",
          "author": "Ian Walker",
          "description": "Monster Hunter Rise won’t include an option to transfer saves from Switch or play with folks on other platforms when it arrives on PC early next year, the series’ official Twitter account confirmed today.\nRead more...",
          "link": "https://kotaku.com/your-hard-earned-monster-hunter-rise-progress-won-t-tra-1847841327",
          "publishedOn": "2021-10-11T20:55:00.000Z",
          "wordCount": 438,
          "title": "Your Hard-Earned Monster Hunter Rise Progress Won’t Transfer From Switch To PC"
        },
        {
          "id": "1847841160",
          "author": "Sisi Jiang",
          "description": "The Genshin Impact community is abuzz over the upcoming arrival of Arataki Itto, a new character who hails from the game’s Inazuma nation. In an unusual move, Genshin developer miHoYo formally announced the character today, well in advance of his story quest appearance in the game itself. While little is yet known…\nRead more...",
          "link": "https://kotaku.com/genshin-impact-s-latest-character-announcement-is-bring-1847841160",
          "publishedOn": "2021-10-11T20:25:00.000Z",
          "wordCount": 580,
          "title": "Genshin Impact’s Latest Character Announcement Is Bringing Out The Thirst"
        },
        {
          "id": "1847840785",
          "author": "Ari Notis",
          "description": "The holidays come a little early this year for fans of first-person shooters. On November 19, EA will publish Battlefield 2042, a game about how, in the wake of catastrophic climate change, we’ll still all shoot each other for scraps. That’s followed on December 8 by Halo Infinite, the sixth mainline entry in…\nRead more...",
          "link": "https://kotaku.com/halo-infinite-vs-battlefield-2042-battle-of-the-betas-1847840785",
          "publishedOn": "2021-10-11T20:10:00.000Z",
          "wordCount": 2029,
          "title": "Halo Infinite Vs. Battlefield 2042: Battle Of The Betas"
        },
        {
          "id": "1847840762",
          "author": "Mike Fahey",
          "description": "In celebration (read: cross-promotion) of the recent release of Nickelodeon’s All-Star Brawl, Microsoft is running a sweepstakes in which one lucky gamer can win an Xbox Series X console dressed up like SpongeBob SquarePants, complete with a matching controller. Only one lucky gamer? That’s nonsense. Everyone should…\nRead more...",
          "link": "https://kotaku.com/everybody-deserves-a-spongebob-squarepants-xbox-1847840762",
          "publishedOn": "2021-10-11T19:55:00.000Z",
          "wordCount": 557,
          "title": "Everybody Deserves A SpongeBob SquarePants Xbox"
        },
        {
          "id": "1847840752",
          "author": "Isaiah Colbert",
          "description": "Update, 10/11/2021 5:00 p.m. ET: Amouranth has just been unbanned from Twitch. She is still banned on TikTok and Instagram. The original story follows.\nRead more...",
          "link": "https://kotaku.com/stream-star-amouranth-banned-from-twitch-tiktok-and-i-1847840752",
          "publishedOn": "2021-10-11T19:40:00.000Z",
          "wordCount": 527,
          "title": "Stream Star Amouranth Banned From Twitch, TikTok, And Insta (She'll Be Fine)"
        },
        {
          "id": "1847839972",
          "author": "Ian Walker",
          "description": "Kraid is a good boy. I don’t know why he’s locked up in a room full of boiling lava in Metroid Dread, which arrived on the Switch last Friday, but he doesn’t deserve it. If you’re a monster who’s willing to make his life even more terrible, however, players recently discovered a much easier way to kill him off,…\nRead more...",
          "link": "https://kotaku.com/metroid-dread-players-discover-gnarly-secret-way-to-qu-1847839972",
          "publishedOn": "2021-10-11T18:00:00.000Z",
          "wordCount": 639,
          "title": "Metroid Dread Players Discover Gnarly, Secret Way To Quick-Kill Kraid"
        },
        {
          "id": "1847839625",
          "author": "Mike Fahey",
          "description": "During the mad rush to play Amazon’s massively multiplayer RPG New World during launch week, its developers told players not to worry about which of the game’s crowded servers they chose to play on, as free transfers were on the way. Not only have those free server transfers been delayed, the developers have also…\nRead more...",
          "link": "https://kotaku.com/new-world-server-transfers-delayed-previously-promised-1847839625",
          "publishedOn": "2021-10-11T17:25:00.000Z",
          "wordCount": 690,
          "title": "New World Server Transfers Delayed, Previously Promised Cross-Realm Moves ‘Not Possible’"
        },
        {
          "id": "1847839191",
          "author": "Sisi Jiang",
          "description": "Last week, Microsoft acceded to pressure from an investor group which advocates for “right-to-repair” policies which, if widely adopted, would facilitate independent repair of many technological devices by making things like spare parts and repair documentation more readily attainable. Though it’s too soon to say just…\nRead more...",
          "link": "https://kotaku.com/microsoft-makes-tentative-moves-toward-easier-to-repair-1847839191",
          "publishedOn": "2021-10-11T16:20:00.000Z",
          "wordCount": 573,
          "title": "Microsoft Makes Tentative Moves Toward Easier-To-Repair Xboxes"
        },
        {
          "id": "1847838890",
          "author": "Ethan Gach",
          "description": "Netflix’s Squid Game has taken the world by storm, and now it’s taking over Grand Theft Auto V role-playing servers. GTA fans are recreating the show’s grim children’s games across the streets of Los Santos. Winners get big cash prizes while the losers get sued into oblivion by Take-Two. Just kidding, that’s a joke. …\nRead more...",
          "link": "https://kotaku.com/squid-game-knock-offs-are-taking-over-gta-5-severs-1847838890",
          "publishedOn": "2021-10-11T15:45:00.000Z",
          "wordCount": 473,
          "title": "Squid Game Knock-Offs Are Taking Over GTA 5 Servers"
        },
        {
          "id": "1847838459",
          "author": "Ari Notis",
          "description": "A tall stone tower. A bale of hay below. The screech of an eagle. If you’ve been conditioned by years of playing Ubisoft games, seeing all of these at once means one thing: jump.\n\nRead more...",
          "link": "https://kotaku.com/far-cry-6-players-are-dying-because-of-an-assassin-s-cr-1847838459",
          "publishedOn": "2021-10-11T15:15:00.000Z",
          "wordCount": 497,
          "title": "Far Cry 6 Players Are Dying Because Of An Assassin’s Creed Easter Egg"
        },
        {
          "id": "1847838491",
          "author": "Mike Fahey",
          "description": "An hour or so into my time with a preview build of Forza Horizon 5, I found myself kangaroo-hopping through cactus-dotted hills in a yellow Ford Bronco. I wasn’t heading to a race or a PR stunt location. I had no particular goal in mind. It was just me, the lush desert, a burly SUV, and a chill song on the in-game…\nRead more...",
          "link": "https://kotaku.com/forza-horizon-5-is-more-forza-horizon-and-that-s-fantas-1847838491",
          "publishedOn": "2021-10-11T15:00:00.000Z",
          "wordCount": 832,
          "title": "Forza Horizon 5 Is More Forza Horizon And That’s Fantastic"
        },
        {
          "id": "1847836807",
          "author": "Luke Plunkett",
          "description": "Hey, remember how back in July a War Thunder player got in big trouble for leaking classified military documents? Three months later, the same thing has happened, in the same game.\n\nRead more...",
          "link": "https://kotaku.com/classified-military-documents-leaked-again-in-the-same-1847836807",
          "publishedOn": "2021-10-11T01:00:00.000Z",
          "wordCount": 550,
          "title": "Classified Military Documents Leaked Again In The Same Game"
        }
      ]
    },
    {
      "title": "Nintendo Life | Latest Updates",
      "feedUrl": "https://www.nintendolife.com/feeds/latest",
      "siteUrl": "https://www.nintendolife.com/feeds/latest",
      "articles": [
        {
          "id": "https://www.nintendolife.com/#article-121930",
          "author": null,
          "description": "Stick to it and believe in your power!\nRetro re-releases falling outside the familiar safety of the M2, Hamster, or Code Mystics stables are usually one thing and one thing alone — a plain ROM bundled with some inoffensive but unspectacular emulation options. It’ll work, it’ll be official, and... that’s about it. If those bland goals had been all this new port of Gleylancer had aimed for, it still would have been more than welcome as in its retro-tastic physical form the game is expensive even by import-only Mega Drive shmup standards. In many ways, even just a cheap and convenient alternative would have been a definite improvement.\nWhat we actually got is far more ambitious than that. The emulation in this unassuming package includes not only the usual raw pixel, 4:3, and stretched screen modes — with toggleable scanlines — but also multiple shadow masks, CRT gamma settings, and optional corner darkening. You can even pick from two different types of screen edge curvature as well as fine-tune the intensity of the effect. Pixels gain a slight (and again, adjustable) softness to them, getting admirably close to imitating the sort of depth you’d find on an old tube TV set. Best of all, you can see these effects applied in real-time to whatever screen the game was on when you accessed the menu, allowing you to easily tweak everything to your liking without going back and forth between the game and the settings.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/reviews/switch-eshop/gleylancer",
          "publishedOn": "2021-10-12T20:00:00.000Z",
          "wordCount": 1151,
          "title": "Mini Review: Gleylancer - A Brilliant 16-Bit Shmup Sparkles With Mod Cons"
        },
        {
          "id": "https://www.nintendolife.com/#article-122178",
          "author": null,
          "description": "Stay away for spoilers.\nSPOILERS, obviously...\nMetroid Dread has been talked about a lot over the past week, largely in positive terms. Plenty of us are still on a first playthrough, frantically running away from E.M.M.I foes and navigating our way around the rather sizeable map. For some, though, now it's time for optimising follow-up runs and potentially speedrunning; it's a game that seems very well suited to those players.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/this-metroid-dread-boss-fight-trick-shows-the-devs-knew-youd-break-the-game",
          "publishedOn": "2021-10-12T19:00:00.000Z",
          "wordCount": 1262,
          "title": "This Metroid Dread Boss Fight Trick Shows The Devs Knew You'd Break The Game"
        },
        {
          "id": "https://www.nintendolife.com/#article-122183",
          "author": null,
          "description": "Also has a villainous teddy with a great voice.\nMONARK is a project you've likely heard about in recent months; it's an upcoming JRPG with some Shin Megami Tensei veterans involved. The good news is that it now has a release date - it arrives on 25th February.\nThere's also a new trailer that focuses on 'adversaries' in the game - the first seems to be a bunny teddy with an awesome voice. You can see that trailer at the top of the page along with the brief PR blurb below:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/monark-brings-ego-and-madness-to-switch-in-february",
          "publishedOn": "2021-10-12T18:00:00.000Z",
          "wordCount": 892,
          "title": "MONARK Brings Ego And Madness To Switch In February"
        },
        {
          "id": "https://www.nintendolife.com/#article-104641",
          "author": null,
          "description": "Every Ace Attorney game, ranked by you.\nIt's been TWENTY YEARS since Ace Attorney was unleashed upon the world (in Japan, at least — the English version wouldn't come out until 2005, so you're not quite as old as this news makes you feel). Ten-ish games later, the series has spawned an anime, a movie, a musical, and legions of Edgeworth-hungry fans.\nIn honour of everyone's favourite scrappy lawyer, Phoenix Wright, having existed for two decades, we asked you lovely readers, \"What's the best Ace Attorney Game?\" With your votes, we've put together this list to settle the matter once and for all.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/guides/best-ace-attorney-games-of-all-time",
          "publishedOn": "2021-10-12T17:00:00.000Z",
          "wordCount": 3380,
          "title": "Guide: Best Ace Attorney Games Of All Time"
        },
        {
          "id": "https://www.nintendolife.com/#article-122186",
          "author": null,
          "description": "New system UI gets shown off to make up for it.\nBlaze Entertainment has today announced that its Evercade VS retro console has been delayed slightly.\nThe NES-style system – which runs physical carts and is the home version of the popular Evercade handheld – was supposed to arrive in November, but will now launch in mid-December launch in Europe. A release window of December 8th-17th has been given, but this is an estimate. North American customers will sadly have to wait until 2022, with a January 14th revised release date being given.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/blazes-evercade-vs-console-has-been-delayed-until-december",
          "publishedOn": "2021-10-12T16:30:00.000Z",
          "wordCount": 1248,
          "title": "Blaze's Evercade VS Console Has Been Delayed Until December"
        },
        {
          "id": "https://www.nintendolife.com/#article-122181",
          "author": null,
          "description": "We love it.\nHow do you do a trailer voiceover for a game like Mario Party Superstars? With great enthusiasm, of course, as befits a colourful game in which you play minigames with friends and love ones. The localised version of a recent introductory trailer does just that, in addition to showing plenty of neat features from the game.\nIn addition to highlighting the presence of online play from day one, the trailer showcases daily and other challenges that you'll be able to tackle against others online in 'Mt. Minigames'. It seems like this entry is trying to keep you playing even when you can't get a group together to play a conventional board.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/the-localised-mario-party-superstars-overview-trailer-is-very-enthusiastic",
          "publishedOn": "2021-10-12T16:00:00.000Z",
          "wordCount": 1320,
          "title": "The Localised Mario Party Superstars Overview Trailer Is Very Enthusiastic"
        },
        {
          "id": "https://www.nintendolife.com/#article-122177",
          "author": null,
          "description": "A spiritual successor to the DS game.\nFrom developers Ravn Studio and Invictus Games, Pinchcliffe Grand Prix will soon be racing onto Nintendo Switch, it's been announced.\nThe game's based on The Pinchcliffe Grand Prix, a Norwegian stop-motion animation that's thought to be the most widely seen Norwegian film of all time. It retells the story of the 1975 feature-length through the medium of racing and minigames and will be available on Nintendo's platform from 4th November.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/pinchcliffe-grand-prix-based-on-the-hit-norwegian-stop-motion-film-races-onto-switch",
          "publishedOn": "2021-10-12T15:30:00.000Z",
          "wordCount": 1520,
          "title": "Pinchcliffe Grand Prix, Based On The Hit Norwegian Stop-Motion Film, Races Onto Switch"
        },
        {
          "id": "https://www.nintendolife.com/#article-122168",
          "author": null,
          "description": "Do you recognise it?\nJigglypuff would be furious.\nThe Pokémon games are special to millions of fans around the world for a number of different reasons, but for us, one of those reasons is the series' music (and yes, the actual gameplay and pure nostalgia are right up there, too).\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/random-oh-dear-looks-like-this-companys-advert-has-ripped-off-a-pokemon-song",
          "publishedOn": "2021-10-12T14:30:00.000Z",
          "wordCount": 2034,
          "title": "Random: Oh Dear, Looks Like This Company's Advert Has Ripped Off A Pokémon Song"
        },
        {
          "id": "https://www.nintendolife.com/#article-119631",
          "author": null,
          "description": "Real sus.\n\nEpic Games has now officially credited Among Us developer, Innersloth in an update to Fortnite's Impostors Mode. On their blog, the text refers to Impostors as \"the game mode inspired by Among Us from Innersloth\".\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/fortnite-finally-credits-among-us-in-an-update-to-its-new-impostors-mode",
          "publishedOn": "2021-10-12T14:15:00.000Z",
          "wordCount": 6144,
          "title": "Fortnite Finally Credits Among Us In An Update To Its New 'Impostors Mode'"
        },
        {
          "id": "https://www.nintendolife.com/#article-122175",
          "author": null,
          "description": "Physical release coming soon.\nAs promised, multiplayer party hit Gang Beasts is now available on the Nintendo eShop following a small delay.\nOriginally destined to launch for Switch last week, the game is now available to pick up for $29.99 / €29,99 / £24.99. You've probably heard all about the game already, but just in case, here's a recap:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/after-a-small-delay-gang-beasts-is-now-available-on-switch",
          "publishedOn": "2021-10-12T14:00:00.000Z",
          "wordCount": 932,
          "title": "After A Small Delay, Gang Beasts Is Now Available On Switch"
        },
        {
          "id": "https://www.nintendolife.com/#article-122167",
          "author": null,
          "description": "Includes 6 art cards and both games are on the cartridge.\nOri and the Blind Forest and Ori and the Will of the Wisps are fantastic games from Moon Studios, and it's still a bit of a marvel that we get to enjoy excellent ports of these games on the Switch. The good news for those holding off and with a penchant for physical copies is that Ori The Collection has finally arrived at retailers globally.\nAs you'd expect it includes both games on the cartridge, along with some nice art cards and two codes to redeem on official soundtracks for each game. The bundle offers a pretty decent discount compared to buying the games individually; in the US it's $49.99USD through iam8bit, while at the time of writing it's £39.99 on Amazon UK.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/ori-the-collection-is-out-now-for-you-switch-physical-collectors",
          "publishedOn": "2021-10-12T13:30:00.000Z",
          "wordCount": 1639,
          "title": "Ori The Collection Is Out Now For You Switch Physical Collectors"
        },
        {
          "id": "https://www.nintendolife.com/#article-122151",
          "author": null,
          "description": "Out at the end of November.\nBeyond a Steel Sky was a welcome announcement for Switch in early September as a 'spritiual successor' to cult classic point-and-click game Beneath A Steel Sky. It's been out on Steam and iOS for over a year, earning positive user reviews, and updated looks at the Revolution Software-developer title certainly give us cause for optimism.\nThis new game is a '3D adventure thriller' and has an eye-catching art style; a new dev diary video above explains the process and technology that gives the game its distinctive look. Dave Gibbons is on board to provide design and expertise on all things comic books, with the game looking to recreate the style of a graphic novel. The results are quite impressive.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/beyond-a-steel-sky-dev-diary-showcases-its-gorgeous-comic-inspired-visuals",
          "publishedOn": "2021-10-12T13:05:00.000Z",
          "wordCount": 1082,
          "title": "Beyond A Steel Sky Dev Diary Showcases Its Gorgeous Comic-Inspired Visuals"
        },
        {
          "id": "https://www.nintendolife.com/#article-121726",
          "author": null,
          "description": "Second time's the charm.\nIn late 2015, a new game came to iOS called Zodiac: Orcanon Odyssey, offering up a reasonably high-quality classic JRPG experience. Though it was originally slated to arrive in some form on the PlayStation consoles of the time, this console project never got off the ground and was subsequently cancelled. Now, that project has been revived by Super Neptunia RPG developer Artisan Studio and reimagined for modern consoles as Astria Ascending. This reworked version essentially deconstructs the original release and rebuilds it in a way that feels more in line with typical RPGs. Some may be wary of the mobile game origins here, but we’re happy to report that this feels like a quality, feature-complete JRPG that you should give a fair shot.\nAstria Ascending takes place in the land of Orcanon, wherein you play as an ensemble cast of demigods called “The Fated Eight”. See, in Orcanon, the world is largely at peace because of a magical fruit called Harmelon that causes people to live in harmony with each other, but things naturally don’t always go according to plan, which is what the demigods are for. Each of them represents one of the eight main races that live in Orcanon, and being a demigod brings with it great power and prestige, but there’s a slight catch: after three years, all the demigods die and are replaced by another eight that make up the next class.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/reviews/nintendo-switch/astria-ascending",
          "publishedOn": "2021-10-12T13:00:00.000Z",
          "wordCount": 3127,
          "title": "Review: Astria Ascending - A Solid JRPG Salvaged With The Help Of Final Fantasy Veterans"
        },
        {
          "id": "https://www.nintendolife.com/#article-122166",
          "author": null,
          "description": "\"You have a heart of gold\".\nDark Souls is hard, right? It's brutal. A real test of your gamer credentials. So then, why are these officially-licenced Dark Souls figures so goshdarn cute?\nThey're expected to launch in Japan this December, and the range includes a host of famous faces from the series. We want them all.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/check-out-these-adorable-super-deformed-dark-souls-figures",
          "publishedOn": "2021-10-12T12:45:00.000Z",
          "wordCount": 889,
          "title": "Check Out These Adorable Super-Deformed Dark Souls Figures"
        },
        {
          "id": "https://www.nintendolife.com/#article-122150",
          "author": null,
          "description": "New screen uses Pulse Width Modulation to control brightness.\nNintendo's latest iteration of the Switch launched on 8th October and while it's far from the long-rumoured 'Switch Pro', the new screen on the Switch OLED model is a beautiful thing and has led to the new Switch SKU receiving generally positive reviews. It doesn't hurt that incredible games like Metroid Dread and Tetris Effect: Connected launched alongside the console and really show off the contrast and rich colour of that lovely new OLED screen.\nHowever, there's one relatively unreported issue that seems to be causing an issue for a minority of players: PWM flicker. It's to do with the way the new screen handles brightness via Pulse Width Modulation, and at lower brightness settings it can result in a flickering effect that a small number of players may be sensitive to.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/psa-sensitive-to-pwm-flicker-youll-want-to-keep-the-switch-oleds-screen-nice-and-bright",
          "publishedOn": "2021-10-12T12:00:00.000Z",
          "wordCount": 2303,
          "title": "PSA: Sensitive To PWM Flicker? You'll Want To Keep The Switch OLED's Screen Nice And Bright"
        },
        {
          "id": "https://www.nintendolife.com/#article-122161",
          "author": null,
          "description": "Phew, eh?\nThe shiny new Switch OLED comes with its own dock, which is hiding a few upgrades of its own – including a chipset that can handle 4K / 60fps. It also has a revised design that sees the rear panel pop off when you're inserting things like HDMI cables, power leads and LAN cables.\nAs you can appreciate, anything that pops off of something is in danger of being lost, and Nintendo has already covered this eventuality by offering the rear panel of the dock separately.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/psa-dont-worry-you-can-order-the-switch-oled-docks-rear-cover",
          "publishedOn": "2021-10-12T11:35:00.000Z",
          "wordCount": 1897,
          "title": "PSA: Don't Worry, You Can Order The Switch OLED Dock's Rear Cover"
        },
        {
          "id": "https://www.nintendolife.com/#article-122156",
          "author": null,
          "description": "Has already outsold Metroid: Samus Returns.\nThough it'll take a number of weeks for sales figures to come through globally, it would seem that Metroid Dread has started strongly, driven by an extensive marketing campaign from Nintendo and a lot of positive word-of-mouth online. UK sales have been some of the first to come through, and though it failed to get past multi-platform titles Far Cry 6 and FIFA 22, Dread's launch weekend more than likely made it the IP's best opening in the country when factoring in eShop downloads (at the time of writing it's number one in the UK and US eShop chart).\nThe series hasn't historically been one of Nintendo's most successful, with its influence and cultural impact outweighing actual sales, but perhaps Dread can turn that around thanks to a combination of its quality and arriving on the hugely popular Switch. Yet the sales data and where Metroid games 'stand' in the bigger picture is interesting, and a new report from GamesIndustry.biz (focused on the UK market) is a fascinating read from that perspective.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/metroid-dreads-uk-sales-momentum-points-to-a-big-moment-for-the-series",
          "publishedOn": "2021-10-12T11:00:00.000Z",
          "wordCount": 3758,
          "title": "Metroid Dread's UK Sales Momentum Points To A Big Moment For The Series"
        },
        {
          "id": "https://www.nintendolife.com/#article-121815",
          "author": null,
          "description": "Update: Realtek chip inside dock advertised as \"4K UHD multimedia SoC\".\nUpdate: We already know that the dock which comes with the Switch OLED is theoretically capable of outputting 4K / 60fps, but now KawlunDram has done some more digging and has discovered that the chip inside the dock is positioned as a “4K UHD multimedia SoC” by its manufacturer Realtek (thanks, VGC).\nApparently, the same chip was referenced in a Switch firmware update earlier this year, alongside the codename ‘Aula’. KawlunDram also points out that the Tegra X1 SoC inside the Switch does actually support 4K 60fps output over HDMI 2.0 already, but there's currently nothing to suggest that Nintendo intends to add this option to the existing Switch hardware.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/teardown-suggests-the-switch-oled-dock-is-4k-60fps-ready-and-future-proof",
          "publishedOn": "2021-10-12T10:10:00.000Z",
          "wordCount": 16139,
          "title": "Teardown Suggests The Switch OLED Dock Is 4K 60fps-Ready And 'Future Proof'"
        },
        {
          "id": "https://www.nintendolife.com/#article-122152",
          "author": null,
          "description": "Including Wham!, Blondie and (yes) Rick Astley.\nCast your minds back to Nintendo's E3 Direct and you'll remember the slightly surprising announcement that Square Enix's Marvel's Guardians of the Galaxy would be headed to Switch. It'll only be available on Nintendo's platform as a Cloud version, unfortunately, but the release date is now just around the corner.\nIt'll be launching on 26th October across all major platforms (again, only as a Cloud version on Switch), and ahead of the release, Square Enix has shared an \"almost\" complete tracklist for the game's soundtrack. As you'd expect with it being a Guardians of the Galaxy game, it boasts a soundtrack full of '80s rock and pop songs:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/marvelrs-guardians-of-the-galaxy-includes-a-cracking-80s-soundtrack-heres-the-full-songlist",
          "publishedOn": "2021-10-12T10:00:00.000Z",
          "wordCount": 1883,
          "title": "Marvel’s Guardians Of The Galaxy Includes A Cracking '80s Soundtrack, Here's The Full Songlist"
        },
        {
          "id": "https://www.nintendolife.com/#article-122149",
          "author": null,
          "description": "Breed over 200 monsters.\nToday sees the launch of Monster Crown, a monster-taming RPG that's looking to give Pokémon fans an alternative take on the genre on Switch.\nIf you've read our full review, you'll know that Monster Crown is a decent effort but one that, in our opinion, ultimately feels like \"a jankier and less addictive version of the oldest Pokémon games\". Still, if you find yourself really pining for those good old 8-bit Pokémon days, it may well be worth a look.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/pokemon-inspired-monster-crown-is-out-today-on-switch-heres-the-launch-trailer1",
          "publishedOn": "2021-10-12T09:30:00.000Z",
          "wordCount": 1714,
          "title": "Pokémon-Inspired Monster Crown Is Out Today On Switch, Here's The Launch Trailer"
        },
        {
          "id": "https://www.nintendolife.com/#article-121775",
          "author": null,
          "description": "Update: The collection goes live.\nUpdate: As promised, BlackMilk's Legend of Zelda collection is now live and ready to be snapped up. You can view the whole range here.\n\nOriginal Article (Mon 4th Oct, 2021 12:00 BST): Australian clothing brand BlackMilk has announced that it'll be launching a brand new collection inspired by The Legend of Zelda series next week.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/blackmilks-legend-of-zelda-clothing-line-is-available-now",
          "publishedOn": "2021-10-12T08:45:00.000Z",
          "wordCount": 1162,
          "title": "BlackMilk's Legend Of Zelda Clothing Line Is Available Now"
        },
        {
          "id": "https://www.nintendolife.com/#article-122142",
          "author": null,
          "description": "The Kingdom Hearts' rep arrives next week.\n\nLast week, Masahiro Sakurai revealed Sora from Kingdom Hearts would be added to Smash Bros. Ultimate as the final fighter.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/gallery-sakurai-shares-new-screenshots-of-the-final-dlc-fighter-for-smash-bros-ultimate",
          "publishedOn": "2021-10-12T05:00:00.000Z",
          "wordCount": 1900,
          "title": "Gallery: Sakurai Shares New Screenshots Of The Final DLC Fighter For Smash Bros. Ultimate"
        },
        {
          "id": "https://www.nintendolife.com/#article-122141",
          "author": null,
          "description": "Initiatives and more planned.\nAs you might have already seen, today marks 20 years of Capcom's Ace Attorney series. It all began when the first Phoenix Wright title was released on the Game Boy Advance in Japan on 12th October 2001. And although we didn't get to experience the series here in the west until 2005, we've been huge fans of the court-based visual novel series ever since.\nTo celebrate this special occasion, Capcom has launched a Phoenix Wright: Ace Attorney series 20th anniversary website including a message from the developers thanking fans for their support and promising to continue its support for the series in the future. As part of this, it's also detailed some anniversary initiatives - including some event details and commemorative goods for Japan.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/capcom-launches-ace-attorney-20th-anniversary-website",
          "publishedOn": "2021-10-12T03:45:00.000Z",
          "wordCount": 1532,
          "title": "Capcom Launches Ace Attorney 20th Anniversary Website"
        },
        {
          "id": "https://www.nintendolife.com/#article-122140",
          "author": null,
          "description": "Part of the \"first major update\".\nOne of the standout releases on the Nintendo Switch this year has been the enhanced version of the original Quake title, celebrating 25 years of id Software's first-person arena shooter.\nThe game got its \"first major update\" for the Switch and multiple other platforms last week, but one thing you might have missed is that mouse and keyboard are now fully supported on Nintendo's hybrid platform - allowing you to play the game as you would on a computer nowadays.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/quake-on-switch-now-supports-mouse-and-keyboard-controls",
          "publishedOn": "2021-10-12T02:30:00.000Z",
          "wordCount": 2037,
          "title": "Quake On Switch Now Supports Mouse And Keyboard Controls"
        },
        {
          "id": "https://www.nintendolife.com/#article-122139",
          "author": null,
          "description": "A 3D platformer \"with attitude\".\nLast year in June, Fabraz - the team behind the excellent 2D platformer Slime-san - lifted the lid on a brand new 3D platformer \"with attitude\" known as Demon Turf.\nIt was more recently confirmed it would be published by Playtonic Friends (the same developer behind Yooka-Laylee) and now it looks like we've got a release date. According to a listing on the Switch eShop, Demon Turf should be arriving early next month on 4th November.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/demon-turf-brings-stylish-3d-platformer-action-to-switch-next-month",
          "publishedOn": "2021-10-12T01:00:00.000Z",
          "wordCount": 1531,
          "title": "Demon Turf Brings Stylish 3D Platformer Action To Switch Next Month"
        }
      ]
    },
    {
      "title": "Rock Paper Shotgun Latest Articles Feed",
      "feedUrl": "https://www.rockpapershotgun.com/feed",
      "siteUrl": "https://www.rockpapershotgun.com/feed",
      "articles": [
        {
          "id": "https://www.rockpapershotgun.com/paradox-staff-allege-culture-of-silence-in-new-reports-of-toxic-workplace",
          "author": "Graham Smith",
          "description": "New reports have been published containing further allegations of abuse at Swedish publisher Paradox Interactive. The reports, published initially by Swedish newspaper Svenska Dagbladet (paywalled), are based primarily on interviews with Paradox staff who wished to remain anonymous.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/paradox-staff-allege-culture-of-silence-in-new-reports-of-toxic-workplace",
          "publishedOn": "2021-10-12T20:09:56.000Z",
          "wordCount": 929,
          "title": "Paradox staff allege \"culture of silence\" in new reports of toxic workplace"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-a-27-in-fast-ips-1440p-144hz-monitor-for-238-thats-62-off-its-normal-price",
          "author": "Will Judd",
          "description": "Fast IPS monitors like the Dell S2721DGFA and LG 27GN800 have become some of my personal favourites to recommend, thanks to their combination of excellent motion handlin, wide viewing angles and gorgeous colours. We've seen these 27-in models discounted to around £300 a few times over the past few months, but today a couple of discount codes have dropped the price to historic lows. \nYou can choose from the Dell S2721DGFA, a 165Hz monitor with great ergonomics, for £270, or the LG 27GN800, a 144Hz monitor with a more basic stand, for £238. Either way, you'll get an incredible value gaming monitor that's perfect for a wide range of games and gaming PCs.\nRead more",
          "link": "https://www.rockpapershotgun.com/get-a-27-in-fast-ips-1440p-144hz-monitor-for-238-thats-62-off-its-normal-price",
          "publishedOn": "2021-10-12T18:38:16.000Z",
          "wordCount": 1002,
          "title": "Get a 27-in Fast IPS 1440p 144Hz monitor for £238 - that's £62 off its normal price"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-is-peak-00s-action-cheese-and-i-am-here-for-it",
          "author": "Alice Bell",
          "description": "Back 4 Blood is out today, that new game from the original developers of Left 4 Dead that is definitely not Left 4 Dead 3, but is still about turning waves of zombies into splashes on the post-apocalyptic pavement as a co-op team. And yes, I still love it. It is fun. It is so much fun. When is this formula not fun? The release version is, in several respects, an improvement on the beta. The characters do more bantering, it has cinematic cutscenes, and if you have to play with bots those bots do not spend all their time shooting into the drywall. Tick, tick, tick.\nBut in playing the full game in context, with stuff like opening cinematics and tutorialising videos all embedded in it, something else has become clear: this game is peak early-00s cheese. Not just because many of the enemies have the same texture as a fully loaded pizza.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-is-peak-00s-action-cheese-and-i-am-here-for-it",
          "publishedOn": "2021-10-12T18:35:37.000Z",
          "wordCount": 1354,
          "title": "Back 4 Blood is peak 00s action cheese and I am here for it"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-a-12tb-wd-elements-external-hard-drive-for-19999-50-off",
          "author": "Will Judd",
          "description": "When it comes to giant external hard drives, WD sells more drives than anyone - and they might see a fair few more sales today. Their 12TB Elements external hard drive has been sharply discounted over at Newegg, with the code EMC2AAZAA27 knocking off $50 off the usual price of $249.99.   \nRead more",
          "link": "https://www.rockpapershotgun.com/get-a-12tb-wd-elements-external-hard-drive-for-19999-50-off",
          "publishedOn": "2021-10-12T18:19:22.000Z",
          "wordCount": 811,
          "title": "Get a 12TB WD Elements external hard drive for $199.99 ($50 off)"
        },
        {
          "id": "https://www.rockpapershotgun.com/monster-hunter-rise-pc-demo-looks-glorious",
          "author": "Katharine Castle",
          "description": "Despite having sunk several hours into Monster Hunter Rise on my Nintendo Switch this year, I cannot tell you how excited I am to play the upcoming PC version. While my relationship with the previous game in the series, Monster Hunter: World, has been somewhat tainted by excessive hours of benchmarking, the Monster Hunter series has always been a sight to behold on PC, and Rise looks set to be no different - especially now I've had a chance to play the upcoming PC demo ahead of its release on Steam tomorrow, October 13th. \nRead more",
          "link": "https://www.rockpapershotgun.com/monster-hunter-rise-pc-demo-looks-glorious",
          "publishedOn": "2021-10-12T16:10:46.000Z",
          "wordCount": 1762,
          "title": "Monster Hunter Rise looks glorious in its new PC demo"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-pc-performance-the-best-settings-to-change",
          "author": "James Archer",
          "description": "Most of my Back 4 Blood playtime has been spent getting brutalised by an endless queue of Special Ridden, like an zombified take on that bit in Airplane!. Even so, it’s nice to see Turtle Rock Studios’ latest co-op shooter goes a lot easier on PC hardware than it does on me. It runs smoothly on older low-end hardware, and scales well enough on luxury kit that with one of the best graphics cards you can easily secure 144fps at 4K. Back 4 Blood is also one of few games to support both Nvidia DLSS and AMD FidelityFX Super Resolution (FSR), so there’s ample opportunity to boost performance via upscaling.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-pc-performance-the-best-settings-to-change",
          "publishedOn": "2021-10-12T16:02:18.000Z",
          "wordCount": 1960,
          "title": "Back 4 Blood PC performance: the best settings to change"
        },
        {
          "id": "https://www.rockpapershotgun.com/hearthstone-adds-roguelikey-rpg-mode-mercenaries-today",
          "author": "Imogen Beckhelling",
          "description": "If you're a little bored of Hearthstone's usual card shenanigans, Blizzard are releasing a new game mode that turns the CCG into a roguelike-ish RPG. Named Mercenaries, players will be able to gather Hearthstone characters then send them off into combat to collect bounties. Like Battlegrounds, you won't use your collection of cards for this, you'll have to gather a party as you venture on. It comes out later today, and will be free-to-play.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/hearthstone-adds-roguelikey-rpg-mode-mercenaries-today",
          "publishedOn": "2021-10-12T15:55:46.000Z",
          "wordCount": 895,
          "title": "Hearthstone adds roguelikey RPG mode Mercenaries today"
        },
        {
          "id": "https://www.rockpapershotgun.com/destiny-2-celebrates-halloween-with-dinosaur-costumes-today",
          "author": "Alice O'Connor",
          "description": "Today is apparently the day for live service games to start Halloween events, with Destiny 2 throwing its wizard hat into the ritual ring too. Festival Of The Lost returns for another year at reset time today, with some welcome new elements. For one, the tired Haunted Forest event is replaced by Haunted Lost Sectors. For another, this year's seasonal outfit is DINOSAUR COSTUMES. Rawr!\nRead more",
          "link": "https://www.rockpapershotgun.com/destiny-2-celebrates-halloween-with-dinosaur-costumes-today",
          "publishedOn": "2021-10-12T15:38:42.000Z",
          "wordCount": 1009,
          "title": "Destiny 2 celebrates Halloween with dinosaur costumes today"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-evangelo",
          "author": "Hayden Hefford",
          "description": "Want to know the best build for Evangelo in Back 4 Blood? Whilst the best cards could fit into any deck, you should always aim to specialise when creating a specific build in Back 4 Blood. Creating the best build for your character is essential if you want to survive on Nightmare difficulty, but it can be tricky to weed through every card to find the perfect match.\nIf you've looked through the characters and decided that you like Evangelo, then you're in luck. This guide covers the best melee build for Evangelo in Back 4 Blood, so that you can stop scratching your head looking at cards and start slashing (which is sort of his speciality). Evangelo might not be one of the best characters at first, but you can transform him into a powerhouse with certain cards.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-evangelo",
          "publishedOn": "2021-10-12T15:10:18.000Z",
          "wordCount": 1227,
          "title": "The best Back 4 Blood Evangelo build"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-best-weapons",
          "author": "Hayden Hefford",
          "description": "Want to know the best weapons in Back 4 Blood? Once you’ve figured out the best characters for your playstyle, you’ll need to think about the best weapons for your build. There are over 30 weapons to choose from in Back 4 Blood, so you’re spoilt for choice in your fight against the Ridden.\nThe weapon that you choose will mostly come down to your playstyle. If you want to run and gun, an SMG will be best, whilst a sniper rifle will suit those who want to pick off their targets from a distance. This guide will show you the best weapons in Back 4 Blood in every category.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-best-weapons",
          "publishedOn": "2021-10-12T15:05:57.000Z",
          "wordCount": 1954,
          "title": "The best weapons and attachments in Back 4 Blood"
        },
        {
          "id": "https://www.rockpapershotgun.com/pokemon-like-rpg-monster-crown-has-left-early-access",
          "author": "Imogen Beckhelling",
          "description": "We have a bunch of Pokémon-like monster catching games on PC now, but if you're tired of Temtem or Coromon, you could give Monster Crown a go. It's an RPG with turn-based combat that launched in full today after a year of early access. It sounds a little darker than other Pokélikes though, because instead of taming or catching your mons in magical contraptions, you make pacts with them. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/pokemon-like-rpg-monster-crown-has-left-early-access",
          "publishedOn": "2021-10-12T15:00:30.000Z",
          "wordCount": 895,
          "title": "Pokémon-like RPG Monster Crown has left early access"
        },
        {
          "id": "https://www.rockpapershotgun.com/guardians-of-the-galaxy-launch-trailer-launches-far-ahead-of-launch",
          "author": "Alice O'Connor",
          "description": "While Marvel's Guardians Of The Galaxy doesn't launch for another fortnight, the superhero game's launch trailer arrived today. That's a long run-up, that. If I'm running up for a launch for two weeks straight, I'm either leaping directly into the sun or falling asleep half-way. Presumably Square Enix are hoping for the former, given the ehhhh reaction to their Avengers game. Here, have a watch below.\nRead more",
          "link": "https://www.rockpapershotgun.com/guardians-of-the-galaxy-launch-trailer-launches-far-ahead-of-launch",
          "publishedOn": "2021-10-12T13:56:00.000Z",
          "wordCount": 897,
          "title": "Guardians Of The Galaxy launch trailer launches far ahead of launch"
        },
        {
          "id": "https://www.rockpapershotgun.com/far-cry-6-leaders",
          "author": "Ollie Toms",
          "description": "Where do you find more Far Cry 6 Leaders? It's a common question among many players who have discovered the delights of the Bandido Operations minigame, and want to maximise their chances of victory by sending the right people to lead their Guerrilla expeditions. There are eight Leaders to be unlocked in Far Cry 6, each of whom brings different skills to your growing Libertad army. Learn where to find and how to unlock each of the Far Cry 6 Leaders below.\nRead more",
          "link": "https://www.rockpapershotgun.com/far-cry-6-leaders",
          "publishedOn": "2021-10-12T13:34:20.000Z",
          "wordCount": 1639,
          "title": "How to unlock all the Far Cry 6 Leaders"
        },
        {
          "id": "https://www.rockpapershotgun.com/rainbow-six-siege-halloween-event-adds-spooky-hide-and-seek-today",
          "author": "Imogen Beckhelling",
          "description": "According to video games, Halloween officially starts today. Look, I don't make the rules! Tonight marks the start of Halloween events in Overwatch, Apex Legends, and Rainbow Six Siege. Ubisoft's tactical first-person shooter is bringing back Doktor's Curse, its 5v5 hide-and-seek mode where a team of monsters have to survive in a spookily decked-out Theme Park while exterminators hunt them down. This year, new operators are joining the fray too.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/rainbow-six-siege-halloween-event-adds-spooky-hide-and-seek-today",
          "publishedOn": "2021-10-12T12:26:42.000Z",
          "wordCount": 854,
          "title": "Rainbow Six Siege Halloween event adds spooky hide-and-seek today"
        },
        {
          "id": "https://www.rockpapershotgun.com/us-agencies-clash-over-two-activision-blizzard-legal-cases",
          "author": "Imogen Beckhelling",
          "description": "Last week, California's Department of Fair Employment and Housing (DFEH) filed an objection to an $18 million proposed settlement between Activision Blizzard and the USA's Equal Employment Opportunity Commission (EEOC), claiming it could harm their own lawsuit with the Call Of Duty and World Of Warcraft publishers. This objection might have an adverse affect on their legal battle however, because it revealed that two lawyers working on the DFEH suit had previously worked for the EEOC, specifically investigating Activision Blizzard. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/us-agencies-clash-over-two-activision-blizzard-legal-cases",
          "publishedOn": "2021-10-12T11:56:11.000Z",
          "wordCount": 1127,
          "title": "US agencies clash over two Activision Blizzard legal cases"
        },
        {
          "id": "https://www.rockpapershotgun.com/disco-elysium-has-a-big-discount-now-and-hits-xbox-and-switch-today",
          "author": "Alice O'Connor",
          "description": "Strange and wonderful detective RPG Disco Elysium launches on Xbox and Nintendo Switch today, which is good for them. That's good for you too, person who wants to talk about Disco Elysium all the time but finds pub conversations waylaid by platform unavailability. And hey, it's good for PC peeps who haven't yet bought the game either, because it has a tidy 45% discount on Steam for the next week. Win-win-win.\nRead more",
          "link": "https://www.rockpapershotgun.com/disco-elysium-has-a-big-discount-now-and-hits-xbox-and-switch-today",
          "publishedOn": "2021-10-12T10:25:34.000Z",
          "wordCount": 823,
          "title": "Disco Elysium has a big discount now, and hits Xbox and Switch today"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-unlock-cleaners",
          "author": "Hayden Hefford",
          "description": "Want to know how to unlock all of the cleaners in Back 4 Blood? When you start Back 4 Blood, you will see that only 4 out of the 8 cleaners are playable. Doc, Hoffman, Jim, and Karlee are locked, so you won’t be able to play as them straight away. Doc and Hoffman are some of the best characters in Back 4 Blood, so you’ll want to know how to unlock them as soon as possible.\nBack 4 Blood is a difficult game, regardless of whether you are playing on Recruit or Nightmare mode. If you’re new to the game, you won’t have many cards unlocked, so it’s especially important to choose the best cleaners for your team in the early stages. This guide will cover everything that you need to know to unlock all cleaners in Back 4 Blood.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-unlock-cleaners",
          "publishedOn": "2021-10-12T10:16:26.000Z",
          "wordCount": 948,
          "title": "How to unlock all Cleaners in Back 4 Blood"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-crucials-2tb-mx500-ssd-for-150-after-a-30-discount",
          "author": "Will Judd",
          "description": "We've spoken about the Crucial MX500 before, but the short version is this: it's a fast SATA SSD that also offers great value. Today, it's even better value than normal in the UK, as Amazon have discounted the gargantuan 2TB size of the drive to just £149.97, a 30% discount from its normal £214 RRP. \nRead more",
          "link": "https://www.rockpapershotgun.com/get-crucials-2tb-mx500-ssd-for-150-after-a-30-discount",
          "publishedOn": "2021-10-11T23:41:51.000Z",
          "wordCount": 967,
          "title": "Get Crucial's 2TB MX500 SSD for £150 after a 30% discount"
        },
        {
          "id": "https://www.rockpapershotgun.com/blues-excellent-snowball-usb-mic-is-half-price-just-40",
          "author": "Will Judd",
          "description": "Blue Microphones are known for their popular Yeti podcasting and streaming mic, but they also make a great budget USB model called the Snowball. Its small, adorably round shape belies its capability to make surprisingly detailed recordings, and it's currently half price at Amazon in the UK. That means you need to pay just £40 to take home this mic that normally retails for £80, the cheapest it's been by some margin for years. If you're interested in streaming or podcasting, or just fancy a USB mic to use alongside headphones without a mic (or a rubbish one), then this is a great shout. \nRead more",
          "link": "https://www.rockpapershotgun.com/blues-excellent-snowball-usb-mic-is-half-price-just-40",
          "publishedOn": "2021-10-11T23:22:53.000Z",
          "wordCount": 1042,
          "title": "Blue's excellent Snowball USB mic is half price - just £40"
        },
        {
          "id": "https://www.rockpapershotgun.com/no-cross-saves-for-monster-hunter-rise-but-capcom-say-they-looked-into-it",
          "author": "Lauren Morton",
          "description": "Getting Monster Hunter games on PC still feels like a new treat, even after Monster Hunter World has been out for a few years. Next up for the action and fashion series is Monster Hunter Rise, which is already out on the Nintendo Switch and coming to PC in January. With the PC release coming ten months after the Switch, it's no surprise that MonHunt fans would be keen on being able to carry their save files over to PC in January with cross-progression. Capcom looked into the possibility they say, and cross-platform multiplayer too, but won't be doing either, they've now said.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/no-cross-saves-for-monster-hunter-rise-but-capcom-say-they-looked-into-it",
          "publishedOn": "2021-10-11T22:04:00.000Z",
          "wordCount": 905,
          "title": "No cross-saves for Monster Hunter Rise, but Capcom say they looked into it"
        },
        {
          "id": "https://www.rockpapershotgun.com/hitflesh-takes-you-back-to-a-classic-mmos-haunted-fan-server",
          "author": "Lauren Morton",
          "description": "Come relive your old MMO nostalgia in that early aughts MMO you definitely remember—HitFlesh! What, you never played HitFlesh? Ah, well lucky you that fans have propped up a classic game server that's totally free to play on. That's the setup, at least, for this story-driven adventure game about spelunking through a classic MMO by the same name. Something's gone spooky in these fan servers though. You can catch the new trailer for HitFlesh down here while you wait for its upcoming free demo.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/hitflesh-takes-you-back-to-a-classic-mmos-haunted-fan-server",
          "publishedOn": "2021-10-11T20:37:42.000Z",
          "wordCount": 902,
          "title": "HitFlesh takes you back to a classic MMO's haunted fan server"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-introduces-one-new-mob-candidate-the-grouchy-little-glare",
          "author": "Lauren Morton",
          "description": "Mojang's big all-things-Minecraft show Minecraft Live is coming up this weekend and, like last year, they'll have players voting on which new creature should be added to the game. They've shown off just one of the options so far, the Glare mob that can alert you to monster-spawning light levels. It seems like a neat little friend, from what we can see down here in the little teaser video, but I'm wondering if there's more to this new mob than they've let on. We'll be seeing more new mob options throughout this week as the show and the vote approach.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-introduces-one-new-mob-candidate-the-grouchy-little-glare",
          "publishedOn": "2021-10-11T18:30:18.000Z",
          "wordCount": 956,
          "title": "Minecraft introduces one new mob candidate: the grouchy little Glare"
        },
        {
          "id": "https://www.rockpapershotgun.com/this-doom-ii-beat-em-up-mod-lets-you-punch-and-fling-demons-around",
          "author": "Lauren Morton",
          "description": "Kicking demons off Earth with a generous application of bullets is swell, sure. A bit impersonal though, right? Thanks to this new Doom II mod, the Doomslayerguy can turn hell's residents into pools of blood with his own two fists. Doom Fighters turns yon classic FPS into a third-person brawler where you can uppercut and chuck baddies all over the place. You can snag it right now or just appreciate the excellent biff baffing demon slapping in this trailer.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/this-doom-ii-beat-em-up-mod-lets-you-punch-and-fling-demons-around",
          "publishedOn": "2021-10-11T16:27:43.000Z",
          "wordCount": 801,
          "title": "This Doom II beat 'em up mod lets you punch and fling demons around"
        },
        {
          "id": "https://www.rockpapershotgun.com/ubisoft-holding-riders-republic-trial-day-tomorrow",
          "author": "Alice O'Connor",
          "description": "Ahead of its full launch later this month, Ubisoft are inviting PC peeps to try open-world xtreme sports game Riders Republic for free this week. The 'PC Play Day' starts tomorrow morning, and you can preload it now to be ready once the lights turn green. I've heard some good things about the game, though this trial is only on the Ubisoft Connect client, boooo.\nRead more",
          "link": "https://www.rockpapershotgun.com/ubisoft-holding-riders-republic-trial-day-tomorrow",
          "publishedOn": "2021-10-11T16:11:33.000Z",
          "wordCount": 857,
          "title": "Ubisoft holding Riders Republic trial day tomorrow"
        },
        {
          "id": "https://www.rockpapershotgun.com/supporter-podcast-the-nate-files-episode-4-a-general-history-of-the-pyrates",
          "author": "Alice Bell",
          "description": "Y'arrrrr maties, tis time for another episode of The Nate Files, the bonus supporter podcast for you rum coves what toss us a few dubloons in exchange for some extras (and not being forced to walk the plank). Yes, in the Nate Files we see fit to put Nate \"The Derailer\" Crowley in charge, and this week, as you may have guessed from that intro, it is pirate-themed. Specifically, it is about A General History Of The Pyrates by Captain Charles Johnson.\nRead more",
          "link": "https://www.rockpapershotgun.com/supporter-podcast-the-nate-files-episode-4-a-general-history-of-the-pyrates",
          "publishedOn": "2021-10-11T16:00:00.000Z",
          "wordCount": 725,
          "title": "Supporter podcast - The Nate Files episode 4: A General History of the Pyrates"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-best-cards",
          "author": "Hayden Hefford",
          "description": "Want to find the best cards in Back 4 Blood? The swarms of Ridden are ridiculously powerful in Back 4 Blood, especially when you make the leap to the appropriately named Nightmare mode. If you want to survive, you’ll need to construct the best deck for your character. Whilst you should choose certain cards depending on your character and build, there are some cards that are undoubtedly worth using.\nThis guide will show you the best cards in Back 4 Blood, and they all fit into any deck.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-best-cards",
          "publishedOn": "2021-10-11T15:53:28.000Z",
          "wordCount": 1558,
          "title": "Best cards to use in your deck in Back 4 Blood"
        },
        {
          "id": "https://www.rockpapershotgun.com/citizencon-showed-off-some-pretty-new-star-citizen-clouds-but-not-much-else",
          "author": "Imogen Beckhelling",
          "description": "Cloud Imperium Games held CitizenCon this weekend, an annual digital event to celebrate all things Star Citizen. Unfortunately, despite being in development for almost 10 years, they still didn't have any news on a release date. They also didn't have a shred of info to share on their singleplayer spin-off, Squadron 42. So, what did the devs show? Well, some pretty new clouds.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/citizencon-showed-off-some-pretty-new-star-citizen-clouds-but-not-much-else",
          "publishedOn": "2021-10-11T15:28:57.000Z",
          "wordCount": 974,
          "title": "CitizenCon showed off some pretty new Star Citizen clouds, but not much else"
        },
        {
          "id": "https://www.rockpapershotgun.com/thank-you-and-farewell-to-rps-vid-bud-colm-ahern",
          "author": "Katharine Castle",
          "description": "As PC Gaming Weekspot viewers will no doubt already know, the time has come to bid farewell to RPS vid bud Colm Ahern. He leaves us this week for pastures new, leaving behind the world of video games journalism for a new and exciting role at a video games publisher. He will be greatly missed, so come and say goodbye to him below.\nRead more",
          "link": "https://www.rockpapershotgun.com/thank-you-and-farewell-to-rps-vid-bud-colm-ahern",
          "publishedOn": "2021-10-11T15:00:00.000Z",
          "wordCount": 1019,
          "title": "Thank you and farewell to RPS vid bud Colm Ahern"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-rawhide-farm",
          "author": "Rebecca Jones",
          "description": "Where are the best places to farm rawhide in New World? It's no secret that New World involves a lot of crafting. There are dozens of crafting resources available, but rawhide is one of the biggies thanks to its importance in leatherwork and armor crafting. Rawhide isn't an overly rare material, but since you're very likely to need a lot of it, we've put together some tips on how to farm it as quickly and efficiently as possible.\n Read more",
          "link": "https://www.rockpapershotgun.com/new-world-rawhide-farm",
          "publishedOn": "2021-10-11T14:26:44.000Z",
          "wordCount": 1020,
          "title": "New World rawhide farming: the best places to gather rawhide from boars"
        },
        {
          "id": "https://www.rockpapershotgun.com/windows-11-auto-hdr-is-neat-but-not-worth-the-upgrade-alone",
          "author": "James Archer",
          "description": "Windows 11 has been out for little under a week, which has proven more than enough time enough time for the bugs to crawl out. Memory leaks, laggy window animations and, most egregiously, major performance issues on AMD Ryzen CPUs have all been reported. All in all, a rather disappointing start, especially given this was pitched as Microsoft most gaming-friendly OS yet.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/windows-11-auto-hdr-is-neat-but-not-worth-the-upgrade-alone",
          "publishedOn": "2021-10-11T14:03:10.000Z",
          "wordCount": 1709,
          "title": "Windows 11 Auto HDR is neat, but not worth the upgrade alone"
        },
        {
          "id": "https://www.rockpapershotgun.com/this-deus-ex-mod-turns-jc-into-a-lady-with-fully-redone-voice-lines",
          "author": "Alice O'Connor",
          "description": "Next time you go to replay Deus Ex (which will be within one week, now that I have put the idea in your head), perhaps you'll want to try it with a twist. A brand new mod named The Lay D Denton Project turns JC Denton from a stoic fella into a stoic lady, complete with full voice acting and a script tweaked to fit. Meet the female JC in the trailer below.\nRead more",
          "link": "https://www.rockpapershotgun.com/this-deus-ex-mod-turns-jc-into-a-lady-with-fully-redone-voice-lines",
          "publishedOn": "2021-10-11T13:59:21.000Z",
          "wordCount": 1099,
          "title": "This Deus Ex mod turns JC into a lady with fully redone voice lines"
        },
        {
          "id": "https://www.rockpapershotgun.com/battlefield-2042s-floating-corpses-bug-made-me-laugh-a-lot",
          "author": "Imogen Beckhelling",
          "description": "You know, I was pretty disappointed that this weekend's Battlefield 2042 beta didn't have wingsuits. It's been one of the main things I'm looking forward to, leaping from buildings and gliding at unsuspecting foes, so it was sad that we didn't get to try it out. However, as I played, I realised that some players didn't seem to need wingsuits to get themselves off of the ground: they simply needed to die in a janky vehicle accident instead.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/battlefield-2042s-floating-corpses-bug-made-me-laugh-a-lot",
          "publishedOn": "2021-10-11T11:48:15.000Z",
          "wordCount": 1054,
          "title": "Battlefield 2042's floating corpses bug made me laugh a lot"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-tool-upgrades",
          "author": "Rebecca Jones",
          "description": "How can you upgrade tools in New World? Tools and weapons in New World can come in various different qualities, as reflected by their tier. Technically in this game you don't upgrade your tools — in as much as you don't use a lower-tier item as a base for a higher-tier upgrade. But there are ways of ensuring you craft a higher-tier tool, and you can do that regardless of whether you have a lower-tier version in hand or not; so in effect this system works more or less like tool upgrades in other games, but with a step removed.\n Read more",
          "link": "https://www.rockpapershotgun.com/new-world-tool-upgrades",
          "publishedOn": "2021-10-11T11:17:10.000Z",
          "wordCount": 1028,
          "title": "New World tool upgrades: how to get higher-tier tools in New World"
        },
        {
          "id": "https://www.rockpapershotgun.com/scummvm-celebrates-20th-birthday-with-the-longest-journey-support",
          "author": "Alice O'Connor",
          "description": "ScummVM celebrated its 20th birthday on Saturday, two decades of making old games easier to run on modern systems. The project started focused on LucasArts adventure games built in the SCUMM game engine and the first release only supported Monkey Island 2, and it has since grown to support over 300 games across other genres too. To celebrate that big birthday, a new update hit adding support for more game engines and many more games, including The Longest Journey, Grim Fandango, and Crusader: No Remorse.\nRead more",
          "link": "https://www.rockpapershotgun.com/scummvm-celebrates-20th-birthday-with-the-longest-journey-support",
          "publishedOn": "2021-10-11T11:08:46.000Z",
          "wordCount": 927,
          "title": "ScummVM celebrates 20th birthday with The Longest Journey support"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-joy-of-playing-deathloop-as-the-pettiest-man-in-existence",
          "author": "Nic Reuben",
          "description": "Hello! How was your day? Oh, me? Well, I spent the morning scheduling a crank wheel delivery to Updaam. Had lunch. Went back in the afternoon, disabled a few turrets, then hid behind a bin for a bit. All solely to turn off an oxygen pump and asphyxiate a bubble-encased band that I could have easily shot in a few seconds. Tomorrow, I may climb to the top of a three story building just to plummet, machete first, on the face of a guard that killed me once a few loops back. Hello. My name is Colt, and I am the pettiest videogame protagonist in existence.\r\n\n\r\nIn his Deathloop review, Brendy described Colt as “playing it by ass”. I liked that line, but I didn’t yet understand its true gravitas. I am now enlightened. I have beheld the true ass of Colt, and I have grasped its magnitude: Colt’s ass is the antithesis to Dishonored’s heart. Blam. Boot. Blam. None of you are free of sin. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-joy-of-playing-deathloop-as-the-pettiest-man-in-existence",
          "publishedOn": "2021-10-11T09:05:46.000Z",
          "wordCount": 1034,
          "title": "The Joy of playing Deathloop as the pettiest man in existence"
        },
        {
          "id": "https://www.rockpapershotgun.com/you-wont-be-able-to-move-new-world-characters-between-regions-after-all",
          "author": "Graham Smith",
          "description": "New World's server transfer system won't be as flexible as first suggested. Amazon had originally said that players would be able to switch between servers in different regions, letting you move a character from, for example, a North American server to a European one. As of yesterday, they confirmed that's not the case.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/you-wont-be-able-to-move-new-world-characters-between-regions-after-all",
          "publishedOn": "2021-10-09T20:41:01.000Z",
          "wordCount": 809,
          "title": "You won't be able to move New World characters between regions after all"
        },
        {
          "id": "https://www.rockpapershotgun.com/football-manager-2022-introduces-data-hub-new-match-engine",
          "author": "Graham Smith",
          "description": "Football Manager 2022 has started revealing its new features, dribbling them out from the back via videos on its official YouTube account. It's the nerdiest set of major new features ever, from new bar charts to \"staff meetings.\"\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/football-manager-2022-introduces-data-hub-new-match-engine",
          "publishedOn": "2021-10-09T20:07:52.000Z",
          "wordCount": 832,
          "title": "Football Manager 2022 introduces data hub, new match engine"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-quake-remasters-bot-support-is-better-now",
          "author": "Graham Smith",
          "description": "The enhanced edition of Quake, released in August to celebrate the game's 25th anniversary, just got a major update. It improves the game's bots, and adds bot support for a bunch more deathmatch maps, among other bug fixes.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-quake-remasters-bot-support-is-better-now",
          "publishedOn": "2021-10-09T18:51:19.000Z",
          "wordCount": 710,
          "title": "The Quake remaster's bot support is better now"
        },
        {
          "id": "https://www.rockpapershotgun.com/hitman-pulled-from-sale-on-gog",
          "author": "Graham Smith",
          "description": "GOG have pulled Hitman from sale. The bald assassin joined the DRM-free digital shop in September, but was met with damning reviews. That's because, while theoretically DRM-free, Hitman relies on online connectivity for a lot of its features to work. In pulling the game offline, GOG apologised, saying that they \"shouldn't have released it in its current form.\"\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/hitman-pulled-from-sale-on-gog",
          "publishedOn": "2021-10-09T18:38:40.000Z",
          "wordCount": 867,
          "title": "Hitman pulled from sale on GOG"
        },
        {
          "id": "https://www.rockpapershotgun.com/age-of-darkness-final-stand-is-a-strategy-game-that-can-draw-70000-units-on-screen-at-a-time",
          "author": "Graham Smith",
          "description": "Read the name \"Age Of Darkness: Final Stand.\" Now go make a cup of tea. By the time the kettle's boiled, can you still remember the name? \r\n\nIt's a shame, because name aside I like everything Age Of Darkness is doing. It's a survival RTS in which you're attempting to reclaim a world from hordes of monsters and a deadly fog, and its art direction is lovely. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/age-of-darkness-final-stand-is-a-strategy-game-that-can-draw-70000-units-on-screen-at-a-time",
          "publishedOn": "2021-10-09T17:11:24.000Z",
          "wordCount": 826,
          "title": "Age Of Darkness: Final Stand is a strategy game that can draw 70,000 units on screen at a time"
        },
        {
          "id": "https://www.rockpapershotgun.com/what-are-we-all-plaing-this-weekend",
          "author": "Alice O'Connor",
          "description": "Soon, virtual worlds will be crawling with skeletons, jack o' lanterns, and all that good stuff. While the various digital spaces we inhabit have different histories, different religions, different species, so many differences, it's nice to see that one belief is shared across almost every facet of the multiverse: actually, skeletons are really cool.\nRead more",
          "link": "https://www.rockpapershotgun.com/what-are-we-all-plaing-this-weekend",
          "publishedOn": "2021-10-09T08:00:00.000Z",
          "wordCount": 1000,
          "title": "What are we all playing this weekend?"
        },
        {
          "id": "https://www.rockpapershotgun.com/eronoctosis-is-a-free-co-op-horror-adventure-launching-on-monday",
          "author": "Lauren Morton",
          "description": "Eronoctosis was one of tons of excellent-looking horror games in today's EEK3 indie horror showcase. It happened to stand out though because I'm a real sucker for a high contrast lo-fi colour scheme. Also I'm a sucker for co-op, especially with horror. Eronoctosis: Put Yourself Together looks to be a psychological horror about banishing badies from inside your own mind. You're required to play with a friend, which makes the price tag of free a real good selling point. You can jump in on Monday when it launches free on Steam.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/eronoctosis-is-a-free-co-op-horror-adventure-launching-on-monday",
          "publishedOn": "2021-10-08T21:50:24.000Z",
          "wordCount": 825,
          "title": "Eronoctosis is a free co-op horror adventure launching on Monday"
        },
        {
          "id": "https://www.rockpapershotgun.com/build-your-dream-machine-for-free-with-pc-building-simulator-this-week",
          "author": "Lauren Morton",
          "description": "It's not often, if ever, that you get to build an impressive PC for free and without fear of irreparable failure. You can have both if you snag PC Building Simulator as the freebie of the week on the Epic Games Store through next Thursday. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/build-your-dream-machine-for-free-with-pc-building-simulator-this-week",
          "publishedOn": "2021-10-08T20:25:46.000Z",
          "wordCount": 824,
          "title": "Build your dream machine for free with PC Building Simulator this week"
        },
        {
          "id": "https://www.rockpapershotgun.com/ryu-ga-gotoku-have-a-new-studio-lead-and-plans-for-yakuza-lad-sequel",
          "author": "Lauren Morton",
          "description": "The Yakuza game series successfully passed the torch from long time leading protagonist to another with Yakuza: Like A Dragon last year and now developers Ryu Ga Gotoku are looking to do the same. Series director Toshihiro Nagoshi and producer Daisuke Sato are both leaving Sega, handing over the RGG studio lead position to writer and producer Masayoshi Yokoyama. Along with the announcement of the change, Yokoyama says that RGG plan to \"let our games do the talking\" including the in progress sequel to Yakuza: LAD. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/ryu-ga-gotoku-have-a-new-studio-lead-and-plans-for-yakuza-lad-sequel",
          "publishedOn": "2021-10-08T19:07:10.000Z",
          "wordCount": 918,
          "title": "Ryu Ga Gotoku have a new studio lead and plans for Yakuza: LAD sequel"
        },
        {
          "id": "https://www.rockpapershotgun.com/if-you-need-more-phoenix-wright-in-your-life-play-tangle-tower",
          "author": "Katharine Castle",
          "description": "I refuse to believe it's been two years since the launch of Tangle Tower. A year, at most, perhaps, but two? Simply impossible. But its release on PS4 and Xbox One this week has got me thinking about this excellent murder mystery game again, and man, if you've been hankering for more great detective work after the likes of The Great Ace Attorney Chronicles (or indeed the Phoenix Wright: Ace Attorney Trilogy) lately, then you absolutely owe it to yourself to play Tangle Tower. After all, when the prime suspect is *checks notes* a painted portrait holding a blood-tipped knife, who could possibly resist such a juicy little murder hook? \nRead more",
          "link": "https://www.rockpapershotgun.com/if-you-need-more-phoenix-wright-in-your-life-play-tangle-tower",
          "publishedOn": "2021-10-08T17:49:51.000Z",
          "wordCount": 830,
          "title": "If you need more Phoenix Wright in your life, play Tangle Tower"
        },
        {
          "id": "https://www.rockpapershotgun.com/diablo-ivs-new-game-director-is-its-design-lead-joe-shely",
          "author": "Lauren Morton",
          "description": "Following the sexual harassment and discrimination lawsuit filed against Activision Blizzard by the state of California this summer, Blizzard let go several long-time developers in leadership positions. Among them was Diablo IV's game director Luis Barriga. Blizzard have now officially filled that position with another long-time Diablo series designer Joe Shely, they've announced in a blog post.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/diablo-ivs-new-game-director-is-its-design-lead-joe-shely",
          "publishedOn": "2021-10-08T17:27:31.000Z",
          "wordCount": 875,
          "title": "Diablo IV's new game director is its design lead Joe Shely"
        },
        {
          "id": "https://www.rockpapershotgun.com/grand-theft-auto-trilogy-remasters-are-officially-announced-coming-this-year",
          "author": "Lauren Morton",
          "description": "As it was rumored, so it shall come to pass. Rockstar have just announced that they are indeed doing remasters of Grand Theft Auto III, GTA: San Andreas, and GTA: Vice City for PC and current consoles. Not just that, but they're coming this year which, now that it's October, means quite soon. They've rolled out a quick teaser trailer and just a couple details on what's getting freshened up in the trilogy remasters. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/grand-theft-auto-trilogy-remasters-are-officially-announced-coming-this-year",
          "publishedOn": "2021-10-08T16:05:47.000Z",
          "wordCount": 864,
          "title": "Grand Theft Auto trilogy remasters are officially announced, coming this year"
        },
        {
          "id": "https://www.rockpapershotgun.com/impostor-factory-review",
          "author": "Giada Zavarise",
          "description": "Every good murder mystery needs a spooky house for a stage. That's the rules. The one in Impostor Factory is a secluded manor deep in the woods, a crumbling temple to cleanliness with self-cleaning floors and a literal golden toilet in the bathroom. You are the first to arrive, shoulders heavy with rain. You don't know much about the hosts, apart from the fact that they're old, eccentric, and eager to unveil the mysterious machine looming in the main hall. The other guests are as rich and quirky as the villa's owners, and you, an everyday man named Quincy, are starting to feel a bit awkward about the whole situation. And yet you stay because you're curious about the machine, the weird vision you had in the bathroom, and that other guest you keep bumping into - the lady in a red dress that looks familiar and sad and full of secrets. \nThe stage is set. The guests are gathered. The murders begin. And then they happen again, and again, and again. The real mystery is not discovering who committed the murders. The mystery is understanding why they keep happening.\nRead more",
          "link": "https://www.rockpapershotgun.com/impostor-factory-review",
          "publishedOn": "2021-10-08T16:00:00.000Z",
          "wordCount": 1550,
          "title": "Impostor Factory (To The Moon 3) review: where an imaginary life is as fulfilling as a real one"
        },
        {
          "id": "https://www.rockpapershotgun.com/you-can-play-the-battlefield-2042-open-beta-right-now",
          "author": "Imogen Beckhelling",
          "description": "Battlefield 2042's open beta went live this morning, giving folks a chance to jump into some futuristic 128-player wars before the game launches in full next month. While there was a brief pre-order early access beta period this week, it's free for everyone to try right now, and is open until Sunday morning. I'll admit, I've never been big on Battlefield, but my pals are pretty excited about this one, so I expect I'll see you in the trenches this weekend.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/you-can-play-the-battlefield-2042-open-beta-right-now",
          "publishedOn": "2021-10-08T15:41:53.000Z",
          "wordCount": 910,
          "title": "You can play the Battlefield 2042 open beta right now"
        },
        {
          "id": "https://www.rockpapershotgun.com/dont-let-plunder-slip-over-the-horizon",
          "author": "Sin Vega",
          "description": "Look, it's not because it's about pirates. I mean, that's obviously what caught my eye, but it takes more than that, and most pirate games aren't about doing piracy at all anyway.\nPlunder isn't either, if I'm honest. It's a monster-slaying action RPG with age of sail trappings, but it's carried off with charm and such a clean design that even I can't bring my usual grudge to bear on it. I'm having far too much fun.\nRead more",
          "link": "https://www.rockpapershotgun.com/dont-let-plunder-slip-over-the-horizon",
          "publishedOn": "2021-10-08T15:33:04.000Z",
          "wordCount": 711,
          "title": "Don't let Plunder slip over the horizon"
        },
        {
          "id": "https://www.rockpapershotgun.com/okay-the-xbox-20th-anniversary-translucent-controller-looks-pretty-cool",
          "author": "Alice O'Connor",
          "description": "Microsoft have revealed a fancy new translucent Xbox controller created to celebrate 20 years of Xboxing, and honestly I dig it. Oh I have no intention of buying a new controller just beacuse it looks nice, a smoky body with a lurid flash of green, but I'm about due a new controller anyway. Time for the periodic replacement once too many minor irritating issues accumulate, you know. Might get this one.\nRead more",
          "link": "https://www.rockpapershotgun.com/okay-the-xbox-20th-anniversary-translucent-controller-looks-pretty-cool",
          "publishedOn": "2021-10-08T15:06:58.000Z",
          "wordCount": 914,
          "title": "Okay, the Xbox 20th anniversary translucent controller looks pretty cool"
        },
        {
          "id": "https://www.rockpapershotgun.com/audio-radar-is-an-led-sound-indicator-for-the-hard-of-hearing",
          "author": "James Archer",
          "description": "Peripheral makers AirDrop Gaming have announced a crowdfuning campaign for Audio Radar, a potentially useful accessory for PC gamers who are deaf or hard of hearing. Audio Radar is a set of six LED strips that surround your monitor and flash to signify the direction of important sound cues, and its Indiegogo campaign it set to launch on October 15th.\nRead more",
          "link": "https://www.rockpapershotgun.com/audio-radar-is-an-led-sound-indicator-for-the-hard-of-hearing",
          "publishedOn": "2021-10-08T15:03:28.000Z",
          "wordCount": 981,
          "title": "Audio Radar is an LED sound indicator for the hard of hearing"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-review-in-progress",
          "author": "Alice Bell",
          "description": "Even the name New World feels like a brash statement of intent, doesn't it? Amazon are shouldering their way into the market with a brand new MMORPG, a fresh digital playground that is, the name implies, unlike any you've seen before! In practise, of course, it is a lot like MMOs you've seen before, albeit with its own twists on the formula to get you hooked. New World understands that formula well, and I am a simple creature, so attaching a button marked Endorphin Release to my brain and pressing it every five minutes or so works as well on me as it does on a lab rat.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-review-in-progress",
          "publishedOn": "2021-10-08T15:00:00.000Z",
          "wordCount": 1972,
          "title": "New World review in progress: a fresh, swashbuckling MMO that's still very grindy early on"
        },
        {
          "id": "https://www.rockpapershotgun.com/apex-legends-begins-zombie-filled-halloween-event-next-week",
          "author": "Imogen Beckhelling",
          "description": "It's beginning: video game Halloween celebrations are starting to emerge from the shadows for another year. This Tuesday, Apex Legends players will be able to jump into the battle royale's new spooky event, Monsters Within. It brings back the limited-time mode that turns Legends into zombies to hunt their pals, adds a bunch of eerie cosmetics, and introduces a new ominous-looking Arenas map to boot. I'm very excited. Halloween!\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/apex-legends-begins-zombie-filled-halloween-event-next-week",
          "publishedOn": "2021-10-08T14:42:49.000Z",
          "wordCount": 872,
          "title": "Apex Legends begins zombie-filled Halloween event next week"
        },
        {
          "id": "https://www.rockpapershotgun.com/so-which-steam-next-fest-demos-did-you-like",
          "author": "Alice O'Connor",
          "description": "The Steam Next Fest has ended, with Valve last night taking down the big banner over their latest event celebrating new demos for indie games. As ever, the demo bonanza was too large to reasonably play everything, so we've recommend quite a few games along the way. But how about you? What did you like? What will you be keeping an eye?\nRead more",
          "link": "https://www.rockpapershotgun.com/so-which-steam-next-fest-demos-did-you-like",
          "publishedOn": "2021-10-08T14:05:41.000Z",
          "wordCount": 825,
          "title": "So which Steam Next Fest demos did you like?"
        },
        {
          "id": "https://www.rockpapershotgun.com/far-cry-6-best-weapons",
          "author": "Ollie Toms",
          "description": "Want to know which are the best weapons in Far Cry 6? There's an awful lot of guns to play with in Ubisoft's latest bombastic open-world FPS, from SMGs and Sniper Rifles to Launchers and Bows. But you've also got Unique Weapons that can be found throughout Yara, and even unique-er Resolver Weapons that you can acquire from Juan in exchange for Depleted Uranium. The point is: picking the best gun is a daunting prospect in Far Cry 6.\nBut that's why we've picked 7! Below you'll find our picks for the very best weapons in Far Cry 6. Each of these tools of destruction are overpowered in their own way, and will allow you to tear through enemies without hesitation. Read on and pick the weapons that best suit your style.\nRead more",
          "link": "https://www.rockpapershotgun.com/far-cry-6-best-weapons",
          "publishedOn": "2021-10-08T14:03:39.000Z",
          "wordCount": 1810,
          "title": "Best weapons in Far Cry 6"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-tadpoles",
          "author": "Rebecca Jones",
          "description": "How can you catch Tadpoles in New World, and what are they used for? Tadpoles are a deceptively helpful resource in New World. It's hard to imagine a more unassuming creature, but you'll need to catch some Tadpoles to complete some useful early Town Projects. Furthermore, Tadpoles can be salvaged into Life Motes, a crafting resource which goes into some good mid-game recipes.\n Read more",
          "link": "https://www.rockpapershotgun.com/new-world-tadpoles",
          "publishedOn": "2021-10-08T13:04:17.000Z",
          "wordCount": 1100,
          "title": "New World Tadpoles: where to catch Tadpoles and why they're so useful"
        },
        {
          "id": "https://www.rockpapershotgun.com/easy-anti-cheat-issues-locked-new-world-players-out-this-week",
          "author": "Imogen Beckhelling",
          "description": "Over the last few days, many New World players have been struggling to get into Amazon's popular MMORPG. Some reported being booted to menu after queuing, while others haven't been able to open the game at all. Last night, the devs suggested it was a problem with Easy Anti-Cheat, and offered a workaround so folks could get back on the grind. As it turns out, other games that use EAC have seen similar issues, and now Steam has rolled back a client update to try and fix them.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/easy-anti-cheat-issues-locked-new-world-players-out-this-week",
          "publishedOn": "2021-10-08T12:25:55.000Z",
          "wordCount": 841,
          "title": "Easy Anti-Cheat issues locked New World players out this week"
        },
        {
          "id": "https://www.rockpapershotgun.com/mystery-steam-reviews-056-video-games-2021",
          "author": "Colm Ahern",
          "description": "2021 has been unfairly hammered by critics. Sure, it's not a classic year like 1998 or 2007, but there's been some decent games out over the last few months. To be fair, though, this MSR also highlights some of 2021's lowlights, so it's not like quality was that much of a concern when we were choosing our games.\r\n  \nRead more",
          "link": "https://www.rockpapershotgun.com/mystery-steam-reviews-056-video-games-2021",
          "publishedOn": "2021-10-08T12:00:00.000Z",
          "wordCount": 965,
          "title": "The final Mystery Steam Reviews is all about 2021"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-to-install-a-new-gpu",
          "author": "James Archer",
          "description": "Right now, there’s a graphics card shortage the likes of which have never been seen, and thus the knowledge of how to install a new GPU has only slightly more relevance than knowing how to parallel park a griffin. Or maybe not – it is technically possible, if annoyingly rare, to grab one of the best graphics cards of the current generation before a reseller or blockchain enthusiast snaps up ten of them at once. And even the most morose estimates don’t suggest this dearth will last forever, in which case: welcome, RPS readers of the future.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/how-to-install-a-new-gpu",
          "publishedOn": "2021-10-08T11:28:24.000Z",
          "wordCount": 1566,
          "title": "How to install a new GPU"
        },
        {
          "id": "https://www.rockpapershotgun.com/destiny-2-will-remove-forsaken-campaign-and-the-tangled-shore-next",
          "author": "Alice O'Connor",
          "description": "Bungie have announced plans to remove the Forsaken expansion's story campaign from Destiny 2, shuffling it into the Destiny Content Vault along with the Tangled Shore location. The Dreaming City will stay, thankfully, and Bungie also plan to pull some old content back out of the Vault. Before Forsaken vanishes in February, it will become free for all players from December. And hey, Battlegrounds mode is becoming a regular fixture!\nRead more",
          "link": "https://www.rockpapershotgun.com/destiny-2-will-remove-forsaken-campaign-and-the-tangled-shore-next",
          "publishedOn": "2021-10-08T10:56:31.000Z",
          "wordCount": 1282,
          "title": "Destiny 2 will remove Forsaken campaign and the Tangled Shore next"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-voidmetal",
          "author": "Rebecca Jones",
          "description": "What is Voidmetal used for in New World, and where can you find it? Voidmetal is one of New World's high-end crafting materials, used in the recipes for some of the game's best weapons, armor, and other desirable items.\n Read more",
          "link": "https://www.rockpapershotgun.com/new-world-voidmetal",
          "publishedOn": "2021-10-08T10:40:36.000Z",
          "wordCount": 1058,
          "title": "New World Voidmetal: how to find, mine, and craft with Voidmetal in New World"
        },
        {
          "id": "https://www.rockpapershotgun.com/rust-now-has-npcs-who-can-give-you-missions",
          "author": "Graham Smith",
          "description": "Grim survival shooter Rust's descriptively named \"Missions & QoL\" update is a doozy. You can now talk to NPCs scattered around the world who will give you missions to perform, \"from catching fish or harvesting lumber to hunting sharks and uncovering hidden treasure.\"\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/rust-now-has-npcs-who-can-give-you-missions",
          "publishedOn": "2021-10-07T23:07:21.000Z",
          "wordCount": 750,
          "title": "Rust now has NPCs who can give you missions"
        },
        {
          "id": "https://www.rockpapershotgun.com/dota-2s-the-international-is-now-underway",
          "author": "Graham Smith",
          "description": "Dota 2's The International is now underway. The group stages for Valve's wizard flinging esports tournament began today, with 18 teams competing to progress into the knockout stages. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/dota-2s-the-international-is-now-underway",
          "publishedOn": "2021-10-07T22:24:45.000Z",
          "wordCount": 751,
          "title": "Dota 2's The International is now underway"
        },
        {
          "id": "https://www.rockpapershotgun.com/watch-the-first-trailer-for-the-resident-evil-welcome-to-raccoon-city-movie",
          "author": "Graham Smith",
          "description": "I'm not sure it's possible for my expectations to be lower than they are for any given Resident Evil movie project, but the subtitle \"Welcome To Raccoon City\" might just have lowered them further. Thankfully I've just watched the first official trailer, and hey, this looks fun! This looks competent. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/watch-the-first-trailer-for-the-resident-evil-welcome-to-raccoon-city-movie",
          "publishedOn": "2021-10-07T21:59:17.000Z",
          "wordCount": 773,
          "title": "Watch the first trailer for the Resident Evil: Welcome To Raccoon City movie"
        },
        {
          "id": "https://www.rockpapershotgun.com/ea-say-fifa-might-not-be-called-fifa-in-future",
          "author": "Graham Smith",
          "description": "EA's FIFA games might not be called FIFA in future. That's what EA Sports say, eventually, in a blog post on the \"future of football\". \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/ea-say-fifa-might-not-be-called-fifa-in-future",
          "publishedOn": "2021-10-07T21:11:16.000Z",
          "wordCount": 937,
          "title": "EA say FIFA might not be called FIFA in future"
        },
        {
          "id": "https://www.rockpapershotgun.com/razer-streaming-gear-is-heavily-discounted-at-amazon-uk",
          "author": "Will Judd",
          "description": "A whole host of Razer peripherals and streaming equipment has been discounted at Amazon UK today, including one of my favourite mice of all time - the Razer Viper Ultimate. Here are the links, then we'll get into the explanations of why these deals are worth considering!\nRead more",
          "link": "https://www.rockpapershotgun.com/razer-streaming-gear-is-heavily-discounted-at-amazon-uk",
          "publishedOn": "2021-10-07T19:57:30.000Z",
          "wordCount": 1086,
          "title": "Razer streaming gear is heavily discounted at Amazon UK"
        },
        {
          "id": "https://www.rockpapershotgun.com/amds-new-ryzen-5700g-apu-thats-cpu-plus-integrated-graphics-is-going-cheap-in-the-uk",
          "author": "Will Judd",
          "description": "The AMD Ryzen 7 5700G was released earlier this year for £330, but supply issues made it hard to find this processor with integrated graphics at all. Now, Ebuyer are selling the chip for £295, a £40 reduction from its recommended retail price of £330. That's a good deal for a CPU that outperforms AMD's already excellent Ryzen 3700X while also providing fast enough graphics performance for 1080p gaming. Oh, and it comes with a free, quite decent AMD Wraith CPU cooler - awesome. \nRead more",
          "link": "https://www.rockpapershotgun.com/amds-new-ryzen-5700g-apu-thats-cpu-plus-integrated-graphics-is-going-cheap-in-the-uk",
          "publishedOn": "2021-10-07T19:34:40.000Z",
          "wordCount": 1064,
          "title": "AMD's new Ryzen 5700G APU (that's CPU plus integrated graphics) is going cheap in the UK"
        },
        {
          "id": "https://www.rockpapershotgun.com/book-of-travels-preview-the-cure-for-my-break-up-with-mmos",
          "author": "Lauren Morton",
          "description": "The first thing I did in the early access version of Book Of Travels was wander aimlessly into a dangerous forest, get robbed by a Ruffian, refuse to hand over my meager starter items because I had given myself the 'stickler' personality trait, and completely flub the resulting combat encounter because I had no weapons.\nMight And Delight's creative director Jakob Tuchten was quite apologetic about my fate, but a life is a small price for a surprise - the greatest gift to an old MMO player like me. I'm telling you this off the cuff because this is not, in fact, representative of my ten hours with Book Of Travels so far. Aside from my initial unwitting choice to spawn in a dangerous area, the Braided Shore is a serene world with a meditative pace. It's a fable in game form, with its painterly visuals and homely magic. If you are looking for danger though, it is out there waiting for you off the roads and far from city centers.\nRead more",
          "link": "https://www.rockpapershotgun.com/book-of-travels-preview-the-cure-for-my-break-up-with-mmos",
          "publishedOn": "2021-10-07T17:00:00.000Z",
          "wordCount": 2074,
          "title": "Book Of Travels' online cRPG world may be the cure for my break-up with MMOs"
        },
        {
          "id": "https://www.rockpapershotgun.com/eidos-montreal-are-switching-to-a-four-day-workweek",
          "author": "Alice O'Connor",
          "description": "The studio behind the Deus Ex prequels, Guardians Of The Galaxy, and Shadow Of The Tomb Raider are taking a bold step in an industry known for overworking, and switching to a four-day workweek. Eidos Montreal say salaries and working conditions will remain the same, they'll just close the office on Fridays as everyone goes from 40-hour weeks to 32-hour weeks. The idea is that with more downtime to unwind and live their lives, people will work better during those reduced hours. Alright, everyone else do this too, thanks.\nRead more",
          "link": "https://www.rockpapershotgun.com/eidos-montreal-are-switching-to-a-four-day-workweek",
          "publishedOn": "2021-10-07T16:26:42.000Z",
          "wordCount": 1076,
          "title": "Eidos Montreal are switching to a four-day workweek"
        },
        {
          "id": "https://www.rockpapershotgun.com/windows-11-is-making-amd-chips-slower-in-games",
          "author": "James Archer",
          "description": "Microsoft’s chief product officer Panos Panay once said “If you’re a gamer, Windows 11 was made for you.” Unfortunately, a couple of days after launching, it’s turning out to be something of an unwanted gift. Besides being blamed for Far Cry 6 crashes and deterring an entire cloud gaming service, Windows 11 is now causing performance drops on AMD chips as well. That’s according to AMD themselves, who announced in a support post that updating to Windows 11 could cause a 3-5% performance drop in some applications as well as a 10-15% drop in “games commonly used for esports.”\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/windows-11-is-making-amd-chips-slower-in-games",
          "publishedOn": "2021-10-07T15:40:05.000Z",
          "wordCount": 979,
          "title": "Windows 11 is making AMD chips slower in games"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-pvp",
          "author": "Rebecca Jones",
          "description": "What PvP modes are available in New World, and how do you take part in them? New World is an MMO, which means interaction with other players forms a big part of the game. While it's far from every-player-for-themself on the Isle of Aeternum — you're encouraged to join up with a Company (New World's version of Guilds, basically) to make the most of co-operative gameplay — there's naturally a PvP aspect involved as well.\n Read more",
          "link": "https://www.rockpapershotgun.com/new-world-pvp",
          "publishedOn": "2021-10-07T15:34:48.000Z",
          "wordCount": 1639,
          "title": "New World PvP: what PvP modes are there in New World?"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-electronic-wireless-show-episode-159-deal-sweeten-with-a-vengeance",
          "author": "Alice Bell",
          "description": "Matthew once again has the temerity to be away, so this week for the Electronic Wireless Show Podcast Nate and I play another round of Sweeten The Deal (per a vote in the podcast Discord), in which, as Nate says, we both lose. On the upside, since this is the third game of Sweeten The Deal that we've played, we are both developing very distinct, high-level playstyles and also a theme song for it.\nIt does mean there isn't a whole lot of game chat this week, although we do discuss the very important developments in the case of The Zodiac Killer, as well as a very special Cavern Of Announcements.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-electronic-wireless-show-episode-159-deal-sweeten-with-a-vengeance",
          "publishedOn": "2021-10-07T15:00:00.000Z",
          "wordCount": 856,
          "title": "EWS podcast episode 158: Deal Sweeten With A Vengeance"
        },
        {
          "id": "https://www.rockpapershotgun.com/randy-pitchford-no-longer-gearbox-software-president-but-still-in-charge",
          "author": "Alice O'Connor",
          "description": "Gearbox Software, the makers of Borderlands and finishers of Duke Nukem Forever, have a new president. Steve Jones, their former chief technical officer, has claimed the throne. Former president Randy Pitchford isn't gone, mind. He's still president and CEO of the wider Gearbox group, and still president of the arm that's bringing their games to TV and films.\nRead more",
          "link": "https://www.rockpapershotgun.com/randy-pitchford-no-longer-gearbox-software-president-but-still-in-charge",
          "publishedOn": "2021-10-07T14:19:57.000Z",
          "wordCount": 893,
          "title": "Randy Pitchford no longer Gearbox Software president, but still in charge"
        },
        {
          "id": "https://www.rockpapershotgun.com/groundeds-next-update-adds-an-ant-filled-dungeon-and-a-literal-sandbox",
          "author": "Imogen Beckhelling",
          "description": "Obsidian's Honey I Shrunk The Kids 'em up survival sandbox Grounded is adding an actual sandbox this month, along with its first dungeon, and a big old pile of trash. This all arrives in the Hot and Hazy update on October 20th, which will give players new places to explore and new creepy crawlies to fight. It's also revamping an existing biome, and you can try it all out right now on a test branch if you fancy.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/groundeds-next-update-adds-an-ant-filled-dungeon-and-a-literal-sandbox",
          "publishedOn": "2021-10-07T13:43:19.000Z",
          "wordCount": 947,
          "title": "Grounded's next update adds an ant-filled dungeon and a literal sandbox"
        },
        {
          "id": "https://www.rockpapershotgun.com/far-cry-6-supremos",
          "author": "Ollie Toms",
          "description": "Want to know about Supremos and their special abilities in Far Cry 6? Supremos are among the most powerful pieces of equipment you can find in Far Cry 6. Not only do they allow you to use throwable gadgets like grenades and throwing knives, but they also give you access to some very powerful special abilities. But not all the Supremos are easy to get your hands on.\nBelow we'll talk about each of the seven Supremo backpacks in Far Cry 6, how to get them, and the special abilities each one unlocks. Keep an eye out in particular for the last Supremo on this list, because it's pretty much the most powerful weapon in the game.\nRead more",
          "link": "https://www.rockpapershotgun.com/far-cry-6-supremos",
          "publishedOn": "2021-10-07T12:38:12.000Z",
          "wordCount": 1526,
          "title": "Far Cry 6 Supremos: how to unlock all 7 Supremo backpacks and their special abilities"
        },
        {
          "id": "https://www.rockpapershotgun.com/far-cry-6-pc-performance-and-best-settings",
          "author": "James Archer",
          "description": "Far Cry 6 is another Ubisoft map marker maelstrom, but it’s not all familiar open world action and notably absent political commentary. In terms of PC techiness, this episode takes a relatively sizeable step forward for the series, introducing ray tracing for shadows and reflections as well as AMD’s FidelityFX Super Resolution (FSR) for upscaling-enabled frame rate boosts. Giancarlo Esposito’s face has never taken advantage of modern graphics hardware quite like this. \nRead more",
          "link": "https://www.rockpapershotgun.com/far-cry-6-pc-performance-and-best-settings",
          "publishedOn": "2021-10-07T11:40:51.000Z",
          "wordCount": 2247,
          "title": "Far Cry 6: PC performance and the best settings to use"
        },
        {
          "id": "https://www.rockpapershotgun.com/far-cry-6-okus-triada-relic-walkthrough",
          "author": "Ollie Toms",
          "description": "Want to know how to find Oku's Triada Relic in Far Cry 6? Oku's Triada Relic is a treasure hunt quest in Far Cry 6. It's a very important side-quest, because it forms part of the larger Triada Blessings quest which will unlock some very powerful and important things for you.\nIn the below walkthrough we'll explain exactly how to complete the Oku's Triada Relic treasure hunt quest in Far Cry 6 so that you can earn all these potent rewards in no time.\nRead more",
          "link": "https://www.rockpapershotgun.com/far-cry-6-okus-triada-relic-walkthrough",
          "publishedOn": "2021-10-07T11:31:28.000Z",
          "wordCount": 1317,
          "title": "Far Cry 6: Oku's Triada Relic walkthrough"
        },
        {
          "id": "https://www.rockpapershotgun.com/far-cry-6-is-out-now-with-some-launch-crashes-on-pc",
          "author": "Imogen Beckhelling",
          "description": "Ubisoft's new open-world dictatorship-toppling simulator Far Cry 6 is out now. You'll be liberating an island, creating make-shift weapons and traversing a huge world - you know, Far Cry stuff. Do watch out if you're playing today though, because a few players have reported crashes on launch, struggles opening the game, and trouble connecting to online services for co-op.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/far-cry-6-is-out-now-with-some-launch-crashes-on-pc",
          "publishedOn": "2021-10-07T11:13:14.000Z",
          "wordCount": 829,
          "title": "Far Cry 6 is out now, with some launch crashes on PC"
        },
        {
          "id": "https://www.rockpapershotgun.com/yup-the-witcher-3-looks-to-run-just-fine-on-a-steam-deck",
          "author": "Alice O'Connor",
          "description": "While Valve yesterday were busy cracking open a Steam Deck, CD Projekt Red showed us a game actually running on one. They've posted a series of short videos of them playing The Witcher 3: The Wild Hunt on Valve's handheld PC and yup, that seems to run well enough. The game might be a few years old now, but it's still one of best RPGs—and honestly the sort of endless sprawling game I might rather play on-and-off on a handheld.\nRead more",
          "link": "https://www.rockpapershotgun.com/yup-the-witcher-3-looks-to-run-just-fine-on-a-steam-deck",
          "publishedOn": "2021-10-07T10:58:33.000Z",
          "wordCount": 859,
          "title": "Yup, The Witcher 3 looks to run just fine on a Steam Deck"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-housing",
          "author": "Rebecca Jones",
          "description": "How do you buy a house in New World? Upon arriving in Aeternum, your New World character quickly learns that they're likely stuck on the island for life thanks to the powerful magical field that surrounds it. On the plus side though, residents of Aeternum tend towards immortality, so it's definitely not all bad news. One thing's for sure though: since they're here literally forever, your plucky Conquistador is going to want to find a place to call home.\n Read more",
          "link": "https://www.rockpapershotgun.com/new-world-housing",
          "publishedOn": "2021-10-07T10:21:26.000Z",
          "wordCount": 1262,
          "title": "New World housing: how to buy a house in New World"
        },
        {
          "id": "https://www.rockpapershotgun.com/twitch-say-logins-and-credit-card-numbers-werent-exposed-in-hack",
          "author": "Alice O'Connor",
          "description": "Livestreaming platform Twitch was recently hacked, hard, and a huge chunk of yoinked data was leaked publicly yesterday. Source code for the site and loads of Twitch projects were shared in a 128GB torrent, along with earnings numbers for streamers. Twitch say they \"are still in the process of understanding the impact in detail\" but so far, it seems login credentials and credit card numbers are safe. They have also reset stream keys, just in case.\nRead more",
          "link": "https://www.rockpapershotgun.com/twitch-say-logins-and-credit-card-numbers-werent-exposed-in-hack",
          "publishedOn": "2021-10-07T09:51:50.000Z",
          "wordCount": 872,
          "title": "Twitch say logins and credit card numbers weren't exposed in hack"
        },
        {
          "id": "https://www.rockpapershotgun.com/far-cry-6-male-female-dani",
          "author": "Ollie Toms",
          "description": "Wondering whether to choose male or female Dani in Far Cry 6? Ubisoft's latest title in the massive open-world FPS series departs from the formulae of the previous games in more than a few ways - one of which is the addition of two fully voiced versions of the main character, Dani Rojas: one male, and one female. But which should you choose, and is there any difference between them? Find out below.\nRead more",
          "link": "https://www.rockpapershotgun.com/far-cry-6-male-female-dani",
          "publishedOn": "2021-10-06T23:01:00.000Z",
          "wordCount": 1003,
          "title": "Far Cry 6: should you pick male or female Dani?"
        },
        {
          "id": "https://www.rockpapershotgun.com/far-cry-6-gunpowder",
          "author": "Ollie Toms",
          "description": "Confused about how to get Gunpowder in Far Cry 6? Gunpowder is a fairly sparse but very important resource in Ubisoft's colossal open-world FPS title, as it is a required component for upgrading your weapons arsenal throughout the game. There are only a few ways you can get your hands on Gunpowder in Far Cry 6, so follow the tips below to learn how to amass a healthy stockpile of Gunpowder while you play.\nRead more",
          "link": "https://www.rockpapershotgun.com/far-cry-6-gunpowder",
          "publishedOn": "2021-10-06T23:01:00.000Z",
          "wordCount": 1001,
          "title": "How to get Gunpowder in Far Cry 6"
        },
        {
          "id": "https://www.rockpapershotgun.com/far-cry-6-depleted-uranium",
          "author": "Ollie Toms",
          "description": "Want to know where to find Depleted Uranium in Far Cry 6? Depleted Uranium is a very important resource in Far Cry 6, the latest title in Ubisoft's massive open-world FPS series. Although in this case, it's actually less of a resource and more of a currency which you can use to purchase powerful and unique gear from your comrade, Juan.\nLearn how to get Depleted Uranium in Far Cry 6 below, along with how to use it up purchasing awesome new equipment once you have it.\nRead more",
          "link": "https://www.rockpapershotgun.com/far-cry-6-depleted-uranium",
          "publishedOn": "2021-10-06T23:01:00.000Z",
          "wordCount": 944,
          "title": "How to get Depleted Uranium in Far Cry 6"
        },
        {
          "id": "https://www.rockpapershotgun.com/far-cry-6-ammo-types",
          "author": "Ollie Toms",
          "description": "Want to know about the different ammo types in Far Cry 6? Each type of ammo in Ubisoft's behemoth of a FPS deals a different type of damage to enemies, and each of them is particularly effective against certain foes in Anton Castillo's army.\nLearn about the different damage and ammo types in Far Cry 6 below, and how you can learn which enemies are susceptible to certain types of damage.\nRead more",
          "link": "https://www.rockpapershotgun.com/far-cry-6-ammo-types",
          "publishedOn": "2021-10-06T23:01:00.000Z",
          "wordCount": 1230,
          "title": "Far Cry 6 ammo types and damage types explained"
        },
        {
          "id": "https://www.rockpapershotgun.com/far-cry-6-fishing-rod-how-to-fish",
          "author": "Ollie Toms",
          "description": "Wondering how to fish in Far Cry 6? First you'll need a Fishing Rod. Sounds obvious, doesn't it? Sadly, you can't just walk up to those fishing points dotted about the coasts of Yara in Far Cry 6 and start catching fish, though.\nBelow we'll teach you how to get the Fishing Rod, how the actual fishing minigame works in Far Cry 6, and how to use the fish you've caught to cook delicious meals and trade for crafting materials.\nRead more",
          "link": "https://www.rockpapershotgun.com/far-cry-6-fishing-rod-how-to-fish",
          "publishedOn": "2021-10-06T23:01:00.000Z",
          "wordCount": 1203,
          "title": "How to fish in Far Cry 6"
        },
        {
          "id": "https://www.rockpapershotgun.com/far-cry-6-anti-aircraft-cannons",
          "author": "Ollie Toms",
          "description": "Confused about how to destroy Anti-Aircraft Cannons in Far Cry 6? There's a very respectable number of in-game tutorials in Ubisoft's latest open-world FPS, but they really could have done with a tutorial about what it takes to destroy those giant, seemingly invulnerable skyward-pointing turrets. Without the right weapons, these things are pretty much impossible to take down - so read on to find out exactly how to destroy Anti-Aircraft Cannons in Far Cry 6.\nRead more",
          "link": "https://www.rockpapershotgun.com/far-cry-6-anti-aircraft-cannons",
          "publishedOn": "2021-10-06T23:01:00.000Z",
          "wordCount": 995,
          "title": "How to destroy Anti-Aircraft Cannons in Far Cry 6"
        },
        {
          "id": "https://www.rockpapershotgun.com/far-cry-6-save-autosave",
          "author": "Ollie Toms",
          "description": "Is it possible to save your progress in Far Cry 6? Like many Ubisoft games, Far Cry 6 uses an autosave feature to save your progress rather letting you save manually, but how does the game decide when to autosave? In such a colossal open-world FPS game, where you're often spending time crossing large distances and getting lots of different things done in a short space of time, it's important that Far Cry 6 features a robust save system. But what can you do to ensure that your progress is saved when you need it to be? Learn the answers to these questions below.\nRead more",
          "link": "https://www.rockpapershotgun.com/far-cry-6-save-autosave",
          "publishedOn": "2021-10-06T23:01:00.000Z",
          "wordCount": 962,
          "title": "Can you save your progress in Far Cry 6?"
        },
        {
          "id": "https://www.rockpapershotgun.com/far-cry-6-amigos",
          "author": "Ollie Toms",
          "description": "Want to know about the different Amigos in Far Cry 6 and how to get them? Guns For Hire are a thing of the past in this latest installment of Ubisoft's open-world FPS franchise, and replacing them are Amigos - animal allies you can give orders to in combat and stealth situations.\nSome of these Amigos are very easy to unlock, while others require far more work to obtain. Learn how to unlock all seven Amigos in Far Cry 6 below, and the strengths and abilities of each one.\nRead more",
          "link": "https://www.rockpapershotgun.com/far-cry-6-amigos",
          "publishedOn": "2021-10-06T23:01:00.000Z",
          "wordCount": 2126,
          "title": "Far Cry 6 Amigos list: how to unlock all seven Far Cry 6 pets"
        },
        {
          "id": "https://www.rockpapershotgun.com/far-cry-6-map-territories",
          "author": "Ollie Toms",
          "description": "Want to know which territory you should go to first in Far Cry 6? In true Ubisoft fashion, Far Cry 6 drops players into an incredibly large and open-ended map, where shortly after the first starting missions you'll have the freedom to pick where in the enormous island of Yara you want to visit. Each of the three major territories is packed with content, characters, and pets - so have a read about each one below and find out which territory you should start with in the Far Cry 6 map.\nRead more",
          "link": "https://www.rockpapershotgun.com/far-cry-6-map-territories",
          "publishedOn": "2021-10-06T23:01:00.000Z",
          "wordCount": 1797,
          "title": "Far Cry 6 map: which territory should you go to first?"
        },
        {
          "id": "https://www.rockpapershotgun.com/far-cry-6-tips-and-tricks",
          "author": "Ollie Toms",
          "description": "Looking for tips and tricks on how to begin your Far Cry 6 journey with a bang? Ubisoft's latest installment in their flagship open-world FPS series is the biggest we've seen so far. Far Cry 6 unleashes players on the colossal, fictional Caribbean country of Yara, and it is jam-packed with things to do. It can be a daunting prospect when you're first starting out, particularly if you've never played a Far Cry game before.\nIn this beginner's guide to Far Cry 6, we'll walk you through our top tips and tricks that will help you get prepared and equipped for any situation early on. From crafting weapons and piloting choppers to getting unique weapons and animal companions, we'll show you the things worth knowing on day one.\nRead more",
          "link": "https://www.rockpapershotgun.com/far-cry-6-tips-and-tricks",
          "publishedOn": "2021-10-06T23:01:00.000Z",
          "wordCount": 2203,
          "title": "Far Cry 6 tips and tricks: a beginner's guide"
        },
        {
          "id": "https://www.rockpapershotgun.com/old-school-runescape-has-added-a-new-group-ironman-challenge-mode",
          "author": "Lauren Morton",
          "description": "Old School RuneScape's Ironman Mode is all about going it alone. The special account type requires you to tackle the game without trading, PvP, and other group activities. As of today, Ironman Mode is getting a big new change. Now you'll be able to play alone together. Jagex have now added the ability to form a group of up to five players who will all head out into the world as an Ironman team to tackle all of OSRS's big baddies as a crew.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/old-school-runescape-has-added-a-new-group-ironman-challenge-mode",
          "publishedOn": "2021-10-06T21:57:55.000Z",
          "wordCount": 872,
          "title": "Old School RuneScape has added a new Group Ironman challenge mode"
        },
        {
          "id": "https://www.rockpapershotgun.com/baldurs-gate-3-patch-6-will-add-another-class-and-weaponized-salami",
          "author": "Lauren Morton",
          "description": "Baldur's Gate 3 is venturing forth into anther early access milestone. Larian say that BG3's next major update, Patch 6, is nearly here. It is, once again, their biggest patch so far, they say. Another new class is getting added, as is an equippable meat easter egg from their LARPing livestream earlier this year. Here are the few details they've shared so far before giving a proper introduction to Patch 6 soon.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/baldurs-gate-3-patch-6-will-add-another-class-and-weaponized-salami",
          "publishedOn": "2021-10-06T20:42:35.000Z",
          "wordCount": 865,
          "title": "Baldur's Gate 3 Patch 6 will add another class and weaponized salami"
        },
        {
          "id": "https://www.rockpapershotgun.com/valve-say-dont-crack-open-your-steam-deck-but-also-show-you-how-to-do-it",
          "author": "Lauren Morton",
          "description": "We're getting closer to the first ship dates for Valve's handheld gaming PC Steam Deck. As PC hardware folks do, everyone apparently wants to see exactly what's inside. Naturally, Valve say they think you really shouldn't go opening the thing yourself, for reasons ranging from electrical safety to the warranty—which doesn't cover any damage you could cause by doing so, they say. So they're showing you exactly how to open it up in hopes that you'll leave doing so to a professional. Their new video today shows what will be inside your Steam Deck and how to remove a few of its parts.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/valve-say-dont-crack-open-your-steam-deck-but-also-show-you-how-to-do-it",
          "publishedOn": "2021-10-06T19:26:24.000Z",
          "wordCount": 852,
          "title": "Valve say don't crack open your Steam Deck but also show you how to do it"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-long-dark-episode-4-is-out-now-with-its-prison-break-survival-story",
          "author": "Lauren Morton",
          "description": "Snowbound survival sandbox The Long Dark has just launched its fourth free story episode update after two years in development. The new episode \"Fury, Then Silence\" follows crashed bush pilot Mackenzie on his continued search for his companion Astrid in the snowy apocalypse. This time, he's found himself captured by a gang attempting a prison break. Episode Four is out now with all that new story mode to chew on before Hinterland talk about what's next for modding tools and survival mode.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-long-dark-episode-4-is-out-now-with-its-prison-break-survival-story",
          "publishedOn": "2021-10-06T18:20:44.000Z",
          "wordCount": 827,
          "title": "The Long Dark Episode 4 is out now with its prison break survival story"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-a-super-fast-2tb-samsung-nvme-ssd-for-164-thats-62-off",
          "author": "Will Judd",
          "description": "The roomy 2TB version of the Samsung 970 Evo Plus SSD is going extremely cheap today over at Amazon, where it costs just £164 - a solid £62 off its normal price of £226. That's an insanely good price for one of the fastest PCIe 3.0 SSDs, especially on a high capacity drive like this one. \nRead more",
          "link": "https://www.rockpapershotgun.com/get-a-super-fast-2tb-samsung-nvme-ssd-for-164-thats-62-off",
          "publishedOn": "2021-10-06T18:04:58.000Z",
          "wordCount": 936,
          "title": "Get a super-fast 2TB Samsung NVMe SSD for £164 - that's £62 off"
        },
        {
          "id": "https://www.rockpapershotgun.com/take-home-a-well-equipped-rtx-3060-ti-gaming-pc-for-1200",
          "author": "Will Judd",
          "description": "Ebuyer are offering a good price on one of their prebuilt gaming PCs, featuring an RTX 3060 Ti, Ryzen 7 3700X processor, 16GB RAM and 1TB NVMe SSD. Right now, you can pick up this build for £1199, a cool £100 off its usual price. Given the state of the graphics card market, where even weak graphics cards are selling for hundreds of pounds above RRP, this is actually a great value.\nRead more",
          "link": "https://www.rockpapershotgun.com/take-home-a-well-equipped-rtx-3060-ti-gaming-pc-for-1200",
          "publishedOn": "2021-10-06T17:42:07.000Z",
          "wordCount": 991,
          "title": "Take home a well-equipped RTX 3060 Ti gaming PC for £1200"
        },
        {
          "id": "https://www.rockpapershotgun.com/arcade-paradise-makes-everything-a-game-including-your-boring-chores",
          "author": "Lauren Morton",
          "description": "When your dad runs off on vacation and leaves you in charge of his junker old laundromat, what else would you do aside from flipping the thing into a booming arcade? Of course, Ashley's dad just expects her to clean and manage the laundry, but she has \"half a business degree\" so she has ideas. Arcade Paradise has just dropped a demo for you to try so you can pick up trash and plunge toilets or whittle away at the work day playing on the arcade cabinets in the back room.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/arcade-paradise-makes-everything-a-game-including-your-boring-chores",
          "publishedOn": "2021-10-06T16:31:14.000Z",
          "wordCount": 972,
          "title": "Arcade Paradise makes everything a game, including your boring chores"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-to-reset-your-twitch-password-and-enable-2fa",
          "author": "Ollie Toms",
          "description": "Want to know how to reset your Twitch password and enable Two-Factor Authentication on your account? It's a very good time and a very good idea to do so, given the recent leak on Twitch which has reportedly exposed encrypted user passwords online. If you want to secure your account and make sure no one can access it except you, then follow the steps below to learn how to reset your password and enable Two-Factor Authentication to further secure your Twitch account.\nRead more",
          "link": "https://www.rockpapershotgun.com/how-to-reset-your-twitch-password-and-enable-2fa",
          "publishedOn": "2021-10-06T15:56:22.000Z",
          "wordCount": 1150,
          "title": "How to reset your Twitch password and enable 2FA"
        }
      ]
    },
    {
      "title": "Root.cz - články",
      "feedUrl": "https://www.root.cz/rss/clanky/",
      "siteUrl": "https://www.root.cz/clanky/",
      "articles": [
        {
          "id": "www.root.cz-text-15706",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "Už jsme se několikrát zmínili o jazycích navržených pro výuku programování. Do této kategorie spadá i Small Basic, jehož jméno se sice odkazuje na klasické BASICy, ovšem jedná se o značně rozdílný dialekt.",
          "link": "https://www.root.cz/clanky/small-basic-moderni-reinkarnace-basicu-urcena-pro-vyuku-programovani/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-11T22:00:15.000Z",
          "wordCount": 5959,
          "title": "Small Basic: moderní reinkarnace BASICu určená pro výuku programování",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/263/small-basic-1.jpg",
            "length": "34319",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15651",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Otevřená závodní hra SuperTuxKart chystá vydání nové verze se spoustou novinek. Emulátor přenosné herní konzole Nintentdo Switch Yuzu vylepšuje výkon a renderování. Dopravní strategie OpenTTD 12.0 má první beta verzi.",
          "link": "https://www.root.cz/clanky/supertuxkart-chysta-spoustu-novinek-yuzu-vylepsuje-vykon/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-11T22:00:10.000Z",
          "wordCount": 1162,
          "title": "SuperTuxKart chystá spoustu novinek, Yuzu vylepšuje výkon",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/509/supertuxkart-1-3-nintendo-switch-1.jpg",
            "length": "81451",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15704",
          "author": "redakce@root.cz (Root.cz: CESNET CERTS)",
          "description": "Ve tmě a chaosu vzniklém při výpadku Facebooku by se mohlo zdát, že se už nic horšího stát nemůže. Ale přesvědčíme se, že útočníci číhají na každém rohu a využíjí každičkou, byť nepatrnou, příležitost.",
          "link": "https://www.root.cz/clanky/postrehy-z-bezpecnosti-apache-nevi-ze-neni-tecka-jako-tecka/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-10T22:00:10.000Z",
          "wordCount": 1547,
          "title": "Postřehy z bezpečnosti: Apache neví, že není tečka jako tečka",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/356/beruska-1.jpg",
            "length": "35123",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15698",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Red Hat Enterprise Linux 8.5 beta je k dispozici k veřejnému testování. Vyšly opravné verze Debianu 10 a 11. Vydání Linux Mint 20.3 je v plánu na letošní Vánoce. TUXEDO InfinityBook Pro 14 je k mání s grafikou NVIDIA GeForce RTX 3050 Ti.",
          "link": "https://www.root.cz/clanky/vysel-rhel-8-5-beta-a-prvni-opravna-verze-debianu-11/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-10T22:00:05.000Z",
          "wordCount": 1146,
          "title": "Vyšel RHEL 8.5 beta a první opravná verze Debianu 11",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/558/rhel-8-1.jpg",
            "length": "14085",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15703",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Canonical představil Ubuntu Frame, Chrome 96 a lepší WebRTC i sdílení obrazovky na Waylandu, Wine 6.19, vzpomínka na první prototyp Leica, Paul Shillito o MOSFET, Debian 11.1 a 10.11, Vivaldi 4.3.",
          "link": "https://www.root.cz/clanky/nova-verze-apache-openoffice-microsoft-a-pravo-na-opravu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-09T22:00:00.000Z",
          "wordCount": 1544,
          "title": "Nová verze Apache OpenOffice, Microsoft a právo na opravu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/266/oprava-wi-fi-1.jpg",
            "length": "61635",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15697",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Evropský parlament hlasoval ve prospěch rezoluce, která zakazuje policii a dalším orgánům v členských státech využívat systémy umělé inteligence (AI) rozpoznávání tváří. Chce tak zabránit masivnímu sledování.",
          "link": "https://www.root.cz/clanky/evropsky-parlament-odmita-plosne-sledovani-za-pomoci-umele-inteligence/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-07T22:00:10.000Z",
          "wordCount": 1481,
          "title": "Evropský parlament odmítá plošné sledování za pomocí umělé inteligence",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/251/face-recognition-rozpoznavani-obliceje-sledovani-1.jpg",
            "length": "52219",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15552",
          "author": "redakce@root.cz (Root.cz: Karel Kulhavý)",
          "description": "V minulém díle byly ukázky fotografií, mobilní aplikace Neoshot, adaptér na dalekohled a optické vady. Dnes přesuneme snímky po Wi-Fi, nafotíme masky korekce vinětace a konvertujeme obrázky do PNG.",
          "link": "https://www.root.cz/clanky/fotografovani-dalekohledem-masky-korekce-vinetace/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-06T22:00:10.000Z",
          "wordCount": 2203,
          "title": "Fotografování dalekohledem: masky korekce vinětace",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/426/dalekohled-1.jpg",
            "length": "42720",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15696",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "Dnes budou popsány základní operace s vektory i s maticemi, tedy se základními datovými strukturami, s nimiž tento projekt nějakým způsobem manipuluje. Prozatím bude nejvíce prostoru věnováno spojování vektorů a matic.",
          "link": "https://www.root.cz/clanky/manipulace-s-vektory-a-maticemi-v-projektu-scilua/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-06T22:00:05.000Z",
          "wordCount": 5781,
          "title": "Manipulace s vektory a maticemi v projektu SciLua",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/679/lua-mesic-noc-mesto-1.jpg",
            "length": "69823",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15695",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Facebook provozuje jednu z nejrozsáhlejších sítí datacenter na světě. Přes všechnu snahu o robustnost se ani jemu nevyhýbají velké výpadky, které přijdou maximálně jednou za deset let. Už víme, co způsobilo ten pondělní.",
          "link": "https://www.root.cz/clanky/vypadek-facebooku-zpusobila-chyba-v-internim-nastroji-pri-rutinnim-zasahu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-06T07:37:57.000Z",
          "wordCount": 2271,
          "title": "Výpadek Facebooku způsobila chyba v interním nástroji při rutinním zásahu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/667/facebook-1.jpg",
            "length": "59405",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15672",
          "author": "redakce@root.cz (Root.cz: Pavel Herout)",
          "description": "V prvním článku se dozvíme, jaká logovací knihovna bude popisována, jak ji zprovoznit v systému PhpStorm, jaké má základní principy a jak jednoduše vyzkoušet její funkčnost. Ukážeme si také, že jsou možné různé kombinace loggerů.",
          "link": "https://www.root.cz/clanky/logovani-v-php-logovaci-system-integrovany-do-znamych-frameworku/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-05T22:00:10.000Z",
          "wordCount": 3325,
          "title": "Logování v PHP: logovací systém integrovaný do známých frameworků",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/516/php-1.jpg",
            "length": "42482",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "Root.cz - zprávičky",
      "feedUrl": "https://www.root.cz/rss/zpravicky/",
      "siteUrl": "https://www.root.cz/zpravicky/",
      "articles": [
        {
          "id": "www.root.cz-actuality-42897",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Oblíbený programátorský editor Geany přichází ve verzi 1.38 s několika novinkami. Tou největší je asi odstranění podpory GTK+ v2 (verze pro Windows mimochodem přechází na GTK3 a x86_64). Zrychluje načítání souborů, zejména při spouštění programu.",
          "link": "https://www.root.cz/zpravicky/geany-1-38-uz-bez-podpory-gtk2/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-12T13:37:16.000Z",
          "wordCount": 814,
          "title": "Geany 1.38 už bez podpory GTK2",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/262/geany-1-37-1-v-gnome-3-38-1.png",
            "length": "67933",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42896",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Intel Xeony generace Sapphire Rapids přinesou jednu horkou novinku: instrukční sadu AMX, tedy další nadstavbu x86 světa, cílící tentokrát na maticové výpočty. Již tato první generace bude podporovat všechny typy instrukcí AMX (bude jich na začátku 12) a co Intel životně potřebuje, je zajištění podpory AMX v Linuxu.",
          "link": "https://www.root.cz/zpravicky/intel-pracuje-na-upravach-kodu-x86-fpu-pripravuje-jej-pro-amx/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-12T12:27:42.000Z",
          "wordCount": 1516,
          "title": "Intel pracuje na úpravách kódu x86 FPU, připravuje jej pro AMX",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/640/intel-xeon-ice-lake-1.jpg",
            "length": "45315",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42895",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Společnost Cloudflare oznámila, že o čtvrtinu rozšířila svou síť datových center, takže nyní jsou její datová centra přítomna ve 250 městech ze 100 zemí světa. Během posledních dvou let zdvojnásobila celkovou síťovou kapacitu na 100 Tbps, díky čemuž je schopna čelit i těm nejmasivnějším DDoS útokům a poskytovat svým zákazníkům rychlejší a spolehlivější služby kdekoliv na světě.",
          "link": "https://www.root.cz/zpravicky/cloudflare-rozsiril-svou-sit-datovych-center-navysil-sitovou-kapacitu-na-100-tbps/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-12T10:48:30.000Z",
          "wordCount": 906,
          "title": "Cloudflare rozšířil svou síť datových center, navýšil síťovou kapacitu na 100 Tbps",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/92/cloudflare-1.jpg",
            "length": "36223",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42894",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Windows 11 jsou na světě a do jejich aplikačního obchodu nyní Microsoft přidal preview verzi Windows Subsystem for Linux (WSL). Končí tak nutnost tuto funkcionalitu aktivovat ručně v dostupných vlastnostech operačního systému, vše lze instalovat jednoduše z Microsoft Store.",
          "link": "https://www.root.cz/zpravicky/windows-subsystem-for-linux-ve-windows-11/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-12T07:21:20.000Z",
          "wordCount": 2449,
          "title": "Windows Subsystem for Linux ve Windows 11",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/9/windows-11-1.jpg",
            "length": "41918",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42893",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "připravili jsme pro vás vylepšení, po kterém jste mnozí z vás volali, a to možnost přispět na provoz serveru Root.cz převodem z účtu. Tato možnost se vám objeví, pokud nezvolíte opakovanou platbu.",
          "link": "https://www.root.cz/zpravicky/nova-moznost-jak-podporit-server-root-cz/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-12T07:14:42.000Z",
          "wordCount": 874,
          "title": "Nová možnost, jak podpořit server Root.cz",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/154/root-cz-palec-1.jpg",
            "length": "16943",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42892",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Vývojář linuxového blokového subsystému a jeden z hlavních vývojářů IO_uring Jens Axboe pokračuje s optimalizacemi linuxového jádra pro vysoký počet I/O operací za sekundu. Používá k tomu Intel Optane Gen2 (s PCIe 4) a nově AMD Ryzen 9 5950X.",
          "link": "https://www.root.cz/zpravicky/linux-dosahuje-temer-7-milionu-iops-na-jadro/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-11T16:32:24.000Z",
          "wordCount": 1190,
          "title": "Linux dosahuje téměř 7 miliónů IOPS na jádro",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/344/tux-linux-1.jpg",
            "length": "22348",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42891",
          "author": "redakce@root.cz (Root.cz: RTsoft)",
          "description": "Dne 20. října 2021 od 18 hod pořádá firma RTsoft workshop na téma Funkcionální programování v PHP. Akce proběhne v Plzni v restauraci u Salzmannů v salónku v 1. patře. Pivo a občerstvení je zajištěno a vstup na akci je zdarma.",
          "link": "https://www.root.cz/zpravicky/it-workshop-funkcionalni-programovani-v-php/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-11T14:55:24.000Z",
          "wordCount": 792,
          "title": "IT workshop: Funkcionální programování v PHP",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/0/php-kod-1.jpg",
            "length": "142165",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42890",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Národní úřad pro kybernetickou a informační bezpečnost vydal veřejnou vyhlášku [PDF], ve které na základě zákona o kybernetické bezpečnosti stanovuje, že provozovatelé informačních systémů, které jsou klíčové pro fungování státu a bezpečí jeho obyvatel, budou muset zabezpečit své e-mailové schránky. Konkrétně jde o orgány a osoby uvedené v § 3 písm. c) až f) zákona o kybernetické bezpečnosti.",
          "link": "https://www.root.cz/zpravicky/nukib-klicove-informacni-systemy-museji-zabezpecit-e-mail-pomoci-dnssec-tls-a-dane/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-11T12:57:56.000Z",
          "wordCount": 2562,
          "title": "NÚKIB: klíčové informační systémy musejí zabezpečit e-mail pomocí DNSSEC, TLS a DANE",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/339/nukib-1.jpg",
            "length": "11849",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42889",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "O strategii v reálném čase s pixelovou grafikou The Fertile Crescent (úrodný půlměsíc) jsme tu již psali. Hra byla a je stále dostupná zdarma na itch.io. Vývojáři se před více jak měsícem rozhodli hru rozšířit a prodávat. Nedávno se objevilo demo na stránkách Steamu.",
          "link": "https://www.root.cz/zpravicky/the-fertile-crescent-bude-na-steamu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-11T08:40:12.000Z",
          "wordCount": 804,
          "title": "The Fertile Crescent bude na Steamu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/219/the-fertile-crescend-1.png",
            "length": "264409",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-40445",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Proxmox je moderní virtualizační platforma, která v mnoha případech může nahradit VMware. Je open-source, zdarma a je postaven na otevřených technologiích jako KVM, LXC, CEPH a dalších. Pokud potřebujete provozovat virtualizaci, Proxmox je pro vás ideální stack a na našem workshopu se dozvíte, jak na něj.",
          "link": "https://www.root.cz/zpravicky/proxmox-moderni-virtualizacni-platforma-schopna-nahradit-vmware-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-11T07:44:47.000Z",
          "wordCount": 774,
          "title": "Proxmox: moderní virtualizační platforma schopná nahradit VMware (online školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/638/proxmox-1.jpg",
            "length": "32887",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42888",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "V TIOBE indexu popularity programovacích jazyků, který se používá již přes 20 let, poprvé zvítězil Python a nahradil tak dvojici C a Java, která obsadila druhé a třetí místo.",
          "link": "https://www.root.cz/zpravicky/python-je-prvni-v-tiobe/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-11T07:01:12.000Z",
          "wordCount": 1992,
          "title": "Python je první v TIOBE",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/116/fustrovany-programator-1.jpg",
            "length": "53261",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42887",
          "author": "redakce@root.cz (Root.cz: vkotyk)",
          "description": "Meetup pro všechny K8s nadšence je tady!",
          "link": "https://www.root.cz/zpravicky/meetup-kubernetes-nasazeni-cloud-native-aplikaci-praha/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-11T06:45:53.000Z",
          "wordCount": 886,
          "title": "MEETUP: Kubernetes - nasazení cloud native aplikací (Praha)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/122/kubernetes-1.jpg",
            "length": "21058",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42886",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Firefox od verze 92 zobrazuje v USA kontextové doporučení „Firefox Suggests“ podle toho, co napíšete do adresního řádku. Tato doporučení mohou obsahovat i sponzorovanou reklamu přes prověřené partnery. Preferovaným partnerem je adMarketplace.",
          "link": "https://www.root.cz/zpravicky/firefox-92-zobrazuje-v-usa-kontextovou-reklamu-v-adresnim-radku/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-08T12:16:59.000Z",
          "wordCount": 6646,
          "title": "Firefox 92 zobrazuje v USA kontextovou reklamu v adresním řádku",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/274/firefox-loga-1.jpg",
            "length": "28748",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-38548",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Nginx je dnes přibližně na třetině web serverů na internetu a toto číslo stále roste. Je výkonný, spolehlivý, má spoustu funkcí a dobře se spravuje. Pokud potřebujete dobrý web server pro svůj projekt, bude Nginx správnou volbou.",
          "link": "https://www.root.cz/zpravicky/nasadte-moderni-web-server-s-nginx-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-08T07:44:04.000Z",
          "wordCount": 818,
          "title": "Nasaďte moderní web server s Nginx (online školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/398/nginx-logo-1.jpg",
            "length": "17314",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42885",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Nedávno vydaná Windows 11 mají problém s procesory AMD. Ty jsou pomalejší až o 15 %. Jeden problém je v časování vyrovnávací paměti L3, která je až 3× pomalejší. Druhý problém je v UEFI CPPC2 (collaborative power and performance), který  nepoužívá nejrychlejší jádro.",
          "link": "https://www.root.cz/zpravicky/procesory-amd-jsou-ve-windows-11-pomalejsi-az-o-15/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-08T05:42:18.000Z",
          "wordCount": 1330,
          "title": "Procesory AMD jsou ve Windows 11 pomalejší až o 15 %",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/9/windows-11-1.jpg",
            "length": "41918",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42884",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Steam Deck je linuxová přenosná herní konzole, která by měla vyjít v prosinci tohoto roku. Pokud ale rezervujete Steam Deck nyní, dostanete ho až přibližně v polovině příštího roku.",
          "link": "https://www.root.cz/zpravicky/valve-ukazuje-jak-rozebrat-steam-deck/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-08T05:12:00.000Z",
          "wordCount": 1394,
          "title": "Valve ukazuje, jak rozebrat Steam Deck",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/92/steam-deck-1.jpg",
            "length": "39877",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42883",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "24. stretnutie komunity Cloud Native – Kubernetes – ONLINE",
          "link": "https://www.root.cz/zpravicky/24-stretnutie-komunity-cloud-native-kubernetes-online/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-07T18:42:10.000Z",
          "wordCount": 876,
          "title": "24. stretnutie komunity Cloud Native – Kubernetes - ONLINE",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/122/kubernetes-1.jpg",
            "length": "21058",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42882",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Pondělní velký výpadek Facebooku vyřadil na šest hodin z provozu nejen stejnojmennou sociální síť, ale také komunikační aplikace WhatsApp a Messenger. Ty jsou přitom pro své uživatele často naprosto zásadním komunikačním nástrojem, není tedy divu, že se uživatelé rozhlíželi po náhradě. Výpadek nakonec velmi pomohl hlavně aplikacím Telegram a Signal.",
          "link": "https://www.root.cz/zpravicky/vypadek-aplikaci-whatsapp-a-messenger-privedl-miliony-uzivatelu-telegramu-a-signalu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-07T10:53:43.000Z",
          "wordCount": 6829,
          "title": "Výpadek aplikací WhatsApp a Messenger přivedl miliony uživatelů k Telegramu a Signalu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/675/telegram-1.jpg",
            "length": "35220",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42880",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Letošní ročník konference CSNOG nakonec vůbec neproběhne. Organizátoři to oznámili na mailing listu akce. Původně se mělo setkání konat online příští týden, vzhledem k nízkému zájmu o online akce a zároveň zlepšení pandemické situace bylo na poslední chvíli rozhodnuto o přesunu pod křídla chystané konference IT 21. Bohužel jsme nepostřehli, že daný termín koliduje s konferencí KKTS Olomouc, kterážto cílí na velmi blízkou cílovou skupinu.",
          "link": "https://www.root.cz/zpravicky/csnog-letos-nebude-termin-koliduje-s-kkts-olomouc/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-07T07:41:00.000Z",
          "wordCount": 883,
          "title": "CSNOG letos nebude, termín koliduje s KKTS Olomouc",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/612/csnog-2019-1.jpg",
            "length": "30848",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42879",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Společnost YubiCo začala prodávat očekávaný USB token YubiKey Bio, který disponuje čtečkou otisků prstů. Ta dovoluje celý autentizační proces potvrdit pomocí druhého faktoru, kterým je právě uživatelův otisk. Všechny ostatní tokeny stejného výrobce používají pro fyzické potvrzení akce pouze kapacitní spínač.",
          "link": "https://www.root.cz/zpravicky/yubikey-bio-se-cteckou-otisku-prstu-je-k-dispozici-za-80-a-85-eur/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-07T06:49:00.000Z",
          "wordCount": 5146,
          "title": "YubiKey Bio se čtečkou otisků prstů je k dispozici za 80 a 85 eur",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/453/yubikey-bio-1.jpg",
            "length": "35863",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42881",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Vyšel Python 3.10. Hlavní novinkou je podpora strukturálního pattern matchingu pomocí klíčových slov match a case. Mezi další vylepšení patří například srozumitelnější chybové hlášky a union type operator.",
          "link": "https://www.root.cz/zpravicky/python-3-10-se-strukturalnim-pattern-matchingem/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-07T06:45:19.000Z",
          "wordCount": 2327,
          "title": "Python 3.10 se strukturálním pattern matchingem",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/87/python-1.jpg",
            "length": "13695",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42876",
          "author": "redakce@root.cz (Root.cz: Vilém Sládek)",
          "description": "Druhá letošní konference správce české národní domény – Internet a Technologie (21.2) – se uskuteční 10. listopadu v Praze a po roční pauze bude opět prezenční. Akce, kterou pořádá CZ.NIC od roku 2008, přinese i tentokrát především přehled novinek v klíčových projektech sdružení za uplynulý rok.",
          "link": "https://www.root.cz/zpravicky/sdruzeni-cz-nic-pripravuje-na-10-listopad-podzimni-konferenci-internet-a-technologie/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-07T06:00:00.000Z",
          "wordCount": 824,
          "title": "Sdružení CZ.NIC připravuje na 10. listopad podzimní konferenci Internet a Technologie",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/579/konference-internet-a-technologie-19-1.jpg",
            "length": "52279",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42878",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "S GNOME 42 se objeví možnost používání plně tmavého režimu prostředí. Tedy nikoli (například) tmavého vzhledu Adwaita, ale na úrovni samotného GNOME řešeného vzhledu. Alexander Mikhaylenko z projektu GNOME nyní na svém blogu shrnuje, jak to vypadá, co vše to obnáší a co musejí udělat tvůrci aplikací, aby nový způsob respektovali.",
          "link": "https://www.root.cz/zpravicky/gnome-42-a-systemovy-tmavy-rezim/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-06T15:09:56.000Z",
          "wordCount": 852,
          "title": "GNOME 42 a systémový tmavý režim",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/602/gnome-42-tmavy-vzhled-1.png",
            "length": "164695",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42877",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "V rámci projektu AlmaLinux, který je nástupcem kdysi zcela svobodného CentOS, vzniká AlmaLinux Foundation. Členem této nadace se může stát kdokoli z komunity a členství je 100% svobodné/otevřené/bezplatné. Tvůrci to mimo jiné vysvětlují takto: z CentOS se postupem doby vytratilo ono C.",
          "link": "https://www.root.cz/zpravicky/almalinux-vysvetluje-co-znamena-clenstvi-v-nadaci-teto-distribuce/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-06T14:30:06.000Z",
          "wordCount": 898,
          "title": "AlmaLinux vysvětluje, co znamená členství v nadaci této distribuce",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/290/almalinux-1.jpg",
            "length": "17609",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42875",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Pokud člověku nechybí GPU akcelerace, lze již Asahi Linux na strojích s ARM SoC Apple M1 používat. Projekt Asahi v posledních týdnech vyřešil většinu podstatných věcí, hlásá zářijový report na jejich webu.",
          "link": "https://www.root.cz/zpravicky/asahi-linux-na-apple-m1-jiz-pouzitelny-pro-zakladni-linuxovy-desktop/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-06T09:35:25.000Z",
          "wordCount": 1047,
          "title": "Asahi Linux na Apple M1 již použitelný pro základní linuxový desktop",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/237/debian-11-na-apple-m1-1.jpg",
            "length": "50846",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "abclinuxu - aktuální články",
      "feedUrl": "http://www.abclinuxu.cz/auto/abc.rss",
      "siteUrl": "http://www.abclinuxu.cz/clanky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/clanky/distribucni-novinky-38-40-2021",
          "author": "Redakce",
          "description": "Babí léto přineslo aktualizace řady více či méně specializovaných distribucí: přechod na Debian 11 v projektech Emmabuntüs DE4 nejen pro vzdělávání, Q4OS také s desktopovým prostředím Trinity, stabilní obrazy PureOS firmy Purism, dále Redo Rescue pro práci s diskovými oddíly, pokračující experimenty v EasyOS a mezi tím vším občerstvení MidnightBSD, UBports, IPFire, Tails, Feren OS či Debianu.",
          "link": "http://www.abclinuxu.cz/clanky/distribucni-novinky-38-40-2021",
          "publishedOn": "2021-10-11T22:01:00.000Z",
          "wordCount": 2030,
          "title": "Distribuční novinky 38-40/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-budovani-kyberneticky-odolne-spolecnosti",
          "author": "Redakce",
          "description": "Problémy s Wi-Fi mohou ohrozit fungování českých firem. Technologické trendy pro finanční ředitele: hyperautomatizace a inteligentní komponovaný byznys. Od pilotního projektu k produkčnímu nasazení umělé inteligence. S evidencí vandalismu pomůže umělá inteligence, řešení bude hledat Atos Hackathon. Budování kyberneticky odolné společnosti. Tiskárny během lockdownů a poté (1) Dodávky.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-budovani-kyberneticky-odolne-spolecnosti",
          "publishedOn": "2021-10-10T14:00:00.000Z",
          "wordCount": 1598,
          "title": "Týden na ITBiz: Budování kyberneticky odolné společnosti"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-40-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-40-2021",
          "publishedOn": "2021-10-08T22:01:00.000Z",
          "wordCount": 2992,
          "title": "Událo se v týdnu 40/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-supravodive-hydridy-ceru",
          "author": "Redakce",
          "description": "Světy s oceány a atmosférou z vodíku. Těžba ve vesmíru s pomocí bakterií. Panspermie v měřítku celé galaxie. Umělá inteligence pro předpověď počasí. Vylepšená uhlíková vlákna.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-supravodive-hydridy-ceru",
          "publishedOn": "2021-10-08T14:00:00.000Z",
          "wordCount": 1736,
          "title": "Týden na ScienceMag.cz: Supravodivé hydridy ceru"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/jaderne-noviny-prehled-za-zari-2021",
          "author": "Redakce",
          "description": "Přehled zářijových vydání Jaderných novin: stav vydání jádra, citáty týdne a seznam článků týkajících se jádra.",
          "link": "http://www.abclinuxu.cz/clanky/jaderne-noviny-prehled-za-zari-2021",
          "publishedOn": "2021-10-07T11:00:00.000Z",
          "wordCount": 2485,
          "title": "Jaderné noviny – přehled za září 2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-vztah-mezi-bezpecnosti-it-a-vyvojem-se-musi-zlepsit",
          "author": "Redakce",
          "description": "IBM Cloud a jeho umělá inteligence i ve vlastním datacentru. HPE představilo nové cloudové služby pro platformu HPE GreenLake. Pure nabízí Database-as-a-Service pro Kubernetes. Internet věcí nás obklopuje na každém kroku, účastníci Atos Hackathonu se naučí s ním zacházet. Vztah mezi bezpečností, IT a vývojem se musí zlepšit.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-vztah-mezi-bezpecnosti-it-a-vyvojem-se-musi-zlepsit",
          "publishedOn": "2021-10-03T22:01:00.000Z",
          "wordCount": 1525,
          "title": "Týden na ITBiz: Vztah mezi bezpečností, IT a vývojem se musí zlepšit"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-elektronika-s-elektrony-se-zapornou-hmotnosti",
          "author": "Redakce",
          "description": "Podivný model chování elektronů, kupodivu v nijak zvlášť exotických polovodičích. Zrcadlo lape vlhkost i ve vedru. Jak vůbec funguje zhroucení hvězdy? Kromě temné hmoty chybí ve vesmíru i ta běžná.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-elektronika-s-elektrony-se-zapornou-hmotnosti",
          "publishedOn": "2021-10-02T22:01:00.000Z",
          "wordCount": 1703,
          "title": "Týden na ScienceMag.cz: Elektronika s elektrony se zápornou hmotností"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/goodoffer24-dozivotni-licence-windows-10-pouze-za-12-super-slevy-az-91-2",
          "author": "Reklama",
          "description": "Stále máte šanci koupit na GoodOffer24.com doživotní licenci na Windows 10 pouze za 12  €. Buď si můžete vybrat z nabízených bundlů, nebo projet celý web GoodOffer24.com. Hlavně nezapomeňte zadat před dokončením nákupu slevový kód AX30.",
          "link": "http://www.abclinuxu.cz/clanky/goodoffer24-dozivotni-licence-windows-10-pouze-za-12-super-slevy-az-91-2",
          "publishedOn": "2021-10-02T10:00:00.000Z",
          "wordCount": 1417,
          "title": "GoodOffer24: Doživotní licence Windows 10 pouze za 12 €, super slevy až 91%!"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-39-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-39-2021",
          "publishedOn": "2021-10-01T22:01:00.000Z",
          "wordCount": 2162,
          "title": "Událo se v týdnu 39/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/distribucni-novinky-36-37-2021",
          "author": "Redakce",
          "description": "Na sklonku léta vyšel nový Whonix, podíváme se na systém pro klientské stanice ThinStation a aktualizovány byly také distribuce Finnix, Lakka, GhostBSD, Tails, Kali, Ubuntu LTS, Sailfish OS nebo Sparky Linux.",
          "link": "http://www.abclinuxu.cz/clanky/distribucni-novinky-36-37-2021",
          "publishedOn": "2021-09-29T00:00:00.000Z",
          "wordCount": 1909,
          "title": "Distribuční novinky 36-37/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/chcete-vedet-kolik-byste-mohli-vydelavat-u-konkurence-na-stejne-pozici",
          "author": "Reklama",
          "description": "Peníze jsou ožehavé téma, obzvlášť jedná-li se o výplaty v zaměstnání. Člověk přemýšlí, zda kolegové nevydělávají víc nebo jestli by si u jiného zaměstnavatele nepolepšil. Jak to ale zjistit? Teď naštěstí jednoduše, protože IT pracovní portál No Fluff Jobs u všech nabídek zveřejňuje nabízené platové ohodnocení.",
          "link": "http://www.abclinuxu.cz/clanky/chcete-vedet-kolik-byste-mohli-vydelavat-u-konkurence-na-stejne-pozici",
          "publishedOn": "2021-09-26T22:01:00.000Z",
          "wordCount": 1377,
          "title": "Chcete vědět kolik byste mohli vydělávat u konkurence na stejné pozici?"
        }
      ]
    },
    {
      "title": "abclinuxu - čerstvé zprávičky",
      "feedUrl": "http://www.abclinuxu.cz/auto/zpravicky.rss",
      "siteUrl": "http://www.abclinuxu.cz/zpravicky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/zpravicky/lutris-0.5.9",
          "author": "Ladislav Hagara",
          "description": "Byla vydána verze 0.5.9 klienta open source herní platformy pro Linux Lutris (Wikipedie). Přehled novinek v oznámení na Patreonu nebo na GitHubu. Zdůrazněna je podpora AMD FSR (FidelityFX Super Resolution) nebo integrace EGS (Epic Games Store).",
          "link": "http://www.abclinuxu.cz/zpravicky/lutris-0.5.9",
          "publishedOn": "2021-10-12T11:37:15.000Z",
          "wordCount": 905,
          "title": "Lutris 0.5.9"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/geany-1.38.0",
          "author": "Ladislav Hagara",
          "description": "Byla vydána nová stabilní verze 1.38.0 multiplatformního programátorského textového editoru a IDE Geany (Wikipedie). Přehled novinek v poznámkách k vydání. Odstraněna byla podpora GTK+2.",
          "link": "http://www.abclinuxu.cz/zpravicky/geany-1.38.0",
          "publishedOn": "2021-10-12T09:00:21.000Z",
          "wordCount": 1306,
          "title": "Geany 1.38.0"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/nukib-spravci-klicovych-systemu-musi-zabezpecit-sve-e-mailove-schranky",
          "author": "Ladislav Hagara",
          "description": "Správci a provozovatelé informačních systémů, které jsou klíčové pro fungování státu a bezpečí jeho obyvatel, budou muset zabezpečit své e-mailové schránky. Národní úřad pro kybernetickou a informační bezpečnost (NÚKIB) za tímto účelem vydal tzv. ochranné opatření podle zákona o kybernetické bezpečnosti. Zavedení postupů uvedených v tomto opatření je pro subjekty vyjmenované v opatření povinné.",
          "link": "http://www.abclinuxu.cz/zpravicky/nukib-spravci-klicovych-systemu-musi-zabezpecit-sve-e-mailove-schranky",
          "publishedOn": "2021-10-12T08:11:32.000Z",
          "wordCount": 2543,
          "title": "NÚKIB: Správci klíčových systémů musí zabezpečit své e-mailové schránky"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/potvrzeno-48.-mersennovo-prvocislo",
          "author": "Ladislav Hagara",
          "description": "Bylo potvrzeno, že dosud pravděpodobně 48. Mersennovo prvočíslo, M(57885161), je opravdu 48. Mersennovo prvočíslo. Na potvrzení dalších Mersennových prvočísel (49., 50. a 51.) se bude muset počkat. Musí se ověřit, že mezi nimi neexistují dosud neobjevena Mersennova prvočísla.",
          "link": "http://www.abclinuxu.cz/zpravicky/potvrzeno-48.-mersennovo-prvocislo",
          "publishedOn": "2021-10-11T20:49:08.000Z",
          "wordCount": 1438,
          "title": "Potvrzeno 48. Mersennovo prvočíslo"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/krita-5.0-beta-2",
          "author": "Ladislav Hagara",
          "description": "Byla vydána druhá beta verze nové major verze 5.0 svobodného programu pro skicování, malování a úpravu obrázků Krita (Wikipedie). Přehled novinek i s náhledy v poznámkách k vydání. Ke stažení je také balíček ve formátu appimage. Stačí jej stáhnout, nastavit právo ke spuštění a spustit.",
          "link": "http://www.abclinuxu.cz/zpravicky/krita-5.0-beta-2",
          "publishedOn": "2021-10-11T16:25:47.000Z",
          "wordCount": 925,
          "title": "Krita 5.0 Beta 2"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/python-poprve-nejoblibenejsim-programovacim-jazykem-dle-tiobe-indexu",
          "author": "Ladislav Hagara",
          "description": "Byl aktualizován TIOBE Index (Wikipedie). Poprvé ve více než dvacetileté historii tohoto žebříčku popularity programovacích jazyků je na prvním místě Python.",
          "link": "http://www.abclinuxu.cz/zpravicky/python-poprve-nejoblibenejsim-programovacim-jazykem-dle-tiobe-indexu",
          "publishedOn": "2021-10-11T10:03:57.000Z",
          "wordCount": 1712,
          "title": "Python poprvé nejoblíbenějším programovacím jazykem dle TIOBE Indexu"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/kodi-matrix-19.2",
          "author": "Ladislav Hagara",
          "description": "Byla vydána druhá opravná verze 19.2 v únoru vydané verze 19.0 multimediálního centra Kodi (dříve XBMC, Wikipedie) s kódovým označením Matrix.",
          "link": "http://www.abclinuxu.cz/zpravicky/kodi-matrix-19.2",
          "publishedOn": "2021-10-11T00:02:01.000Z",
          "wordCount": 916,
          "title": "Kodi \"Matrix\" 19.2"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/rozsudek-soudniho-dvora-ve-veci-c13-20-kupujici-pocitacoveho-programu-jej-muze-dekompilovat-za-ucelem-opravy-chyb",
          "author": "Ladislav Hagara",
          "description": "Rozsudek Soudního dvora ve věci C‑13/20: Kupující počítačového programu jej může dekompilovat za účelem opravy chyb. Mimochodem, v anglické verzi rozsudku se používá termín \"Decompilation\", v slovenské verzi \"Spätný preklad\" a v české verzi \"Rozklad\".",
          "link": "http://www.abclinuxu.cz/zpravicky/rozsudek-soudniho-dvora-ve-veci-c13-20-kupujici-pocitacoveho-programu-jej-muze-dekompilovat-za-ucelem-opravy-chyb",
          "publishedOn": "2021-10-10T23:02:07.000Z",
          "wordCount": 1838,
          "title": "Rozsudek Soudního dvora ve věci C‑13/20 – Kupující počítačového programu jej může dekompilovat za účelem opravy chyb"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/scummvm-2.5.0",
          "author": "Ladislav Hagara",
          "description": "Projekt ScummVM (Wikipedie) umožňující bezproblémový běh mnoha klasických adventur na zařízeních, pro které nebyly nikdy určeny, slaví 20 let. Při této příležitosti byla vydána nová verze 2.5.0. Přehled novinek v poznámkách k vydání.",
          "link": "http://www.abclinuxu.cz/zpravicky/scummvm-2.5.0",
          "publishedOn": "2021-10-10T01:49:26.000Z",
          "wordCount": 967,
          "title": "ScummVM 2.5.0"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/debian-11.1-a-10.11",
          "author": "Ladislav Hagara",
          "description": "Byl vydán Debian 11.1, tj. první opravná verze Debianu 11 s kódovým názvem Bullseye a Debian 10.11, tj. jedenáctá opravná verze Debianu 10 s kódovým názvem Buster. Řešeny jsou především bezpečnostní problémy, ale také několik vážných chyb. Instalační média Debianu 11 a Debianu 10 lze samozřejmě nadále k instalaci používat. Po instalaci stačí systém aktualizovat.",
          "link": "http://www.abclinuxu.cz/zpravicky/debian-11.1-a-10.11",
          "publishedOn": "2021-10-09T15:18:33.000Z",
          "wordCount": 2358,
          "title": "Debian 11.1 a 10.11"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Numpy-AVX-512-Landed",
          "author": null,
          "description": "Intel has contributed AVX-512 optimizations to upstream Numpy. For those using Numpy as this leading Python library for numerical computing, newer Intel CPUs with AVX-512 capabilities can enjoy major speed-ups in the range of 14~32x faster...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Numpy-AVX-512-Landed",
          "publishedOn": "2021-10-12T18:50:12.000Z",
          "wordCount": 807,
          "title": "Intel Contributes AVX-512 Optimizations To Numpy, Yields Massive Speedups"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GNOME-Platform-Design-EO2021",
          "author": null,
          "description": "GNOME developer Allan Day has provided an update on behalf of the GNOME design time around some of their recent platform design improvements and some of the changes they are talking about in the near future...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GNOME-Platform-Design-EO2021",
          "publishedOn": "2021-10-12T18:35:07.000Z",
          "wordCount": 827,
          "title": "GNOME's Platform Design Continues Evolving From Dark Mode To Toasts"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=7.4M-IOPS-Linux-Per-Core",
          "author": null,
          "description": "Linux block subsystem maintainer and lead IO_uring developer Jens Axboe had a goal of hitting 7M IOPS per-core performance this week. On Monday he managed to already hit 7.2M IOPS and today hit 7.4M IOPS with his latest work-in-progress kernel patches...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=7.4M-IOPS-Linux-Per-Core",
          "publishedOn": "2021-10-12T18:14:43.000Z",
          "wordCount": 791,
          "title": "7.4M IOPS Achieved Per-Core With Newest Linux Patches"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=POCL-1.8-Released",
          "author": null,
          "description": "PoCL is the open-source project implementing OpenCL for CPU-based execution as well as multi-device support by getting its Portable Computing Language implementation working atop NVIDIA GPUs via CUDA, AMD GPUs via HSA, and other back-ends by way of LLVM. PoCL 1.8 is out today as the newest feature release...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=POCL-1.8-Released",
          "publishedOn": "2021-10-12T17:31:31.000Z",
          "wordCount": 710,
          "title": "Portable Computing Language 1.8 Released For OpenCL On CPUs, Other Accelerators"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30597",
          "author": null,
          "description": "Earlier this month were benchmarks looking at how Intel Tiger Lake performance has improved from Ubuntu 21.04 to Ubuntu 21.10, but how does Canonical's latest Linux offering compete with other autumn 2021 distributions? In this article from the Dell XPS Core i7-1165G7 Tiger Lake notebook are benchmarks of Ubuntu 21.10 going up against Arch Linux, Clear Linux, Fedora Workstation 35, and openSUSE Tumbleweed for getting an idea how the performance compares with this latest-generation Intel EVO notebook.",
          "link": "https://www.phoronix.com/vr.php?view=30597",
          "publishedOn": "2021-10-12T12:26:39.000Z",
          "wordCount": 908,
          "title": "Intel Tiger Lake Performance Across Five Autumn 2021 Linux Distributions"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Glibc-2.35-Removes-Intel-MPX",
          "author": null,
          "description": "Intel Memory Protection Extensions (MPX) never really took off and the Linux support has been deprecated for a while with the code elsewhere in the stack already having been removed while with the upcoming Glibc 2.35 release that GNU C Library is also flushing away its support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Glibc-2.35-Removes-Intel-MPX",
          "publishedOn": "2021-10-12T10:02:14.000Z",
          "wordCount": 836,
          "title": "Glibc 2.35 Removes The Long-Deprecated Intel MPX Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-FPU-Cleaning-For-AMX",
          "author": null,
          "description": "It's been one year now that Intel has been posting Linux kernel patches to enable AMX support for upcoming Sapphire Rapids processors. Over the past year their Linux kernel patches for enabling Advanced Matrix Extensions has gone through 11 rounds of review but that journey isn't over yet...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-FPU-Cleaning-For-AMX",
          "publishedOn": "2021-10-12T09:45:22.000Z",
          "wordCount": 870,
          "title": "Linux x86 FPU Code Getting Reworked In Preparation For Intel AMX"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Lutris-0.5.9-Released",
          "author": null,
          "description": "Lutris 0.5.9 is now available for this open-source Linux game manager program that has now added initial support for the Epic Games Store among other new options and enhancements in this new version...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Lutris-0.5.9-Released",
          "publishedOn": "2021-10-11T19:43:29.000Z",
          "wordCount": 862,
          "title": "Lutris 0.5.9 Released With Support For The Epic Games Store, New Options"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Microsoft-Windows-11-WSL-Store",
          "author": null,
          "description": "Those running Microsoft's recently released Windows 11 will now be able to find the Windows Subsystem for Linux (WSL) available from within the Microsoft Store for easier setting up of this Linux-based environment...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Microsoft-Windows-11-WSL-Store",
          "publishedOn": "2021-10-11T19:21:26.000Z",
          "wordCount": 848,
          "title": "Microsoft Publishes WSL Preview Inside the Windows 11 Store"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-DG2-64k-Pages-Flat-CCS",
          "author": null,
          "description": "While Linux 5.15 brings very early bits around DG2/Alchemist graphics card support, further work is needed to bring it into usable shape for end-users. The latest new patch series to be posted came out today with more driver changes needed around local device memory handling for DG2...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-DG2-64k-Pages-Flat-CCS",
          "publishedOn": "2021-10-11T18:53:47.000Z",
          "wordCount": 916,
          "title": "Intel Posts Latest DG2/Alchemist Linux Patches In Requiring 64K Page Size Handling"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Walmart-L3AF-eBPF",
          "author": null,
          "description": "Retail shopping giant Walmart has found use out eBPF programs and today announced the open-source L3AF to help in the effort...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Walmart-L3AF-eBPF",
          "publishedOn": "2021-10-11T18:07:50.000Z",
          "wordCount": 786,
          "title": "Walmart Pushes Open-Source L3AF To Help Out eBPF Ecosystem"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30591",
          "author": null,
          "description": "With Ubuntu 21.10 due for release this week I've been running various Ubuntu Linux performance comparisons across a variety of hardware and overall this new release is looking to be in great shape. One of the tests I recently carried out for curiosity is seeing how the AMD Zen 2 performance has evolved now over the past two years on Linux going from Ubuntu 19.10 to Ubuntu 21.10.",
          "link": "https://www.phoronix.com/vr.php?view=30591",
          "publishedOn": "2021-10-11T13:12:58.000Z",
          "wordCount": 883,
          "title": "Ubuntu 19.10 To 21.10: AMD Zen 2 + Radeon Performance On Linux Over Two Years"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Approaching-7M-IOPS",
          "author": null,
          "description": "Linux block subsystem maintainer and IO_uring lead developer Jens Axboe continues making staggering optimizations to the kernel code to squeeze out the maximum performance potential out of his shiny new system...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Approaching-7M-IOPS",
          "publishedOn": "2021-10-11T13:04:33.000Z",
          "wordCount": 901,
          "title": "More Optimizations Has Linux Approaching 7M IOPS Per Core"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Krita-5.0-Beta-2",
          "author": null,
          "description": "Krita 5.0 Beta 2 is out today as the newest test release for this very powerful, open-source digital painting program...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Krita-5.0-Beta-2",
          "publishedOn": "2021-10-11T11:15:33.000Z",
          "wordCount": 734,
          "title": "Krita 5.0 Beta 2 Reworks Its GPU Accelerated Canvas"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Yellow-Carp-Audio-Driver",
          "author": null,
          "description": "It was just with Linux 5.15 last month that AMD added a new audio driver for Van Gogh APUs sporting an ACP 5.x audio co-processor (ACP) while now a new driver has been posted for Yellow Carp / Rembrandt with it introducing new ACP 6.x audio co-processor IP...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Yellow-Carp-Audio-Driver",
          "publishedOn": "2021-10-11T09:49:39.000Z",
          "wordCount": 805,
          "title": "AMD Publishes New Linux Audio Driver Code For  Yellow Carp / ACP6x Audio Co-Processor"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=EROFS-LZMA-Compression",
          "author": null,
          "description": "The EROFS read-only file-system is adding LZMA compression support using a new header/container format called MicroLZMA...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=EROFS-LZMA-Compression",
          "publishedOn": "2021-10-11T09:28:05.000Z",
          "wordCount": 701,
          "title": "EROFS File-System Adding LZMA Compression Support Via New MicroLZMA"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-rc5-Released",
          "author": null,
          "description": "Linus Torvalds just pushed out the Linux 5.15-rc5 kernel release with things looking smooth for this stage and hopefully leading to an on-time release in just a few weeks...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-rc5-Released",
          "publishedOn": "2021-10-11T00:29:57.000Z",
          "wordCount": 817,
          "title": "Linux 5.15-rc5 Released With This Cycle Running Smoothly"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Phoronix-Test-Suite-10.6",
          "author": null,
          "description": "Phoronix Test Suite 10.6.1 was released today with various improvements for our cross-platform, open-source, fully-automated benchmarking software...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Phoronix-Test-Suite-10.6",
          "publishedOn": "2021-10-10T23:19:01.000Z",
          "wordCount": 853,
          "title": "Phoronix Test Suite 10.6 Released With Various Improvements For Linux Benchmarking"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-Tegra-Linux-5.16-NVDEC",
          "author": null,
          "description": "The Tegra DRM driver changes were sent out on Friday of the new material destined for Linux 5.16. Notable this time around is NVIDIA's NVDEC driver being included...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-Tegra-Linux-5.16-NVDEC",
          "publishedOn": "2021-10-10T10:45:54.000Z",
          "wordCount": 845,
          "title": "NVIDIA Contributing Tegra NVDEC Support To Linux 5.16"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-rc5-x86",
          "author": null,
          "description": "Sent in this morning were an urgent set of x86 updates for the Linux 5.15-rc5 kernel due out later today...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-rc5-x86",
          "publishedOn": "2021-10-10T10:00:00.000Z",
          "wordCount": 1013,
          "title": "Linux 5.15-rc5 x86 Changes Aim To Fix \"Yet Another Hardware Trainwreck\""
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=LLVM-Daily-For-Fedora",
          "author": null,
          "description": "Red Hat's Platform Tools team is making it very easy to run the very bleeding edge, development version of the LLVM toolchain and Clang compiler on the current versions of Fedora...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=LLVM-Daily-For-Fedora",
          "publishedOn": "2021-10-10T09:53:28.000Z",
          "wordCount": 732,
          "title": "Red Hat Is Making It Easy To Run Bleeding-Edge LLVM/Clang On Fedora"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-CPU-Namespace",
          "author": null,
          "description": "IBM engineer Pratik Sampat published an early prototype of a CPU namespace interface for the Linux kernel. This CPU namespace was devised to address coherency issues with current means of viewing available CPU resources as well as addressing possible security issues stemming from understanding resource access/positioning on the system...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-CPU-Namespace",
          "publishedOn": "2021-10-09T22:56:52.000Z",
          "wordCount": 1130,
          "title": "IBM Proposing A CPU Namespace For The Linux Kernel"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Preps-Linux-Multi-Tile",
          "author": null,
          "description": "Intel has been preparing Xe HP bring-up for many months already including fundamental work around their discrete graphics/accelerator support for their Linux graphics driver stack going back quite a while. On the Xe HP front,  Friday afternoon brought an important patch series posted for the first time: initial work around multi-tile support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Preps-Linux-Multi-Tile",
          "publishedOn": "2021-10-09T14:25:16.000Z",
          "wordCount": 960,
          "title": "Intel Begins Preparing Linux Graphics Driver For Multi-Tile Hardware"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Debian-11.1-Released",
          "author": null,
          "description": "Debian 11 \"Bullseye\" debuted back in August as the latest major release for this popular community Linux distribution. Today it's been succeeded by Debian 11.1...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Debian-11.1-Released",
          "publishedOn": "2021-10-09T14:07:33.000Z",
          "wordCount": 782,
          "title": "Debian 11.1 Released With Initial Batch Of Fixes"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=FUTEX2-Bits-In-Locking-Core",
          "author": null,
          "description": "Barring any last minute reservations it appears the initial \"FUTEX2\" work that is of much interest to Linux gamers enjoying Steam Play / Proton will find that kernel functionality in Linux 5.16...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=FUTEX2-Bits-In-Locking-Core",
          "publishedOn": "2021-10-09T10:39:19.000Z",
          "wordCount": 868,
          "title": "It Appears FUTEX2 Will Land For Linux 5.16"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-Goes-To-GitLab-CI",
          "author": null,
          "description": "KDE developers remain very busy squashing bugs ahead of the release of Plasma 5.23 that is also known as the Plasma 25th Anniversary Edition...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-Goes-To-GitLab-CI",
          "publishedOn": "2021-10-09T10:13:11.000Z",
          "wordCount": 918,
          "title": "KDE Moves To GitLab-Based CI, Lands More Plasma Wayland Fixes"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMDGPU-More-For-Linux-5.16",
          "author": null,
          "description": "Building off the earlier DRM-Next staged code from last month that brought initial DisplayPort 2.0 support and other feature work, another feature pull request was submitted today of additional AMD Radeon \"AMDGPU\" kernel driver changes slated for Linux 5.16...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMDGPU-More-For-Linux-5.16",
          "publishedOn": "2021-10-08T20:50:32.000Z",
          "wordCount": 943,
          "title": "A Big Batch Of AMD Graphics Driver Updates Just Sent Out For Linux 5.16"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Wine-6.19-Released",
          "author": null,
          "description": "Wine 6.19 is out as the latest bi-weekly development release of Wine as the developers work towards Wine 7.0 stable in early 2022...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Wine-6.19-Released",
          "publishedOn": "2021-10-08T19:25:36.000Z",
          "wordCount": 735,
          "title": "Wine 6.19 Continues Work On HID Joystick, PE Conversion"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-RADV-NGGC-Def",
          "author": null,
          "description": "The Radeon Vulkan driver \"RADV\" within Mesa 21.3 is enabling NGG culling by default for Radeon RX 6000 series (RDNA2) GPUs and newer as another performance win...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-RADV-NGGC-Def",
          "publishedOn": "2021-10-08T17:42:57.000Z",
          "wordCount": 830,
          "title": "Mesa 21.3 Enables NGG Culling By Default For RDNA2 GPUs"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GCC-12-Auto-Vec-O2",
          "author": null,
          "description": "A month ago was talk of GCC developers enabling the vectorizer at the common \"-O2\" optimization level and now that change has landed into the GCC 12 development code-base...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GCC-12-Auto-Vec-O2",
          "publishedOn": "2021-10-08T14:06:20.000Z",
          "wordCount": 777,
          "title": "GCC 12 Enables Auto-Vectorization For -O2 Optimization Level"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Flatpak-1.12-Released",
          "author": null,
          "description": "Flatpak 1.12 was just released along with issuing Flatpak 1.10.4 to address a security vulnerability in the portal support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Flatpak-1.12-Released",
          "publishedOn": "2021-10-08T11:34:00.000Z",
          "wordCount": 863,
          "title": "Flatpak 1.12 Released - Better Sub-Sandbox Handling To Benefit Steam"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=drm-intel-gt-next-5.16",
          "author": null,
          "description": "A new batch of Intel kernel graphics driver code was mailed out today to DRM-Next for staging ahead of next month's Linux 5.16 kernel merge window. Lots of notable changes in this pull!..",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=drm-intel-gt-next-5.16",
          "publishedOn": "2021-10-08T10:53:59.000Z",
          "wordCount": 1040,
          "title": "Linux 5.16 To Add Intel Encrypted PXP, Alder Lake S Declared Stable & Ready"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/rss.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2527/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2527/",
          "publishedOn": "2021-10-11T04:00:00.000Z",
          "wordCount": 187,
          "title": "New Nobel Prizes"
        },
        {
          "id": "https://xkcd.com/2526/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2526/",
          "publishedOn": "2021-10-08T04:00:00.000Z",
          "wordCount": 187,
          "title": "TSP vs TBSP"
        },
        {
          "id": "https://xkcd.com/2525/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2525/",
          "publishedOn": "2021-10-06T04:00:00.000Z",
          "wordCount": 189,
          "title": "Air Travel Packing List"
        },
        {
          "id": "https://xkcd.com/2524/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2524/",
          "publishedOn": "2021-10-04T04:00:00.000Z",
          "wordCount": 185,
          "title": "Comet Visitor"
        }
      ]
    }
  ],
  "cliVersion": "1.11.2"
}