{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": [
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.2",
          "author": null,
          "description": "Fixed: unicode characters in URL caused download error\nFixed: project root npm install error\nAdded: unit test library\nChore: Dependency updates\nThank you: @CaptNo1",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.2",
          "publishedOn": "2021-09-26T18:45:39.000Z",
          "wordCount": 354,
          "title": "v1.11.2"
        },
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "author": null,
          "description": "Fixed: Unexpected nested element in author field crashes the parser\nThank you @ad-m",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "publishedOn": "2021-09-16T06:39:32.000Z",
          "wordCount": 344,
          "title": "v1.11.1"
        }
      ]
    },
    {
      "title": "Kotaku",
      "feedUrl": "https://kotaku.com/rss",
      "siteUrl": "https://kotaku.com",
      "articles": [
        {
          "id": "1847860302",
          "author": "Luke Plunkett",
          "description": "Dave Chappelle’s latest comedy special, The Closer, contains some very sad, very harmful anti-trans comments. Faced with widespread criticism over his company’s decision to bankroll and air the special, Netflix Co-CEO Ted Sarandos has decided to email the entire company twice, and in doing so simply make things worse.\n\nRead more...",
          "link": "https://kotaku.com/netflix-boss-doubles-down-on-dave-chappelles-transphobi-1847860302",
          "publishedOn": "2021-10-14T03:30:00.000Z",
          "wordCount": 1012,
          "title": "Netflix Boss Doubles Down On Dave Chappelle's Transphobia In Embarrassing Email"
        },
        {
          "id": "1847859725",
          "author": "Luke Plunkett",
          "description": "It’s only been a matter of days since Ubisoft announced a new Ghost Recon game, Frontline, but public reception to its reveal has seemingly been strong enough to have already had an effect on the game’s planned closed beta testing.\n\nRead more...",
          "link": "https://kotaku.com/ubisoft-postpones-closed-beta-for-ghost-recon-frontline-1847859725",
          "publishedOn": "2021-10-14T01:00:00.000Z",
          "wordCount": 641,
          "title": "Ubisoft Postpones Closed Beta For Ghost Recon Frontline, The Game Nobody Asked For"
        },
        {
          "id": "1847858884",
          "author": "Ari Notis",
          "description": "Billy Mitchell, a pro gamer best known for making the numbers on an arcade machine get really big, is going to court. As spotted by Axios’ Stephen Totilo, a U.S. appeals court gave the green light yesterday for Mitchell to proceed with a defamation suit against Twin Galaxies, the popular gaming leaderboard site.\n\nRead more...",
          "link": "https://kotaku.com/former-pac-man-champ-billy-mitchell-can-now-sue-world-r-1847858884",
          "publishedOn": "2021-10-13T23:00:00.000Z",
          "wordCount": 514,
          "title": "Former Pac-Man Champ Billy Mitchell Can Now Sue World Record Leaderboard Group"
        },
        {
          "id": "1847859016",
          "author": "Luke Plunkett",
          "description": "Jon Gruden, a hateful little man who this week resigned as Head Coach of the NFL’s Las Vegas Raiders after revelations he sent numerous racist, homophobic and misogynistic emails, will also have his face scrubbed from EA Sports’ Madden 22.\n\nRead more...",
          "link": "https://kotaku.com/jon-grudens-bigoted-ass-is-being-removed-from-madden-22-1847859016",
          "publishedOn": "2021-10-13T22:50:00.000Z",
          "wordCount": 504,
          "title": "Jon Gruden, Bigot, Is Being Removed From Madden 22"
        },
        {
          "id": "1847858862",
          "author": "Sisi Jiang",
          "description": "Not every Pokémon player is happy about the new gameplay details that are emerging for Brilliant Diamond and Shining Pearl, the Switch remakes of Nintendo DS’ Pokémon Diamond and Pearl. In fact, a significant portion of the playerbase is currently upset because Exp. Share (a feature in which experience points are…\nRead more...",
          "link": "https://kotaku.com/pokemon-fans-mixed-on-experience-share-feature-making-d-1847858862",
          "publishedOn": "2021-10-13T22:35:00.000Z",
          "wordCount": 721,
          "title": "Pokémon Fans Mixed On Experience Share Feature Making Diamond, Pearl Remakes Easier"
        },
        {
          "id": "1847858871",
          "author": "Luke Plunkett",
          "description": "A player by the name of BarryMode has, for the last eight years, held the world record for a run through Spelunky. Not anymore, though, after fans discovered that he’d cheated, with the evidence clearly visible in the video he’d recorded of the run.\n\nRead more...",
          "link": "https://kotaku.com/spelunky-world-record-holder-busted-as-a-cheater-1847858871",
          "publishedOn": "2021-10-13T22:30:00.000Z",
          "wordCount": 475,
          "title": "Spelunky World Record Holder Busted As A Cheater"
        },
        {
          "id": "1847858293",
          "author": "Ari Notis",
          "description": "Tomorrow, the beat-’em-up Aeon Must Die comes out for PC, Switch, Xbox, and PlayStation. A day ahead of its release, some of the game’s original developers—now at a different, newly formed studio—have published a statement requesting that the game’s publisher and developer “complete their legal responsibilities.” That…\nRead more...",
          "link": "https://kotaku.com/devs-of-stolen-game-aeon-must-die-demand-money-from-pub-1847858293",
          "publishedOn": "2021-10-13T21:20:00.000Z",
          "wordCount": 836,
          "title": "Devs Of 'Stolen' Game Aeon Must Die Demand Money From Publisher"
        },
        {
          "id": "1847857437",
          "author": "Ian Walker",
          "description": "Amidst numerous lawsuits claiming the company fostered an abuse-filled working environment, Activision Blizzard is getting serious about Call of Duty: Warzone cheaters with the introduction of its new, proprietary Ricochet Anti-Cheat system.\n\nRead more...",
          "link": "https://kotaku.com/activision-says-call-of-duty-warzone-vanguard-are-get-1847857437",
          "publishedOn": "2021-10-13T20:00:00.000Z",
          "wordCount": 662,
          "title": "Activision Says Call Of Duty: Warzone, Vanguard Are Getting New, Souped-Up Anti-Cheat"
        },
        {
          "id": "1847857258",
          "author": "Isaiah Colbert",
          "description": "For the past six days, Diablo II: Resurrected players in the United States, Asia, and the United Kingdom have experienced intermittent difficulties when attempting to log in to the game’s online servers. Now, some are taking to social media to demand refunds. \nRead more...",
          "link": "https://kotaku.com/diablo-ii-resurrected-plagued-by-login-issues-some-pl-1847857258",
          "publishedOn": "2021-10-13T19:45:00.000Z",
          "wordCount": 537,
          "title": "Diablo II: Resurrected Plagued By Login Issues, Some Players Demand Refunds"
        },
        {
          "id": "1847857345",
          "author": "Sisi Jiang",
          "description": "Hey, it’s me: the Kotaku staffer who explains why a random Genshin Impact character is trending on Twitter. Today, several notable Genshin Impact leakers stated that the geo element swordsman Albedo will be making an event appearance in the 2.3 update.\nRead more...",
          "link": "https://kotaku.com/genshin-leak-teases-massive-cliffhanger-resolution-with-1847857345",
          "publishedOn": "2021-10-13T19:30:00.000Z",
          "wordCount": 596,
          "title": "Genshin Leak Teases Massive Cliffhanger Resolution With Albedo"
        },
        {
          "id": "1847856709",
          "author": "Mike Fahey",
          "description": "Of course, the biggest, most noticeable difference between the original Nintendo Switch and the new OLED Switch is the display, but there are quite a few changes inside the console’s plastic housing as well. Our friends at iFixit cracked open one of the latest models, discovering redesigned circuit boards, modified…\nRead more...",
          "link": "https://kotaku.com/the-oled-switch-is-pretty-different-on-the-inside-1847856709",
          "publishedOn": "2021-10-13T19:00:00.000Z",
          "wordCount": 741,
          "title": "The OLED Switch Is Pretty Different On The Inside"
        },
        {
          "id": "1847856613",
          "author": "Renata Price",
          "description": "In a recent interview with PC Gamer, Final Fantasy XIV Director Naoki Yoshida spoke at length about the MMO’s influx of players, and his mixed feelings about World of Warcraft comparisons. At the heart of it all is Yoshida’s consistent refrain that video games are just that: video games. So don’t be weird about them.\n\nRead more...",
          "link": "https://kotaku.com/ffxiv-director-wants-you-to-be-normal-about-the-game-s-1847856613",
          "publishedOn": "2021-10-13T18:30:00.000Z",
          "wordCount": 629,
          "title": "FFXIV Director Wants You To Be Normal About The Game’s Success"
        },
        {
          "id": "1847855800",
          "author": "Sisi Jiang",
          "description": "Sometimes, I want the gritty fantasy storytelling of The Witcher 3: Wild Hunt without dealing with hundreds of hours of content or an open world map. Xuan Yuan Sword 7, the latest entry in an action roleplaying series that has been a cornerstone of Chinese gaming for almost 30 years, scratches that itch for me. But…\nRead more...",
          "link": "https://kotaku.com/new-chinese-action-rpg-is-like-the-witcher-but-more-fo-1847855800",
          "publishedOn": "2021-10-13T17:30:00.000Z",
          "wordCount": 1017,
          "title": "New Chinese Action-RPG Is Like The Witcher, But More Focused"
        },
        {
          "id": "1847855637",
          "author": "Ethan Gach",
          "description": "Last week EA hinted that it might be renaming its massively popular FIFA series. Now we know why. According to a new report by The New York Times, the International Federation of Association Football is asking the sports publishing giant to pay $1 billion for exclusive rights to the FIFA brand going forward.\n\nRead more...",
          "link": "https://kotaku.com/report-ea-in-a-messy-fight-over-fifa-license-money-1847855637",
          "publishedOn": "2021-10-13T17:00:00.000Z",
          "wordCount": 549,
          "title": "Report: EA In A Messy Fight Over FIFA License, Money"
        },
        {
          "id": "1847855277",
          "author": "Ari Notis",
          "description": "Arkane’s recent and well-regarded immersive sim isn’t the only death loop of the fall. Thanks to a rare autosave bug in Far Cry 6 that spawns players milliseconds before a death, some players have found themselves stuck in an unbreakable feedback loop, with no apparent way to break the cycle.\n\nRead more...",
          "link": "https://kotaku.com/far-cry-6s-autosave-bug-keeps-killing-players-repeatedl-1847855277",
          "publishedOn": "2021-10-13T16:30:00.000Z",
          "wordCount": 570,
          "title": "Far Cry 6's Autosave Bug Keeps Killing Players Repeatedly"
        },
        {
          "id": "1847855183",
          "author": "Renata Price",
          "description": "On Monday, publisher Raw Fury announced a new first-look deal with dJ2 Entertainment for adapting their publishing catalogue into film and television series. And in the same moment, we’ve just heard word of a live-action version of the classic action-adventure, System Shock.\n\nRead more...",
          "link": "https://kotaku.com/all-the-possible-video-game-tv-series-announced-in-the-1847855183",
          "publishedOn": "2021-10-13T16:10:00.000Z",
          "wordCount": 531,
          "title": "All The Possible Video Game TV Series Announced In The Last 48 Hours"
        },
        {
          "id": "1847854594",
          "author": "Mike Fahey",
          "description": "I recently had the opportunity to spend several hours exploring the new lands, jobs, and dungeons coming in Final Fantasy XIV’s Endwalker expansion when it launches November 23. I flew through the wretched ruins of Garlemald, strolled the serene streets of the scholarly city of Old Sharlayan, and marveled at the…\nRead more...",
          "link": "https://kotaku.com/ffxiv-s-biggest-expansion-yet-endwalker-will-take-you-1847854594",
          "publishedOn": "2021-10-13T15:40:00.000Z",
          "wordCount": 1406,
          "title": "FFXIV’s Biggest Expansion Yet, Endwalker, Will Take Your Breath Away"
        },
        {
          "id": "1847854612",
          "author": "Ethan Gach",
          "description": "Bungie has changed up how Destiny 2’s annual Festival of the Lost Halloween celebration works this year, as well as adding a new pulse rifle, and scaly dinosaur armor. But this Untitled Goose Game mask is all that matters.\nRead more...",
          "link": "https://kotaku.com/destiny-2-gets-slightly-unsettling-goose-game-mask-1847854612",
          "publishedOn": "2021-10-13T15:25:00.000Z",
          "wordCount": 597,
          "title": "Destiny 2 Gets Slightly Unsettling Goose Game Mask"
        },
        {
          "id": "1847852988",
          "author": "Brian Ashcraft",
          "description": "In Gangwon Province, South Korea, a hotel announced that it will be holding a real-life version of Squid Game later this month. \nAccording to The Korea Times, St. John’s Hotel in Gangneung will be hosting the event. The hotel’s official site is publicizing the real-life take on the popular Netflix series, where the…\nRead more...",
          "link": "https://kotaku.com/real-life-squid-game-taking-place-in-south-korea-minus-1847852988",
          "publishedOn": "2021-10-13T10:30:00.000Z",
          "wordCount": 545,
          "title": "Real-Life Squid Game Taking Place In South Korea, Minus The Killing"
        },
        {
          "id": "1847852810",
          "author": "Brian Ashcraft",
          "description": "Yoko Kanno, who scored the original anime, isn’t the only one returning to Cowboy Bebop. The entire, original voice cast is, too, who will be dubbing the live-action Netflix show’s Japanese language track. \nThat’s right, not just some of the original Japanese language cast, but the entire Japanese language cast. This…\nRead more...",
          "link": "https://kotaku.com/cowboy-bebops-original-japanese-voice-cast-returns-to-d-1847852810",
          "publishedOn": "2021-10-13T09:30:00.000Z",
          "wordCount": 427,
          "title": "Cowboy Bebop's Original Japanese Voice Cast Returns To Dub Netflix Series"
        },
        {
          "id": "1847844952",
          "author": "Brian Ashcraft",
          "description": "At host clubs, men serve customers their drinks, light their cigarettes, and make small talk with them. At a newly opened one in Osaka, they also dress as Nazis. That’s pretty fucked up. \nThe name of the bar is Unfair, and its tagline is, “Life is a bet.” Reddit spotted a truck driving through Osaka emblazoned with the…\nRead more...",
          "link": "https://kotaku.com/ungh-nazi-themed-host-bar-opens-in-osaka-1847844952",
          "publishedOn": "2021-10-13T02:30:00.000Z",
          "wordCount": 445,
          "title": "Ugh, Nazi-Themed Host Bar Opens In Osaka"
        },
        {
          "id": "1847851690",
          "author": "Luke Plunkett",
          "description": "You’d be forgiven for thinking that every move and every system you’ve ever enjoyed in a video game has been planned to the last meticulous detail. But hey, sometimes a thought just comes to you, and the results stand the test of time.\n\nRead more...",
          "link": "https://kotaku.com/old-video-shows-the-birth-of-mortal-kombats-get-over-he-1847851690",
          "publishedOn": "2021-10-13T01:00:00.000Z",
          "wordCount": 673,
          "title": "Old Video Shows The Birth Of Mortal Kombat's 'Get Over Here' Move"
        },
        {
          "id": "1847851074",
          "author": "Luke Plunkett",
          "description": "When the first Xbox console was revealed on stage back in 2001, it was announced that it was packing an Intel CPU. This had been a last-minute decision on Microsoft’s part; so last-minute, in fact, that according to the “Father of the Xbox” Seamus Blackley, AMD engineers were sitting in the front row of the console’s…\nRead more...",
          "link": "https://kotaku.com/report-xboxs-last-second-intel-switcheroo-left-amd-eng-1847851074",
          "publishedOn": "2021-10-12T23:00:00.000Z",
          "wordCount": 461,
          "title": "Report: Xbox's Last-Second Intel Switcheroo Left AMD Engineers Heartbroken"
        },
        {
          "id": "1847850809",
          "author": "Luke Plunkett",
          "description": "There are probably some readers out there young enough to not know what Games For Windows Live even was. But for those of us who lived through it, we remember: how pointless it was, how broken.\n\nRead more...",
          "link": "https://kotaku.com/13-years-too-late-fallout-3-removes-game-for-windows-l-1847850809",
          "publishedOn": "2021-10-12T22:30:00.000Z",
          "wordCount": 481,
          "title": "13 Years Too Late, Fallout 3 Removes Game For Windows Live"
        },
        {
          "id": "1847850470",
          "author": "Isaiah Colbert",
          "description": "Harley Quinn: The Animated Series is hands down my favorite piece of DC Comics media. The show’s sharp, raunchy writing, alongside its thoughtful characterizations of Harley and the rest of Batman’s rogue’s gallery, have injected new life into these once-familiar characters for me. It also doesn’t hurt that the…\nRead more...",
          "link": "https://kotaku.com/new-harley-quinn-clobbers-comic-industry-ableism-1847850470",
          "publishedOn": "2021-10-12T21:50:00.000Z",
          "wordCount": 1625,
          "title": "New Harley Quinn Clobbers Comic Industry Ableism"
        }
      ]
    },
    {
      "title": "Nintendo Life | Latest Updates",
      "feedUrl": "https://www.nintendolife.com/feeds/latest",
      "siteUrl": "https://www.nintendolife.com/feeds/latest",
      "articles": [
        {
          "id": "https://www.nintendolife.com/#article-122246",
          "author": null,
          "description": "Rally-X returns.\n\nThis week's arcade archives release from Hamster Corporation is the 1980 Namco \"maze chase\" classic, Rally-X. Here's some PR and screens:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/another-classic-namco-title-joins-hamsters-arcade-archives-this-week",
          "publishedOn": "2021-10-14T05:55:00.000Z",
          "wordCount": 699,
          "title": "Another Classic Namco Title Joins Hamster's Arcade Archives This Week"
        },
        {
          "id": "https://www.nintendolife.com/#article-122245",
          "author": null,
          "description": "Part of the 'Hobonichi Mother Project'.\nLast May, you might remember how the company Hobonichi Shinbun (owned by Mother series' creator Shigesato Itoi) launched the 'Hobonichi Mother Project'.\nIt included a Pollyanna tribute comic - featuring comics and illustrations handled by 35 manga artists and writers - including Toby Fox (Undertale). Now, in an update, Pollyanna 2 has been announced:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/a-new-mother-tribute-comic-has-been-revealed-pre-orders-open-in-japan-later-this-month",
          "publishedOn": "2021-10-14T05:15:00.000Z",
          "wordCount": 586,
          "title": "A New Mother Tribute Comic Has Been Revealed, Pre-Orders Open In Japan Later This Month"
        },
        {
          "id": "https://www.nintendolife.com/#article-122244",
          "author": null,
          "description": "The Switch Online release appears to be an original ROM.\nLast month, Nintendo announced Nintendo 64 games would be coming to its Switch Online service in the form of a paid upgrade referred to as the \"Expansion Pack\".\nThere have been all sorts of questions that have been raised so far, but one that keeps coming up is what version of Super Mario 64 will the service get? For Mario's 35th last year, Nintendo included the Shindou iteration of the game in the \"limited-time\" Super Mario 3D All-Stars collection featuring an updated resolution and textures.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/dont-worry-the-3d-all-stars-version-of-super-mario-64-will-still-likely-be-the-definitive-edition",
          "publishedOn": "2021-10-14T04:30:00.000Z",
          "wordCount": 1859,
          "title": "Don't Worry, The '3D All-Stars' Version Of Super Mario 64 Will Still Likely Be The Definitive Edition"
        },
        {
          "id": "https://www.nintendolife.com/#article-122242",
          "author": null,
          "description": "Sora is on the way!\nNext week marks the arrival of the final fighter in Super Smash Bros. Ultimate. If you've somehow missed the news, it's Sora from the Square Enix's long-running RPG series, Kingdom Hearts.\nAlongside the addition of this final DLC fighter for the game, will be a massive update - Version 13.0.0. It follows on from the 12.0.0 update back in June and will add a new level, Mii Fighter outfits, and more, in addition to Sora.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/smash-ultimate-version-13-0-0-arrives-next-week-save-your-replays-asap",
          "publishedOn": "2021-10-14T02:30:00.000Z",
          "wordCount": 1169,
          "title": "Smash Ultimate Version 13.0.0 Arrives Next Week, Save Your Replays ASAP"
        },
        {
          "id": "https://www.nintendolife.com/#article-122241",
          "author": null,
          "description": "TMs have also reverted to \"single use\".\nIf you're a player who likes to take a more hands-on approach when training your Pokémon, you might want to read on. The upcoming remakes Pokémon Brilliant Diamond and Shining Pearl won't allow players to deactivate Exp. Share. This detail was reportedly confirmed in the latest round of previews.\nIn case you need a refresher, Exp. Share gives Pokémon in battle experience, as well as the Pokémon in your party. While this is no different to how Exp. Share functioned in Pokémon Sword and Shield, it seems to have raised some concerns about the remakes.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/exp-share-supposedly-cant-be-turned-off-in-the-pokemon-diamond-and-pearl-remakes",
          "publishedOn": "2021-10-14T00:55:00.000Z",
          "wordCount": 6222,
          "title": "Exp. Share Supposedly Can't Be Turned Off In ﻿﻿The Pokémon Diamond And Pearl Remakes"
        },
        {
          "id": "https://www.nintendolife.com/#article-122131",
          "author": null,
          "description": "We've got a latte questions.\nBrewster is finally coming to Animal Crossing: New Horizons. Players have been asking about/demanding Brewster for ages, like that one clip from The Mandalorian where Werner Herzog says \"I would like to see the baby\", only instead of \"baby\", it's \"adult bird barista\".\nFor a significant number of ACNH players, though, this is their first Animal Crossing game — which means that they've never met Brewster. And that means that they've never been offered Pigeon Milk in their coffee.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/features/back-page-the-dark-secrets-of-brewsters-pigeon-milk",
          "publishedOn": "2021-10-13T21:30:00.000Z",
          "wordCount": 1911,
          "title": "Back Page: The Dark Secrets Of Brewster's 'Pigeon Milk'"
        },
        {
          "id": "https://www.nintendolife.com/#article-122238",
          "author": null,
          "description": "Tastier than a pumpkin spice latte.\nLast year, RPG spin-off Minecraft Dungeons held something called the \"Spooky Fall\", a Halloween-themed event with seasonal rewards, mobs, and trials. How could Mojang possibly top that?\nWith SPOOKIER Fall, obviously. The event is free for all players, but is time-limited, running from October 13th to November 2nd. By playing during the event, you can unlock a bunch of festive, limited-edition items, including:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/spookier-fall-event-brings-halloween-to-minecraft-dungeons",
          "publishedOn": "2021-10-13T20:30:00.000Z",
          "wordCount": 874,
          "title": "'Spookier Fall' Event Brings Halloween To Minecraft Dungeons"
        },
        {
          "id": "https://www.nintendolife.com/#article-122187",
          "author": null,
          "description": "Best build on the block.\n\nAt first glance, the Lego Super Mario 64 Question Mark Block looks pretty uneventful; simple, in fact, especially following on from the interactive gamification featured in the previous Lego Super Mario sets. It’s just a solid Lego block, right?\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/features/our-verdict-on-the-lego-super-mario-64-question-mark-block",
          "publishedOn": "2021-10-13T20:00:00.000Z",
          "wordCount": 2504,
          "title": "Feature: Our Verdict On The LEGO Super Mario 64 Question Mark Block"
        },
        {
          "id": "https://www.nintendolife.com/#article-122234",
          "author": null,
          "description": "Drawing on inspiration from the film.\nThough we'll need to wait until 2022 for Alfred Hitchcock - Vertigo on Switch, we're nonetheless still rather intrigued by what it'll deliver. Publisher Microids has now published the second of its Dev Diary video series on the game, this time focusing on the soundtrack.\nIt's an interesting insight into the process not just for this game, but indeed for medium-sized games of this scope. We get a glimpse of developer Pendulo Studio's internal studio, learn how the composer works alongside the script and design teams, and also see some recording sessions. It's not the big studio resources you'd see from a major 'triple-A' retail game, but is nonetheless an impressive setup to see in action.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/take-a-look-behind-the-scenes-of-the-alfred-hitchcock-vertigo-soundtrack",
          "publishedOn": "2021-10-13T19:00:00.000Z",
          "wordCount": 776,
          "title": "Take A Look Behind The Scenes Of The Alfred Hitchcock - Vertigo Soundtrack"
        },
        {
          "id": "https://www.nintendolife.com/#article-122208",
          "author": null,
          "description": "Game Trial now on for a limited time.\nSwitch owners who are subscribed to Nintendo Switch Online can now play The Jackbox Party Pack 6 in its entirety for free for a limited time.\nThis quirky, multiplayer party game collection is now available as the latest offering in Nintendo's Game Trials series. As we explained earlier today thanks to Europe's upcoming trial, these limited-time events let Switch Online subscribers download and play a full game while the offer is live, without any progression restrictions like your typical demo.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/switch-online-subscribers-can-now-play-the-jackbox-party-pack-6-for-free-north-america",
          "publishedOn": "2021-10-13T17:30:00.000Z",
          "wordCount": 1210,
          "title": "Switch Online Subscribers Can Now Play The Jackbox Party Pack 6 For Free (North America)"
        },
        {
          "id": "https://www.nintendolife.com/#article-121669",
          "author": null,
          "description": "Boneless brawler.\nIn the Party Game Hall of Fame, Gang Beasts is one of the OG big dogs, alongside Nidhogg, Jackbox, and Overcooked. Gang Beasts is a chaotic, wonky physics brawler that relies on the utter incomp-itude of its players to create mirth and merriment, and much like a massive chocolate cake or a puppy, it's always been a huge success whenever we've pulled it out at parties.\nIt's strange, then, that it's taken such a long time to come to the Nintendo Switch. It was out in Early Access for years, beginning in 2014, and chances are that if you've played it, it may well have been that EA version. Four years after its official release on PC, Xbox One, and PS4, it's finally reached the Switch — which we'd argue is the home of party games. (Of course we'd say that, though.)\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/reviews/switch-eshop/gang-beasts",
          "publishedOn": "2021-10-13T17:05:00.000Z",
          "wordCount": 2174,
          "title": "Review: Gang Beasts - An Adorably Janky Brawler Arrives Late To The Switch Party"
        },
        {
          "id": "https://www.nintendolife.com/#article-122226",
          "author": null,
          "description": "Batmobiles, new Arena and more...\nPsynoix has announced that Batman will be making a grand return to Rocket League just in time for Halloween, bringing new Event Challenges, cars, items and more along for the ride.\nDC's legendary hero will headline the game's annual Haunted Hallows Event which kicks off again tomorrow, 14th October. It'll introduce Batman Super-Villain themed items, a Batman-themed Rumble Limited Time Mode, the return of three iconic Batmobiles, a new Arena variant, and those Event Challenges we mentioned. Here are the details you need:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/batman-returns-to-rocket-league-for-halloweens-haunted-hallows-event",
          "publishedOn": "2021-10-13T17:00:00.000Z",
          "wordCount": 1011,
          "title": "Batman Returns To Rocket League For Halloween's Haunted Hallows Event"
        },
        {
          "id": "https://www.nintendolife.com/#article-122232",
          "author": null,
          "description": "24 pieces to open and build.\nChocolate? Or pieces of Sonic's body? The age-old dilemma returns yet again this Christmas as customers are forced to choose between the two things that make the holidays such a special time. Or we guess you could just get both.\nYes, thanks to an ongoing partnership between Sega and Numskull Designs, this new advent calendar starring none other than the famous blue blur himself will soon be hitting the stores. As you open each of the calendar's 24 doors, you'll be greeted with a new piece of a Sonic statue, leaving you with a genuinely lovely looking figurine to display when Christmas finally rolls around.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/build-your-own-sonic-statue-with-this-official-advent-calendar",
          "publishedOn": "2021-10-13T16:00:00.000Z",
          "wordCount": 1286,
          "title": "Build Your Own Sonic Statue With This Official Advent Calendar"
        },
        {
          "id": "https://www.nintendolife.com/#article-122196",
          "author": null,
          "description": "Down the path of a farming sim.\nThis year's selection of Pocket Monster-catching video games has been a point of contention for fans since they were announced back in early 2021. Pokémon Brilliant Diamond and Shining Pearl are from-the-ground-up remakes of the 2006 Nintendo DS games that fans have been begging for for years, so what’s the issue? Shouldn’t most people be fairly thrilled? Some fans are absolutely head over heels for the chibi art style and the game’s simplicity, although others wish these remakes took things to the next level, tried something different, and gave us a more of a graphical showcase.\nFor us, though, we fall somewhere in the middle. Last week Nintendo invited us to attend a special preview session to check out the games ahead of the November launch, and while we weren’t able to go hands-on just yet, we were able to gain a lot more insight into what to expect from these Gen 4 remakes. Since The Pokémon Company currently has its hands full with next year's Pokémon Legends: Arceus, Brilliant Diamond and Shining Pearl are being outsourced to a third-party company known as ILCA. They’ve worked with TPC in the past on the app Pokémon Home, but are now being given the chance to show their stuff in the Sinnoh Region.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/features/first-impressions-for-better-or-worse-pokemon-brilliant-diamond-and-shining-pearl-look-like-extremely-safe-remakes",
          "publishedOn": "2021-10-13T15:00:00.000Z",
          "wordCount": 7212,
          "title": "First Impressions: For Better Or Worse, Pokémon Brilliant Diamond & Shining Pearl Look Like Extremely Safe Remakes"
        },
        {
          "id": "https://www.nintendolife.com/#article-122228",
          "author": null,
          "description": "Featuring 8 hours of film.\nWales Interactive has shared a new cinematic trailer for its latest FMV game, Bloodshore. Oh, and we've also got a confirmed release date, too.\nThe game will be blasting onto Switch on 3rd November, with players watching a group of influencers, death row inmates and failing celebrities compete for a life-changing cash prize. As we pointed out when the game was first announced for Switch, it's all very Hunger Games meets Twitch...\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/battle-royale-fmv-bloodshore-gets-new-cinematic-trailer-and-switch-release-date",
          "publishedOn": "2021-10-13T14:00:00.000Z",
          "wordCount": 1220,
          "title": "Battle Royale FMV 'Bloodshore' Gets New Cinematic Trailer And Switch Release Date"
        },
        {
          "id": "https://www.nintendolife.com/#article-122222",
          "author": null,
          "description": "How do they do it?\nMetroid Dread hasn't even been out for a week yet, but some of the skills we're seeing even at this early stage are mightly impressive.\nIf you've been playing the game yourself, you'll know that one of things that becomes immediately apparent is just how smooth and slick Samus feels to control. Running and sliding around and pulling off quickly aimed missile shots is incredibly satisfying, and some of the game's late-stage mechanics are introducing some seriously cool possibilities.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/random-players-are-already-scarily-good-at-controlling-samus-in-metroid-dread",
          "publishedOn": "2021-10-13T13:30:00.000Z",
          "wordCount": 4287,
          "title": "Random: Players Are Already Scarily Good At Controlling Samus In Metroid Dread"
        },
        {
          "id": "https://www.nintendolife.com/#article-122221",
          "author": null,
          "description": "'Comfortably outperformed' the Switch Lite launch.\nLast week brought a major hardware release from Nintendo, with the Switch OLED model bringing us the first notable new version of the system since the Lite in 2019. Though plenty of current Switch owners won't have upgraded (with various good reasons, especially those that prefer docked play), there did also seem to be pretty solid buzz online with plenty sharing excitement about their shiny new device.\nGamesIndustry.biz has been looking at the UK market sales data, and the results suggest the new system has had a good start. No numbers are given (unsurprisingly), but the stats that are available suggest that it proved quite popular, perhaps doing a little better than some of us would have predicted weeks ago.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/uk-sales-data-shows-a-strong-start-for-switch-oled",
          "publishedOn": "2021-10-13T12:40:00.000Z",
          "wordCount": 4361,
          "title": "UK Sales Data Shows A Strong Start For Switch OLED"
        },
        {
          "id": "https://www.nintendolife.com/#article-122215",
          "author": null,
          "description": "Point and tap.\nThe point & click genre has been having a rather enjoyable renaissance in recent years with the Switch eShop being well supported. Another that's due soon is VirtuaVerse, developed by Theta Division, which launches on 28th October.\nAs you can see in the trailer above it's going for a hacker / cyperpunk vibe in the 'not-so-distant' future; you can see some of its Steam description below.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/virtuaverse-an-old-school-cyberpunk-point-and-click-arrives-on-switch-soon",
          "publishedOn": "2021-10-13T11:30:00.000Z",
          "wordCount": 756,
          "title": "VirtuaVerse, An \"Old School Cyberpunk Point & Click\", Arrives On Switch Soon"
        },
        {
          "id": "https://www.nintendolife.com/#article-122214",
          "author": null,
          "description": "Download, print and get carving!\nThe spookiest season of them all is just around the corner and if you're wanting a Nintendo-themed Halloween this year, you'll want to get a load of this.\nNintendo has shared a free, printable stencil for any pumpkin carving you find yourself doing over the next few weeks. Available to download on the Play Nintendo website, the stencil is shaped just like Jack from Animal Crossing – perfect for any fans of the series. Here's what it looks like:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/want-a-pumpkin-like-animal-crossings-jack-heres-a-free-stencil-to-use-this-halloween",
          "publishedOn": "2021-10-13T11:00:00.000Z",
          "wordCount": 961,
          "title": "Want A Pumpkin Like Animal Crossing's Jack? Here's A Free Stencil To Use This Halloween"
        },
        {
          "id": "https://www.nintendolife.com/#article-122130",
          "author": null,
          "description": "New mobs! Updates! Jokes, probably!\nMinecraft Live 2021 is almost upon us, and this Saturday 16th October we'll get to find out what's in store for everyone's favourite block-mining video game.\nOver the course of the week, Jens Bergensten and Agnes Larsson, the Lead Designer and Game Director of Minecraft respectively, have been teasing some of the content ahead of the stream on the weekend. Here's what we know so far — and we'll update this as we find out more, of course.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/guides/minecraft-live-2021-where-to-watch-what-to-expect-and-everything-you-need-to-know",
          "publishedOn": "2021-10-13T10:30:00.000Z",
          "wordCount": 1905,
          "title": "Guide: Minecraft Live 2021: Where To Watch, What To Expect, And Everything You Need To Know"
        },
        {
          "id": "https://www.nintendolife.com/#article-122211",
          "author": null,
          "description": "Metroid games run riot in the eShop charts.\nWith Metroid Dread already looking like a mighty success, both in terms of its critical reception and early sales data, it perhaps comes as no surprise that the game's popularity appears to have kickstarted a flurry of purchases across the entire series.\nMetroid fever has been running high ever since Dread's initial reveal, with plenty of fans revisiting their old favourite games in the run-up to Dread's launch, and series newcomers wanting to check it out for the very first time. Indeed, when we published an article discussing the best Metroid games to play before Dread, a high level of engagement suggested that fans were feeling ready to devour the entire series.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/metroid-dread-sparks-improved-sales-for-past-games-in-the-series",
          "publishedOn": "2021-10-13T10:00:00.000Z",
          "wordCount": 3948,
          "title": "Metroid Dread Sparks Improved Sales For Past Games In The Series"
        },
        {
          "id": "https://www.nintendolife.com/#article-122207",
          "author": null,
          "description": "Download it now!\nNintendo of Europe is giving Switch Online subscribers the chance to check out Prison Architect: Nintendo Switch Edition for free next week.\nThe BAFTA-winning simulation and management game is the latest title to be offered up as a Game Trial (events that let Switch Online subscribers download and play a full game for a limited time). Unlike a typical free demo, you can go ahead and beat the entire game without spending a single penny if you have the time to do so before the trial's up.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/prison-architect-will-soon-be-free-on-nintendo-switch-online-for-a-limited-time",
          "publishedOn": "2021-10-13T09:30:00.000Z",
          "wordCount": 1001,
          "title": "Prison Architect Will Soon Be Free On Nintendo Switch Online For A Limited Time"
        },
        {
          "id": "https://www.nintendolife.com/#article-122206",
          "author": null,
          "description": "It's been a long formation lap.\nThe last time we mentioned Circuit Superstars here on Nintendo Life was way back in 2019, when it was confirmed that the Original Fire Games-developed title would be published under the Square Enix Collective indie publishing label. Back then it was pegged for 2020, but things happen and the game has spent a good deal longer in development.\nThe pleasing news is that it's now over the line, out today on PC and Xbox (priced at $19.99USD with regional variations) and looking rather fun in the trailer - it has top-down racing and various options for multiplayer and competitive play, along with a good range of car types and tracks. The press release accompanying the launch states that it's 'coming soon' to Switch.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/circuit-superstars-is-out-now-on-pc-and-xbox-coming-soon-to-switch",
          "publishedOn": "2021-10-13T09:00:00.000Z",
          "wordCount": 1626,
          "title": "Circuit Superstars Is Out Now On PC And Xbox, 'Coming Soon' To Switch"
        },
        {
          "id": "https://www.nintendolife.com/#article-122202",
          "author": null,
          "description": "What's going on here?\nIt looks like another Mega Man game might be on the way to the Nintendo Switch. It's the action-platformer Android and iOS release Rockman X DiVE, developed by Capcom Taiwan, and released globally on smartphones in select regions earlier this year.\nAccording to Mega Man fansite, Rockman Corner, dataminers have discovered \"a series of strings\" in the game's client suggesting a Nintendo Switch port of the action-platformer Mega Man X DiVE might be on the way - with references to amiibo and 'NS':\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/mega-man-x-dive-datamine-uncovers-references-to-nintendo-switch",
          "publishedOn": "2021-10-13T05:05:00.000Z",
          "wordCount": 1755,
          "title": "Mega Man X DiVE Datamine Uncovers References To Nintendo Switch"
        },
        {
          "id": "https://www.nintendolife.com/#article-122201",
          "author": null,
          "description": "Ed Boon begins the 30th anniversary celebrations.\n\nThere are a lot of major video game anniversaries taking place right now, and next year will be no different. One of the bigger celebrations will be 30 years of the famous brutal, bloody and violent western fighting game, Mortal Kombat.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/video-get-over-here-and-watch-the-creation-of-scorpions-iconic-spear-move-for-mortal-kombat",
          "publishedOn": "2021-10-13T04:30:00.000Z",
          "wordCount": 2685,
          "title": "Video: Get Over Here And Watch The Creation Of Scorpion's Iconic Spear Move For Mortal Kombat"
        }
      ]
    },
    {
      "title": "Rock Paper Shotgun Latest Articles Feed",
      "feedUrl": "https://www.rockpapershotgun.com/feed",
      "siteUrl": "https://www.rockpapershotgun.com/feed",
      "articles": [
        {
          "id": "https://www.rockpapershotgun.com/former-state-of-decay-founder-launches-new-studio-possibility-space",
          "author": "Lauren Morton",
          "description": "Jeff Strain—co-founder of Guild Wars studio ArenaNet and founder of State Of Decay studio Undead Labs—is now founding a new game studio once again. Strain's studio Possibility Space has already drawn in a group of leadership talent worth paying attention to with history at the likes of Valve, Electronic Arts, Ubisoft, BioWare, Double Fine, and more. Possibility Space doesn't have a game to announce just yet, but is hiring up for their first \"joyful game\" that Strain describes as his \"dream for many years.\"\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/former-state-of-decay-founder-launches-new-studio-possibility-space",
          "publishedOn": "2021-10-13T23:14:28.000Z",
          "wordCount": 941,
          "title": "Former State Of Decay founder launches new studio Possibility Space"
        },
        {
          "id": "https://www.rockpapershotgun.com/amds-superbly-fast-ryzen-9-5900x-is-467-at-amazon",
          "author": "Will Judd",
          "description": "The AMD Ryzen 9 5900X is the company's latest high-end consumer processor, offering 12 cores and 24 threads using the incredibly fast Zen 3 design. AMD's latest generation CPUs have made incredible strides against Intel*, and are now often the best choice for both gaming and content creation - an unthinkable situation just five years ago when Ryzen first launched. \nThe 5900X has been the hardest Ryzen 5000 model to find at a good price, thanks to low supply and incredible demand, but today you can pick one up for a significant discount - £43 below RRP, or £466.92. That's a great price for a CPU of this quality, especially in the middle of a silicon shortage.\nRead more",
          "link": "https://www.rockpapershotgun.com/amds-superbly-fast-ryzen-9-5900x-is-467-at-amazon",
          "publishedOn": "2021-10-13T22:48:35.000Z",
          "wordCount": 1112,
          "title": "AMD's superbly fast Ryzen 9 5900X is £467 at Amazon"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-logitech-g-pro-x-is-our-best-premium-gaming-headset-and-its-just-63-today",
          "author": "Will Judd",
          "description": "The Logitech G Pro X is a fantastic headset - a comfy and well-built premium option that sounds fantastic. Today, it's not so premium any more, as Currys has discounted the headset from its original RRP of £110 to just £62.99 - a massive bargain. To get that price, you'll need to use code FNDDGAMING at the checkout. \nRead more",
          "link": "https://www.rockpapershotgun.com/the-logitech-g-pro-x-is-our-best-premium-gaming-headset-and-its-just-63-today",
          "publishedOn": "2021-10-13T22:24:54.000Z",
          "wordCount": 896,
          "title": "Our 'best premium gaming headset' pick, Logitech's G Pro X, is £63 today"
        },
        {
          "id": "https://www.rockpapershotgun.com/activision-introduce-call-of-dutys-upcoming-ricochet-anti-cheat-system",
          "author": "Lauren Morton",
          "description": "As it goes in online competitive games, Activision are in a constant battle against cheaters in Call Of Duty games. They've banned more than half a million cheaters in Call Of Duty: Warzone and yet there are always more. They've announced a new tool to help crack down: their Ricochet Anti-Cheat system. When it launches in Warzone and Call Of Duty: Vanguard it will include server-side tools along with a kernel-level driver to monitor applications interacting with the game.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/activision-introduce-call-of-dutys-upcoming-ricochet-anti-cheat-system",
          "publishedOn": "2021-10-13T22:04:08.000Z",
          "wordCount": 912,
          "title": "Activision introduce Call Of Duty's upcoming Ricochet Anti-Cheat system"
        },
        {
          "id": "https://www.rockpapershotgun.com/genshin-impact-version-22-is-here-with-a-new-island-and-your-free-5-star-aloy",
          "author": "Lauren Morton",
          "description": "As it does, action and explore 'em up Genshin Impact has rolled out another game update adding more characters, weapons, a domain, and a new island too. Genshin Impact version 2.2 has launched today, opening up more of that new Inazuma area and bringing its first crossover character Aloy of Horizon Zero Dawn fame to the game. You can hop into the new update titled \"Into the Perilous Labyrinth of Fog\" as of today to get started on all the new activities.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/genshin-impact-version-22-is-here-with-a-new-island-and-your-free-5-star-aloy",
          "publishedOn": "2021-10-13T20:11:21.000Z",
          "wordCount": 828,
          "title": "Genshin Impact version 2.2 is here with a new island and your free 5-star Aloy"
        },
        {
          "id": "https://www.rockpapershotgun.com/hyper-light-drifter-developers-next-game-solar-ash-delayed-to-december",
          "author": "Lauren Morton",
          "description": "Solar Ash is the next action-y adventure from the folks behind Hyper Light Drifter, which they've described as \"Super Mario Galaxy meets Shadow Of The Colossus, and sprinkle in a bit of Jet Set Radio.\" It was coming up quite soon, and ranked on RPS's list of best games in October to look forward to thanks to that colourful world and skater-like movement. The monthly list has taken a hit again, as there's a bit longer to wait for it now. Heart Machine have just announced a delay, though fortunately a short one.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/hyper-light-drifter-developers-next-game-solar-ash-delayed-to-december",
          "publishedOn": "2021-10-13T18:37:15.000Z",
          "wordCount": 846,
          "title": "Hyper Light Drifter developer's next game Solar Ash delayed to December"
        },
        {
          "id": "https://www.rockpapershotgun.com/battle-royale-naraka-bladepoint-is-adding-a-1v1-mode-tomorrow",
          "author": "Lauren Morton",
          "description": "After launching in August, mostly-melee battle royale 'em up Naraka: Bladepoint rated on RPS's list of best battle royale games for its parkour and grabble hook fights. If you're all about the battle and less about the royale, Naraka is queueing up a new game mode for you. The new 1v1 mode is inspired by and named after the movie Bloodsport, pitting sixteen players against one another in an elimination tourney until just one emerges as the winner. Naraka's new Bloodsport mode is kicking off tomorrow for you to go face to face and sword to sword with solo challengers.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/battle-royale-naraka-bladepoint-is-adding-a-1v1-mode-tomorrow",
          "publishedOn": "2021-10-13T16:33:16.000Z",
          "wordCount": 909,
          "title": "Battle royale Naraka: Bladepoint is adding a 1v1 mode tomorrow"
        },
        {
          "id": "https://www.rockpapershotgun.com/skyrims-anniversary-edition-might-break-many-mods-badly-modder-warns",
          "author": "Alice O'Connor",
          "description": "November may bring an unpleasant surprise for Skyrim Special Edition players, as one prolific modder has warned that changes in an update will mean a large part of Skyrim modding \"is going to be broken for an unknown length of time\". While it's common for updates to break mods, supposedly this will require a whole lot more work than usual to get back on track. And there's a risk some will never be fixed.\nRead more",
          "link": "https://www.rockpapershotgun.com/skyrims-anniversary-edition-might-break-many-mods-badly-modder-warns",
          "publishedOn": "2021-10-13T16:28:15.000Z",
          "wordCount": 1111,
          "title": "Skyrim's Anniversary Edition might break many mods badly, modder warns"
        },
        {
          "id": "https://www.rockpapershotgun.com/demon-slayer-kimetsu-no-yaiba-the-hinokami-chronicles-review",
          "author": "Hirun Cryer",
          "description": "I love a bit of anime fighting. The darting back and forth over a battlefield the size of a small town, the gravity-defying jumps through the air, the razing of entire cities with the flick of a thumb, the volume of someone’s yell equating to their increase in power - it’s all equal parts enrapturing melodrama and total lunacy. \r\n\n\nDemon Slayer -Kimetsu no Yaiba- The Hinokami Chronicles gets this. It gets that, when I am playing a 3D fighting game adapting a popular manga, I really want to inhabit the part of an incredibly wholesome anime boy, journeying across feudal Japan to cure my younger sister of her demonic sickness and smack around some otherworldly folk on the way there. Tanjiro Kamado is about as pure as anime protagonists come, and if there’s one lovable anime lad whose shoes I had to step into, it’d probably be his.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/demon-slayer-kimetsu-no-yaiba-the-hinokami-chronicles-review",
          "publishedOn": "2021-10-13T16:00:00.000Z",
          "wordCount": 1535,
          "title": "Demon Slayer: The Hinokami Chronicles review: simple, unfiltered fun"
        },
        {
          "id": "https://www.rockpapershotgun.com/amd-radeon-rx-6600-announced",
          "author": "James Archer",
          "description": "AMD have finally launched the Radeon RX 6600, the new entry-level model (which is still kind of a mid-ranger) in the RX 6000 graphics cards series. As expected, it’s a tuned-down relative of the Radeon RX 6600 XT, with fewer cores and lower clock speeds – but the same 8GB of GDDR6 VRAM. As far as I can see, it’s also sold out immediately, despite just releasing with models from Asus, MSI, Gigabyte, XFX, PowerColor and more. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/amd-radeon-rx-6600-announced",
          "publishedOn": "2021-10-13T15:20:56.000Z",
          "wordCount": 1033,
          "title": "Here’s the AMD Radeon RX 6600, and where to buy it"
        },
        {
          "id": "https://www.rockpapershotgun.com/finding-zen-in-rally-sim-wrc-10",
          "author": "Ed Thorn",
          "description": "Is it called rally driving or rally racing? Oh, it's neither of these options: it's called rallying. As you can see, I'm no expert on the act of flinging cars around dirt tracks. The only experience I've got is watching other people do so rather beautifully. In fact, that's what inspired me to give rally simulator WRC 10 a whirl and finally learn how to drive, drive.\nBut what I've really learned is terrible, actually. I've learned to totally ignore the bloke who sits next to you and dictates corners. I've learned not to pay attention at all. I'm in my own head, thinking back to that Greek yoghurt I just had. And I'm driving superbly. If I concentrate for even just a second my drive goes to shambles. So long as I find zen, I'm in control.\nRead more",
          "link": "https://www.rockpapershotgun.com/finding-zen-in-rally-sim-wrc-10",
          "publishedOn": "2021-10-13T15:09:38.000Z",
          "wordCount": 816,
          "title": "Finding zen in rally sim WRC 10"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-holly",
          "author": "Hayden Hefford",
          "description": "Want to know the best build for Holly in Back 4 Blood? Holly is our own Alice Bee’s favourite character, and with very good reason. Holly recovers 10 stamina each time she kills a Ridden, gets +10% damage resistance, and even gives the whole team an extra 25 stamina. However, with the right cards, you can push Holly even further, making her an absolute powerhouse and solidifying her position as one of the best characters in Back 4 Blood.\nThis guide will show you how to create the best build for Holly in Back 4 Blood, so you can dive into a session and start punching, stabbing, and smacking Ridden with your choice of melee weapon.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-holly",
          "publishedOn": "2021-10-13T14:52:46.000Z",
          "wordCount": 1279,
          "title": "The best Back 4 Blood Holly build"
        },
        {
          "id": "https://www.rockpapershotgun.com/now-a-union-has-objected-to-activision-blizzards-settlement-too",
          "author": "Imogen Beckhelling",
          "description": "The Communications Workers Of America union (CWA) have filed an objection to the proposed settlement between Activision Blizzard and the USA's Equal Employment Opportunity Commission (EEOC). As part of the settlement to this, one of several current legal battles, ActiBliz have agreed to create an $18 million fund for those who experienced harm from \"sexual harassment, pregnancy discrimination and/or related retaliation\". But the CWA says there are \"a number of serious deficiencies\" with the agreement, and are requesting a fairness hearing to address them. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/now-a-union-has-objected-to-activision-blizzards-settlement-too",
          "publishedOn": "2021-10-13T14:29:56.000Z",
          "wordCount": 964,
          "title": "Now a union has objected to Activision Blizzard's settlement too"
        },
        {
          "id": "https://www.rockpapershotgun.com/oh-my-god-fallout-3-has-removed-games-for-windows-live",
          "author": "Alice O'Connor",
          "description": "After 13 years, Fallout 3 has finally removed Microsoft's reviled (and broken) Games For Windows Live service from the Steam release. Hooray! FO3 is still busted because Bethesda haven't updated the game to run happily on modern Windows, but I'll take any opportunity to dance on GFWL's grave. However, avoid the update if you play FO3 with lots of mods.\nRead more",
          "link": "https://www.rockpapershotgun.com/oh-my-god-fallout-3-has-removed-games-for-windows-live",
          "publishedOn": "2021-10-13T12:17:24.000Z",
          "wordCount": 1149,
          "title": "Oh my god, Fallout 3 has removed Games For Windows Live"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-genshin-impact-arataki-itto-build",
          "author": "Rebecca Jones",
          "description": "When will Arataki Itto be coming to Genshin Impact? Arataki Itto is an upcoming playable character in Genshin Impact whose imminent arrival as a potential party member is causing a great deal of excitement, and let's not pretend we can't work out why.\n Read more",
          "link": "https://www.rockpapershotgun.com/best-genshin-impact-arataki-itto-build",
          "publishedOn": "2021-10-13T12:17:01.000Z",
          "wordCount": 1216,
          "title": "Genshin Impact Arataki Itto: everything we know so far"
        },
        {
          "id": "https://www.rockpapershotgun.com/final-fantasy-xiv-endwalker-preview",
          "author": "Ed Thorn",
          "description": "Shadow Hulk and I, we've been through a lot in MMORPG Final Fantasy XIV. I've learned to love his run, and together we've been largely been taken aback at just how nice everyone in the game is. Right now, though, we've hit a bit of a wall. We're deep in what I've dubbed the 'Filler City' quest line, as we attempt to reach the game's first expansion, Heavensward. Motivation has dipped considerably as of late.\nBut you should have seen me at the Endwalker hands-on preview, Final Fantasy XIV's upcoming fourth expansion. I played as a tall bunny boy, not Shadow Hulk. I was suddenly at the highest level cap, not the foothills of the early-mid game. I soared over new zones and wrestled through a new dungeon in a state of delirium. And now, writing this in the present, I desperately want to go back. Motivation? Renewed.\nRead more",
          "link": "https://www.rockpapershotgun.com/final-fantasy-xiv-endwalker-preview",
          "publishedOn": "2021-10-13T12:00:00.000Z",
          "wordCount": 1594,
          "title": "Final Fantasy XIV: Endwalker has re-motivated me to reach the finish line"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-split-screen",
          "author": "Hayden Hefford",
          "description": "Can you play Split Screen co-op in Back 4 Blood? Back 4 Blood harkens back to some classic co-op games like Left 4 Dead, so many of you are probably wondering whether you can hunker down on the sofa and play split screen like you did before.\nThis guide will let you know whether you can play split screen in Back 4 Blood, so that you can jump into a match, pick up a gun, and start slaying all kinds of zombies and Special Ridden with your friends.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-split-screen",
          "publishedOn": "2021-10-13T11:00:57.000Z",
          "wordCount": 896,
          "title": "Can you play Split Screen in Back 4 Blood?"
        },
        {
          "id": "https://www.rockpapershotgun.com/riot-are-removing-cross-team-text-chat-in-league-of-legends",
          "author": "Imogen Beckhelling",
          "description": "Riot Games have announced they're disabling /all chat in matchmade queues in League Of Legends to cut back on verbal abuse. Players in the same team will still be able to type to each other, and post-match chat will remain cross-team too, so you'll still be able to throw out your \"ggs\". But, as of League's next patch, you'll no longer be able to see messages from enemies mid-game. Good riddance, I say.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/riot-are-removing-cross-team-text-chat-in-league-of-legends",
          "publishedOn": "2021-10-13T10:51:58.000Z",
          "wordCount": 1077,
          "title": "Riot are removing cross-team text chat in League Of Legends"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-crossplay",
          "author": "Hayden Hefford",
          "description": "Want to know how to enable crossplay in Back 4 Blood? Nightmare mode can be pretty tough, so you’ll want to assemble the best team possible to survive the zombie onslaught in Back 4 Blood. Fortunately, you can stretch beyond your platform to find only the best zombie slayers by enabling crossplay.\nThis guide will explain how to enable and disable crossplay, so that you can pick and choose exactly who you play with in Back 4 Blood. Before hopping online, you should probably finish up the tutorial and figure out how to unlock all cleaners so that you can fit into any team.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-crossplay",
          "publishedOn": "2021-10-13T10:16:01.000Z",
          "wordCount": 876,
          "title": "How to enable Crossplay in Back 4 Blood"
        },
        {
          "id": "https://www.rockpapershotgun.com/genshin-impact-endgame",
          "author": "Rebecca Jones",
          "description": "What is there to do once you reach the endgame in New World? Currently at least, New World has a level cap of 60. There's a debate among MMO fans as to whether reaching the endgame should be the whole point of playing, or if it's really just a nice bonus after you've finished the satisfying business of levelling your character up from nothing. Whichever opinion you hold, most can agree that it's nice to have something to keep you coming back to the game that you've spent all those hours mastering.\nRead more",
          "link": "https://www.rockpapershotgun.com/genshin-impact-endgame",
          "publishedOn": "2021-10-13T09:30:10.000Z",
          "wordCount": 1305,
          "title": "New World endgame content: things to do when you hit Level 60"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-walker",
          "author": "Hayden Hefford",
          "description": "Want to know the best Walker build in Back 4 Blood? Walker is a sharpshooter who gains increased accuracy with precision kills. He also deals 10% more damage and increases everyone’s health by 10, making him an invaluable member of any team. However, to really unlock his full potential, you need to create the best build using all of the cards at your disposal. There are over 100 cards in Back 4 Blood, so check out our Supply Lines guide to see how you can start unlocking them all.\nIf you want to stop looking at stat numbers and start looking at mushy piles of zombies, then you’re in the right place. This guide will cover everything that you need to know to make the best Walker build in Back 4 Blood.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-walker",
          "publishedOn": "2021-10-13T09:09:13.000Z",
          "wordCount": 1268,
          "title": "The best Back 4 Blood Walker build"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-genshin-impact-eula-build",
          "author": "Amelia Zollner",
          "description": "Want to learn how to create the best Eula build in Genshin Impact? While Cryo Claymore user Eula isn’t the most loved by her fellow Mondstadt citizens thanks to her family’s tyrannical history, you’re sure to love her if you have her on your team. Eula has an all-around solid moveset, making her a stellar main DPS.\nThis guide will show you how to create the best Eula build in Genshin Impact. Below we'll cover everything you need to know about Eula, including wishing, weapons, artifacts, ascension materials, talents, abilities, and constellations.\nRead more",
          "link": "https://www.rockpapershotgun.com/best-genshin-impact-eula-build",
          "publishedOn": "2021-10-13T09:05:18.000Z",
          "wordCount": 1809,
          "title": "The best Genshin Impact Eula build"
        },
        {
          "id": "https://www.rockpapershotgun.com/call-of-duty-vanguards-writers-want-to-make-two-sequels",
          "author": "Graham Smith",
          "description": "Call Of Duty: Vanguard has started to dribble out a few more details about its story in new trailers, with a particular focus on its five new protagonists. If those characters are appealing, then good news: Vanguard's developers say that they hope to make a Vanguard 2 and 3 with the same cast.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/call-of-duty-vanguards-writers-want-to-make-two-sequels",
          "publishedOn": "2021-10-12T22:50:24.000Z",
          "wordCount": 835,
          "title": "Call Of Duty: Vanguard's writers want to make two sequels"
        },
        {
          "id": "https://www.rockpapershotgun.com/team-fortress-2-halloween-cosmetic-gets-restricted-prices-skyrocket",
          "author": "Graham Smith",
          "description": "Team Fortress 2 launched its Halloween update last week. Scream Fortress XIII adds new maps, cosmetics, taunts and contracts, amongst a lot else. One of the additions has caused a stir, however.\r\n\nThe \"Corpse Carrier\" is a cosmetic item wearable by Scouts that makes the speedster look as if he's carrying his own severed torso. It's a nightmare for snipers for obvious reasons, but it was initially easy to obtain and wearable all year round. Valve have since changed both of those things - and in turn, created a new, highly valuable item within TF2's trading marketplace.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/team-fortress-2-halloween-cosmetic-gets-restricted-prices-skyrocket",
          "publishedOn": "2021-10-12T22:13:19.000Z",
          "wordCount": 885,
          "title": "Team Fortress 2 Halloween cosmetic gets restricted, prices skyrocket"
        },
        {
          "id": "https://www.rockpapershotgun.com/long-standing-spelunky-speedrun-record-revealed-as-fraudulent",
          "author": "Graham Smith",
          "description": "In 2012, a player named BarryMode completed Spelunky Classic in two minutes and 30 seconds. Since then, this time has stood as the world record, and no other speedrunner has come close. Now, BarryMode's speedrun has been revealed as fraudulent. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/long-standing-spelunky-speedrun-record-revealed-as-fraudulent",
          "publishedOn": "2021-10-12T21:03:46.000Z",
          "wordCount": 761,
          "title": "Long-standing Spelunky speedrun record revealed as fraudulent"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-ironhide-loadout-warzone",
          "author": "Charlie Biggerstaff",
          "description": "Looking for the best Ironhide loadout in Warzone? The new lever-action Shotgun probably won’t crack the meta, but it’s aesthetically killer. If you’re looking for something different now that the Gallo has been nerfed, the Ironhide is an excellent choice. With two-shot kill potential, it’s a menace up close. To maximize its strengths though, you’re going to need the best build.\r\n\nTo make Shotguns work in Warzone, you need as much range and hipfire accuracy as you can get. Target those stats with this build:\r\n\nThis may be a shotgun, but we’re still starting off with an Agency Choke and Task Force Barrel. Both attachments grant a big boost to damage range, though the Task Force comes with a hipfire penalty. That's why the SOF Target Designator is also a must on Cold War shotguns, as it provides even more of the two stats we need; hipfire accuracy and damage range. You have some options in the stock slot, but we’ve gone with No Stock here. This is the biggest mobility boost you can get on your Ironhide, which is a big help when dueling SMG users. Unfortunately, it also comes with a hipfire penatly. These unfortunate tradeoffs have really held Cold War shotguns back in the meta. If you find the hipfire spread on this build isn't tight enough, a Wire Stock boosts sprint-to-fire speed without a penalty. Finally, we’ve gone with the 7 Round Tube magazine to help take on groups of foes without a reload.\r\n \nRead more",
          "link": "https://www.rockpapershotgun.com/best-ironhide-loadout-warzone",
          "publishedOn": "2021-10-12T20:21:24.000Z",
          "wordCount": 865,
          "title": "Best Ironhide loadout in Warzone Season 6"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-grav-loadout-warzone",
          "author": "Charlie Biggerstaff",
          "description": "Looking for the best Grav loadout in Warzone Season 6? Warzone’s newest rifle packs a potent combination of damage and fire rate that makes for excellent time-to-kill numbers. The Grav also boasts one of the highest bullet velocities in the Assault Rifle category and is one of the only Cold War weapons with a caliber-conversion magazine. Get a handle on its beastly recoil, and the Grav has the potential to be a top-tier rifle. Here are the best ways to build it out.\r\n\nThe Grav’s excellent damage and bullet velocity make it highly effective at long-range if you can control the recoil. That’s no easy task, but this build will help:\r\n\nAs usual, you’ll want to start with an Agency Suppressor and Task Force Barrel. I’m as tired of writing that sentence as you are of reading it, but until Vanguard drops this is the long-range combo for every Cold War weapon. The pile of damage range and recoil control stats these two attachments provide are too good to pass up. You’ll want a Field Agent Grip as well for maximum recoil control. The Grav has a lot of vertical climb, so even skilled players should welcome the help. You’ll want some zoom for range as well, and the Axial Arms 3x remains the go-to. If you prefer a Royal and Kross 4x or other optic though, you’ll have no issues making a substitution. \r\n \nRead more",
          "link": "https://www.rockpapershotgun.com/best-grav-loadout-warzone",
          "publishedOn": "2021-10-12T20:19:48.000Z",
          "wordCount": 1344,
          "title": "Best Grav loadout in Warzone Season 6"
        },
        {
          "id": "https://www.rockpapershotgun.com/paradox-staff-allege-culture-of-silence-in-new-reports-of-toxic-workplace",
          "author": "Graham Smith",
          "description": "New reports have been published containing further allegations of abuse at Swedish publisher Paradox Interactive. The reports, published initially by Swedish newspaper Svenska Dagbladet (paywalled), are based primarily on interviews with Paradox staff who wished to remain anonymous.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/paradox-staff-allege-culture-of-silence-in-new-reports-of-toxic-workplace",
          "publishedOn": "2021-10-12T20:09:56.000Z",
          "wordCount": 933,
          "title": "Paradox staff allege \"culture of silence\" in new reports of toxic workplace"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-a-27-in-fast-ips-1440p-144hz-monitor-for-238-thats-62-off-its-normal-price",
          "author": "Will Judd",
          "description": "Fast IPS monitors like the Dell S2721DGFA and LG 27GN800 have become some of my personal favourites to recommend, thanks to their combination of excellent motion handlin, wide viewing angles and gorgeous colours. We've seen these 27-in models discounted to around £300 a few times over the past few months, but today a couple of discount codes have dropped the price to historic lows. \nYou can choose from the Dell S2721DGFA, a 165Hz monitor with great ergonomics, for £270, or the LG 27GN800, a 144Hz monitor with a more basic stand, for £238. Either way, you'll get an incredible value gaming monitor that's perfect for a wide range of games and gaming PCs.\nRead more",
          "link": "https://www.rockpapershotgun.com/get-a-27-in-fast-ips-1440p-144hz-monitor-for-238-thats-62-off-its-normal-price",
          "publishedOn": "2021-10-12T18:38:16.000Z",
          "wordCount": 1011,
          "title": "Get a 27-in Fast IPS 1440p 144Hz monitor for £238 - that's £62 off its normal price"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-is-peak-00s-action-cheese-and-i-am-here-for-it",
          "author": "Alice Bell",
          "description": "Back 4 Blood is out today, that new game from the original developers of Left 4 Dead that is definitely not Left 4 Dead 3, but is still about turning waves of zombies into splashes on the post-apocalyptic pavement as a co-op team. And yes, I still love it. It is fun. It is so much fun. When is this formula not fun? The release version is, in several respects, an improvement on the beta. The characters do more bantering, it has cinematic cutscenes, and if you have to play with bots those bots do not spend all their time shooting into the drywall. Tick, tick, tick.\nBut in playing the full game in context, with stuff like opening cinematics and tutorialising videos all embedded in it, something else has become clear: this game is peak early-00s cheese. Not just because many of the enemies have the same texture as a fully loaded pizza.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-is-peak-00s-action-cheese-and-i-am-here-for-it",
          "publishedOn": "2021-10-12T18:35:37.000Z",
          "wordCount": 1342,
          "title": "Back 4 Blood is peak 00s action cheese and I am here for it"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-a-12tb-wd-elements-external-hard-drive-for-19999-50-off",
          "author": "Will Judd",
          "description": "When it comes to giant external hard drives, WD sells more drives than anyone - and they might see a fair few more sales today. Their 12TB Elements external hard drive has been sharply discounted over at Newegg, with the code EMC2AAZAA27 knocking off $50 off the usual price of $249.99.   \nRead more",
          "link": "https://www.rockpapershotgun.com/get-a-12tb-wd-elements-external-hard-drive-for-19999-50-off",
          "publishedOn": "2021-10-12T18:19:22.000Z",
          "wordCount": 810,
          "title": "Get a 12TB WD Elements external hard drive for $199.99 ($50 off)"
        },
        {
          "id": "https://www.rockpapershotgun.com/monster-hunter-rise-pc-demo-looks-glorious",
          "author": "Katharine Castle",
          "description": "Despite having sunk several hours into Monster Hunter Rise on my Nintendo Switch this year, I cannot tell you how excited I am to play the upcoming PC version. While my relationship with the previous game in the series, Monster Hunter: World, has been somewhat tainted by excessive hours of benchmarking, the Monster Hunter series has always been a sight to behold on PC, and Rise looks set to be no different - especially now I've had a chance to play the upcoming PC demo ahead of its release on Steam tomorrow, October 13th. \nRead more",
          "link": "https://www.rockpapershotgun.com/monster-hunter-rise-pc-demo-looks-glorious",
          "publishedOn": "2021-10-12T16:10:46.000Z",
          "wordCount": 1751,
          "title": "Monster Hunter Rise looks glorious in its new PC demo"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-pc-performance-the-best-settings-to-change",
          "author": "James Archer",
          "description": "Most of my Back 4 Blood playtime has been spent getting brutalised by an endless queue of Special Ridden, like an zombified take on that bit in Airplane!. Even so, it’s nice to see Turtle Rock Studios’ latest co-op shooter goes a lot easier on PC hardware than it does on me. It runs smoothly on older low-end hardware, and scales well enough on luxury kit that with one of the best graphics cards you can easily secure 144fps at 4K. Back 4 Blood is also one of few games to support both Nvidia DLSS and AMD FidelityFX Super Resolution (FSR), so there’s ample opportunity to boost performance via upscaling.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-pc-performance-the-best-settings-to-change",
          "publishedOn": "2021-10-12T16:02:18.000Z",
          "wordCount": 1949,
          "title": "Back 4 Blood PC performance: the best settings to change"
        },
        {
          "id": "https://www.rockpapershotgun.com/hearthstone-adds-roguelikey-rpg-mode-mercenaries-today",
          "author": "Imogen Beckhelling",
          "description": "If you're a little bored of Hearthstone's usual card shenanigans, Blizzard are releasing a new game mode that turns the CCG into a roguelike-ish RPG. Named Mercenaries, players will be able to gather Hearthstone characters then send them off into combat to collect bounties. Like Battlegrounds, you won't use your collection of cards for this, you'll have to gather a party as you venture on. It comes out later today, and will be free-to-play.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/hearthstone-adds-roguelikey-rpg-mode-mercenaries-today",
          "publishedOn": "2021-10-12T15:55:46.000Z",
          "wordCount": 910,
          "title": "Hearthstone adds roguelikey RPG mode Mercenaries today"
        },
        {
          "id": "https://www.rockpapershotgun.com/destiny-2-celebrates-halloween-with-dinosaur-costumes-today",
          "author": "Alice O'Connor",
          "description": "Today is apparently the day for live service games to start Halloween events, with Destiny 2 throwing its wizard hat into the ritual ring too. Festival Of The Lost returns for another year at reset time today, with some welcome new elements. For one, the tired Haunted Forest event is replaced by Haunted Lost Sectors. For another, this year's seasonal outfit is DINOSAUR COSTUMES. Rawr!\nRead more",
          "link": "https://www.rockpapershotgun.com/destiny-2-celebrates-halloween-with-dinosaur-costumes-today",
          "publishedOn": "2021-10-12T15:38:42.000Z",
          "wordCount": 1028,
          "title": "Destiny 2 celebrates Halloween with dinosaur costumes today"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-evangelo",
          "author": "Hayden Hefford",
          "description": "Want to know the best build for Evangelo in Back 4 Blood? Whilst the best cards could fit into any deck, you should always aim to specialise when creating a specific build in Back 4 Blood. Creating the best build for your character is essential if you want to survive on Nightmare difficulty, but it can be tricky to weed through every card to find the perfect match.\nIf you've looked through the characters and decided that you like Evangelo, then you're in luck. This guide covers the best melee build for Evangelo in Back 4 Blood, so that you can stop scratching your head looking at cards and start slashing (which is sort of his speciality). Evangelo might not be one of the best characters at first, but you can transform him into a powerhouse with certain cards.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-evangelo",
          "publishedOn": "2021-10-12T15:10:18.000Z",
          "wordCount": 1217,
          "title": "The best Back 4 Blood Evangelo build"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-best-weapons",
          "author": "Hayden Hefford",
          "description": "Want to know the best weapons in Back 4 Blood? Once you’ve figured out the best characters for your playstyle, you’ll need to think about the best weapons for your build. There are over 30 weapons to choose from in Back 4 Blood, so you’re spoilt for choice in your fight against the Ridden.\nThe weapon that you choose will mostly come down to your playstyle. If you want to run and gun, an SMG will be best, whilst a sniper rifle will suit those who want to pick off their targets from a distance. This guide will show you the best weapons in Back 4 Blood in every category.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-best-weapons",
          "publishedOn": "2021-10-12T15:05:57.000Z",
          "wordCount": 1951,
          "title": "The best weapons and attachments in Back 4 Blood"
        },
        {
          "id": "https://www.rockpapershotgun.com/pokemon-like-rpg-monster-crown-has-left-early-access",
          "author": "Imogen Beckhelling",
          "description": "We have a bunch of Pokémon-like monster catching games on PC now, but if you're tired of Temtem or Coromon, you could give Monster Crown a go. It's an RPG with turn-based combat that launched in full today after a year of early access. It sounds a little darker than other Pokélikes though, because instead of taming or catching your mons in magical contraptions, you make pacts with them. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/pokemon-like-rpg-monster-crown-has-left-early-access",
          "publishedOn": "2021-10-12T15:00:30.000Z",
          "wordCount": 911,
          "title": "Pokémon-like RPG Monster Crown has left early access"
        },
        {
          "id": "https://www.rockpapershotgun.com/guardians-of-the-galaxy-launch-trailer-launches-far-ahead-of-launch",
          "author": "Alice O'Connor",
          "description": "While Marvel's Guardians Of The Galaxy doesn't launch for another fortnight, the superhero game's launch trailer arrived today. That's a long run-up, that. If I'm running up for a launch for two weeks straight, I'm either leaping directly into the sun or falling asleep half-way. Presumably Square Enix are hoping for the former, given the ehhhh reaction to their Avengers game. Here, have a watch below.\nRead more",
          "link": "https://www.rockpapershotgun.com/guardians-of-the-galaxy-launch-trailer-launches-far-ahead-of-launch",
          "publishedOn": "2021-10-12T13:56:00.000Z",
          "wordCount": 914,
          "title": "Guardians Of The Galaxy launch trailer launches far ahead of launch"
        },
        {
          "id": "https://www.rockpapershotgun.com/far-cry-6-leaders",
          "author": "Ollie Toms",
          "description": "Where do you find more Far Cry 6 Leaders? It's a common question among many players who have discovered the delights of the Bandido Operations minigame, and want to maximise their chances of victory by sending the right people to lead their Guerrilla expeditions. There are eight Leaders to be unlocked in Far Cry 6, each of whom brings different skills to your growing Libertad army. Learn where to find and how to unlock each of the Far Cry 6 Leaders below.\nRead more",
          "link": "https://www.rockpapershotgun.com/far-cry-6-leaders",
          "publishedOn": "2021-10-12T13:34:20.000Z",
          "wordCount": 1634,
          "title": "How to unlock all the Far Cry 6 Leaders"
        },
        {
          "id": "https://www.rockpapershotgun.com/rainbow-six-siege-halloween-event-adds-spooky-hide-and-seek-today",
          "author": "Imogen Beckhelling",
          "description": "According to video games, Halloween officially starts today. Look, I don't make the rules! Tonight marks the start of Halloween events in Overwatch, Apex Legends, and Rainbow Six Siege. Ubisoft's tactical first-person shooter is bringing back Doktor's Curse, its 5v5 hide-and-seek mode where a team of monsters have to survive in a spookily decked-out Theme Park while exterminators hunt them down. This year, new operators are joining the fray too.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/rainbow-six-siege-halloween-event-adds-spooky-hide-and-seek-today",
          "publishedOn": "2021-10-12T12:26:42.000Z",
          "wordCount": 872,
          "title": "Rainbow Six Siege Halloween event adds spooky hide-and-seek today"
        },
        {
          "id": "https://www.rockpapershotgun.com/us-agencies-clash-over-two-activision-blizzard-legal-cases",
          "author": "Imogen Beckhelling",
          "description": "Last week, California's Department of Fair Employment and Housing (DFEH) filed an objection to an $18 million proposed settlement between Activision Blizzard and the USA's Equal Employment Opportunity Commission (EEOC), claiming it could harm their own lawsuit with the Call Of Duty and World Of Warcraft publishers. This objection might have an adverse affect on their legal battle however, because it revealed that two lawyers working on the DFEH suit had previously worked for the EEOC, specifically investigating Activision Blizzard. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/us-agencies-clash-over-two-activision-blizzard-legal-cases",
          "publishedOn": "2021-10-12T11:56:11.000Z",
          "wordCount": 1144,
          "title": "US agencies clash over two Activision Blizzard legal cases"
        },
        {
          "id": "https://www.rockpapershotgun.com/disco-elysium-has-a-big-discount-now-and-hits-xbox-and-switch-today",
          "author": "Alice O'Connor",
          "description": "Strange and wonderful detective RPG Disco Elysium launches on Xbox and Nintendo Switch today, which is good for them. That's good for you too, person who wants to talk about Disco Elysium all the time but finds pub conversations waylaid by platform unavailability. And hey, it's good for PC peeps who haven't yet bought the game either, because it has a tidy 45% discount on Steam for the next week. Win-win-win.\nRead more",
          "link": "https://www.rockpapershotgun.com/disco-elysium-has-a-big-discount-now-and-hits-xbox-and-switch-today",
          "publishedOn": "2021-10-12T10:25:34.000Z",
          "wordCount": 840,
          "title": "Disco Elysium has a big discount now, and hits Xbox and Switch today"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-unlock-cleaners",
          "author": "Hayden Hefford",
          "description": "Want to know how to unlock all of the cleaners in Back 4 Blood? When you start Back 4 Blood, you will see that only 4 out of the 8 cleaners are playable. Doc, Hoffman, Jim, and Karlee are locked, so you won’t be able to play as them straight away. Doc and Hoffman are some of the best characters in Back 4 Blood, so you’ll want to know how to unlock them as soon as possible.\nBack 4 Blood is a difficult game, regardless of whether you are playing on Recruit or Nightmare mode. If you’re new to the game, you won’t have many cards unlocked, so it’s especially important to choose the best cleaners for your team in the early stages. This guide will cover everything that you need to know to unlock all cleaners in Back 4 Blood.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-unlock-cleaners",
          "publishedOn": "2021-10-12T10:16:26.000Z",
          "wordCount": 941,
          "title": "How to unlock all Cleaners in Back 4 Blood"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-crucials-2tb-mx500-ssd-for-150-after-a-30-discount",
          "author": "Will Judd",
          "description": "We've spoken about the Crucial MX500 before, but the short version is this: it's a fast SATA SSD that also offers great value. Today, it's even better value than normal in the UK, as Amazon have discounted the gargantuan 2TB size of the drive to just £149.97, a 30% discount from its normal £214 RRP. \nRead more",
          "link": "https://www.rockpapershotgun.com/get-crucials-2tb-mx500-ssd-for-150-after-a-30-discount",
          "publishedOn": "2021-10-11T23:41:51.000Z",
          "wordCount": 971,
          "title": "Get Crucial's 2TB MX500 SSD for £150 after a 30% discount"
        },
        {
          "id": "https://www.rockpapershotgun.com/blues-excellent-snowball-usb-mic-is-half-price-just-40",
          "author": "Will Judd",
          "description": "Blue Microphones are known for their popular Yeti podcasting and streaming mic, but they also make a great budget USB model called the Snowball. Its small, adorably round shape belies its capability to make surprisingly detailed recordings, and it's currently half price at Amazon in the UK. That means you need to pay just £40 to take home this mic that normally retails for £80, the cheapest it's been by some margin for years. If you're interested in streaming or podcasting, or just fancy a USB mic to use alongside headphones without a mic (or a rubbish one), then this is a great shout. \nRead more",
          "link": "https://www.rockpapershotgun.com/blues-excellent-snowball-usb-mic-is-half-price-just-40",
          "publishedOn": "2021-10-11T23:22:53.000Z",
          "wordCount": 1052,
          "title": "Blue's excellent Snowball USB mic is half price - just £40"
        },
        {
          "id": "https://www.rockpapershotgun.com/no-cross-saves-for-monster-hunter-rise-but-capcom-say-they-looked-into-it",
          "author": "Lauren Morton",
          "description": "Getting Monster Hunter games on PC still feels like a new treat, even after Monster Hunter World has been out for a few years. Next up for the action and fashion series is Monster Hunter Rise, which is already out on the Nintendo Switch and coming to PC in January. With the PC release coming ten months after the Switch, it's no surprise that MonHunt fans would be keen on being able to carry their save files over to PC in January with cross-progression. Capcom looked into the possibility they say, and cross-platform multiplayer too, but won't be doing either, they've now said.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/no-cross-saves-for-monster-hunter-rise-but-capcom-say-they-looked-into-it",
          "publishedOn": "2021-10-11T22:04:00.000Z",
          "wordCount": 922,
          "title": "No cross-saves for Monster Hunter Rise, but Capcom say they looked into it"
        },
        {
          "id": "https://www.rockpapershotgun.com/hitflesh-takes-you-back-to-a-classic-mmos-haunted-fan-server",
          "author": "Lauren Morton",
          "description": "Come relive your old MMO nostalgia in that early aughts MMO you definitely remember—HitFlesh! What, you never played HitFlesh? Ah, well lucky you that fans have propped up a classic game server that's totally free to play on. That's the setup, at least, for this story-driven adventure game about spelunking through a classic MMO by the same name. Something's gone spooky in these fan servers though. You can catch the new trailer for HitFlesh down here while you wait for its upcoming free demo.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/hitflesh-takes-you-back-to-a-classic-mmos-haunted-fan-server",
          "publishedOn": "2021-10-11T20:37:42.000Z",
          "wordCount": 919,
          "title": "HitFlesh takes you back to a classic MMO's haunted fan server"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-introduces-one-new-mob-candidate-the-grouchy-little-glare",
          "author": "Lauren Morton",
          "description": "Mojang's big all-things-Minecraft show Minecraft Live is coming up this weekend and, like last year, they'll have players voting on which new creature should be added to the game. They've shown off just one of the options so far, the Glare mob that can alert you to monster-spawning light levels. It seems like a neat little friend, from what we can see down here in the little teaser video, but I'm wondering if there's more to this new mob than they've let on. We'll be seeing more new mob options throughout this week as the show and the vote approach.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-introduces-one-new-mob-candidate-the-grouchy-little-glare",
          "publishedOn": "2021-10-11T18:30:18.000Z",
          "wordCount": 973,
          "title": "Minecraft introduces one new mob candidate: the grouchy little Glare"
        },
        {
          "id": "https://www.rockpapershotgun.com/this-doom-ii-beat-em-up-mod-lets-you-punch-and-fling-demons-around",
          "author": "Lauren Morton",
          "description": "Kicking demons off Earth with a generous application of bullets is swell, sure. A bit impersonal though, right? Thanks to this new Doom II mod, the Doomslayerguy can turn hell's residents into pools of blood with his own two fists. Doom Fighters turns yon classic FPS into a third-person brawler where you can uppercut and chuck baddies all over the place. You can snag it right now or just appreciate the excellent biff baffing demon slapping in this trailer.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/this-doom-ii-beat-em-up-mod-lets-you-punch-and-fling-demons-around",
          "publishedOn": "2021-10-11T16:27:43.000Z",
          "wordCount": 818,
          "title": "This Doom II beat 'em up mod lets you punch and fling demons around"
        },
        {
          "id": "https://www.rockpapershotgun.com/ubisoft-holding-riders-republic-trial-day-tomorrow",
          "author": "Alice O'Connor",
          "description": "Ahead of its full launch later this month, Ubisoft are inviting PC peeps to try open-world xtreme sports game Riders Republic for free this week. The 'PC Play Day' starts tomorrow morning, and you can preload it now to be ready once the lights turn green. I've heard some good things about the game, though this trial is only on the Ubisoft Connect client, boooo.\nRead more",
          "link": "https://www.rockpapershotgun.com/ubisoft-holding-riders-republic-trial-day-tomorrow",
          "publishedOn": "2021-10-11T16:11:33.000Z",
          "wordCount": 874,
          "title": "Ubisoft holding Riders Republic trial day tomorrow"
        },
        {
          "id": "https://www.rockpapershotgun.com/supporter-podcast-the-nate-files-episode-4-a-general-history-of-the-pyrates",
          "author": "Alice Bell",
          "description": "Y'arrrrr maties, tis time for another episode of The Nate Files, the bonus supporter podcast for you rum coves what toss us a few dubloons in exchange for some extras (and not being forced to walk the plank). Yes, in the Nate Files we see fit to put Nate \"The Derailer\" Crowley in charge, and this week, as you may have guessed from that intro, it is pirate-themed. Specifically, it is about A General History Of The Pyrates by Captain Charles Johnson.\nRead more",
          "link": "https://www.rockpapershotgun.com/supporter-podcast-the-nate-files-episode-4-a-general-history-of-the-pyrates",
          "publishedOn": "2021-10-11T16:00:00.000Z",
          "wordCount": 715,
          "title": "Supporter podcast - The Nate Files episode 4: A General History of the Pyrates"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-best-cards",
          "author": "Hayden Hefford",
          "description": "Want to find the best cards in Back 4 Blood? The swarms of Ridden are ridiculously powerful in Back 4 Blood, especially when you make the leap to the appropriately named Nightmare mode. If you want to survive, you’ll need to construct the best deck for your character. Whilst you should choose certain cards depending on your character and build, there are some cards that are undoubtedly worth using.\nThis guide will show you the best cards in Back 4 Blood, and they all fit into any deck.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-best-cards",
          "publishedOn": "2021-10-11T15:53:28.000Z",
          "wordCount": 1553,
          "title": "Best cards to use in your deck in Back 4 Blood"
        },
        {
          "id": "https://www.rockpapershotgun.com/citizencon-showed-off-some-pretty-new-star-citizen-clouds-but-not-much-else",
          "author": "Imogen Beckhelling",
          "description": "Cloud Imperium Games held CitizenCon this weekend, an annual digital event to celebrate all things Star Citizen. Unfortunately, despite being in development for almost 10 years, they still didn't have any news on a release date. They also didn't have a shred of info to share on their singleplayer spin-off, Squadron 42. So, what did the devs show? Well, some pretty new clouds.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/citizencon-showed-off-some-pretty-new-star-citizen-clouds-but-not-much-else",
          "publishedOn": "2021-10-11T15:28:57.000Z",
          "wordCount": 991,
          "title": "CitizenCon showed off some pretty new Star Citizen clouds, but not much else"
        },
        {
          "id": "https://www.rockpapershotgun.com/thank-you-and-farewell-to-rps-vid-bud-colm-ahern",
          "author": "Katharine Castle",
          "description": "As PC Gaming Weekspot viewers will no doubt already know, the time has come to bid farewell to RPS vid bud Colm Ahern. He leaves us this week for pastures new, leaving behind the world of video games journalism for a new and exciting role at a video games publisher. He will be greatly missed, so come and say goodbye to him below.\nRead more",
          "link": "https://www.rockpapershotgun.com/thank-you-and-farewell-to-rps-vid-bud-colm-ahern",
          "publishedOn": "2021-10-11T15:00:00.000Z",
          "wordCount": 1036,
          "title": "Thank you and farewell to RPS vid bud Colm Ahern"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-rawhide-farm",
          "author": "Rebecca Jones",
          "description": "Where are the best places to farm rawhide in New World? It's no secret that New World involves a lot of crafting. There are dozens of crafting resources available, but rawhide is one of the biggies thanks to its importance in leatherwork and armor crafting. Rawhide isn't an overly rare material, but since you're very likely to need a lot of it, we've put together some tips on how to farm it as quickly and efficiently as possible.\n Read more",
          "link": "https://www.rockpapershotgun.com/new-world-rawhide-farm",
          "publishedOn": "2021-10-11T14:26:44.000Z",
          "wordCount": 1015,
          "title": "New World rawhide farming: the best places to gather rawhide from boars"
        },
        {
          "id": "https://www.rockpapershotgun.com/windows-11-auto-hdr-is-neat-but-not-worth-the-upgrade-alone",
          "author": "James Archer",
          "description": "Windows 11 has been out for little under a week, which has proven more than enough time enough time for the bugs to crawl out. Memory leaks, laggy window animations and, most egregiously, major performance issues on AMD Ryzen CPUs have all been reported. All in all, a rather disappointing start, especially given this was pitched as Microsoft most gaming-friendly OS yet.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/windows-11-auto-hdr-is-neat-but-not-worth-the-upgrade-alone",
          "publishedOn": "2021-10-11T14:03:10.000Z",
          "wordCount": 1701,
          "title": "Windows 11 Auto HDR is neat, but not worth the upgrade alone"
        },
        {
          "id": "https://www.rockpapershotgun.com/this-deus-ex-mod-turns-jc-into-a-lady-with-fully-redone-voice-lines",
          "author": "Alice O'Connor",
          "description": "Next time you go to replay Deus Ex (which will be within one week, now that I have put the idea in your head), perhaps you'll want to try it with a twist. A brand new mod named The Lay D Denton Project turns JC Denton from a stoic fella into a stoic lady, complete with full voice acting and a script tweaked to fit. Meet the female JC in the trailer below.\nRead more",
          "link": "https://www.rockpapershotgun.com/this-deus-ex-mod-turns-jc-into-a-lady-with-fully-redone-voice-lines",
          "publishedOn": "2021-10-11T13:59:21.000Z",
          "wordCount": 1116,
          "title": "This Deus Ex mod turns JC into a lady with fully redone voice lines"
        },
        {
          "id": "https://www.rockpapershotgun.com/battlefield-2042s-floating-corpses-bug-made-me-laugh-a-lot",
          "author": "Imogen Beckhelling",
          "description": "You know, I was pretty disappointed that this weekend's Battlefield 2042 beta didn't have wingsuits. It's been one of the main things I'm looking forward to, leaping from buildings and gliding at unsuspecting foes, so it was sad that we didn't get to try it out. However, as I played, I realised that some players didn't seem to need wingsuits to get themselves off of the ground: they simply needed to die in a janky vehicle accident instead.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/battlefield-2042s-floating-corpses-bug-made-me-laugh-a-lot",
          "publishedOn": "2021-10-11T11:48:15.000Z",
          "wordCount": 1071,
          "title": "Battlefield 2042's floating corpses bug made me laugh a lot"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-tool-upgrades",
          "author": "Rebecca Jones",
          "description": "How can you upgrade tools in New World? Tools and weapons in New World can come in various different qualities, as reflected by their tier. Technically in this game you don't upgrade your tools — in as much as you don't use a lower-tier item as a base for a higher-tier upgrade. But there are ways of ensuring you craft a higher-tier tool, and you can do that regardless of whether you have a lower-tier version in hand or not; so in effect this system works more or less like tool upgrades in other games, but with a step removed.\n Read more",
          "link": "https://www.rockpapershotgun.com/new-world-tool-upgrades",
          "publishedOn": "2021-10-11T11:17:10.000Z",
          "wordCount": 1023,
          "title": "New World tool upgrades: how to get higher-tier tools in New World"
        },
        {
          "id": "https://www.rockpapershotgun.com/scummvm-celebrates-20th-birthday-with-the-longest-journey-support",
          "author": "Alice O'Connor",
          "description": "ScummVM celebrated its 20th birthday on Saturday, two decades of making old games easier to run on modern systems. The project started focused on LucasArts adventure games built in the SCUMM game engine and the first release only supported Monkey Island 2, and it has since grown to support over 300 games across other genres too. To celebrate that big birthday, a new update hit adding support for more game engines and many more games, including The Longest Journey, Grim Fandango, and Crusader: No Remorse.\nRead more",
          "link": "https://www.rockpapershotgun.com/scummvm-celebrates-20th-birthday-with-the-longest-journey-support",
          "publishedOn": "2021-10-11T11:08:46.000Z",
          "wordCount": 944,
          "title": "ScummVM celebrates 20th birthday with The Longest Journey support"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-joy-of-playing-deathloop-as-the-pettiest-man-in-existence",
          "author": "Nic Reuben",
          "description": "Hello! How was your day? Oh, me? Well, I spent the morning scheduling a crank wheel delivery to Updaam. Had lunch. Went back in the afternoon, disabled a few turrets, then hid behind a bin for a bit. All solely to turn off an oxygen pump and asphyxiate a bubble-encased band that I could have easily shot in a few seconds. Tomorrow, I may climb to the top of a three story building just to plummet, machete first, on the face of a guard that killed me once a few loops back. Hello. My name is Colt, and I am the pettiest videogame protagonist in existence.\r\n\n\r\nIn his Deathloop review, Brendy described Colt as “playing it by ass”. I liked that line, but I didn’t yet understand its true gravitas. I am now enlightened. I have beheld the true ass of Colt, and I have grasped its magnitude: Colt’s ass is the antithesis to Dishonored’s heart. Blam. Boot. Blam. None of you are free of sin. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-joy-of-playing-deathloop-as-the-pettiest-man-in-existence",
          "publishedOn": "2021-10-11T09:05:46.000Z",
          "wordCount": 1026,
          "title": "The Joy of playing Deathloop as the pettiest man in existence"
        },
        {
          "id": "https://www.rockpapershotgun.com/you-wont-be-able-to-move-new-world-characters-between-regions-after-all",
          "author": "Graham Smith",
          "description": "New World's server transfer system won't be as flexible as first suggested. Amazon had originally said that players would be able to switch between servers in different regions, letting you move a character from, for example, a North American server to a European one. As of yesterday, they confirmed that's not the case.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/you-wont-be-able-to-move-new-world-characters-between-regions-after-all",
          "publishedOn": "2021-10-09T20:41:01.000Z",
          "wordCount": 826,
          "title": "You won't be able to move New World characters between regions after all"
        },
        {
          "id": "https://www.rockpapershotgun.com/football-manager-2022-introduces-data-hub-new-match-engine",
          "author": "Graham Smith",
          "description": "Football Manager 2022 has started revealing its new features, dribbling them out from the back via videos on its official YouTube account. It's the nerdiest set of major new features ever, from new bar charts to \"staff meetings.\"\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/football-manager-2022-introduces-data-hub-new-match-engine",
          "publishedOn": "2021-10-09T20:07:52.000Z",
          "wordCount": 849,
          "title": "Football Manager 2022 introduces data hub, new match engine"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-quake-remasters-bot-support-is-better-now",
          "author": "Graham Smith",
          "description": "The enhanced edition of Quake, released in August to celebrate the game's 25th anniversary, just got a major update. It improves the game's bots, and adds bot support for a bunch more deathmatch maps, among other bug fixes.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-quake-remasters-bot-support-is-better-now",
          "publishedOn": "2021-10-09T18:51:19.000Z",
          "wordCount": 727,
          "title": "The Quake remaster's bot support is better now"
        },
        {
          "id": "https://www.rockpapershotgun.com/hitman-pulled-from-sale-on-gog",
          "author": "Graham Smith",
          "description": "GOG have pulled Hitman from sale. The bald assassin joined the DRM-free digital shop in September, but was met with damning reviews. That's because, while theoretically DRM-free, Hitman relies on online connectivity for a lot of its features to work. In pulling the game offline, GOG apologised, saying that they \"shouldn't have released it in its current form.\"\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/hitman-pulled-from-sale-on-gog",
          "publishedOn": "2021-10-09T18:38:40.000Z",
          "wordCount": 884,
          "title": "Hitman pulled from sale on GOG"
        },
        {
          "id": "https://www.rockpapershotgun.com/age-of-darkness-final-stand-is-a-strategy-game-that-can-draw-70000-units-on-screen-at-a-time",
          "author": "Graham Smith",
          "description": "Read the name \"Age Of Darkness: Final Stand.\" Now go make a cup of tea. By the time the kettle's boiled, can you still remember the name? \r\n\nIt's a shame, because name aside I like everything Age Of Darkness is doing. It's a survival RTS in which you're attempting to reclaim a world from hordes of monsters and a deadly fog, and its art direction is lovely. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/age-of-darkness-final-stand-is-a-strategy-game-that-can-draw-70000-units-on-screen-at-a-time",
          "publishedOn": "2021-10-09T17:11:24.000Z",
          "wordCount": 843,
          "title": "Age Of Darkness: Final Stand is a strategy game that can draw 70,000 units on screen at a time"
        },
        {
          "id": "https://www.rockpapershotgun.com/what-are-we-all-plaing-this-weekend",
          "author": "Alice O'Connor",
          "description": "Soon, virtual worlds will be crawling with skeletons, jack o' lanterns, and all that good stuff. While the various digital spaces we inhabit have different histories, different religions, different species, so many differences, it's nice to see that one belief is shared across almost every facet of the multiverse: actually, skeletons are really cool.\nRead more",
          "link": "https://www.rockpapershotgun.com/what-are-we-all-plaing-this-weekend",
          "publishedOn": "2021-10-09T08:00:00.000Z",
          "wordCount": 992,
          "title": "What are we all playing this weekend?"
        },
        {
          "id": "https://www.rockpapershotgun.com/eronoctosis-is-a-free-co-op-horror-adventure-launching-on-monday",
          "author": "Lauren Morton",
          "description": "Eronoctosis was one of tons of excellent-looking horror games in today's EEK3 indie horror showcase. It happened to stand out though because I'm a real sucker for a high contrast lo-fi colour scheme. Also I'm a sucker for co-op, especially with horror. Eronoctosis: Put Yourself Together looks to be a psychological horror about banishing badies from inside your own mind. You're required to play with a friend, which makes the price tag of free a real good selling point. You can jump in on Monday when it launches free on Steam.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/eronoctosis-is-a-free-co-op-horror-adventure-launching-on-monday",
          "publishedOn": "2021-10-08T21:50:24.000Z",
          "wordCount": 842,
          "title": "Eronoctosis is a free co-op horror adventure launching on Monday"
        },
        {
          "id": "https://www.rockpapershotgun.com/build-your-dream-machine-for-free-with-pc-building-simulator-this-week",
          "author": "Lauren Morton",
          "description": "It's not often, if ever, that you get to build an impressive PC for free and without fear of irreparable failure. You can have both if you snag PC Building Simulator as the freebie of the week on the Epic Games Store through next Thursday. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/build-your-dream-machine-for-free-with-pc-building-simulator-this-week",
          "publishedOn": "2021-10-08T20:25:46.000Z",
          "wordCount": 841,
          "title": "Build your dream machine for free with PC Building Simulator this week"
        },
        {
          "id": "https://www.rockpapershotgun.com/ryu-ga-gotoku-have-a-new-studio-lead-and-plans-for-yakuza-lad-sequel",
          "author": "Lauren Morton",
          "description": "The Yakuza game series successfully passed the torch from long time leading protagonist to another with Yakuza: Like A Dragon last year and now developers Ryu Ga Gotoku are looking to do the same. Series director Toshihiro Nagoshi and producer Daisuke Sato are both leaving Sega, handing over the RGG studio lead position to writer and producer Masayoshi Yokoyama. Along with the announcement of the change, Yokoyama says that RGG plan to \"let our games do the talking\" including the in progress sequel to Yakuza: LAD. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/ryu-ga-gotoku-have-a-new-studio-lead-and-plans-for-yakuza-lad-sequel",
          "publishedOn": "2021-10-08T19:07:10.000Z",
          "wordCount": 935,
          "title": "Ryu Ga Gotoku have a new studio lead and plans for Yakuza: LAD sequel"
        },
        {
          "id": "https://www.rockpapershotgun.com/if-you-need-more-phoenix-wright-in-your-life-play-tangle-tower",
          "author": "Katharine Castle",
          "description": "I refuse to believe it's been two years since the launch of Tangle Tower. A year, at most, perhaps, but two? Simply impossible. But its release on PS4 and Xbox One this week has got me thinking about this excellent murder mystery game again, and man, if you've been hankering for more great detective work after the likes of The Great Ace Attorney Chronicles (or indeed the Phoenix Wright: Ace Attorney Trilogy) lately, then you absolutely owe it to yourself to play Tangle Tower. After all, when the prime suspect is *checks notes* a painted portrait holding a blood-tipped knife, who could possibly resist such a juicy little murder hook? \nRead more",
          "link": "https://www.rockpapershotgun.com/if-you-need-more-phoenix-wright-in-your-life-play-tangle-tower",
          "publishedOn": "2021-10-08T17:49:51.000Z",
          "wordCount": 813,
          "title": "If you need more Phoenix Wright in your life, play Tangle Tower"
        },
        {
          "id": "https://www.rockpapershotgun.com/diablo-ivs-new-game-director-is-its-design-lead-joe-shely",
          "author": "Lauren Morton",
          "description": "Following the sexual harassment and discrimination lawsuit filed against Activision Blizzard by the state of California this summer, Blizzard let go several long-time developers in leadership positions. Among them was Diablo IV's game director Luis Barriga. Blizzard have now officially filled that position with another long-time Diablo series designer Joe Shely, they've announced in a blog post.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/diablo-ivs-new-game-director-is-its-design-lead-joe-shely",
          "publishedOn": "2021-10-08T17:27:31.000Z",
          "wordCount": 892,
          "title": "Diablo IV's new game director is its design lead Joe Shely"
        },
        {
          "id": "https://www.rockpapershotgun.com/grand-theft-auto-trilogy-remasters-are-officially-announced-coming-this-year",
          "author": "Lauren Morton",
          "description": "As it was rumored, so it shall come to pass. Rockstar have just announced that they are indeed doing remasters of Grand Theft Auto III, GTA: San Andreas, and GTA: Vice City for PC and current consoles. Not just that, but they're coming this year which, now that it's October, means quite soon. They've rolled out a quick teaser trailer and just a couple details on what's getting freshened up in the trilogy remasters. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/grand-theft-auto-trilogy-remasters-are-officially-announced-coming-this-year",
          "publishedOn": "2021-10-08T16:05:47.000Z",
          "wordCount": 881,
          "title": "Grand Theft Auto trilogy remasters are officially announced, coming this year"
        },
        {
          "id": "https://www.rockpapershotgun.com/impostor-factory-review",
          "author": "Giada Zavarise",
          "description": "Every good murder mystery needs a spooky house for a stage. That's the rules. The one in Impostor Factory is a secluded manor deep in the woods, a crumbling temple to cleanliness with self-cleaning floors and a literal golden toilet in the bathroom. You are the first to arrive, shoulders heavy with rain. You don't know much about the hosts, apart from the fact that they're old, eccentric, and eager to unveil the mysterious machine looming in the main hall. The other guests are as rich and quirky as the villa's owners, and you, an everyday man named Quincy, are starting to feel a bit awkward about the whole situation. And yet you stay because you're curious about the machine, the weird vision you had in the bathroom, and that other guest you keep bumping into - the lady in a red dress that looks familiar and sad and full of secrets. \nThe stage is set. The guests are gathered. The murders begin. And then they happen again, and again, and again. The real mystery is not discovering who committed the murders. The mystery is understanding why they keep happening.\nRead more",
          "link": "https://www.rockpapershotgun.com/impostor-factory-review",
          "publishedOn": "2021-10-08T16:00:00.000Z",
          "wordCount": 1540,
          "title": "Impostor Factory (To The Moon 3) review: where an imaginary life is as fulfilling as a real one"
        },
        {
          "id": "https://www.rockpapershotgun.com/you-can-play-the-battlefield-2042-open-beta-right-now",
          "author": "Imogen Beckhelling",
          "description": "Battlefield 2042's open beta went live this morning, giving folks a chance to jump into some futuristic 128-player wars before the game launches in full next month. While there was a brief pre-order early access beta period this week, it's free for everyone to try right now, and is open until Sunday morning. I'll admit, I've never been big on Battlefield, but my pals are pretty excited about this one, so I expect I'll see you in the trenches this weekend.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/you-can-play-the-battlefield-2042-open-beta-right-now",
          "publishedOn": "2021-10-08T15:41:53.000Z",
          "wordCount": 927,
          "title": "You can play the Battlefield 2042 open beta right now"
        },
        {
          "id": "https://www.rockpapershotgun.com/dont-let-plunder-slip-over-the-horizon",
          "author": "Sin Vega",
          "description": "Look, it's not because it's about pirates. I mean, that's obviously what caught my eye, but it takes more than that, and most pirate games aren't about doing piracy at all anyway.\nPlunder isn't either, if I'm honest. It's a monster-slaying action RPG with age of sail trappings, but it's carried off with charm and such a clean design that even I can't bring my usual grudge to bear on it. I'm having far too much fun.\nRead more",
          "link": "https://www.rockpapershotgun.com/dont-let-plunder-slip-over-the-horizon",
          "publishedOn": "2021-10-08T15:33:04.000Z",
          "wordCount": 694,
          "title": "Don't let Plunder slip over the horizon"
        },
        {
          "id": "https://www.rockpapershotgun.com/okay-the-xbox-20th-anniversary-translucent-controller-looks-pretty-cool",
          "author": "Alice O'Connor",
          "description": "Microsoft have revealed a fancy new translucent Xbox controller created to celebrate 20 years of Xboxing, and honestly I dig it. Oh I have no intention of buying a new controller just beacuse it looks nice, a smoky body with a lurid flash of green, but I'm about due a new controller anyway. Time for the periodic replacement once too many minor irritating issues accumulate, you know. Might get this one.\nRead more",
          "link": "https://www.rockpapershotgun.com/okay-the-xbox-20th-anniversary-translucent-controller-looks-pretty-cool",
          "publishedOn": "2021-10-08T15:06:58.000Z",
          "wordCount": 931,
          "title": "Okay, the Xbox 20th anniversary translucent controller looks pretty cool"
        },
        {
          "id": "https://www.rockpapershotgun.com/audio-radar-is-an-led-sound-indicator-for-the-hard-of-hearing",
          "author": "James Archer",
          "description": "Peripheral makers AirDrop Gaming have announced a crowdfuning campaign for Audio Radar, a potentially useful accessory for PC gamers who are deaf or hard of hearing. Audio Radar is a set of six LED strips that surround your monitor and flash to signify the direction of important sound cues, and its Indiegogo campaign it set to launch on October 15th.\nRead more",
          "link": "https://www.rockpapershotgun.com/audio-radar-is-an-led-sound-indicator-for-the-hard-of-hearing",
          "publishedOn": "2021-10-08T15:03:28.000Z",
          "wordCount": 998,
          "title": "Audio Radar is an LED sound indicator for the hard of hearing"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-review-in-progress",
          "author": "Alice Bell",
          "description": "Even the name New World feels like a brash statement of intent, doesn't it? Amazon are shouldering their way into the market with a brand new MMORPG, a fresh digital playground that is, the name implies, unlike any you've seen before! In practise, of course, it is a lot like MMOs you've seen before, albeit with its own twists on the formula to get you hooked. New World understands that formula well, and I am a simple creature, so attaching a button marked Endorphin Release to my brain and pressing it every five minutes or so works as well on me as it does on a lab rat.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-review-in-progress",
          "publishedOn": "2021-10-08T15:00:00.000Z",
          "wordCount": 1962,
          "title": "New World review in progress: a fresh, swashbuckling MMO that's still very grindy early on"
        },
        {
          "id": "https://www.rockpapershotgun.com/apex-legends-begins-zombie-filled-halloween-event-next-week",
          "author": "Imogen Beckhelling",
          "description": "It's beginning: video game Halloween celebrations are starting to emerge from the shadows for another year. This Tuesday, Apex Legends players will be able to jump into the battle royale's new spooky event, Monsters Within. It brings back the limited-time mode that turns Legends into zombies to hunt their pals, adds a bunch of eerie cosmetics, and introduces a new ominous-looking Arenas map to boot. I'm very excited. Halloween!\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/apex-legends-begins-zombie-filled-halloween-event-next-week",
          "publishedOn": "2021-10-08T14:42:49.000Z",
          "wordCount": 889,
          "title": "Apex Legends begins zombie-filled Halloween event next week"
        },
        {
          "id": "https://www.rockpapershotgun.com/so-which-steam-next-fest-demos-did-you-like",
          "author": "Alice O'Connor",
          "description": "The Steam Next Fest has ended, with Valve last night taking down the big banner over their latest event celebrating new demos for indie games. As ever, the demo bonanza was too large to reasonably play everything, so we've recommend quite a few games along the way. But how about you? What did you like? What will you be keeping an eye?\nRead more",
          "link": "https://www.rockpapershotgun.com/so-which-steam-next-fest-demos-did-you-like",
          "publishedOn": "2021-10-08T14:05:41.000Z",
          "wordCount": 842,
          "title": "So which Steam Next Fest demos did you like?"
        },
        {
          "id": "https://www.rockpapershotgun.com/far-cry-6-best-weapons",
          "author": "Ollie Toms",
          "description": "Want to know which are the best weapons in Far Cry 6? There's an awful lot of guns to play with in Ubisoft's latest bombastic open-world FPS, from SMGs and Sniper Rifles to Launchers and Bows. But you've also got Unique Weapons that can be found throughout Yara, and even unique-er Resolver Weapons that you can acquire from Juan in exchange for Depleted Uranium. The point is: picking the best gun is a daunting prospect in Far Cry 6.\nBut that's why we've picked 7! Below you'll find our picks for the very best weapons in Far Cry 6. Each of these tools of destruction are overpowered in their own way, and will allow you to tear through enemies without hesitation. Read on and pick the weapons that best suit your style.\nRead more",
          "link": "https://www.rockpapershotgun.com/far-cry-6-best-weapons",
          "publishedOn": "2021-10-08T14:03:39.000Z",
          "wordCount": 1805,
          "title": "Best weapons in Far Cry 6"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-tadpoles",
          "author": "Rebecca Jones",
          "description": "How can you catch Tadpoles in New World, and what are they used for? Tadpoles are a deceptively helpful resource in New World. It's hard to imagine a more unassuming creature, but you'll need to catch some Tadpoles to complete some useful early Town Projects. Furthermore, Tadpoles can be salvaged into Life Motes, a crafting resource which goes into some good mid-game recipes.\n Read more",
          "link": "https://www.rockpapershotgun.com/new-world-tadpoles",
          "publishedOn": "2021-10-08T13:04:17.000Z",
          "wordCount": 1095,
          "title": "New World Tadpoles: where to catch Tadpoles and why they're so useful"
        },
        {
          "id": "https://www.rockpapershotgun.com/easy-anti-cheat-issues-locked-new-world-players-out-this-week",
          "author": "Imogen Beckhelling",
          "description": "Over the last few days, many New World players have been struggling to get into Amazon's popular MMORPG. Some reported being booted to menu after queuing, while others haven't been able to open the game at all. Last night, the devs suggested it was a problem with Easy Anti-Cheat, and offered a workaround so folks could get back on the grind. As it turns out, other games that use EAC have seen similar issues, and now Steam has rolled back a client update to try and fix them.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/easy-anti-cheat-issues-locked-new-world-players-out-this-week",
          "publishedOn": "2021-10-08T12:25:55.000Z",
          "wordCount": 858,
          "title": "Easy Anti-Cheat issues locked New World players out this week"
        },
        {
          "id": "https://www.rockpapershotgun.com/mystery-steam-reviews-056-video-games-2021",
          "author": "Colm Ahern",
          "description": "2021 has been unfairly hammered by critics. Sure, it's not a classic year like 1998 or 2007, but there's been some decent games out over the last few months. To be fair, though, this MSR also highlights some of 2021's lowlights, so it's not like quality was that much of a concern when we were choosing our games.\r\n  \nRead more",
          "link": "https://www.rockpapershotgun.com/mystery-steam-reviews-056-video-games-2021",
          "publishedOn": "2021-10-08T12:00:00.000Z",
          "wordCount": 964,
          "title": "The final Mystery Steam Reviews is all about 2021"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-to-install-a-new-gpu",
          "author": "James Archer",
          "description": "Right now, there’s a graphics card shortage the likes of which have never been seen, and thus the knowledge of how to install a new GPU has only slightly more relevance than knowing how to parallel park a griffin. Or maybe not – it is technically possible, if annoyingly rare, to grab one of the best graphics cards of the current generation before a reseller or blockchain enthusiast snaps up ten of them at once. And even the most morose estimates don’t suggest this dearth will last forever, in which case: welcome, RPS readers of the future.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/how-to-install-a-new-gpu",
          "publishedOn": "2021-10-08T11:28:24.000Z",
          "wordCount": 1561,
          "title": "How to install a new GPU"
        },
        {
          "id": "https://www.rockpapershotgun.com/destiny-2-will-remove-forsaken-campaign-and-the-tangled-shore-next",
          "author": "Alice O'Connor",
          "description": "Bungie have announced plans to remove the Forsaken expansion's story campaign from Destiny 2, shuffling it into the Destiny Content Vault along with the Tangled Shore location. The Dreaming City will stay, thankfully, and Bungie also plan to pull some old content back out of the Vault. Before Forsaken vanishes in February, it will become free for all players from December. And hey, Battlegrounds mode is becoming a regular fixture!\nRead more",
          "link": "https://www.rockpapershotgun.com/destiny-2-will-remove-forsaken-campaign-and-the-tangled-shore-next",
          "publishedOn": "2021-10-08T10:56:31.000Z",
          "wordCount": 1303,
          "title": "Destiny 2 will remove Forsaken campaign and the Tangled Shore next"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-voidmetal",
          "author": "Rebecca Jones",
          "description": "What is Voidmetal used for in New World, and where can you find it? Voidmetal is one of New World's high-end crafting materials, used in the recipes for some of the game's best weapons, armor, and other desirable items.\n Read more",
          "link": "https://www.rockpapershotgun.com/new-world-voidmetal",
          "publishedOn": "2021-10-08T10:40:36.000Z",
          "wordCount": 1052,
          "title": "New World Voidmetal: how to find, mine, and craft with Voidmetal in New World"
        },
        {
          "id": "https://www.rockpapershotgun.com/rust-now-has-npcs-who-can-give-you-missions",
          "author": "Graham Smith",
          "description": "Grim survival shooter Rust's descriptively named \"Missions & QoL\" update is a doozy. You can now talk to NPCs scattered around the world who will give you missions to perform, \"from catching fish or harvesting lumber to hunting sharks and uncovering hidden treasure.\"\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/rust-now-has-npcs-who-can-give-you-missions",
          "publishedOn": "2021-10-07T23:07:21.000Z",
          "wordCount": 767,
          "title": "Rust now has NPCs who can give you missions"
        },
        {
          "id": "https://www.rockpapershotgun.com/dota-2s-the-international-is-now-underway",
          "author": "Graham Smith",
          "description": "Dota 2's The International is now underway. The group stages for Valve's wizard flinging esports tournament began today, with 18 teams competing to progress into the knockout stages. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/dota-2s-the-international-is-now-underway",
          "publishedOn": "2021-10-07T22:24:45.000Z",
          "wordCount": 772,
          "title": "Dota 2's The International is now underway"
        },
        {
          "id": "https://www.rockpapershotgun.com/watch-the-first-trailer-for-the-resident-evil-welcome-to-raccoon-city-movie",
          "author": "Graham Smith",
          "description": "I'm not sure it's possible for my expectations to be lower than they are for any given Resident Evil movie project, but the subtitle \"Welcome To Raccoon City\" might just have lowered them further. Thankfully I've just watched the first official trailer, and hey, this looks fun! This looks competent. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/watch-the-first-trailer-for-the-resident-evil-welcome-to-raccoon-city-movie",
          "publishedOn": "2021-10-07T21:59:17.000Z",
          "wordCount": 790,
          "title": "Watch the first trailer for the Resident Evil: Welcome To Raccoon City movie"
        },
        {
          "id": "https://www.rockpapershotgun.com/ea-say-fifa-might-not-be-called-fifa-in-future",
          "author": "Graham Smith",
          "description": "EA's FIFA games might not be called FIFA in future. That's what EA Sports say, eventually, in a blog post on the \"future of football\". \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/ea-say-fifa-might-not-be-called-fifa-in-future",
          "publishedOn": "2021-10-07T21:11:16.000Z",
          "wordCount": 954,
          "title": "EA say FIFA might not be called FIFA in future"
        },
        {
          "id": "https://www.rockpapershotgun.com/razer-streaming-gear-is-heavily-discounted-at-amazon-uk",
          "author": "Will Judd",
          "description": "A whole host of Razer peripherals and streaming equipment has been discounted at Amazon UK today, including one of my favourite mice of all time - the Razer Viper Ultimate. Here are the links, then we'll get into the explanations of why these deals are worth considering!\nRead more",
          "link": "https://www.rockpapershotgun.com/razer-streaming-gear-is-heavily-discounted-at-amazon-uk",
          "publishedOn": "2021-10-07T19:57:30.000Z",
          "wordCount": 1095,
          "title": "Razer streaming gear is heavily discounted at Amazon UK"
        },
        {
          "id": "https://www.rockpapershotgun.com/amds-new-ryzen-5700g-apu-thats-cpu-plus-integrated-graphics-is-going-cheap-in-the-uk",
          "author": "Will Judd",
          "description": "The AMD Ryzen 7 5700G was released earlier this year for £330, but supply issues made it hard to find this processor with integrated graphics at all. Now, Ebuyer are selling the chip for £295, a £40 reduction from its recommended retail price of £330. That's a good deal for a CPU that outperforms AMD's already excellent Ryzen 3700X while also providing fast enough graphics performance for 1080p gaming. Oh, and it comes with a free, quite decent AMD Wraith CPU cooler - awesome. \nRead more",
          "link": "https://www.rockpapershotgun.com/amds-new-ryzen-5700g-apu-thats-cpu-plus-integrated-graphics-is-going-cheap-in-the-uk",
          "publishedOn": "2021-10-07T19:34:40.000Z",
          "wordCount": 1072,
          "title": "AMD's new Ryzen 5700G APU (that's CPU plus integrated graphics) is going cheap in the UK"
        },
        {
          "id": "https://www.rockpapershotgun.com/book-of-travels-preview-the-cure-for-my-break-up-with-mmos",
          "author": "Lauren Morton",
          "description": "The first thing I did in the early access version of Book Of Travels was wander aimlessly into a dangerous forest, get robbed by a Ruffian, refuse to hand over my meager starter items because I had given myself the 'stickler' personality trait, and completely flub the resulting combat encounter because I had no weapons.\nMight And Delight's creative director Jakob Tuchten was quite apologetic about my fate, but a life is a small price for a surprise - the greatest gift to an old MMO player like me. I'm telling you this off the cuff because this is not, in fact, representative of my ten hours with Book Of Travels so far. Aside from my initial unwitting choice to spawn in a dangerous area, the Braided Shore is a serene world with a meditative pace. It's a fable in game form, with its painterly visuals and homely magic. If you are looking for danger though, it is out there waiting for you off the roads and far from city centers.\nRead more",
          "link": "https://www.rockpapershotgun.com/book-of-travels-preview-the-cure-for-my-break-up-with-mmos",
          "publishedOn": "2021-10-07T17:00:00.000Z",
          "wordCount": 2065,
          "title": "Book Of Travels' online cRPG world may be the cure for my break-up with MMOs"
        },
        {
          "id": "https://www.rockpapershotgun.com/eidos-montreal-are-switching-to-a-four-day-workweek",
          "author": "Alice O'Connor",
          "description": "The studio behind the Deus Ex prequels, Guardians Of The Galaxy, and Shadow Of The Tomb Raider are taking a bold step in an industry known for overworking, and switching to a four-day workweek. Eidos Montreal say salaries and working conditions will remain the same, they'll just close the office on Fridays as everyone goes from 40-hour weeks to 32-hour weeks. The idea is that with more downtime to unwind and live their lives, people will work better during those reduced hours. Alright, everyone else do this too, thanks.\nRead more",
          "link": "https://www.rockpapershotgun.com/eidos-montreal-are-switching-to-a-four-day-workweek",
          "publishedOn": "2021-10-07T16:26:42.000Z",
          "wordCount": 1091,
          "title": "Eidos Montreal are switching to a four-day workweek"
        },
        {
          "id": "https://www.rockpapershotgun.com/windows-11-is-making-amd-chips-slower-in-games",
          "author": "James Archer",
          "description": "Microsoft’s chief product officer Panos Panay once said “If you’re a gamer, Windows 11 was made for you.” Unfortunately, a couple of days after launching, it’s turning out to be something of an unwanted gift. Besides being blamed for Far Cry 6 crashes and deterring an entire cloud gaming service, Windows 11 is now causing performance drops on AMD chips as well. That’s according to AMD themselves, who announced in a support post that updating to Windows 11 could cause a 3-5% performance drop in some applications as well as a 10-15% drop in “games commonly used for esports.”\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/windows-11-is-making-amd-chips-slower-in-games",
          "publishedOn": "2021-10-07T15:40:05.000Z",
          "wordCount": 996,
          "title": "Windows 11 is making AMD chips slower in games"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-pvp",
          "author": "Rebecca Jones",
          "description": "What PvP modes are available in New World, and how do you take part in them? New World is an MMO, which means interaction with other players forms a big part of the game. While it's far from every-player-for-themself on the Isle of Aeternum — you're encouraged to join up with a Company (New World's version of Guilds, basically) to make the most of co-operative gameplay — there's naturally a PvP aspect involved as well.\n Read more",
          "link": "https://www.rockpapershotgun.com/new-world-pvp",
          "publishedOn": "2021-10-07T15:34:48.000Z",
          "wordCount": 1634,
          "title": "New World PvP: what PvP modes are there in New World?"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-electronic-wireless-show-episode-159-deal-sweeten-with-a-vengeance",
          "author": "Alice Bell",
          "description": "Matthew once again has the temerity to be away, so this week for the Electronic Wireless Show Podcast Nate and I play another round of Sweeten The Deal (per a vote in the podcast Discord), in which, as Nate says, we both lose. On the upside, since this is the third game of Sweeten The Deal that we've played, we are both developing very distinct, high-level playstyles and also a theme song for it.\nIt does mean there isn't a whole lot of game chat this week, although we do discuss the very important developments in the case of The Zodiac Killer, as well as a very special Cavern Of Announcements.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-electronic-wireless-show-episode-159-deal-sweeten-with-a-vengeance",
          "publishedOn": "2021-10-07T15:00:00.000Z",
          "wordCount": 855,
          "title": "EWS podcast episode 158: Deal Sweeten With A Vengeance"
        }
      ]
    },
    {
      "title": "Root.cz - články",
      "feedUrl": "https://www.root.cz/rss/clanky/",
      "siteUrl": "https://www.root.cz/clanky/",
      "articles": [
        {
          "id": "www.root.cz-text-15712",
          "author": "redakce@root.cz (Root.cz: Daniel Salzman)",
          "description": "Uživatelé se často ptají, jak zprovoznit vlastní DNS server. Na praktických příkladech si tedy přiblížíme základy i pokročilejší možnosti Knot DNS, autoritativního serveru z dílen českého sdružení CZ.NIC.",
          "link": "https://www.root.cz/clanky/nasazujeme-knot-dns-na-vlastni-domene-prakticky-navod/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-13T22:00:10.000Z",
          "wordCount": 3139,
          "title": "Nasazujeme Knot DNS na vlastní doméně: praktický návod",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/399/uzel-provaz-spojeni-1.jpg",
            "length": "44034",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15711",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "Ve druhém a současně i závěrečném článku o Small Basicu si ukážeme práci s vestavěnými objekty, zejména s grafickým oknem. Taktéž si popíšeme želví grafiku a systém událostí (a reakcí na ně). Zmíníme se i o alternativně ke Small Basicu, jímž je Basic-256.",
          "link": "https://www.root.cz/clanky/vestavene-objekty-small-basicu-prace-s-grafikou-casovacem-reakce-na-udalosti/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-13T22:00:05.000Z",
          "wordCount": 6267,
          "title": "Vestavěné objekty Small Basicu: práce s grafikou, časovačem, reakce na události",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/263/small-basic-1.jpg",
            "length": "34319",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15673",
          "author": "redakce@root.cz (Root.cz: Pavel Herout)",
          "description": "Ve druhém článku si ukážeme poměrně podrobně možnosti výstupů logování zajišťovaných handlery. Tyto možnosti jsou vcelku rozsáhlé a evidentně reagují na reálnou poptávku takřka „ze života“.",
          "link": "https://www.root.cz/clanky/logovani-v-php-moznosti-vystupu-logovani-zajistovanych-handlery/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-12T22:00:10.000Z",
          "wordCount": 3007,
          "title": "Logování v PHP: možnosti výstupů logování zajišťovaných handlery",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/516/php-1.jpg",
            "length": "42482",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15705",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Sonda do světa otevřeného softwaru. Dnes si přidáme anotace k obrázkům, zvýšíme si výdrž baterie u notebooku, proměníme skripty z Pythonu ve webové aplikace a stáhneme si informace z chytrých hodinek.",
          "link": "https://www.root.cz/clanky/softwarova-sklizen-13-10-2021/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-12T22:00:05.000Z",
          "wordCount": 965,
          "title": "Softwarová sklizeň (13. 10. 2021)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/root/368/kombajn-sklizen.jpg",
            "length": "394618",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15706",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "Už jsme se několikrát zmínili o jazycích navržených pro výuku programování. Do této kategorie spadá i Small Basic, jehož jméno se sice odkazuje na klasické BASICy, ovšem jedná se o značně rozdílný dialekt.",
          "link": "https://www.root.cz/clanky/small-basic-moderni-reinkarnace-basicu-urcena-pro-vyuku-programovani/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-11T22:00:15.000Z",
          "wordCount": 6195,
          "title": "Small Basic: moderní reinkarnace BASICu určená pro výuku programování",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/263/small-basic-1.jpg",
            "length": "34319",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15651",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Otevřená závodní hra SuperTuxKart chystá vydání nové verze se spoustou novinek. Emulátor přenosné herní konzole Nintentdo Switch Yuzu vylepšuje výkon a renderování. Dopravní strategie OpenTTD 12.0 má první beta verzi.",
          "link": "https://www.root.cz/clanky/supertuxkart-chysta-spoustu-novinek-yuzu-vylepsuje-vykon/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-11T22:00:10.000Z",
          "wordCount": 1158,
          "title": "SuperTuxKart chystá spoustu novinek, Yuzu vylepšuje výkon",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/509/supertuxkart-1-3-nintendo-switch-1.jpg",
            "length": "81451",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15704",
          "author": "redakce@root.cz (Root.cz: CESNET CERTS)",
          "description": "Ve tmě a chaosu vzniklém při výpadku Facebooku by se mohlo zdát, že se už nic horšího stát nemůže. Ale přesvědčíme se, že útočníci číhají na každém rohu a využíjí každičkou, byť nepatrnou, příležitost.",
          "link": "https://www.root.cz/clanky/postrehy-z-bezpecnosti-apache-nevi-ze-neni-tecka-jako-tecka/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-10T22:00:10.000Z",
          "wordCount": 1537,
          "title": "Postřehy z bezpečnosti: Apache neví, že není tečka jako tečka",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/356/beruska-1.jpg",
            "length": "35123",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15698",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Red Hat Enterprise Linux 8.5 beta je k dispozici k veřejnému testování. Vyšly opravné verze Debianu 10 a 11. Vydání Linux Mint 20.3 je v plánu na letošní Vánoce. TUXEDO InfinityBook Pro 14 je k mání s grafikou NVIDIA GeForce RTX 3050 Ti.",
          "link": "https://www.root.cz/clanky/vysel-rhel-8-5-beta-a-prvni-opravna-verze-debianu-11/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-10T22:00:05.000Z",
          "wordCount": 1155,
          "title": "Vyšel RHEL 8.5 beta a první opravná verze Debianu 11",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/558/rhel-8-1.jpg",
            "length": "14085",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15703",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Canonical představil Ubuntu Frame, Chrome 96 a lepší WebRTC i sdílení obrazovky na Waylandu, Wine 6.19, vzpomínka na první prototyp Leica, Paul Shillito o MOSFET, Debian 11.1 a 10.11, Vivaldi 4.3.",
          "link": "https://www.root.cz/clanky/nova-verze-apache-openoffice-microsoft-a-pravo-na-opravu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-09T22:00:00.000Z",
          "wordCount": 1530,
          "title": "Nová verze Apache OpenOffice, Microsoft a právo na opravu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/266/oprava-wi-fi-1.jpg",
            "length": "61635",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15697",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Evropský parlament hlasoval ve prospěch rezoluce, která zakazuje policii a dalším orgánům v členských státech využívat systémy umělé inteligence (AI) rozpoznávání tváří. Chce tak zabránit masivnímu sledování.",
          "link": "https://www.root.cz/clanky/evropsky-parlament-odmita-plosne-sledovani-za-pomoci-umele-inteligence/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-07T22:00:10.000Z",
          "wordCount": 1474,
          "title": "Evropský parlament odmítá plošné sledování za pomocí umělé inteligence",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/251/face-recognition-rozpoznavani-obliceje-sledovani-1.jpg",
            "length": "52219",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "Root.cz - zprávičky",
      "feedUrl": "https://www.root.cz/rss/zpravicky/",
      "siteUrl": "https://www.root.cz/zpravicky/",
      "articles": [
        {
          "id": "www.root.cz-actuality-42901",
          "author": "redakce@root.cz (Root.cz: Vilém Sládek)",
          "description": "Sdružení CZ.NIC, pořadatel konference Internet a Technologie (21.2), zveřejnilo webové stránky akce a otevřelo registraci. Tato tradiční konference správce české národní domény se uskuteční 10. listopadu v konferenčních prostorech hotelu Grandior (Na Poříčí 1052/42, Praha 1). Program, registrační formulář a další informace včetně archivu minulých ročníků jsou k dispozici na webu akce.",
          "link": "https://www.root.cz/zpravicky/poradatele-konference-internet-a-technologie-predstavili-program-a-spustili-registraci/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-13T11:59:10.000Z",
          "wordCount": 831,
          "title": "Pořadatelé konference Internet a Technologie představili program a spustili registraci",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/579/konference-internet-a-technologie-19-1.jpg",
            "length": "52279",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-38548",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Nginx je dnes přibližně na třetině web serverů na internetu a toto číslo stále roste. Je výkonný, spolehlivý, má spoustu funkcí a dobře se spravuje. Pokud potřebujete dobrý web server pro svůj projekt, bude Nginx správnou volbou.",
          "link": "https://www.root.cz/zpravicky/nasadte-moderni-web-server-s-nginx-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-13T11:22:03.000Z",
          "wordCount": 786,
          "title": "Nasaďte moderní web server s Nginx (online školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/398/nginx-logo-1.jpg",
            "length": "17314",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42900",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Tým v Red Hatu věnující se GPU subsystému a věcem souvisejícím už obsahuje velká jména jako David Airlie (správce DRM) či dalších vývojářů pracujících v rámci projektu MESA. Nyní Red Hat hledá dalšího experta přes GPU, který se bude věnovat oblasti GPU hardware enablement.",
          "link": "https://www.root.cz/zpravicky/red-hat-najima-dalsiho-vyvojare-pro-gpu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-13T07:56:00.000Z",
          "wordCount": 857,
          "title": "Red Hat najímá dalšího vývojáře pro GPU",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/383/amd-radeon-hd-7970-1.jpg",
            "length": "27361",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42898",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Sotva se nám budou za pár týdnů objevovat první spotřebitelské procesory s podporou PCI Express 5.0 (pozn. Intel Alder Lake), PCI-SIG hovoří o téměř finální specifikaci generace následné. PCI Express 6.0 opět nabídne zdvojnásobení přenosových rychlostí a plnou zpětnou kompatibilitu, to vše stále „na metalice“.",
          "link": "https://www.root.cz/zpravicky/pci-express-6-0-opet-zrychli-na-dvojnasobek-diky-pam4-modulaci/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-13T06:00:00.000Z",
          "wordCount": 1272,
          "title": "PCI Express 6.0 opět zrychlí na dvojnásobek, díky PAM4 modulaci",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/116/pci-express.jpg",
            "length": "88396",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42899",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Začíná to být nekonečná telenovela. Sotva pár desítek hodin po tom, co jsme psali o dosažení propustnosti téměř 7 miliónů IOPS na CPU jádro v Linuxu, přichází zpráva, jejímž autorem je opět Jens Axboe, že IOPS poskočily na téměř sedm a půl miliónů. Zrychlení jde na bedra dalších optimalizací, mimo jiné 10% snížení latence u synchronizace.",
          "link": "https://www.root.cz/zpravicky/linux-znovu-lame-rekord-dosahuje-7-4-milionu-iops-na-jadro/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-12T22:00:00.000Z",
          "wordCount": 1066,
          "title": "Linux znovu láme rekord, dosahuje 7,4 miliónů IOPS na jádro",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/183/intel-optane-1.png",
            "length": "136512",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42897",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Oblíbený programátorský editor Geany přichází ve verzi 1.38 s několika novinkami. Tou největší je asi odstranění podpory GTK+ v2 (verze pro Windows mimochodem přechází na GTK3 a x86_64). Zrychluje načítání souborů, zejména při spouštění programu.",
          "link": "https://www.root.cz/zpravicky/geany-1-38-uz-bez-podpory-gtk2/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-12T13:37:16.000Z",
          "wordCount": 806,
          "title": "Geany 1.38 už bez podpory GTK2",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/262/geany-1-37-1-v-gnome-3-38-1.png",
            "length": "67933",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42896",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Intel Xeony generace Sapphire Rapids přinesou jednu horkou novinku: instrukční sadu AMX, tedy další nadstavbu x86 světa, cílící tentokrát na maticové výpočty. Již tato první generace bude podporovat všechny typy instrukcí AMX (bude jich na začátku 12) a co Intel životně potřebuje, je zajištění podpory AMX v Linuxu.",
          "link": "https://www.root.cz/zpravicky/intel-pracuje-na-upravach-kodu-x86-fpu-pripravuje-jej-pro-amx/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-12T12:27:42.000Z",
          "wordCount": 3233,
          "title": "Intel pracuje na úpravách kódu x86 FPU, připravuje jej pro AMX",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/640/intel-xeon-ice-lake-1.jpg",
            "length": "45315",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42895",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Společnost Cloudflare oznámila, že o čtvrtinu rozšířila svou síť datových center, takže nyní jsou její datová centra přítomna ve 250 městech ze 100 zemí světa. Během posledních dvou let zdvojnásobila celkovou síťovou kapacitu na 100 Tbps, díky čemuž je schopna čelit i těm nejmasivnějším DDoS útokům a poskytovat svým zákazníkům rychlejší a spolehlivější služby kdekoliv na světě.",
          "link": "https://www.root.cz/zpravicky/cloudflare-rozsiril-svou-sit-datovych-center-navysil-sitovou-kapacitu-na-100-tbps/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-12T10:48:30.000Z",
          "wordCount": 895,
          "title": "Cloudflare rozšířil svou síť datových center, navýšil síťovou kapacitu na 100 Tbps",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/92/cloudflare-1.jpg",
            "length": "36223",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42894",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Windows 11 jsou na světě a do jejich aplikačního obchodu nyní Microsoft přidal preview verzi Windows Subsystem for Linux (WSL). Končí tak nutnost tuto funkcionalitu aktivovat ručně v dostupných vlastnostech operačního systému, vše lze instalovat jednoduše z Microsoft Store.",
          "link": "https://www.root.cz/zpravicky/windows-subsystem-for-linux-ve-windows-11/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-12T07:21:20.000Z",
          "wordCount": 3086,
          "title": "Windows Subsystem for Linux ve Windows 11",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/9/windows-11-1.jpg",
            "length": "41918",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42893",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "připravili jsme pro vás vylepšení, po kterém jste mnozí z vás volali, a to možnost přispět na provoz serveru Root.cz převodem z účtu. Tato možnost se vám objeví, pokud nezvolíte opakovanou platbu.",
          "link": "https://www.root.cz/zpravicky/nova-moznost-jak-podporit-server-root-cz/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-12T07:14:42.000Z",
          "wordCount": 842,
          "title": "Nová možnost, jak podpořit server Root.cz",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/154/root-cz-palec-1.jpg",
            "length": "16943",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42892",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Vývojář linuxového blokového subsystému a jeden z hlavních vývojářů IO_uring Jens Axboe pokračuje s optimalizacemi linuxového jádra pro vysoký počet I/O operací za sekundu. Používá k tomu Intel Optane Gen2 (s PCIe 4) a nově AMD Ryzen 9 5950X.",
          "link": "https://www.root.cz/zpravicky/linux-dosahuje-temer-7-milionu-iops-na-jadro/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-11T16:32:24.000Z",
          "wordCount": 1196,
          "title": "Linux dosahuje téměř 7 miliónů IOPS na jádro",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/344/tux-linux-1.jpg",
            "length": "22348",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42891",
          "author": "redakce@root.cz (Root.cz: RTsoft)",
          "description": "Dne 20. října 2021 od 18 hod pořádá firma RTsoft workshop na téma Funkcionální programování v PHP. Akce proběhne v Plzni v restauraci u Salzmannů v salónku v 1. patře. Pivo a občerstvení je zajištěno a vstup na akci je zdarma.",
          "link": "https://www.root.cz/zpravicky/it-workshop-funkcionalni-programovani-v-php/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-11T14:55:24.000Z",
          "wordCount": 772,
          "title": "IT workshop: Funkcionální programování v PHP",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/0/php-kod-1.jpg",
            "length": "142165",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42890",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Národní úřad pro kybernetickou a informační bezpečnost vydal veřejnou vyhlášku [PDF], ve které na základě zákona o kybernetické bezpečnosti stanovuje, že provozovatelé informačních systémů, které jsou klíčové pro fungování státu a bezpečí jeho obyvatel, budou muset zabezpečit své e-mailové schránky. Konkrétně jde o orgány a osoby uvedené v § 3 písm. c) až f) zákona o kybernetické bezpečnosti.",
          "link": "https://www.root.cz/zpravicky/nukib-klicove-informacni-systemy-museji-zabezpecit-e-mail-pomoci-dnssec-tls-a-dane/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-11T12:57:56.000Z",
          "wordCount": 2588,
          "title": "NÚKIB: klíčové informační systémy musejí zabezpečit e-mail pomocí DNSSEC, TLS a DANE",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/339/nukib-1.jpg",
            "length": "11849",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42889",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "O strategii v reálném čase s pixelovou grafikou The Fertile Crescent (úrodný půlměsíc) jsme tu již psali. Hra byla a je stále dostupná zdarma na itch.io. Vývojáři se před více jak měsícem rozhodli hru rozšířit a prodávat. Nedávno se objevilo demo na stránkách Steamu.",
          "link": "https://www.root.cz/zpravicky/the-fertile-crescent-bude-na-steamu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-11T08:40:12.000Z",
          "wordCount": 810,
          "title": "The Fertile Crescent bude na Steamu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/219/the-fertile-crescend-1.png",
            "length": "264409",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42888",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "V TIOBE indexu popularity programovacích jazyků, který se používá již přes 20 let, poprvé zvítězil Python a nahradil tak dvojici C a Java, která obsadila druhé a třetí místo.",
          "link": "https://www.root.cz/zpravicky/python-je-prvni-v-tiobe/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-11T07:01:12.000Z",
          "wordCount": 1996,
          "title": "Python je první v TIOBE",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/116/fustrovany-programator-1.jpg",
            "length": "53261",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42887",
          "author": "redakce@root.cz (Root.cz: vkotyk)",
          "description": "Meetup pro všechny K8s nadšence je tady!",
          "link": "https://www.root.cz/zpravicky/meetup-kubernetes-nasazeni-cloud-native-aplikaci-praha/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-11T06:45:53.000Z",
          "wordCount": 959,
          "title": "MEETUP: Kubernetes - nasazení cloud native aplikací (Praha)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/122/kubernetes-1.jpg",
            "length": "21058",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42886",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Firefox od verze 92 zobrazuje v USA kontextové doporučení „Firefox Suggests“ podle toho, co napíšete do adresního řádku. Tato doporučení mohou obsahovat i sponzorovanou reklamu přes prověřené partnery. Preferovaným partnerem je adMarketplace.",
          "link": "https://www.root.cz/zpravicky/firefox-92-zobrazuje-v-usa-kontextovou-reklamu-v-adresnim-radku/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-08T12:16:59.000Z",
          "wordCount": 6667,
          "title": "Firefox 92 zobrazuje v USA kontextovou reklamu v adresním řádku",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/274/firefox-loga-1.jpg",
            "length": "28748",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42885",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Nedávno vydaná Windows 11 mají problém s procesory AMD. Ty jsou pomalejší až o 15 %. Jeden problém je v časování vyrovnávací paměti L3, která je až 3× pomalejší. Druhý problém je v UEFI CPPC2 (collaborative power and performance), který  nepoužívá nejrychlejší jádro.",
          "link": "https://www.root.cz/zpravicky/procesory-amd-jsou-ve-windows-11-pomalejsi-az-o-15/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-08T05:42:18.000Z",
          "wordCount": 1298,
          "title": "Procesory AMD jsou ve Windows 11 pomalejší až o 15 %",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/9/windows-11-1.jpg",
            "length": "41918",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42884",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Steam Deck je linuxová přenosná herní konzole, která by měla vyjít v prosinci tohoto roku. Pokud ale rezervujete Steam Deck nyní, dostanete ho až přibližně v polovině příštího roku.",
          "link": "https://www.root.cz/zpravicky/valve-ukazuje-jak-rozebrat-steam-deck/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-08T05:12:00.000Z",
          "wordCount": 1367,
          "title": "Valve ukazuje, jak rozebrat Steam Deck",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/92/steam-deck-1.jpg",
            "length": "39877",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42883",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "24. stretnutie komunity Cloud Native – Kubernetes – ONLINE",
          "link": "https://www.root.cz/zpravicky/24-stretnutie-komunity-cloud-native-kubernetes-online/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-07T18:42:10.000Z",
          "wordCount": 873,
          "title": "24. stretnutie komunity Cloud Native – Kubernetes - ONLINE",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/122/kubernetes-1.jpg",
            "length": "21058",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42882",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Pondělní velký výpadek Facebooku vyřadil na šest hodin z provozu nejen stejnojmennou sociální síť, ale také komunikační aplikace WhatsApp a Messenger. Ty jsou přitom pro své uživatele často naprosto zásadním komunikačním nástrojem, není tedy divu, že se uživatelé rozhlíželi po náhradě. Výpadek nakonec velmi pomohl hlavně aplikacím Telegram a Signal.",
          "link": "https://www.root.cz/zpravicky/vypadek-aplikaci-whatsapp-a-messenger-privedl-miliony-uzivatelu-telegramu-a-signalu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-07T10:53:43.000Z",
          "wordCount": 6820,
          "title": "Výpadek aplikací WhatsApp a Messenger přivedl miliony uživatelů k Telegramu a Signalu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/675/telegram-1.jpg",
            "length": "35220",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42880",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Letošní ročník konference CSNOG nakonec vůbec neproběhne. Organizátoři to oznámili na mailing listu akce. Původně se mělo setkání konat online příští týden, vzhledem k nízkému zájmu o online akce a zároveň zlepšení pandemické situace bylo na poslední chvíli rozhodnuto o přesunu pod křídla chystané konference IT 21. Bohužel jsme nepostřehli, že daný termín koliduje s konferencí KKTS Olomouc, kterážto cílí na velmi blízkou cílovou skupinu.",
          "link": "https://www.root.cz/zpravicky/csnog-letos-nebude-termin-koliduje-s-kkts-olomouc/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-07T07:41:00.000Z",
          "wordCount": 853,
          "title": "CSNOG letos nebude, termín koliduje s KKTS Olomouc",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/612/csnog-2019-1.jpg",
            "length": "30848",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42879",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Společnost YubiCo začala prodávat očekávaný USB token YubiKey Bio, který disponuje čtečkou otisků prstů. Ta dovoluje celý autentizační proces potvrdit pomocí druhého faktoru, kterým je právě uživatelův otisk. Všechny ostatní tokeny stejného výrobce používají pro fyzické potvrzení akce pouze kapacitní spínač.",
          "link": "https://www.root.cz/zpravicky/yubikey-bio-se-cteckou-otisku-prstu-je-k-dispozici-za-80-a-85-eur/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-07T06:49:00.000Z",
          "wordCount": 5113,
          "title": "YubiKey Bio se čtečkou otisků prstů je k dispozici za 80 a 85 eur",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/453/yubikey-bio-1.jpg",
            "length": "35863",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42881",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Vyšel Python 3.10. Hlavní novinkou je podpora strukturálního pattern matchingu pomocí klíčových slov match a case. Mezi další vylepšení patří například srozumitelnější chybové hlášky a union type operator.",
          "link": "https://www.root.cz/zpravicky/python-3-10-se-strukturalnim-pattern-matchingem/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-07T06:45:19.000Z",
          "wordCount": 2297,
          "title": "Python 3.10 se strukturálním pattern matchingem",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/87/python-1.jpg",
            "length": "13695",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42876",
          "author": "redakce@root.cz (Root.cz: Vilém Sládek)",
          "description": "Druhá letošní konference správce české národní domény – Internet a Technologie (21.2) – se uskuteční 10. listopadu v Praze a po roční pauze bude opět prezenční. Akce, kterou pořádá CZ.NIC od roku 2008, přinese i tentokrát především přehled novinek v klíčových projektech sdružení za uplynulý rok.",
          "link": "https://www.root.cz/zpravicky/sdruzeni-cz-nic-pripravuje-na-10-listopad-podzimni-konferenci-internet-a-technologie/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-07T06:00:00.000Z",
          "wordCount": 819,
          "title": "Sdružení CZ.NIC připravuje na 10. listopad podzimní konferenci Internet a Technologie",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/579/konference-internet-a-technologie-19-1.jpg",
            "length": "52279",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "abclinuxu - aktuální články",
      "feedUrl": "http://www.abclinuxu.cz/auto/abc.rss",
      "siteUrl": "http://www.abclinuxu.cz/clanky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/clanky/key-trainings-je-openshift-tou-spravnou-volbou",
          "author": "Reklama",
          "description": "OpenShift je platforma pro provoz kontejnerů ve firemním prostředí. Usnadňuje standardizaci provozu vašich aplikací a současně zjednodušuje provoz a zvyšuje bezpečnost a spolehlivost provozu. Umožňuje vám přidělit vybraná oprávnění např. dodavatelským firmám a mít tak pod kontrolou větší část nebo celý vývojový cyklus aplikací. Současně vám přináší jednotný způsob monitoringu a sběru logů.",
          "link": "http://www.abclinuxu.cz/clanky/key-trainings-je-openshift-tou-spravnou-volbou",
          "publishedOn": "2021-10-13T22:01:00.000Z",
          "wordCount": 1429,
          "title": "KEY Trainings: Je OpenShift tou správnou volbou?"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/distribucni-novinky-38-40-2021",
          "author": "Redakce",
          "description": "Babí léto přineslo aktualizace řady více či méně specializovaných distribucí: přechod na Debian 11 v projektech Emmabuntüs DE4 nejen pro vzdělávání, Q4OS také s desktopovým prostředím Trinity, stabilní obrazy PureOS firmy Purism, dále Redo Rescue pro práci s diskovými oddíly, pokračující experimenty v EasyOS a mezi tím vším občerstvení MidnightBSD, UBports, IPFire, Tails, Feren OS či Debianu.",
          "link": "http://www.abclinuxu.cz/clanky/distribucni-novinky-38-40-2021",
          "publishedOn": "2021-10-11T22:01:00.000Z",
          "wordCount": 1885,
          "title": "Distribuční novinky 38-40/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-budovani-kyberneticky-odolne-spolecnosti",
          "author": "Redakce",
          "description": "Problémy s Wi-Fi mohou ohrozit fungování českých firem. Technologické trendy pro finanční ředitele: hyperautomatizace a inteligentní komponovaný byznys. Od pilotního projektu k produkčnímu nasazení umělé inteligence. S evidencí vandalismu pomůže umělá inteligence, řešení bude hledat Atos Hackathon. Budování kyberneticky odolné společnosti. Tiskárny během lockdownů a poté (1) Dodávky.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-budovani-kyberneticky-odolne-spolecnosti",
          "publishedOn": "2021-10-10T14:00:00.000Z",
          "wordCount": 1453,
          "title": "Týden na ITBiz: Budování kyberneticky odolné společnosti"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-40-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-40-2021",
          "publishedOn": "2021-10-08T22:01:00.000Z",
          "wordCount": 2847,
          "title": "Událo se v týdnu 40/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-supravodive-hydridy-ceru",
          "author": "Redakce",
          "description": "Světy s oceány a atmosférou z vodíku. Těžba ve vesmíru s pomocí bakterií. Panspermie v měřítku celé galaxie. Umělá inteligence pro předpověď počasí. Vylepšená uhlíková vlákna.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-supravodive-hydridy-ceru",
          "publishedOn": "2021-10-08T14:00:00.000Z",
          "wordCount": 1591,
          "title": "Týden na ScienceMag.cz: Supravodivé hydridy ceru"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/jaderne-noviny-prehled-za-zari-2021",
          "author": "Redakce",
          "description": "Přehled zářijových vydání Jaderných novin: stav vydání jádra, citáty týdne a seznam článků týkajících se jádra.",
          "link": "http://www.abclinuxu.cz/clanky/jaderne-noviny-prehled-za-zari-2021",
          "publishedOn": "2021-10-07T11:00:00.000Z",
          "wordCount": 2340,
          "title": "Jaderné noviny – přehled za září 2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-vztah-mezi-bezpecnosti-it-a-vyvojem-se-musi-zlepsit",
          "author": "Redakce",
          "description": "IBM Cloud a jeho umělá inteligence i ve vlastním datacentru. HPE představilo nové cloudové služby pro platformu HPE GreenLake. Pure nabízí Database-as-a-Service pro Kubernetes. Internet věcí nás obklopuje na každém kroku, účastníci Atos Hackathonu se naučí s ním zacházet. Vztah mezi bezpečností, IT a vývojem se musí zlepšit.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-vztah-mezi-bezpecnosti-it-a-vyvojem-se-musi-zlepsit",
          "publishedOn": "2021-10-03T22:01:00.000Z",
          "wordCount": 1380,
          "title": "Týden na ITBiz: Vztah mezi bezpečností, IT a vývojem se musí zlepšit"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-elektronika-s-elektrony-se-zapornou-hmotnosti",
          "author": "Redakce",
          "description": "Podivný model chování elektronů, kupodivu v nijak zvlášť exotických polovodičích. Zrcadlo lape vlhkost i ve vedru. Jak vůbec funguje zhroucení hvězdy? Kromě temné hmoty chybí ve vesmíru i ta běžná.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-elektronika-s-elektrony-se-zapornou-hmotnosti",
          "publishedOn": "2021-10-02T22:01:00.000Z",
          "wordCount": 1558,
          "title": "Týden na ScienceMag.cz: Elektronika s elektrony se zápornou hmotností"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/goodoffer24-dozivotni-licence-windows-10-pouze-za-12-super-slevy-az-91-2",
          "author": "Reklama",
          "description": "Stále máte šanci koupit na GoodOffer24.com doživotní licenci na Windows 10 pouze za 12  €. Buď si můžete vybrat z nabízených bundlů, nebo projet celý web GoodOffer24.com. Hlavně nezapomeňte zadat před dokončením nákupu slevový kód AX30.",
          "link": "http://www.abclinuxu.cz/clanky/goodoffer24-dozivotni-licence-windows-10-pouze-za-12-super-slevy-az-91-2",
          "publishedOn": "2021-10-02T10:00:00.000Z",
          "wordCount": 1269,
          "title": "GoodOffer24: Doživotní licence Windows 10 pouze za 12 €, super slevy až 91%!"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-39-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-39-2021",
          "publishedOn": "2021-10-01T22:01:00.000Z",
          "wordCount": 2017,
          "title": "Událo se v týdnu 39/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/distribucni-novinky-36-37-2021",
          "author": "Redakce",
          "description": "Na sklonku léta vyšel nový Whonix, podíváme se na systém pro klientské stanice ThinStation a aktualizovány byly také distribuce Finnix, Lakka, GhostBSD, Tails, Kali, Ubuntu LTS, Sailfish OS nebo Sparky Linux.",
          "link": "http://www.abclinuxu.cz/clanky/distribucni-novinky-36-37-2021",
          "publishedOn": "2021-09-29T00:00:00.000Z",
          "wordCount": 1764,
          "title": "Distribuční novinky 36-37/2021"
        }
      ]
    },
    {
      "title": "abclinuxu - čerstvé zprávičky",
      "feedUrl": "http://www.abclinuxu.cz/auto/zpravicky.rss",
      "siteUrl": "http://www.abclinuxu.cz/zpravicky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/zpravicky/kde-slavi-25-let",
          "author": "Ladislav Hagara",
          "description": "Projekt KDE slaví 25 let. Přesně před 25 lety, 14. října 1996, poslal Matthias Ettrich do diskusní skupiny comp.os.linux.misc zprávu, která započala historii projektu KDE. Důležité milníky jsou zobrazeny na časové ose.",
          "link": "http://www.abclinuxu.cz/zpravicky/kde-slavi-25-let",
          "publishedOn": "2021-10-14T03:46:53.000Z",
          "wordCount": 766,
          "title": "KDE slaví 25 let"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/openbsd-7.0",
          "author": "Ladislav Hagara",
          "description": "Bylo vydáno OpenBSD 7.0. Společně se songem The Style Hymn. Jedná se již o 51. vydání OpenBSD.",
          "link": "http://www.abclinuxu.cz/zpravicky/openbsd-7.0",
          "publishedOn": "2021-10-14T03:37:08.000Z",
          "wordCount": 745,
          "title": "OpenBSD 7.0"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/deno-1.15",
          "author": "Ladislav Hagara",
          "description": "Deno (Wikipedie), běhové prostředí (runtime) pro JavaScript a TypeScript, bylo vydáno ve verzi 1.15. Přehled novinek v poznámkách k vydání.",
          "link": "http://www.abclinuxu.cz/zpravicky/deno-1.15",
          "publishedOn": "2021-10-13T15:50:41.000Z",
          "wordCount": 749,
          "title": "Deno 1.15"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/opensilver-1.0",
          "author": "Ladislav Hagara",
          "description": "Podpora aplikační platformy Microsoft Silverlight byla včera oficiálně ukončena. Včera byl také představen OpenSilver 1.0 (GitHub). Jedná se o open source řešení umožňující spouštět Silverlight aplikace v současných webových prohlížečích s využitím WebAssembly.",
          "link": "http://www.abclinuxu.cz/zpravicky/opensilver-1.0",
          "publishedOn": "2021-10-13T15:50:03.000Z",
          "wordCount": 841,
          "title": "OpenSilver 1.0"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/gtfobins-a-lolbas",
          "author": "Ladislav Hagara",
          "description": "GTFOBins je zajímavý seznam binárních unixových příkazů a aplikací s možnostmi jejich nestandardního využití  nejenom pro CTF (Capture the Flag). Podobný seznam pro Windows je LOLBAS.",
          "link": "http://www.abclinuxu.cz/zpravicky/gtfobins-a-lolbas",
          "publishedOn": "2021-10-13T11:11:57.000Z",
          "wordCount": 758,
          "title": "GTFOBins a LOLBAS"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/zemrel-jorg-schilling-tvurce-cdrtools",
          "author": "Ladislav Hagara",
          "description": "Ve věku 66 let zemřel Jörg Schilling, známý jako tvůrce cdrtools.",
          "link": "http://www.abclinuxu.cz/zpravicky/zemrel-jorg-schilling-tvurce-cdrtools",
          "publishedOn": "2021-10-12T23:38:17.000Z",
          "wordCount": 976,
          "title": "Zemřel Jörg Schilling, tvůrce cdrtools"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/lutris-0.5.9",
          "author": "Ladislav Hagara",
          "description": "Byla vydána verze 0.5.9 klienta open source herní platformy pro Linux Lutris (Wikipedie). Přehled novinek v oznámení na Patreonu nebo na GitHubu. Zdůrazněna je podpora AMD FSR (FidelityFX Super Resolution) nebo integrace EGS (Epic Games Store).",
          "link": "http://www.abclinuxu.cz/zpravicky/lutris-0.5.9",
          "publishedOn": "2021-10-12T11:37:15.000Z",
          "wordCount": 771,
          "title": "Lutris 0.5.9"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/geany-1.38.0",
          "author": "Ladislav Hagara",
          "description": "Byla vydána nová stabilní verze 1.38.0 multiplatformního programátorského textového editoru a IDE Geany (Wikipedie). Přehled novinek v poznámkách k vydání. Odstraněna byla podpora GTK+2.",
          "link": "http://www.abclinuxu.cz/zpravicky/geany-1.38.0",
          "publishedOn": "2021-10-12T09:00:21.000Z",
          "wordCount": 1879,
          "title": "Geany 1.38.0"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/nukib-spravci-klicovych-systemu-musi-zabezpecit-sve-e-mailove-schranky",
          "author": "Ladislav Hagara",
          "description": "Správci a provozovatelé informačních systémů, které jsou klíčové pro fungování státu a bezpečí jeho obyvatel, budou muset zabezpečit své e-mailové schránky. Národní úřad pro kybernetickou a informační bezpečnost (NÚKIB) za tímto účelem vydal tzv. ochranné opatření podle zákona o kybernetické bezpečnosti. Zavedení postupů uvedených v tomto opatření je pro subjekty vyjmenované v opatření povinné.",
          "link": "http://www.abclinuxu.cz/zpravicky/nukib-spravci-klicovych-systemu-musi-zabezpecit-sve-e-mailove-schranky",
          "publishedOn": "2021-10-12T08:11:32.000Z",
          "wordCount": 2913,
          "title": "NÚKIB: Správci klíčových systémů musí zabezpečit své e-mailové schránky"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/potvrzeno-48.-mersennovo-prvocislo",
          "author": "Ladislav Hagara",
          "description": "Bylo potvrzeno, že dosud pravděpodobně 48. Mersennovo prvočíslo, M(57885161), je opravdu 48. Mersennovo prvočíslo. Na potvrzení dalších Mersennových prvočísel (49., 50. a 51.) se bude muset počkat. Musí se ověřit, že mezi nimi neexistují dosud neobjevena Mersennova prvočísla.",
          "link": "http://www.abclinuxu.cz/zpravicky/potvrzeno-48.-mersennovo-prvocislo",
          "publishedOn": "2021-10-11T20:49:08.000Z",
          "wordCount": 1326,
          "title": "Potvrzeno 48. Mersennovo prvočíslo"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=XeHPG-Tess-Geometry-Distribute",
          "author": null,
          "description": "A new feature for upcoming XeHPG graphics that was merged into Intel's open-source Linux OpenGL and Vulkan drivers today was for tessellation distribution and geometry distribution across the graphics hardware...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=XeHPG-Tess-Geometry-Distribute",
          "publishedOn": "2021-10-14T04:00:00.000Z",
          "wordCount": 799,
          "title": "Intel Linux Driver Lands Tessellation/Geometry Distribution Feature For Xe-HPG"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-rc1-Released",
          "author": null,
          "description": "Mesa 21.3 feature development is now over with the code having been branched and the first release candidate issued...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-rc1-Released",
          "publishedOn": "2021-10-13T20:26:46.000Z",
          "wordCount": 892,
          "title": "Mesa 21.3-rc1 Released With Improved Zink, Radeon Ray-Tracing, RADV NGG Culling"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Retpoline-Rewrite-Rewrite",
          "author": null,
          "description": "The Linux kernel has supported Retpolines for over three years now as part of their Spectre Variant Two mitigations while now a patch series is proposed that rewrites Retpoline's rewrite logic...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Retpoline-Rewrite-Rewrite",
          "publishedOn": "2021-10-13T18:11:04.000Z",
          "wordCount": 930,
          "title": "Linux Patches Rewrite The Retpoline Rewrite Code - Possible Performance Benefit"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=DragonFlyBSD-6.0.1-Released",
          "author": null,
          "description": "Released back in May was the shiny DragonFlyBSD 6.0 release while today a point release for it has been issued...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=DragonFlyBSD-6.0.1-Released",
          "publishedOn": "2021-10-13T17:20:35.000Z",
          "wordCount": 677,
          "title": "DragonFlyBSD 6.0.1 Released With AMD Zen 3 Temperature Monitoring, Fixes"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30600",
          "author": null,
          "description": "Today AMD is officially launching the Radeon RX 6600 graphics card as a trimmed down model from the Radeon RX 6600 XT that launched back in August. This new (non-XT) model has a suggested price of $329 USD and here is a look at how well this RDNA2 graphics card is performing under Linux.",
          "link": "https://www.phoronix.com/vr.php?view=30600",
          "publishedOn": "2021-10-13T13:00:00.000Z",
          "wordCount": 904,
          "title": "AMD Radeon RX 6600 Linux Performance"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Vulkan-1.2.196-H265-Encode",
          "author": null,
          "description": "Arriving back in April were the initial Vulkan Video extensions that included support for video decode of H.264 and H.265 while the initial video encode support was limited to H.264. Out today with Vulkan 1.2.196 is the new extension allowing for H.265 encoding with this new industry-standard video API...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Vulkan-1.2.196-H265-Encode",
          "publishedOn": "2021-10-13T11:27:41.000Z",
          "wordCount": 879,
          "title": "Vulkan 1.2.196 Introduces H.265 Encode Extension"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-Fixes-Wayland-Trans",
          "author": null,
          "description": "Landing in time for the imminent Mesa 21.3 feature freeze / code branching is support for the EGL_EXT_present_opaque extension on Wayland. While this EGL extension may not sound too exciting, for some OpenGL games on Wayland it will address some transparency issues...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-Fixes-Wayland-Trans",
          "publishedOn": "2021-10-13T11:17:28.000Z",
          "wordCount": 865,
          "title": "Mesa 21.3 Fixes Issue Of Some Games Having Transparency Issues Under Wayland"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=LoongArch-Linux-v5",
          "author": null,
          "description": "Chinese vendor Loongson continues working on their Linux kernel patches enabling the LoongArch processor ISA as their fork from MIPS. While early on when copying existing MIPS open-source code they were quick to call their new ISA \"not MIPS\", in these later patch series they continue to refer to their ISA as \"a bit like MIPS or RISC-V.\"..",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=LoongArch-Linux-v5",
          "publishedOn": "2021-10-13T09:06:01.000Z",
          "wordCount": 783,
          "title": "Loongson Volleys Latest Patches For LoongArch Linux Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=DAMON-Physical-Monitoring",
          "author": null,
          "description": "One of many exciting additions with the forthcoming Linux 5.15 kernel is DAMON landed as a data access monitoring framework. DAMON opens up new possibilities around proactive reclamation of system memory and other interesting features. Currently though it's limited to monitoring the virtual address space of the kernel but a new set of patches out allow for physical address space monitoring as well...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=DAMON-Physical-Monitoring",
          "publishedOn": "2021-10-13T07:45:20.000Z",
          "wordCount": 716,
          "title": "DAMON Extended To Offer Physical Memory Address Space Monitoring"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Red-Hat-New-2021-GPU-Developer",
          "author": null,
          "description": "Red Hat already employs numerous open-source graphics driver developers from DRM subsystem maintainer David Airlie to numerous others on his team working on areas from Mesa OpenCL support to Heterogeneous Memory Management to other user and kernel-space improvements for open-source Linux graphics. Red Hat has now put out a call to hire yet another experienced Linux GPU driver developer...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Red-Hat-New-2021-GPU-Developer",
          "publishedOn": "2021-10-12T22:36:21.000Z",
          "wordCount": 882,
          "title": "Red Hat Is Hiring Another Linux Developer To Work On GPU Hardware Enablement"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Numpy-AVX-512-Landed",
          "author": null,
          "description": "Intel has contributed AVX-512 optimizations to upstream Numpy. For those using Numpy as this leading Python library for numerical computing, newer Intel CPUs with AVX-512 capabilities can enjoy major speed-ups in the range of 14~32x faster...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Numpy-AVX-512-Landed",
          "publishedOn": "2021-10-12T18:50:12.000Z",
          "wordCount": 878,
          "title": "Intel Contributes AVX-512 Optimizations To Numpy, Yields Massive Speedups"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GNOME-Platform-Design-EO2021",
          "author": null,
          "description": "GNOME developer Allan Day has provided an update on behalf of the GNOME design time around some of their recent platform design improvements and some of the changes they are talking about in the near future...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GNOME-Platform-Design-EO2021",
          "publishedOn": "2021-10-12T18:35:07.000Z",
          "wordCount": 828,
          "title": "GNOME's Platform Design Continues Evolving From Dark Mode To Toasts"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=7.4M-IOPS-Linux-Per-Core",
          "author": null,
          "description": "Linux block subsystem maintainer and lead IO_uring developer Jens Axboe had a goal of hitting 7M IOPS per-core performance this week. On Monday he managed to already hit 7.2M IOPS and today hit 7.4M IOPS with his latest work-in-progress kernel patches...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=7.4M-IOPS-Linux-Per-Core",
          "publishedOn": "2021-10-12T18:14:43.000Z",
          "wordCount": 863,
          "title": "7.4M IOPS Achieved Per-Core With Newest Linux Patches"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=POCL-1.8-Released",
          "author": null,
          "description": "PoCL is the open-source project implementing OpenCL for CPU-based execution as well as multi-device support by getting its Portable Computing Language implementation working atop NVIDIA GPUs via CUDA, AMD GPUs via HSA, and other back-ends by way of LLVM. PoCL 1.8 is out today as the newest feature release...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=POCL-1.8-Released",
          "publishedOn": "2021-10-12T17:31:31.000Z",
          "wordCount": 780,
          "title": "Portable Computing Language 1.8 Released For OpenCL On CPUs, Other Accelerators"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30597",
          "author": null,
          "description": "Earlier this month were benchmarks looking at how Intel Tiger Lake performance has improved from Ubuntu 21.04 to Ubuntu 21.10, but how does Canonical's latest Linux offering compete with other autumn 2021 distributions? In this article from the Dell XPS Core i7-1165G7 Tiger Lake notebook are benchmarks of Ubuntu 21.10 going up against Arch Linux, Clear Linux, Fedora Workstation 35, and openSUSE Tumbleweed for getting an idea how the performance compares with this latest-generation Intel EVO notebook.",
          "link": "https://www.phoronix.com/vr.php?view=30597",
          "publishedOn": "2021-10-12T12:26:39.000Z",
          "wordCount": 903,
          "title": "Intel Tiger Lake Performance Across Five Autumn 2021 Linux Distributions"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Glibc-2.35-Removes-Intel-MPX",
          "author": null,
          "description": "Intel Memory Protection Extensions (MPX) never really took off and the Linux support has been deprecated for a while with the code elsewhere in the stack already having been removed while with the upcoming Glibc 2.35 release that GNU C Library is also flushing away its support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Glibc-2.35-Removes-Intel-MPX",
          "publishedOn": "2021-10-12T10:02:14.000Z",
          "wordCount": 762,
          "title": "Glibc 2.35 Removes The Long-Deprecated Intel MPX Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-FPU-Cleaning-For-AMX",
          "author": null,
          "description": "It's been one year now that Intel has been posting Linux kernel patches to enable AMX support for upcoming Sapphire Rapids processors. Over the past year their Linux kernel patches for enabling Advanced Matrix Extensions has gone through 11 rounds of review but that journey isn't over yet...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-FPU-Cleaning-For-AMX",
          "publishedOn": "2021-10-12T09:45:22.000Z",
          "wordCount": 861,
          "title": "Linux x86 FPU Code Getting Reworked In Preparation For Intel AMX"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Lutris-0.5.9-Released",
          "author": null,
          "description": "Lutris 0.5.9 is now available for this open-source Linux game manager program that has now added initial support for the Epic Games Store among other new options and enhancements in this new version...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Lutris-0.5.9-Released",
          "publishedOn": "2021-10-11T19:43:29.000Z",
          "wordCount": 854,
          "title": "Lutris 0.5.9 Released With Support For The Epic Games Store, New Options"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Microsoft-Windows-11-WSL-Store",
          "author": null,
          "description": "Those running Microsoft's recently released Windows 11 will now be able to find the Windows Subsystem for Linux (WSL) available from within the Microsoft Store for easier setting up of this Linux-based environment...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Microsoft-Windows-11-WSL-Store",
          "publishedOn": "2021-10-11T19:21:26.000Z",
          "wordCount": 840,
          "title": "Microsoft Publishes WSL Preview Inside the Windows 11 Store"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-DG2-64k-Pages-Flat-CCS",
          "author": null,
          "description": "While Linux 5.15 brings very early bits around DG2/Alchemist graphics card support, further work is needed to bring it into usable shape for end-users. The latest new patch series to be posted came out today with more driver changes needed around local device memory handling for DG2...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-DG2-64k-Pages-Flat-CCS",
          "publishedOn": "2021-10-11T18:53:47.000Z",
          "wordCount": 827,
          "title": "Intel Posts Latest DG2/Alchemist Linux Patches In Requiring 64K Page Size Handling"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Walmart-L3AF-eBPF",
          "author": null,
          "description": "Retail shopping giant Walmart has found use out eBPF programs and today announced the open-source L3AF to help in the effort...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Walmart-L3AF-eBPF",
          "publishedOn": "2021-10-11T18:07:50.000Z",
          "wordCount": 858,
          "title": "Walmart Pushes Open-Source L3AF To Help Out eBPF Ecosystem"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30591",
          "author": null,
          "description": "With Ubuntu 21.10 due for release this week I've been running various Ubuntu Linux performance comparisons across a variety of hardware and overall this new release is looking to be in great shape. One of the tests I recently carried out for curiosity is seeing how the AMD Zen 2 performance has evolved now over the past two years on Linux going from Ubuntu 19.10 to Ubuntu 21.10.",
          "link": "https://www.phoronix.com/vr.php?view=30591",
          "publishedOn": "2021-10-11T13:12:58.000Z",
          "wordCount": 892,
          "title": "Ubuntu 19.10 To 21.10: AMD Zen 2 + Radeon Performance On Linux Over Two Years"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Approaching-7M-IOPS",
          "author": null,
          "description": "Linux block subsystem maintainer and IO_uring lead developer Jens Axboe continues making staggering optimizations to the kernel code to squeeze out the maximum performance potential out of his shiny new system...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Approaching-7M-IOPS",
          "publishedOn": "2021-10-11T13:04:33.000Z",
          "wordCount": 907,
          "title": "More Optimizations Has Linux Approaching 7M IOPS Per Core"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Krita-5.0-Beta-2",
          "author": null,
          "description": "Krita 5.0 Beta 2 is out today as the newest test release for this very powerful, open-source digital painting program...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Krita-5.0-Beta-2",
          "publishedOn": "2021-10-11T11:15:33.000Z",
          "wordCount": 726,
          "title": "Krita 5.0 Beta 2 Reworks Its GPU Accelerated Canvas"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Yellow-Carp-Audio-Driver",
          "author": null,
          "description": "It was just with Linux 5.15 last month that AMD added a new audio driver for Van Gogh APUs sporting an ACP 5.x audio co-processor (ACP) while now a new driver has been posted for Yellow Carp / Rembrandt with it introducing new ACP 6.x audio co-processor IP...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Yellow-Carp-Audio-Driver",
          "publishedOn": "2021-10-11T09:49:39.000Z",
          "wordCount": 797,
          "title": "AMD Publishes New Linux Audio Driver Code For  Yellow Carp / ACP6x Audio Co-Processor"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=EROFS-LZMA-Compression",
          "author": null,
          "description": "The EROFS read-only file-system is adding LZMA compression support using a new header/container format called MicroLZMA...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=EROFS-LZMA-Compression",
          "publishedOn": "2021-10-11T09:28:05.000Z",
          "wordCount": 773,
          "title": "EROFS File-System Adding LZMA Compression Support Via New MicroLZMA"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-rc5-Released",
          "author": null,
          "description": "Linus Torvalds just pushed out the Linux 5.15-rc5 kernel release with things looking smooth for this stage and hopefully leading to an on-time release in just a few weeks...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-rc5-Released",
          "publishedOn": "2021-10-11T00:29:57.000Z",
          "wordCount": 727,
          "title": "Linux 5.15-rc5 Released With This Cycle Running Smoothly"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Phoronix-Test-Suite-10.6",
          "author": null,
          "description": "Phoronix Test Suite 10.6.1 was released today with various improvements for our cross-platform, open-source, fully-automated benchmarking software...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Phoronix-Test-Suite-10.6",
          "publishedOn": "2021-10-10T23:19:01.000Z",
          "wordCount": 765,
          "title": "Phoronix Test Suite 10.6 Released With Various Improvements For Linux Benchmarking"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-Tegra-Linux-5.16-NVDEC",
          "author": null,
          "description": "The Tegra DRM driver changes were sent out on Friday of the new material destined for Linux 5.16. Notable this time around is NVIDIA's NVDEC driver being included...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-Tegra-Linux-5.16-NVDEC",
          "publishedOn": "2021-10-10T10:45:54.000Z",
          "wordCount": 837,
          "title": "NVIDIA Contributing Tegra NVDEC Support To Linux 5.16"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-rc5-x86",
          "author": null,
          "description": "Sent in this morning were an urgent set of x86 updates for the Linux 5.15-rc5 kernel due out later today...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-rc5-x86",
          "publishedOn": "2021-10-10T10:00:00.000Z",
          "wordCount": 1004,
          "title": "Linux 5.15-rc5 x86 Changes Aim To Fix \"Yet Another Hardware Trainwreck\""
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=LLVM-Daily-For-Fedora",
          "author": null,
          "description": "Red Hat's Platform Tools team is making it very easy to run the very bleeding edge, development version of the LLVM toolchain and Clang compiler on the current versions of Fedora...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=LLVM-Daily-For-Fedora",
          "publishedOn": "2021-10-10T09:53:28.000Z",
          "wordCount": 804,
          "title": "Red Hat Is Making It Easy To Run Bleeding-Edge LLVM/Clang On Fedora"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-CPU-Namespace",
          "author": null,
          "description": "IBM engineer Pratik Sampat published an early prototype of a CPU namespace interface for the Linux kernel. This CPU namespace was devised to address coherency issues with current means of viewing available CPU resources as well as addressing possible security issues stemming from understanding resource access/positioning on the system...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-CPU-Namespace",
          "publishedOn": "2021-10-09T22:56:52.000Z",
          "wordCount": 1191,
          "title": "IBM Proposing A CPU Namespace For The Linux Kernel"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/rss.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2528/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2528/",
          "publishedOn": "2021-10-13T04:00:00.000Z",
          "wordCount": 187,
          "title": "Flag Map Sabotage"
        },
        {
          "id": "https://xkcd.com/2527/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2527/",
          "publishedOn": "2021-10-11T04:00:00.000Z",
          "wordCount": 187,
          "title": "New Nobel Prizes"
        },
        {
          "id": "https://xkcd.com/2526/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2526/",
          "publishedOn": "2021-10-08T04:00:00.000Z",
          "wordCount": 187,
          "title": "TSP vs TBSP"
        },
        {
          "id": "https://xkcd.com/2525/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2525/",
          "publishedOn": "2021-10-06T04:00:00.000Z",
          "wordCount": 189,
          "title": "Air Travel Packing List"
        }
      ]
    }
  ],
  "cliVersion": "1.11.2"
}