{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": [
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.2",
          "author": null,
          "description": "Fixed: unicode characters in URL caused download error\nFixed: project root npm install error\nAdded: unit test library\nChore: Dependency updates\nThank you: @CaptNo1",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.2",
          "publishedOn": "2021-09-26T18:45:39.000Z",
          "wordCount": 354,
          "title": "v1.11.2"
        },
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "author": null,
          "description": "Fixed: Unexpected nested element in author field crashes the parser\nThank you @ad-m",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "publishedOn": "2021-09-16T06:39:32.000Z",
          "wordCount": 344,
          "title": "v1.11.1"
        }
      ]
    },
    {
      "title": "Kotaku",
      "feedUrl": "https://kotaku.com/rss",
      "siteUrl": "https://kotaku.com",
      "articles": [
        {
          "id": "1847772902",
          "author": "Brian Ashcraft",
          "description": "This 2021 Tokyo Game Show, like last year’s, is an online affair. There is a teeny tiny in-person area with miniscule booths. The public is not allowed in, and even Sony doesn’t have a booth. But you know who does? Ikea. \n\nRead more...",
          "link": "https://kotaku.com/ikea-is-serious-enough-to-attend-japans-biggest-gaming-1847772902",
          "publishedOn": "2021-09-30T09:30:00.000Z",
          "wordCount": 484,
          "title": "Ikea Is Serious Enough To Attend Japan's Biggest Gaming Expo"
        },
        {
          "id": "1847768613",
          "author": "Ian Walker",
          "description": "When King of Fighters XV comes to PlayStation 4, PlayStation 5, Xbox Series X/S, and PC on February 14, it’ll do so with a bevy of characters, including all four heroes from past sagas of the decades-long storyline, long-dead fighters revived by the events of the previous game, and a pair of very cool-looking…\nRead more...",
          "link": "https://kotaku.com/king-of-fighters-xv-director-dishes-on-the-series-new-1847768613",
          "publishedOn": "2021-09-30T04:50:00.000Z",
          "wordCount": 1043,
          "title": "King Of Fighters XV Director Dishes On The Series' New, Possibly Best Girl"
        },
        {
          "id": "1847771572",
          "author": "Jeremy Winslow",
          "description": "Following news that Activision Blizzard plans to settle the U.S. Equal Employment Opportunity Commission’s (EEOC) complaint for just $18 million, workers at a labor union say it doesn’t do enough to curb “corporate bad actors.”\nRead more...",
          "link": "https://kotaku.com/labor-union-suggests-18m-activision-blizzard-settlemen-1847771572",
          "publishedOn": "2021-09-29T23:40:00.000Z",
          "wordCount": 648,
          "title": "Labor Union Suggests $18M Activision Blizzard Settlement Akin To Pennies"
        },
        {
          "id": "1847771280",
          "author": "Ethan Gach",
          "description": "For years, reports have alleged that Nintendo is working on a more powerful Switch, and for years, it has yet to come true. Instead of releasing a Switch Pro with 4K graphics this year as was rumored, Nintendo announced in July it would simply take the current version and slap an OLED screen on it. So what happened to…\nRead more...",
          "link": "https://kotaku.com/report-games-in-the-works-for-4k-nintendo-console-that-1847771280",
          "publishedOn": "2021-09-29T22:50:00.000Z",
          "wordCount": 759,
          "title": "Report: Games In The Works For 4K Nintendo Console That Doesn't Officially Exist [Update]"
        },
        {
          "id": "1847770886",
          "author": "Isaiah Colbert",
          "description": "Not many hero’s journey games lean into the journey part occurring from the back seat of a convertible, where you talk about how you had a crush on your best friend while their partner drives, but then, Get in the Car, Loser! isn’t afraid to get awkward, while also gaying up the place with all the style and grace that…\nRead more...",
          "link": "https://kotaku.com/gay-road-trip-rpgs-are-a-thing-now-and-im-into-it-1847770886",
          "publishedOn": "2021-09-29T22:00:00.000Z",
          "wordCount": 1357,
          "title": "Gay Road Trip RPGs Are A Thing Now, And I'm Into It"
        },
        {
          "id": "1847770792",
          "author": "Ari Notis",
          "description": "Everyone loves a redemption story. Outriders, a third-person loot-shooter released earlier this year, seemed poised for a good one. Like many online-only games, it launched with a raft of problems, obscuring the fact that under all the disconnects and server failures was a pretty solid game. Many of those woes…\nRead more...",
          "link": "https://kotaku.com/outriders-six-months-later-meh-1847770792",
          "publishedOn": "2021-09-29T21:45:00.000Z",
          "wordCount": 1567,
          "title": "Outriders, Six Months Later: Meh"
        },
        {
          "id": "1847770424",
          "author": "Ian Walker",
          "description": "Final Fantasy XIV is a wonderful game, with a compelling storyline and gameplay mechanics that transcend the MMO genre. But for the last few weeks, the excitement of logging into my account and working on quests has been coupled with the dread of again coming face-to-face with a banner advertising a super expensive,…\nRead more...",
          "link": "https://kotaku.com/creepy-final-fantasy-xiv-doll-costs-1-000-but-the-nigh-1847770424",
          "publishedOn": "2021-09-29T21:05:00.000Z",
          "wordCount": 478,
          "title": "Creepy Final Fantasy XIV Doll Costs $1,000 But The Nightmares Are Free"
        },
        {
          "id": "1847770447",
          "author": "Sisi Jiang",
          "description": "Brian Matt, the original announcer for the Super Monkey Ball series, will apparently not be heard in Super Monkey Ball Banana Mania, despite the new release being effectively a remake of the first two games. Today, Sega claimed that Matt was never even involved in the development of the latest Super Monkey Ball, a…\nRead more...",
          "link": "https://kotaku.com/sega-drops-series-monkey-ball-announcer-who-claims-dis-1847770447",
          "publishedOn": "2021-09-29T20:40:00.000Z",
          "wordCount": 621,
          "title": "Sega Drops Series Monkey Ball Announcer, Who Claims Discrimination"
        },
        {
          "id": "1847768949",
          "author": "Jeremy Winslow",
          "description": "Details about Marvel’s Spider-Man 2, Insomniac Games’ webslinging sequel first revealed during the September PlayStation showcase, are still scarce. However, Marvel Entertainment’s creative vice president Bill Rosemann gave us a juicy morsel to chew on: the superhero game will kind of feel like Star Wars: The Empire…\nRead more...",
          "link": "https://kotaku.com/the-next-spider-man-game-will-be-darker-like-empire-st-1847768949",
          "publishedOn": "2021-09-29T18:10:00.000Z",
          "wordCount": 588,
          "title": "The Next Spider-Man Game Will Be Darker, Like Empire Strikes Back"
        },
        {
          "id": "1847768695",
          "author": "Renata Price",
          "description": "Today, high-profile DOTA 2 team Team Aster announced via a Weibo post that several members of the team had tested positive for Covid-19, including three players. This news comes just eight days before the beginning of DOTA 2’s $40 million tournament, The International, which is scheduled for October 7, 2021.\n\nRead more...",
          "link": "https://kotaku.com/yikes-top-dota-2-team-gets-covid-a-week-before-40m-to-1847768695",
          "publishedOn": "2021-09-29T17:45:00.000Z",
          "wordCount": 450,
          "title": "Yikes, Top DOTA 2 Team Gets Covid A Week Before $40M Tourney"
        },
        {
          "id": "1847768506",
          "author": "Sisi Jiang",
          "description": "Genshin Impact’s one-year anniversary is underway, but not all players are finding it a cause for celebration. For anyone familiar with the game’s community on social media or who follows some of its biggest streamers, it’s been impossible to escape players’ complaints about the anniversary rewards. After first review…\nRead more...",
          "link": "https://kotaku.com/ticked-off-genshin-impact-players-go-on-review-bomb-spr-1847768506",
          "publishedOn": "2021-09-29T17:30:00.000Z",
          "wordCount": 610,
          "title": "Ticked Off Genshin Impact Players Go On Review-Bomb Spree"
        },
        {
          "id": "1847767761",
          "author": "Mike Fahey",
          "description": "Amazon’s New World has launched, and as with many a massively multiplayer online role-playing game, it launched with some pretty annoying bugs. Bugs like being told you have to wait a week for your character to respawn after dying or, on the other end of the mortality spectrum, your character suddenly becoming…\nRead more...",
          "link": "https://kotaku.com/amazon-mmo-new-world-bugs-7-day-respawn-timers-immort-1847767761",
          "publishedOn": "2021-09-29T16:00:00.000Z",
          "wordCount": 739,
          "title": "Amazon MMO New World Bugs: 7-Day Respawn Timers, Immortality"
        },
        {
          "id": "1847767245",
          "author": "Renata Price",
          "description": "No, you cannot name yourself Jeff Bezos or any variant thereof in Amazon’s recently released and incredibly messy Massively Multiplayer Online Colonization Simulator, The New World. This is unsurprising given the extremely fragile egos of the most powerful men on earth.\n\nRead more...",
          "link": "https://kotaku.com/amazon-s-new-world-mmo-won-t-let-you-name-yourself-jeff-1847767245",
          "publishedOn": "2021-09-29T15:15:00.000Z",
          "wordCount": 470,
          "title": "Amazon’s New World MMO Won’t Let You Name Yourself Jeff Bezos"
        },
        {
          "id": "1847766918",
          "author": "Ethan Gach",
          "description": "Live sex cam site Chaturbate recently announced that its streaming platform will now support certain pre-approved video games, and is calling on developers to give their permission to add more to that growing list. Honestly, it was only a matter of time.\n\nRead more...",
          "link": "https://kotaku.com/watch-out-twitch-porn-site-chaturbate-now-lets-models-1847766918",
          "publishedOn": "2021-09-29T14:45:00.000Z",
          "wordCount": 459,
          "title": "Watch Out Twitch, Porn Site Chaturbate Now Lets Models Stream Video Games"
        },
        {
          "id": "1847766632",
          "author": "Ari Notis",
          "description": "When it comes to cool feats in The Legend of Zelda: Breath of the Wild, you probably think you’ve seen it all. You’ve caught the speedrunners and Korok seed completionists. You’ve seen someone, or perhaps many someones, run essentially naked up to Calamity Ganon’s throne and defeat him effortlessly. But hold on there,…\nRead more...",
          "link": "https://kotaku.com/breath-of-the-wild-player-completes-amazing-minimalist-1847766632",
          "publishedOn": "2021-09-29T14:20:00.000Z",
          "wordCount": 750,
          "title": "Breath Of The Wild Player Completes Amazing ‘Minimalist’ Run In Five Hours"
        },
        {
          "id": "1847765623",
          "author": "Brian Ashcraft",
          "description": "On Wednesday, the editorial department of Big Comic announced that Takao Saito passed away on September 24 from pancreatic cancer. He was 84.\nRead more...",
          "link": "https://kotaku.com/takao-saito-creator-of-golgo-13-dies-at-84-1847765623",
          "publishedOn": "2021-09-29T09:30:00.000Z",
          "wordCount": 620,
          "title": "Takao Saito, Creator Of Golgo 13, Dies At 84"
        },
        {
          "id": "1847764946",
          "author": "Alexandra Hall",
          "description": "You know what my grandmother used to say? “That blasted Game Boy of yours, it’s too damn big!” She was right, the old woman was wise. And if this fictional gram were alive today maybe she’d smile upon hearing word of Thumby, a very, very small Game Boy-like device that launched a Kickstarter today. (Of course, she’d…\nRead more...",
          "link": "https://kotaku.com/a-playable-game-boy-for-ants-1847764946",
          "publishedOn": "2021-09-29T03:05:00.000Z",
          "wordCount": 621,
          "title": "A (Playable) Game Boy For Ants"
        },
        {
          "id": "1847763973",
          "author": "Jeremy Winslow",
          "description": "Streaming giant Netflix has acquired Night School Studio, a developer founded by former Telltale Games employees that released Oxenfree, an intriguing supernatural mystery game, and Afterparty, a barhopping comedy journey through Hell. Though now a Netflix subsidiary, Night School Studio confirmed that Oxenfree 2‘s…\nRead more...",
          "link": "https://kotaku.com/netflix-acquires-oxenfree-dev-as-its-first-game-studio-1847763973",
          "publishedOn": "2021-09-28T22:45:00.000Z",
          "wordCount": 490,
          "title": "Netflix Acquires Oxenfree Dev As Its First Game Studio"
        },
        {
          "id": "1847763621",
          "author": "Ian Walker",
          "description": "Amazon’s new massively multiplayer online role-playing game New World opened its doors earlier today, reaching a peak of over 700,000 players. That said, not even Jeff Bezos’ piggy bank has kept the MMO’s grand debut from being plagued with the usual launch day woes, including ridiculous wait times to just play the…\nRead more...",
          "link": "https://kotaku.com/new-world-players-face-massive-queues-wait-times-on-ov-1847763621",
          "publishedOn": "2021-09-28T21:50:00.000Z",
          "wordCount": 569,
          "title": "New World Players Face Massive Queues, Wait Times On Overloaded Servers"
        },
        {
          "id": "1847762409",
          "author": "Ethan Gach",
          "description": "Deathloop has some of Arkane Studios’ biggest, most kinetic-feeling levels to date. Yes, they’re beautiful to behold, and a joy to traverse, but their best quality may be a little more subtle. They’ve proven to be perfect laboratories for players to experiment with ever more dastardly and amusing ways to kill…\nRead more...",
          "link": "https://kotaku.com/look-at-all-the-ways-you-can-kill-people-in-deathloop-1847762409",
          "publishedOn": "2021-09-28T20:45:00.000Z",
          "wordCount": 531,
          "title": "Look At All The Ways You Can Kill People In Deathloop"
        },
        {
          "id": "1847762964",
          "author": "Ari Notis",
          "description": "Death’s Door, an isometric dungeon-crawler that came out for PC and Xbox earlier this year, is a master class in elegant game design. Nowhere is that more apparent than in one late-game boss fight. In pretty much every way—visually, thematically, mechanically, musically—the bout is a tour de force. I cannot stop…\nRead more...",
          "link": "https://kotaku.com/the-boss-fight-that-proves-death-s-door-is-on-another-l-1847762964",
          "publishedOn": "2021-09-28T20:30:00.000Z",
          "wordCount": 1009,
          "title": "The Boss Fight That Proves Death’s Door Is On Another Level"
        },
        {
          "id": "1847762677",
          "author": "Sisi Jiang",
          "description": "The Neopets developers recently revealed on their website that they are creating NFTs for over twenty thousand customized pets, all in partnership with several blockchain companies. So far, the public response from past and present community members has been overwhelmingly negative. \nRead more...",
          "link": "https://kotaku.com/how-dare-neopets-taint-my-childhood-with-nfts-1847762677",
          "publishedOn": "2021-09-28T20:15:00.000Z",
          "wordCount": 1107,
          "title": "How Dare Neopets Taint My Childhood With NFTs"
        },
        {
          "id": "1847762599",
          "author": "Renata Price",
          "description": "When I meet the mask crafter for the first time, I am unsure if I am touching a spirit, god, or machine. The machinists, whose ranks I plan to join today, would probably dismiss the distinction altogether. As I remember this, my hoverbike Simoon purrs outside the tent. She has been a good teacher.\nRead more...",
          "link": "https://kotaku.com/sable-the-kotaku-review-1847762599",
          "publishedOn": "2021-09-28T20:00:00.000Z",
          "wordCount": 1888,
          "title": "Sable: The Kotaku Review"
        },
        {
          "id": "1847761702",
          "author": "Ian Walker",
          "description": "Nigel Thornberry, patriarch of the eponymously wild Thornberrys, is one of the weirdest characters in Nickelodeon All-Star Brawl. Earlier today, the developers behind this cartoony platform fighter released a breakdown of the nature documentarian’s moveset, which includes one very big homage to the undisputed king of…\nRead more...",
          "link": "https://kotaku.com/nick-fighting-game-gives-nigel-thornberry-jigglypuff-s-1847761702",
          "publishedOn": "2021-09-28T18:30:00.000Z",
          "wordCount": 554,
          "title": "Nick Fighting Game Gives Nigel Thornberry Jigglypuff’s Rest From Smash"
        },
        {
          "id": "1847761302",
          "author": "Jeremy Winslow",
          "description": "Developer 1047 Games has rolled out a massive update for its popular Portal shooter Splitgate. The patch introduces several quality-of-life improvements and bug fixes, as well as adding two important adjustments to make the game a little easier to play: the option to change the armor color of friends and foes, and the…\nRead more...",
          "link": "https://kotaku.com/splitgates-big-update-mantling-plus-other-quality-of-1847761302",
          "publishedOn": "2021-09-28T18:00:00.000Z",
          "wordCount": 552,
          "title": "Splitgate's Big Update: Mantling, Plus Other Quality Of Life Tweaks"
        }
      ]
    },
    {
      "title": "Nintendo Life | Latest Updates",
      "feedUrl": "https://www.nintendolife.com/feeds/latest",
      "siteUrl": "https://www.nintendolife.com/feeds/latest",
      "articles": [
        {
          "id": "https://www.nintendolife.com/#article-121633",
          "author": null,
          "description": "\"This is not a story for good boys and girls\".\nPublisher No Gravity Games and developer Creepy Brothers have announced that Creepy Tale 2, a point and click adventure that's sure to bring some scares along for the ride, will spook the Switch eShop on 7th October.\nUnsurprisingly a sequel to the original Creepy Tale, already available on Switch, Creepy Tale 2 has you taking on the role of a young boy who must solve puzzles to progress the story and save his sibling. The official synopsis paints a petrifying picture:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/creepy_tale_2_brings_point_and_click_terror_to_switch_in_time_for_halloween",
          "publishedOn": "2021-09-30T09:30:00.000Z",
          "wordCount": 867,
          "title": "Creepy Tale 2 Brings Point & Click Terror To Switch In Time For Halloween"
        },
        {
          "id": "https://www.nintendolife.com/#article-121632",
          "author": null,
          "description": "Here's the launch trailer!\nLaunching today on Nintendo Switch is Astria Ascending, a JRPG developed by indie team Artisan Studios and a host of renowned Final Fantasy veterans.\nSaid to be \"an epic adventure with the charm and pedigree of a classic JRPG\", Astria Ascending has players taking control of the Demigods, a crew of eight heroes charged with the fate of the world. Each of these characters has their own story to discover told across five cities, 25 dungeons, and an expected 30-50 hours of gameplay.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/astria_ascending_a_jrpg_from_final_fantasy_veterans_launches_today_on_switch",
          "publishedOn": "2021-09-30T09:00:00.000Z",
          "wordCount": 1121,
          "title": "Astria Ascending, A JRPG From Final Fantasy Veterans, Launches Today On Switch"
        },
        {
          "id": "https://www.nintendolife.com/#article-121625",
          "author": null,
          "description": "Available from the eShop.\n\nThis week's Arcade Archives release from Hamster is Typhoon Gal / Onna Sanshirou. It was originally an action beat 'em up game released by Taito in 1985. Here's some PR and screenshots:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/taito_beat_em_up_typhoon_gal_joins_hamsters_arcade_archives_on_switch",
          "publishedOn": "2021-09-30T06:30:00.000Z",
          "wordCount": 1013,
          "title": "Taito Beat 'Em Up Typhoon Gal Joins Hamster's Arcade Archives On Switch"
        },
        {
          "id": "https://www.nintendolife.com/#article-121623",
          "author": null,
          "description": "He apparently hasn't been involved with the series for \"some time\".\n\nThe original Super Monkey Ball announcer, Brian Matt - who seemingly teased Super Monkey Ball Banana Mania and his own return to the role last June - is not featured in the new game's credits.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/super_monkey_balls_original_announcer_did_not_work_on_the_new_game_according_to_sega",
          "publishedOn": "2021-09-30T05:30:00.000Z",
          "wordCount": 1365,
          "title": "Super Monkey Ball's Original Announcer Did Not Work On The New Game, According To Sega"
        },
        {
          "id": "https://www.nintendolife.com/#article-121622",
          "author": null,
          "description": "Start your engines in 2022.\n\nIf you are keen on arcade-style racing games and are tired of waiting for Nintendo to release a new Mario Kart game, then Square Enix's Chocobo GP might be worth a look when it arrives next year exclusively on the Switch.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/video_heres_another_look_at_square_enixs_new_racing_game_chocobo_gp",
          "publishedOn": "2021-09-30T02:30:00.000Z",
          "wordCount": 1405,
          "title": "Video: Here's Another Look At Square Enix's New Racing Game Chocobo GP"
        },
        {
          "id": "https://www.nintendolife.com/#article-121619",
          "author": null,
          "description": "Weapon changes, fixes and more.\nAlthough Splatoon 3 is just around the corner, Nintendo is still committed to providing Splatoon 2 updates.\nThe latest one - Version 5.5.0 is actually quite a large update. There are changes to multiplayer, including weapon changes and also a number of fixes. There are some \"other changes\" tied to the previous update, too.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/splatoon_2_version_5_5_0_is_now_live_here_are_the_full_patch_notes",
          "publishedOn": "2021-09-30T01:05:00.000Z",
          "wordCount": 1297,
          "title": "Splatoon 2 Version 5.5.0 Is Now Live, Here Are The Full Patch Notes"
        },
        {
          "id": "https://www.nintendolife.com/#article-121618",
          "author": null,
          "description": "Update: Nintendo says Bloomberg's report about a 4K dev kit is false.\nUpdate: Nintendo has now responded to Bloomberg's report, claiming it's \"not true\". Here is the full statement:\n\n\"A news report on Sept. 30, 2021 falsely claims that Nintendo is supplying tools to drive game development for a Nintendo Switch with 4K support. To ensure correct understanding among our investors and customers, we want to clarify that this report is not true.\"\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/rumour_developers_have_reportedly_been_working_on_4k_switch_games",
          "publishedOn": "2021-09-30T00:30:00.000Z",
          "wordCount": 7484,
          "title": "Rumour: Developers Have Reportedly Been Working On \"4K Switch Games\""
        },
        {
          "id": "https://www.nintendolife.com/#article-121606",
          "author": null,
          "description": "Sam & Max! Unavowed! Thimbleweed Park! More!\n\nThere's been an interesting trend of smaller developers and publishers teaming up on shared promotions, and another to emerge this week is The Point & Click Sale on Switch eShop. It's live now and a group of 10 games in the genre are on discount, running until 6th October at 8am Pacific / 11am Eastern / 4pm UK / 5pm CEST.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/the_point_and_click_sale_discounts_10_games_on_switch",
          "publishedOn": "2021-09-29T20:30:00.000Z",
          "wordCount": 1669,
          "title": "The Point & Click Sale Discounts 10 Games On Switch"
        },
        {
          "id": "https://www.nintendolife.com/#article-121611",
          "author": null,
          "description": "\"You can definitely tell that it's new and different\".\nFollowing on from the world-first Nintendo Switch OLED unboxing, and then the first Nintendo Switch / OLED comparison, we've now got Nintendo's own \"official\" unboxing of the new model, courtesy of Nintendo Minute's Kit and Krysta.\nObviously, this isn't the unboxing you should watch if you want an unbiased review, but it's pretty professional all the same, albeit basically a glorified press release. The hosts take out the screen and the Joy-Cons, commenting on the screen going \"all the way to the edge\" and how \"different\" it is, making sure to mention that the OLED is \"bright\".\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/another_oled_unboxing_has_surfaced_-_and_this_ones_from_nintendo",
          "publishedOn": "2021-09-29T20:00:00.000Z",
          "wordCount": 1542,
          "title": "Another OLED Unboxing Has Surfaced - And This One's From Nintendo"
        },
        {
          "id": "https://www.nintendolife.com/#article-121473",
          "author": null,
          "description": "Hellish.\nWe're pretty big fans of the Darksiders franchise here at Nintendo Life. These games may pilfer their core mechanics from all over the shop, and make no attempt to hide the fact in the process, but they're pure comfort food; cosy, familiar, resolutely old-fashioned in how they go about their business, and for the most part a lot of easy-breezy fun to boot.\nFirst released to fairly average reviews back in 2018, Darksiders III sees the series stripped back to its basics, removing a lot of the faff introduced in part two for a much more streamlined and basic affair. You'll do combat with all manner of demonic beasties, solve a bunch of pretty simple puzzles, take on some bosses and engage in light platforming action — there are absolutely no surprises in store here. It's the very epitome of a safe, straightforward adventure that serves up exactly what fans of the series will likely expect, a light-hearted action adventure with plenty of character in the form of its sassy cast of Horsemen and demons.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/reviews/nintendo-switch/darksiders_iii",
          "publishedOn": "2021-09-29T19:00:00.000Z",
          "wordCount": 4248,
          "title": "Review: Darksiders III - A Poor Switch Port Of A Distinctly Average Series Entry"
        },
        {
          "id": "https://www.nintendolife.com/#article-121600",
          "author": null,
          "description": "Sale ends this weekend.\nNintendo and Capcom have kicked off a special Monster Hunter franchise sale across Switch and 3DS, discounting several games and DLC items.\nAll deals listed below will remain live on the Switch and 3DS eShops until 11:59pm PT on 3rd October, falling in line with the current Nintendo Blockbuster sale which is currently offering more than 300 games at discounted prices.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/nintendos_monster_hunter_sale_discounts_five_games_and_lots_of_rise_dlc",
          "publishedOn": "2021-09-29T18:00:00.000Z",
          "wordCount": 1583,
          "title": "Nintendo's Monster Hunter Sale Discounts Five Games And Lots Of Rise DLC"
        },
        {
          "id": "https://www.nintendolife.com/#article-121604",
          "author": null,
          "description": "Learn new abilities and movements from collected critters.\nNot every Metroidvania successfully stands out from the crowd on Switch, but Sheepo hopes to do so courtesy of a rather neat mechanic for 'upgrading' your character.\nThe idea is that you're trying to discover and preserve varied creatures on a dying planet, and in the process inherit their abilities. The story is quite bonkers, which can often be a good thing.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/sheepo_is_a_cute_creature-collecting_metroidvania_out_soon",
          "publishedOn": "2021-09-29T17:30:00.000Z",
          "wordCount": 1019,
          "title": "Sheepo Is A Cute Creature-Collecting Metroidvania, Out Soon"
        },
        {
          "id": "https://www.nintendolife.com/#article-121580",
          "author": null,
          "description": "There's a correct answer.\n\nAmong all the talk of big games coming up, the imminent double release of Metroid Dread and the OLED Switch model, we like to consider the big questions here at Nintendo Life. Stuff that matters.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/poll_do_you_use_the_black_or_white_theme_on_your_nintendo_switch",
          "publishedOn": "2021-09-29T17:00:00.000Z",
          "wordCount": 5606,
          "title": "Poll: Do You Use The Black Or White Theme On Your Nintendo Switch?"
        },
        {
          "id": "https://www.nintendolife.com/#article-121598",
          "author": null,
          "description": "A hint for the last fighter? Nah, probably not.\nNext week is a big one for Super Smash Bros. Ultimate, with Masahiro Sakurai to host a showcase to unveil the final fighter for the game on 5th October. It's been a long road.\nBefore that, however, regular players have a themed online tournament to tackle, so far confirmed on the game's Japanese account with localised messages likely to be on the way.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/smash_bros_ultimates_upcoming_tournament_event_is_winged_characters_only",
          "publishedOn": "2021-09-29T16:30:00.000Z",
          "wordCount": 932,
          "title": "Smash Bros. Ultimate's Upcoming Tournament Event Is Winged Characters Only"
        },
        {
          "id": "https://www.nintendolife.com/#article-120755",
          "author": null,
          "description": "\"I really love bananas!\" - AiAi.\nSuper Monkey Ball is an incredibly simple idea: poor little monkeys are trapped in air-tight balls. They can probably breathe but it isn't specified, and all you have to do is roll them to the goal. Yet somehow the original two games and the expanded Deluxe compilation managed to take that premise and mould it into one of the greatest games we've ever played. Everything was polished to a shimmering gleam. The stage design, the visual and audio feedback and most importantly how it feels to move in 3D space. Every single one of those points is something the series has severely struggled with since. It's come close to hitting the beats of greatness but more often than not it's hitting incredibly low lows.\nHow is such a simple idea repeatedly executed so poorly? It all comes down to the engine. Everything worked exactly as you'd expect on GameCube, so much so that finishing the game in a linear fashion is more like the tutorial. The meta of Monkey Ball is exploiting the stages — moving the Monkey in ways the developer likely never even intended. Check out a few speed runs if you haven't before, the things people can do in these games is bananas. This also extends to the party games which may seem like completely different experiences but whether you're playing Billiards or flying through the sky in Monkey Target, the importance of physics and momentum is still at the forefront of the experience.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/reviews/nintendo-switch/super_monkey_ball_banana_mania",
          "publishedOn": "2021-09-29T16:00:00.000Z",
          "wordCount": 7174,
          "title": "Review: Super Monkey Ball Banana Mania - Feature-Packed, But Far From Top Banana"
        },
        {
          "id": "https://www.nintendolife.com/#article-121599",
          "author": null,
          "description": "As of March 2021.\nNintendo has revealed that, as of March 2021, the Donkey Kong series of games have sold a whopping 65 million units worldwide.\nYou probably know the story by now, but Donkey Kong was first brought to life by none other than Shigeru Miyamoto back in 1981, when the very first game in the series hit arcades. The game saw Jumpman, who would later go on to become Mario, climbing a construction site to save Pauline from Donkey Kong himself – yes, DK wasn't always the lovable gorilla we see today.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/the_donkey_kong_series_has_surpassed_65_million_sales_worldwide",
          "publishedOn": "2021-09-29T15:00:00.000Z",
          "wordCount": 3230,
          "title": "The Donkey Kong Series Has Surpassed 65 Million Sales Worldwide"
        },
        {
          "id": "https://www.nintendolife.com/#article-121591",
          "author": null,
          "description": "A slight delay to fix leaderboards.\nToy Soldiers HD is an upcoming release that has had a few date changes, and now Accelerate Games & Signal Studios Family has pinned down 21st October for its arrival. It's a re-release of an action / strategy hybrid that has given plenty of players fond memories, with this version throwing in all of the DLC of the original version.\nAs you can see in the walkthrough video above, it looks like it does a nice job of swapping between strategic views and some first-person action, all with the toy-like vibes you'd expect.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/toy_soldiers_hd_brings_its_action_strategy_blend_to_switch_in_october",
          "publishedOn": "2021-09-29T14:30:00.000Z",
          "wordCount": 948,
          "title": "Toy Soldiers HD Brings Its Action Strategy Blend To Switch In October"
        },
        {
          "id": "https://www.nintendolife.com/#article-121573",
          "author": null,
          "description": "And pre-orders are live.\nATLUS has shared the latest trailer for Shin Megami Tensei V, giving us our first listen of the English dub and revealing the voice talent featured in the game.\nThe game, which launches both digitally and physically on Switch on 12th November, will have you exploring the expansive world of post-apocalyptic Tokyo. You'll bump into a wide cast of characters along the way, so let's go ahead and meet them:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/heres_shin_megami_tensei_vs_first_english_dub_trailer_and_cast_list",
          "publishedOn": "2021-09-29T14:00:00.000Z",
          "wordCount": 2138,
          "title": "Here's Shin Megami Tensei V's First English Dub Trailer And Cast List"
        },
        {
          "id": "https://www.nintendolife.com/#article-121593",
          "author": null,
          "description": "Ready to revisit Inkopolis?\nThis year's flying by at a terrifying pace, but 2022 still somehow feels forever away, no doubt thanks to the fact that Splatoon 3 launches next year and we can't wait to see it in the sticky squid-like flesh.\nWe're pretty thankful, then, that Nintendo has continued to drip-feed us new info on the game over on social media; yesterday we were treated to a look at 'Eeltail Alley' and that super cool Crab Tank weapon, and today we're learning all about Inkopolis' Museum d'Alfonsino and two special weapons.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/heres_a_closer_look_at_splatoon_3s_museum_and_weapons_including_the_ninja-like_zipcaster",
          "publishedOn": "2021-09-29T13:30:00.000Z",
          "wordCount": 1221,
          "title": "Here's A Closer Look At Splatoon 3's Museum And Weapons, Including The Ninja-Like Zipcaster"
        },
        {
          "id": "https://www.nintendolife.com/#article-95657",
          "author": null,
          "description": "The top 50 N64 games ever, as ranked by you.\nIn celebration of this mighty 64-bit console's 25th anniversary (in North America, following the Japanese anniversary back in June), we're republishing this reader-ranked list of the top 50 Nintendo 64 games ever. As with all our Top 50 library lists, this ranking is is based on User Ratings in the Nintendo Life games database and is subject to fluctuation, even after publication!\nSo, if you haven't rated your favourite N64 games, feel free to exert your influence and potentially switch up the order of the games below. You can also now check out our reader-ranked list of all the N64 games coming to Nintendo Switch Online in October, too. Enjoy!\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/guides/best-nintendo-64-games",
          "publishedOn": "2021-09-29T13:00:00.000Z",
          "wordCount": 12774,
          "title": "Guide: Best Nintendo 64 Games"
        },
        {
          "id": "https://www.nintendolife.com/#article-121592",
          "author": null,
          "description": "\"I’m the only one who knows how to make this movie work script wise\".\nLast week, Nintendo finally lifted the lid on the cast for the upcoming Super Mario movie, with Chris Pratt's casting as Mario raising a few eyebrows.\nAs you might expect, John Leguizamo - who played Luigi in the 1993 live-action Mario movie – has some words to say about this topic, too. Taking to Twitter, Leguizamo hit out at the lack of variety when it came to the main cast while celebrating the \"groundbreaking colour-blind casting\" of the 1993 version (which he incorrectly says is the 'original', which seems to suggest he thinks this new film is a reboot). He then adds that he's the \"only one who knows how to make this movie work\" in terms of script.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/former_mario_movie_star_john_leguizamo_isnt_happy_with_the_casting_on_the_new_film",
          "publishedOn": "2021-09-29T12:45:00.000Z",
          "wordCount": 7941,
          "title": "Former Mario Movie Star John Leguizamo Isn't Happy With The Casting On The New Film"
        },
        {
          "id": "https://www.nintendolife.com/#article-121587",
          "author": null,
          "description": "What music they make!\n\nThis year marks Castlevania's 35th birthday, and Konami is celebrating the occasion with a lavish 26-disc music collection. The catch? It's exclusive to Japan at present and costs an eye-watering 28,600 Yen ($256 / £190).\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/konami_celebrates_castlevanias_35th_with_a_26-disc_music_collection_that_costs_usd250",
          "publishedOn": "2021-09-29T12:30:00.000Z",
          "wordCount": 1439,
          "title": "Konami Celebrates Castlevania's 35th With A 26-Disc Music Collection That Costs $250"
        },
        {
          "id": "https://www.nintendolife.com/#article-121579",
          "author": null,
          "description": "Due for release this Fall.\nWhat's old is new, which is no bad thing when retro-style games combine treasured old gameplay styles with flashy modern visuals. We've seen a steady flow of 3D platformers in that vein over recent years, bringing to mind classics but in lovely HD.\nAnother making its pitch in this genre is Kukoos - Lost Pets, developed by Brazilian studio PetitFabrik and apparently 'coming soon' this Autumn / Fall. You can check it out in the trailer above and some PR blurb below:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/kukoos_-_lost_pets_is_a_colourful_3d_platformer_inspired_by_the_nintendo_64_era",
          "publishedOn": "2021-09-29T12:00:00.000Z",
          "wordCount": 1017,
          "title": "Kukoos - Lost Pets Is A Colourful 3D Platformer Inspired By The Nintendo 64 Era"
        },
        {
          "id": "https://www.nintendolife.com/#article-121569",
          "author": null,
          "description": "Great Scot!\nChannel 4's upcoming reboot of the cult video game show GamesMaster has gone and got itself a presenter, as today it's been announced that Scottish comedian, writer, filmmaker and poet, Robert Florence, will be taking over as host when it relaunches later this year. Robert will be joined by Frankie Ward and Ty Logan as co-hosts.\nCurrently comprised of three 60 minute episodes that focus on celebrities doing battle against one another in an effort to reign supreme, the new show will be aired on E4's YouTube channel before being broadcast on E4 proper. We still don't know exactly when we'll get to see this modern take on an iconic show that's been off the air for 23 years now (!) or indeed who will assume the legendary mantle of the actual GamesMaster, but we'll keep you all posted as soon as we have any further information.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/channel_4s_gamesmaster_reboot_has_found_its_presenter",
          "publishedOn": "2021-09-29T11:40:00.000Z",
          "wordCount": 2448,
          "title": "Channel 4's GamesMaster Reboot Has Found Its Presenter"
        },
        {
          "id": "https://www.nintendolife.com/#article-121582",
          "author": null,
          "description": "Our hands-on impressions.\nIn just nine days' time, Nintendo will be launching its latest, shiny, gorgeous looking console – the Nintendo Switch OLED. We've been lucky enough to go hands-on with the system, so we thought we'd share our thoughts with you lovely lot ahead of its official launch on 8th October.\nOur video team, made up of the also-lovely Alex, Zion and Jon, have gone over plenty of questions that Switch owners are likely to have in an attempt to answer them once and for all. We couldn't share any side-by-side footage unfortunately, making it hard to give you a proper verdict, but it's safe to say that we came away rather impressed with what the new system has to offer.\n\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/video_we_touched_a_switch_oled_model_and_we_liked_it",
          "publishedOn": "2021-09-29T11:00:00.000Z",
          "wordCount": 2054,
          "title": "Video: We Touched A Switch OLED Model, And We Liked It"
        }
      ]
    },
    {
      "title": "Rock Paper Shotgun Latest Articles Feed",
      "feedUrl": "https://www.rockpapershotgun.com/feed",
      "siteUrl": "https://www.rockpapershotgun.com/feed",
      "articles": [
        {
          "id": "https://www.rockpapershotgun.com/new-world-opens-more-servers-planning-to-enlarge-servers-too",
          "author": "Alice O'Connor",
          "description": "Amazon's sandbox MMO New World instantly become one of the most-played games on Steam when it launched this week (briefly the most), and some of those 700,000 'players' even made it through the server queues to actually play. The devs have been scrambling to meet demand ever since and continue to open new servers, in the past 24 hours opening over 100 new New World worlds. They're also exploring the possibility of increasing the capacity of individual servers.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-opens-more-servers-planning-to-enlarge-servers-too",
          "publishedOn": "2021-09-30T09:31:19.000Z",
          "wordCount": 853,
          "title": "New World opens more servers, planning to enlarge servers too"
        },
        {
          "id": "https://www.rockpapershotgun.com/rogue-lords-review-a-compelling-roguelike-where-cheaters-prosper-for-a-while",
          "author": "Matt Cox",
          "description": "Fighting against Satan must be miserable. You think you’ve got one of his minions cornered and then bam, down (up?) comes the hand of evil incarnate. Schwoop, Evil says, as he waves away most of your priest’s health bar. Pffft, he scoffs, as he flicks a shield from your bounty hunter to his succubus. Pop, he mouths, as he recharges Bloody Mary’s stabbing skill and sends her in for the kill. If this sounds unfair, that’s because it is - though fortunately, you’re not actually that side of the pentagram. Rogue Lords is a roguelike where the rules and UI elements are old Nick’s playthings, and you’re the lucky devil in charge of all his toys. \r\n\n\r\nOf course, that doesn’t wind up mattering nearly as much as you think it might.\nRead more",
          "link": "https://www.rockpapershotgun.com/rogue-lords-review-a-compelling-roguelike-where-cheaters-prosper-for-a-while",
          "publishedOn": "2021-09-30T09:00:00.000Z",
          "wordCount": 2031,
          "title": "Rogue Lords review: a compelling roguelike where cheaters prosper - for a while"
        },
        {
          "id": "https://www.rockpapershotgun.com/chess-plus-cards-roguelike-pawnbarian-has-launched-its-shiny-new-version",
          "author": "Lauren Morton",
          "description": "When you double down and then triple down on strategy, Pawnbarian must be pure essence that emerges. This tactical dungeon crawler throws chess on top of a roguelike plus some cards just for fun. Despite the undeniably deep strategic potential, it really is quick and breezy to pick up if you remember how chess pieces move. You can take your turn with it in its demo or pick up the shiny new release that its developer has whipped up to build on its former free browser version.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/chess-plus-cards-roguelike-pawnbarian-has-launched-its-shiny-new-version",
          "publishedOn": "2021-09-29T22:21:00.000Z",
          "wordCount": 878,
          "title": "Chess plus cards roguelike Pawnbarian has launched its shiny new version"
        },
        {
          "id": "https://www.rockpapershotgun.com/rfm-is-a-retro-future-tactical-roguelite-with-a-demo-this-weekend",
          "author": "Lauren Morton",
          "description": "This stylish retro-future strategy game has you diving into real-time tactical battles as an inter-dimensional mercenary. It's quite a looker, with a very chill, retro synth soundtrack to match. Don't let that get you too relaxed though, it looks like these battles may get a bit hectic as you dive deeper. RFM is looking to launch sometime next year, but you'll also be able to take it for a spin in the upcoming Steam Next Fest that kicks off this Friday.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/rfm-is-a-retro-future-tactical-roguelite-with-a-demo-this-weekend",
          "publishedOn": "2021-09-29T20:52:59.000Z",
          "wordCount": 780,
          "title": "RFM is a retro-future tactical roguelite with a demo this weekend"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-an-rps-recommended-razer-gaming-chair-for-155-off",
          "author": "Will Judd",
          "description": "The Razer Iskur is a rather excellent gaming chair if you're a relatively tall person or a normal-sized cat - or at least so says Katharine in her review. This premium chair normally retails for £500, but today Ebuyer have discounted it to £345, and they're also throwing in a pair of Razer peripherals to sweeten the deal. \nRead more",
          "link": "https://www.rockpapershotgun.com/get-an-rps-recommended-razer-gaming-chair-for-155-off",
          "publishedOn": "2021-09-29T20:20:43.000Z",
          "wordCount": 876,
          "title": "Get an RPS-recommended Razer gaming chair for £155 off"
        },
        {
          "id": "https://www.rockpapershotgun.com/this-high-spec-3400mbs-crucial-ssd-is-going-cheap-78-for-1tb",
          "author": "Will Judd",
          "description": "The Crucial P5 is a high-end PCIe 3.0 SSD, capable of read speeds up to 3400MB/s - about four to five times faster than your average SATA SSD. It's normally around £100 for a 1TB model, but today it's been heavily discounted at Ebuyer via Ebay - you can pay just £78 to take this new SSD home. \nRead more",
          "link": "https://www.rockpapershotgun.com/this-high-spec-3400mbs-crucial-ssd-is-going-cheap-78-for-1tb",
          "publishedOn": "2021-09-29T20:02:08.000Z",
          "wordCount": 821,
          "title": "This high-spec 3400MB/s Crucial SSD is going cheap: £78 for 1TB"
        },
        {
          "id": "https://www.rockpapershotgun.com/correction-you-can-be-jeff-bezos-in-new-world-sort-of",
          "author": "Lauren Morton",
          "description": "As is ever the case in starting a new MMO, picking a character name can be tough. Not least because naming things is hard, but also because some words are on the no-no list. In Amazon's MMO New World, that includes most versions of attempting to name your character after Amazon's founder. As Graham found out yesterday, you can't be Jeff Bezos in New World. Well, not exactly, anyway. You can be close to Jeff Bezos, depending on how far you're willing to stretch his name. At least one player—though I suspect there are hundreds more—has successfully bent the rules and landed in Aeternum as a knockoff Jeff.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/correction-you-can-be-jeff-bezos-in-new-world-sort-of",
          "publishedOn": "2021-09-29T19:39:13.000Z",
          "wordCount": 924,
          "title": "Correction: you can be Jeff Bezos in New World, sort of"
        },
        {
          "id": "https://www.rockpapershotgun.com/halo-infinite-is-letting-in-non-insiders-for-this-weekends-big-team-battle-beta",
          "author": "Lauren Morton",
          "description": "This weekend's Halo Infinite beta is bigger than before, both in player invites going out and in the matches you'll tackle. Registered Halo Insiders have been getting their hands on with Halo Infinite's multiplayer in 343's recent beta tests and now this weekend you can too. Well, maybe, provided you can pester a friend invite code out of a pal of yours who's already an Insider. If you find yourself queued up to play, you'll be participating in those chaotic 12v12 spartan matches Friday through Sunday. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/halo-infinite-is-letting-in-non-insiders-for-this-weekends-big-team-battle-beta",
          "publishedOn": "2021-09-29T17:58:59.000Z",
          "wordCount": 1027,
          "title": "Halo Infinite is letting in non-Insiders for this weekend's big team battle beta"
        },
        {
          "id": "https://www.rockpapershotgun.com/this-is-what-peak-dark-souls-fitness-looks-like",
          "author": "Ed Thorn",
          "description": "Lots of people are excited for Elden Ring. You're excited for Elden Ring, I'm excited for Elden Ring, all the old folks down at your local Spoons at 10am? Yes, this is the game they contemplate over a remarkably early cold one.\nThis is nothing, though. This is a terrible level of excitement in comparison to abusaad3, who is more up for Elden Ring than anyone on this planet. To prove it, they're doing a no-hit boss challenge each day in Dark Souls 3 until Elden Ring is released. This is phenomenal levels of dedication and I am very here for it.\nRead more",
          "link": "https://www.rockpapershotgun.com/this-is-what-peak-dark-souls-fitness-looks-like",
          "publishedOn": "2021-09-29T16:14:33.000Z",
          "wordCount": 744,
          "title": "This is what peak Dark Souls fitness looks like"
        },
        {
          "id": "https://www.rockpapershotgun.com/horrific-pikmin-like-adventure-dap-has-you-protect-a-gaggle-of-spooky-pals",
          "author": "Lauren Morton",
          "description": "At last, it's nearly horror games month-eve and so even the concept of friendship must become frightening. Pikmin-like action puzzler game Dap is all about collecting your Dap pals and attempting to lead them home out of a spooky dream world forest without being consumed by Dap infighting. The nightmare has begun today, so you can lead your own Dap pack out of the woods right now if that's your thing.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/horrific-pikmin-like-adventure-dap-has-you-protect-a-gaggle-of-spooky-pals",
          "publishedOn": "2021-09-29T16:01:06.000Z",
          "wordCount": 813,
          "title": "Horrific Pikmin-like adventure Dap has you protect a gaggle of spooky pals"
        },
        {
          "id": "https://www.rockpapershotgun.com/halo-infinites-maps-are-vintage-multiplayer-jungle-gyms",
          "author": "Brendan Caldwell",
          "description": "The multiplayer maps of Halos past had a devotion to footstep fairness, the principle that every step I take toward the giant laser cannon should equal one step you take toward the same brutal death-tube. Halo Infinite abides by that time-honored rule, at least judging by the recent public test.\nThese maps are classic Master Chief party houses, loyal to the supremacy of abstract shapes, with clarity to every corner and a pared-back art style that makes a brief glance of an enemy in a doorway pop out. Pick-ups lounge on exposed podiums like glimmering sirens. Isolated platforms furnish gravity hammers, surrounded by a grinning void. They are arenas that somehow feel both dangerous and fair. But they are something else too. They're playful.\nRead more",
          "link": "https://www.rockpapershotgun.com/halo-infinites-maps-are-vintage-multiplayer-jungle-gyms",
          "publishedOn": "2021-09-29T16:00:00.000Z",
          "wordCount": 2000,
          "title": "Halo Infinite's maps are vintage multiplayer jungle gyms"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-factions-companies",
          "author": "Rebecca Jones",
          "description": "How do you join a Faction or a Company in New World? Amazon's new MMO New World features both PvP and PvE gameplay, and even though it is theoretically possible to go it alone and still enjoy some of the features, joining up with other players is a lot more fun. The complex social heirarchies of New World are divided up into Factions and Companies — two separate, but linked, types of player organisation. It can all be a bit confusing, though, so below we've laid out the difference between them, as well as how to join a Faction or Company.\n Read more",
          "link": "https://www.rockpapershotgun.com/new-world-factions-companies",
          "publishedOn": "2021-09-29T15:22:36.000Z",
          "wordCount": 1705,
          "title": "New World Factions & Companies explained: how to join them and what the differences are"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-new-gamesmasters-host-is-robert-florence",
          "author": "Alice O'Connor",
          "description": "The co-host of the UK's best video games TV show is becoming the host of its most beloved one, as Channel 4 have named Robert Florence lead host of their rebooted GamesMaster. You know, Rab from VideoGaiden and Consolevania, and from BBC Scotland sketch show Burnistoun, and from RPS board games column Cardboard Children. Honestly, he's a great shout. But no, he's not going to be the actual GamesMaster.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-new-gamesmasters-host-is-robert-florence",
          "publishedOn": "2021-09-29T15:22:35.000Z",
          "wordCount": 870,
          "title": "The new GamesMaster's host is Robert Florence"
        },
        {
          "id": "https://www.rockpapershotgun.com/marvels-avengers-hits-xbox-game-pass-tomorrow",
          "author": "Imogen Beckhelling",
          "description": "Ill-fated co-op superhero game Marvel's Avengers comes to Xbox Game Pass tomorrow. The live service action-RPG first launched in September last year to an overwhelmingly \"meh\" reaction from players, but if you were curious about it, at least now you don't need to pay full price to try it out. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/marvels-avengers-hits-xbox-game-pass-tomorrow",
          "publishedOn": "2021-09-29T14:53:26.000Z",
          "wordCount": 779,
          "title": "Marvel's Avengers hits Xbox Game Pass tomorrow"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-best-settings",
          "author": "James Archer",
          "description": "Even though you can’t play as Jeff Bezos, Amazon Game Studios’ MMO New World is proving popular. So popular, in fact, that some players are apparently willing to queue for hours if it means joining their preferred server. If you find yourself waiting to get to the front of the line, why not kill time efficiently by reading this guide to New World’s best settings? Despite some light-looking system requirements, New World can hammer your hardware in certain areas, and even if you own one of the best graphics cards it’s worth knowing which settings to tone down in exchange for those morish frames per second. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-best-settings",
          "publishedOn": "2021-09-29T14:44:18.000Z",
          "wordCount": 1832,
          "title": "New World: the best settings to improve performance"
        },
        {
          "id": "https://www.rockpapershotgun.com/oh-lord-will-wrights-new-game-is-built-on-nfts",
          "author": "Alice O'Connor",
          "description": "Will Wright, the legendary designer behind games from SimCity to The Sims, has opened up about his mysterious new game. It's named Proxi, and it's some sort of world-building AI simulation game inspired by \"how the brain stores memories\". Normally news on a new Will Wright game would be cause for celebration but ah jeez he's fallen for NFTs, oh no.\nRead more",
          "link": "https://www.rockpapershotgun.com/oh-lord-will-wrights-new-game-is-built-on-nfts",
          "publishedOn": "2021-09-29T14:19:30.000Z",
          "wordCount": 1441,
          "title": "Oh lord, Will Wright's new game is built on NFTs"
        },
        {
          "id": "https://www.rockpapershotgun.com/colts-squishy-vulnerability-is-stopping-me-from-enjoying-deathloops-action",
          "author": "Ed Thorn",
          "description": "Let's try action. Let's try action. Let's try action. This is the Deathloop I'm in at the moment, but I'm slowly beginning to think it's worth breaking the cycle and taking the stealthy approach as often as I can. I'm confused, you see. In many of the game's pre-release teasers, we saw Colt bursting into action. Stealth? No no, this is more of an FPS. The music flares, enemies die, it is carnage.\nBut when I actually give action a go in the game, I'm mostly left dead in seconds. Either that, or I meekly duck behind some cover and regret not trying the stealthy approach. And the problem is that sometimes I have no option but to go all guns blazing, and I think, \"Colt isn't built for this. He's only a squishy lad.\" I just think he's a stealth character being forced to break cover when he's clearly uncomfortable doing so.\nRead more",
          "link": "https://www.rockpapershotgun.com/colts-squishy-vulnerability-is-stopping-me-from-enjoying-deathloops-action",
          "publishedOn": "2021-09-29T13:00:00.000Z",
          "wordCount": 1482,
          "title": "Colt's squishy vulnerability is stopping me from enjoying Deathloop's action"
        },
        {
          "id": "https://www.rockpapershotgun.com/tunic-isnt-a-soulslike-says-dev-but-it-wont-go-easy-on-you",
          "author": "Imogen Beckhelling",
          "description": "At first glance, the upcoming action-adventure game Tunic looks remarkably similar to The Legend Of Zelda. Its protagonist is a cute little dude (well, a fox, in this case) with a sword and shield and similar taste in green adventure-wear, and they get to run around all sorts of lush forests, bright temples and more. But upon playing the game, people have already discovered that it's a fair bit tougher than it looks. More Dark Souls, than Zelda, perhaps.\nJust because Tunic isn't dark and gloomy doesn't mean it can't offer its fair share of challenges, so I spoke to Tunic creator Andrew Shouldice to find out how he's managing expectations, as well as tackling difficulty and accessibility. We also talked about the joy of exploring and uncovering secrets, but we'll check behind that waterfall in a bit.\nRead more",
          "link": "https://www.rockpapershotgun.com/tunic-isnt-a-soulslike-says-dev-but-it-wont-go-easy-on-you",
          "publishedOn": "2021-09-29T12:00:00.000Z",
          "wordCount": 2001,
          "title": "Tunic isn't a Soulslike, says dev, but it won't go easy on you"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-azoth",
          "author": "Hayden Hefford",
          "description": "Want to learn about Azoth in New World? Azoth is a very important resource that you will use for some crucial activities in New World, including fast travel and crafting. You'll do those often in an MMO, so Azoth’s pretty darn useful.\nThis guide will explain everything that you need to know about Azoth, including where you can find Azoth and the quickest way to farm Azoth in New World.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-azoth",
          "publishedOn": "2021-09-29T11:32:55.000Z",
          "wordCount": 1037,
          "title": "How to get Azoth in New World"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-epic-games-store-is-coming-to-the-microsoft-store-for-some-reason",
          "author": "Imogen Beckhelling",
          "description": "Microsoft are making a new Microsoft Store, and you'll be able to download even more stores from it. They've announced that they're adding a number of third-party storefront apps, including Amazon and Epic Games. These will arrive sometime in the next few months, after the new Microsoft Store launches alongside Windows 11 next week. Finally, you'll be able to launch a store you don't want from a store you really don't want.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-epic-games-store-is-coming-to-the-microsoft-store-for-some-reason",
          "publishedOn": "2021-09-29T11:22:49.000Z",
          "wordCount": 865,
          "title": "The Epic Games Store is coming to the Microsoft Store, for some reason"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-new-world-character-builds",
          "author": "Rebecca Jones",
          "description": "What are the best character builds in New World? Unlike many MMOs of a similar type, New World doesn't have character classes. Instead, you build your character over time by allocating points into their Attributes and Weapon Masteries. This gives you the opportunity to experiment with gameplay a little before committing to a play style, allowing you to find the build that works best for you.\n Read more",
          "link": "https://www.rockpapershotgun.com/best-new-world-character-builds",
          "publishedOn": "2021-09-29T10:05:09.000Z",
          "wordCount": 2141,
          "title": "Best New World builds: weapons, attributes, and more for the best character builds"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-will-offer-free-server-transfers-over-the-next-two-weeks",
          "author": "Imogen Beckhelling",
          "description": "New World has had quite the start to life, becoming the most popular game on Steam last night. Unfortunately, the MMORPG's popularity has caused an awful lot of queuing, with players having to wait hours to get their preferred servers. Amazon Games have announced a sort of workaround for that, though. Over the next two weeks, if you get your character started on a lower player count server, the devs will let you transfer them for free to the server you want to settle down in.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-will-offer-free-server-transfers-over-the-next-two-weeks",
          "publishedOn": "2021-09-29T09:56:21.000Z",
          "wordCount": 849,
          "title": "New World will offer free server transfers to help with queues"
        },
        {
          "id": "https://www.rockpapershotgun.com/diablo-2-resurrected-respec",
          "author": "Charlie Biggerstaff",
          "description": "Trying to figure out how to respec in Diablo 2? A quick initiation for those who aren’t RPG diehards - respec simply refers to the process of refunding and reallocating things like skill and attribute points that are common to the genre. Respecing in many modern RPGs is a simple, repeatable process, but things aren’t quite so easy in Diablo 2: Resurrected. While you will earn a few easy respec opportunities, once you’ve used them getting another will be a fittingly grindy process. To make sure you don’t waste your chances and cripple your build, we’ll walk you through all the ways to respec your character in Diablo 2: Resurrected.\nRead more",
          "link": "https://www.rockpapershotgun.com/diablo-2-resurrected-respec",
          "publishedOn": "2021-09-29T09:45:04.000Z",
          "wordCount": 1207,
          "title": "How to respec in Diablo 2: Resurrected"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-ray-tracing",
          "author": "Hayden Hefford",
          "description": "Want to learn about RTX ray tracing in Minecraft? When you think of gorgeous graphics, Minecraft might not be the first thing that comes to mind. Sure, it has a charming aesthetic, and texture packs can make your worlds look really unique, but it isn’t very realistic. However, Nvidia have now created ray traced RTX worlds in Minecraft that will completely transform your experience.\nThis guide will explain everything that you need to know to get RTX ray tracing in Minecraft, including the minimum requirements for ray tracing.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-ray-tracing",
          "publishedOn": "2021-09-29T08:33:07.000Z",
          "wordCount": 1314,
          "title": "How to enable RTX ray tracing in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/netflix-have-bought-the-developers-of-oxenfree",
          "author": "Graham Smith",
          "description": "Night School Studio are \"joining the Netflix team.\" The developers of Oxenfree and Afterparty are the first games studio to be bought by Netflix, with founder and creative director Sean Krankel writing in a blog post that they'll continue working on the in-development Oxenfree 2. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/netflix-have-bought-the-developers-of-oxenfree",
          "publishedOn": "2021-09-28T22:35:46.000Z",
          "wordCount": 764,
          "title": "Netflix have bought the developers of Oxenfree"
        },
        {
          "id": "https://www.rockpapershotgun.com/you-cant-be-jeff-bezos-in-new-world",
          "author": "Graham Smith",
          "description": "Picture the scene. You're playing newly released coloniast theme park New World when who should walk over to you but Amazon founder Jeff Bezos. The billionaire says that he's locked out of his bank accounts, but if you buy him several Amazon gift cards, he'll pay you back with \"extra\" once he gets his access back.\r\n\nThis situation probably can't happen, because \"Jeff Bezos\" and almost every variation of it aren't permitted names in Amazon's MMO.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/you-cant-be-jeff-bezos-in-new-world",
          "publishedOn": "2021-09-28T21:41:51.000Z",
          "wordCount": 703,
          "title": "You can't be Jeff Bezos in New World"
        },
        {
          "id": "https://www.rockpapershotgun.com/you-can-now-play-the-demo-for-pony-island-devs-creepy-card-game",
          "author": "Graham Smith",
          "description": "Inscryption is reportedly \"inky black card-based odyssey that blends the deckbuilding roguelike, escape-room style puzzles, and psychological horror into a blood-laced smoothie.\" It's also from Daniel Mullins, the makers of Pony Island and The Hex, which means it's probably a few other, secret genres, too. It's coming October 19th, but there's a demo available now and a new trailer below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/you-can-now-play-the-demo-for-pony-island-devs-creepy-card-game",
          "publishedOn": "2021-09-28T21:11:47.000Z",
          "wordCount": 762,
          "title": "You can now play the demo for Pony Island dev's creepy card game"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-is-currently-the-most-popular-game-on-steam",
          "author": "Graham Smith",
          "description": "Amazon's MMO New World launched earlier today, and it's apparently great if you like queues. \r\n\nTo put the login issues players are experiencing in context however, it's maybe worth noting that New World is currently the most popular game on Steam, knocking CS:GO from its perch within hours of release.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-is-currently-the-most-popular-game-on-steam",
          "publishedOn": "2021-09-28T20:11:33.000Z",
          "wordCount": 772,
          "title": "New World is currently the most popular game on Steam"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-a-500w-seasonic-sfx-l-power-supply-for-35-at-newegg",
          "author": "Will Judd",
          "description": "Seasonic is known the world over for their high-spec, high-reliability power supplies, and today one of their small form factor (SFX-L) PSUs is heavily discounted at Newegg. The fully modular Focus SGX-500 is a 500W PSU that comes with a ten-year warranty and a footprint of less than 5 x 5 inches. Normally you'd expect to pay $120 for it, but a combination of a Newegg discount, a $15 mail in rebate and a code for $10 off (NEOCTOBER) has dropped it to just $35 when all is said and done - pretty impressive! \nRead more",
          "link": "https://www.rockpapershotgun.com/get-a-500w-seasonic-sfx-l-power-supply-for-35-at-newegg",
          "publishedOn": "2021-09-28T19:41:12.000Z",
          "wordCount": 879,
          "title": "Get a 500W Seasonic SFX-L power supply for $35 at Newegg"
        },
        {
          "id": "https://www.rockpapershotgun.com/this-rps-approved-ultrawide-gaming-monitor-is-400-off-today",
          "author": "Will Judd",
          "description": "Yesterday we featured a cut-price 49-in Samsung ultrawide monitor, which was marked down to £1099. That's still stonking expensive, so how about something more reasonable? This is the Samsung CRG9, the Odyssey G9's predecessor, and it offers almost all the same specs for much less - just £699, down from £1099. Here's why it gets the sagely RPS nod of approval. \nRead more",
          "link": "https://www.rockpapershotgun.com/this-rps-approved-ultrawide-gaming-monitor-is-400-off-today",
          "publishedOn": "2021-09-28T19:24:23.000Z",
          "wordCount": 1038,
          "title": "This RPS-approved ultrawide gaming monitor is £400 off today"
        },
        {
          "id": "https://www.rockpapershotgun.com/halo-infinites-multiplayer-reminds-me-of-old-halo-and-i-mean-that-in-the-best-way",
          "author": "Ed Thorn",
          "description": "I adored Halo 3 and Halo Reach's multiplayer. So much so, I never want to play them again. In my mind, I view them through a next-gen lens, coloured by nostalgia and post-homework energy. I know that if I jump into the Halo: The Master Chief Collection, I simply won't be able to recapture those heady times. I'm genuinely afraid of tarnishing those memories.\nHalo 4 didn't do it for me, and I skipped Halo 5 altogether. They just felt off, you know? But having spent some time with Halo Infinite's tech preview this weekend, though, I'm hopeful that this is the Halo that recaptures those former glory days. It's a step backwards in the best possible way.\nRead more",
          "link": "https://www.rockpapershotgun.com/halo-infinites-multiplayer-reminds-me-of-old-halo-and-i-mean-that-in-the-best-way",
          "publishedOn": "2021-09-28T17:00:00.000Z",
          "wordCount": 1466,
          "title": "Halo Infinite's multiplayer reminds me of old Halo, and I mean that in the best way"
        },
        {
          "id": "https://www.rockpapershotgun.com/battlefield-2042-open-beta-dates-confirmed-starts-october-8",
          "author": "Alice O'Connor",
          "description": "Following the recent delay of Battlefield 2042's launch into November, Electronic Arts have now confirmed new timing for the open beta test of Dice's near-future shooter. It'll start on Friday the 8th of October and run until the morning of  Sunday the 10th, inviting everyone to play Conquest mod on the map Orbital.\nRead more",
          "link": "https://www.rockpapershotgun.com/battlefield-2042-open-beta-dates-confirmed-starts-october-8",
          "publishedOn": "2021-09-28T16:22:21.000Z",
          "wordCount": 890,
          "title": "Battlefield 2042 open beta dates confirmed, starts October 8"
        },
        {
          "id": "https://www.rockpapershotgun.com/echoes-of-the-eye-is-sensational-dlc-for-outer-wilds-dont-let-anyone-spoil-it-for-you",
          "author": "Matthew Castle",
          "description": "Echoes Of The Eye, the new expansion for Outer Wilds, is out... now! And I’d like to congratulate Mobius Digital and Annapurna on just how little promoting their promotional campaign did. The reveal trailer did anything but, showing us the familiar solar system of Outer Wilds, only with the beginning of an eclipse followed by shots of murky caves and forests. And take a look at the official screenshots used in this article: obscured to the point of ugliness. Here’s a team so determined to keep their secrets they’d rather present the game in an unflattering light. It was worth it.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/echoes-of-the-eye-is-sensational-dlc-for-outer-wilds-dont-let-anyone-spoil-it-for-you",
          "publishedOn": "2021-09-28T16:00:00.000Z",
          "wordCount": 1942,
          "title": "Echoes Of The Eye is sensational DLC for Outer Wilds - don’t let anyone spoil it for you"
        },
        {
          "id": "https://www.rockpapershotgun.com/pc-gaming-weekspot-podcast-055-outer-wilds-echoes-of-the-eye",
          "author": "Colm Ahern",
          "description": "So, the main point of discussion on this week's podcast is the Outer Wilds: Echoes Of The Eye DLC. Talking about it is tricky, because saying pretty much anything about it feels spoiler-y. Christ, I'm trying to be careful writing this blurb in case I say something that I shouldn't. But, somehow, I think we managed to talk about it, without talking about it. Know what I mean?\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/pc-gaming-weekspot-podcast-055-outer-wilds-echoes-of-the-eye",
          "publishedOn": "2021-09-28T16:00:00.000Z",
          "wordCount": 803,
          "title": "The Weekspot podcast #055: eye and mighty"
        },
        {
          "id": "https://www.rockpapershotgun.com/roblox-players-are-making-loads-of-squid-game-games",
          "author": "Imogen Beckhelling",
          "description": "Squid Game is a South Korean survival drama show that's been taking Netflix by storm recently, and it's inspired a whole bunch of Squid Game games on Roblox. The show pits folks against each other in games like tug-of-war, where the winners earn cash, and the losers earn, well, death. It's a fun (read: somehow even more sinister) twist on the battle royale genre. It reminds me a bit of when the Hunger Games films inspired loads of Minecraft mods.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/roblox-players-are-making-loads-of-squid-game-games",
          "publishedOn": "2021-09-28T15:51:39.000Z",
          "wordCount": 842,
          "title": "Roblox players are making loads of Squid Game games"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-new-world-weapons-tier-list",
          "author": "Rebecca Jones",
          "description": "Looking for the best weapons in New World? The highly-anticipated MMO New World from Amazon Game Studios is now available as a full release, and for most players getting stuck into life on Aeternum Island, putting together a good selection of weapons will be their number one priority. In this tier list, we've ranked each weapon according to our experiences, and also put together some pointers on choosing the best weapons for your play style.\n Read more",
          "link": "https://www.rockpapershotgun.com/best-new-world-weapons-tier-list",
          "publishedOn": "2021-09-28T15:35:14.000Z",
          "wordCount": 1950,
          "title": "Best New World weapons tier list: ranking the best weapons in New World"
        },
        {
          "id": "https://www.rockpapershotgun.com/time-looping-arena-shooter-lemnis-gate-is-out-now",
          "author": "Imogen Beckhelling",
          "description": "'Tis the season of the time loop. If you have any space left in your brain after Deathloop for more groundhog day-like shenanigans, you might be interested in Lemnis Gate, a strategic first-person shooter that launched today. It pits players against each other in 1v1 and 2v2 matches, letting you plan out moves in 25 second-long rounds. It sounds a little confusing, but seems pretty fun. It also has some excellent-looking sci-fi backgrounds and laser guns, which is truly the most important part.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/time-looping-arena-shooter-lemnis-gate-is-out-now",
          "publishedOn": "2021-09-28T14:30:53.000Z",
          "wordCount": 854,
          "title": "Time looping arena shooter Lemnis Gate is out now"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-dripstone-infinite-lave-source",
          "author": "Hayden Hefford",
          "description": "Want to learn more about Dripstone in Minecraft? Caves are getting a huge revamp in Minecraft 1.18, and Dripstone is going to be an important new block, as you can use it to make an infinite lava source in your base.\nThis guide will explain everything you need to know about Dripstone, including where you will be able to find it and how to use Pointed Dripstone to create a lava farm in Minecraft.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-dripstone-infinite-lave-source",
          "publishedOn": "2021-09-28T14:01:50.000Z",
          "wordCount": 1300,
          "title": "Everything we know about Dripstone in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-neo-the-world-ends-with-you-captures-the-15-year-evolution-of-shibuya-and-is-a-better-game-for-it",
          "author": "Alicia Haddick",
          "description": "NEO: The World Ends With You is out on PC today (via the Epic Games Store), and marks the grand return of a franchise that, despite a rabid fanbase and numerous re-releases, is only receiving its first sequel after 15 years. The original The World Ends With You impressed audiences on Nintendo DS as much for the game’s stylish Tokyo setting as it did for a unique battle system that saw players control multiple characters on multiple screens simultaneously. Yet what made this game really memorable was how it transformed the fashion and pop-cultural power of Shibuya into its own JRPG battle system. Your drip gave you strength, your armor made you a trendsetter, and the music and energy of the city were translated into a story about coming-of-age, self-worth and finding strength in yourself and your friends by embracing the things that make you unique. \nNow, NEO: The World Ends With You has arrived, but this long-awaited sequel is far from a simple retread of what the first game did 15 years ago. Shibuya itself has changed a lot in the intervening years and it's fascinating to see how NEO's setting and its gameplay mechanics have evolved alongside it. \nRead more",
          "link": "https://www.rockpapershotgun.com/how-neo-the-world-ends-with-you-captures-the-15-year-evolution-of-shibuya-and-is-a-better-game-for-it",
          "publishedOn": "2021-09-28T12:00:00.000Z",
          "wordCount": 2128,
          "title": "How NEO: The World Ends With You captures the 15 year evolution of Shibuya, and is a better game for it"
        },
        {
          "id": "https://www.rockpapershotgun.com/gigabyte-g5-review-a-ray-tracing-gaming-laptop-at-a-good-price",
          "author": "James Archer",
          "description": "With graphics card prices being what they are, gaming laptops like the Gigabyte G5 have been making a lot more sense. Believe it or not, this particular model is – at £850 / $969 – one of the cheapest routes possible into a complete PC gaming system with Nvidia’s RTX ray tracing and DLSS powers.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/gigabyte-g5-review-a-ray-tracing-gaming-laptop-at-a-good-price",
          "publishedOn": "2021-09-28T11:35:17.000Z",
          "wordCount": 2171,
          "title": "Gigabyte G5 review: a ray tracing gaming laptop at a good price"
        },
        {
          "id": "https://www.rockpapershotgun.com/uk-advertising-authority-set-guidance-for-in-game-purchases",
          "author": "Alice O'Connor",
          "description": "As various UK agencies and organisations continue to regard microtransactions and loot boxes with escalating curiosity and suspicion, the Advertising Standards Authority have laid out new guidelines for advertising in-game in purchases. Basically, they think games should be clear about what they're selling and how much things cost in real money, and that advertising shouldn't pressure or mislead. The ASA are relatively toothless but fairly prolific, and their interest might lead to more official interest.\nRead more",
          "link": "https://www.rockpapershotgun.com/uk-advertising-authority-set-guidance-for-in-game-purchases",
          "publishedOn": "2021-09-28T10:49:14.000Z",
          "wordCount": 1193,
          "title": "UK advertising authority set guidance for in-game purchases"
        },
        {
          "id": "https://www.rockpapershotgun.com/amazons-mmo-new-world-is-out-now-but-the-servers-are-struggling",
          "author": "Imogen Beckhelling",
          "description": "At long last, Amazon's MMO New World has launched. After multiple delays and two rather popular betas, folks can now jump onto the supernatural island of Aeternum and stay there for as long as they please. The EU servers are already live, with the rest of the world to follow throughout today. Do watch out if you're jumping in this morning though, because some players are reporting long queue times, while others are struggling to get into the queue in the first place.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/amazons-mmo-new-world-is-out-now-but-the-servers-are-struggling",
          "publishedOn": "2021-09-28T10:30:11.000Z",
          "wordCount": 1012,
          "title": "Amazon's MMO New World is out now, but the servers are struggling"
        },
        {
          "id": "https://www.rockpapershotgun.com/activision-blizzard-commit-to-18-million-settlement-with-equal-employment-opportunity-commission",
          "author": "Alice O'Connor",
          "description": "Activision Blizzard have agreed to create a claims fund of $18 million (£13m) for employees who experienced harm from \"sexual harassment, pregnancy discrimination and/or related retaliation\". This is part of a settlement with the USA's Equal Employment Opportunity Commission (EEOC), who had taken Actiblizz to court with allegations of those issues. This is only one of Activision Blizzard's current legal battles over alleged workplace problems, and not the big one you're probably thinking of. The company also had to agree to, like, not do any of those bad things—but the settlement is not an admission of guilt.\nRead more",
          "link": "https://www.rockpapershotgun.com/activision-blizzard-commit-to-18-million-settlement-with-equal-employment-opportunity-commission",
          "publishedOn": "2021-09-28T09:59:52.000Z",
          "wordCount": 1035,
          "title": "Activision Blizzard commit to $18 million settlement with Equal Employment Opportunity Commission"
        },
        {
          "id": "https://www.rockpapershotgun.com/league-of-legends-series-arcane-premieres-throughout-november",
          "author": "Lauren Morton",
          "description": "Yet another beefy trailer and launch date exploded out of Netflix's corner this weekend. Their upcoming animated series Arcane, set in the universe of Riot's League Of Legends, has gotten one of each. The new trailer down here digs into the dynamic between protagonist sisters Vi and Jinx. The release date, at least the first of them, is coming up pretty quick too, scheduled for November 6th.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/league-of-legends-series-arcane-premieres-throughout-november",
          "publishedOn": "2021-09-27T22:37:16.000Z",
          "wordCount": 820,
          "title": "League Of Legends series Arcane premieres throughout November"
        },
        {
          "id": "https://www.rockpapershotgun.com/steam-may-be-planning-to-restrict-player-access-to-old-game-builds",
          "author": "Lauren Morton",
          "description": "As they always do, things in Steam are likely to change again. Unlike Valve's Steam Labs experiments for storefront discoverability or downstream effects of the upcoming Steam Deck, this one is a little more under the hood. As spotted by the unaffiliated Steam tracking site SteamDB, the beta version of Steam's client now has a new method that is capable of preventing users from accessing former builds of games they own. The majority of players likely aren't pulling up old game builds often, if ever, but this change could make life a lot tougher for modders, speedrunners, and anyone trying to roll back a buggy game update while they wait for a hotfix.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/steam-may-be-planning-to-restrict-player-access-to-old-game-builds",
          "publishedOn": "2021-09-27T21:55:12.000Z",
          "wordCount": 980,
          "title": "Steam may be planning to restrict player access to old game builds"
        },
        {
          "id": "https://www.rockpapershotgun.com/oculus-announces-resident-evil-4-vr-release-date-for-october",
          "author": "Lauren Morton",
          "description": "October is creeping up on us all and, like a proper jump scare just before I'd expected it, so has Resident Evil 4 VR. Leon Kennedy's spooky cult adventure begins again in the first-person and hands-on version that's arriving on the Oculus Quest 2 next month. Now that you'll be getting all up close and personal with Salazar and Saddler and El Gigante and all, they've gotten some fresh pixels as well, which you can catch a look at once again in a new trailer.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/oculus-announces-resident-evil-4-vr-release-date-for-october",
          "publishedOn": "2021-09-27T20:14:37.000Z",
          "wordCount": 766,
          "title": "Oculus announces Resident Evil 4 VR release date for October"
        },
        {
          "id": "https://www.rockpapershotgun.com/netflixs-lady-assassin-movie-kate-is-getting-an-action-roguelike-tie-in-game",
          "author": "Lauren Morton",
          "description": "I've been positively held hostage by the lady assassin action movie trend—having been in the same room as my partner relentlessly devouring the likes of The Old Guard, Ava, Terminal, and Gunpowder Milkshake. No surprise then that I also got sucked into watching Kate, Netflix's new action movie starring assassin Mary Elizabeth Winstead and her teen hostage slash sidekick Miku Martineau. What is surprising—even though Netflix have shown an increasing interest in games—is that Kate is getting a tie-in action game called Kate: Collateral Damage. It's a fast-paced and arcade-y roguelike with some twin-stick style shooting coming out in October.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/netflixs-lady-assassin-movie-kate-is-getting-an-action-roguelike-tie-in-game",
          "publishedOn": "2021-09-27T18:19:30.000Z",
          "wordCount": 892,
          "title": "Netflix's lady assassin movie Kate is getting an action roguelike tie-in game"
        },
        {
          "id": "https://www.rockpapershotgun.com/this-27-in-240hz-samsung-monitor-is-229-right-now-70-off",
          "author": "Will Judd",
          "description": "For a while, I was super into Counter-Strike: Global Offensive, and I took getting better at the game very seriously. I swapped out my mouse and headset, practiced grenade line-ups for hours and even learned a few Russian phrases to try and get the respect of my match-making teammates. All these steps worked, but the real results came when I swapped my old 144Hz monitor for a 240Hz model, the Samsung CRG5. Hitting such a high frame-rate in Counter-Strike isn't difficult even on old hardware, and the increase in clarity meant hitting shots a lot easier. \nIf you want to follow in my footsteps, then it's good news: this 240Hz screen is going cheap on Amazon today. They're asking £229 for it, £70 off its regular price of £299, and I think that's a great deal. \nRead more",
          "link": "https://www.rockpapershotgun.com/this-27-in-240hz-samsung-monitor-is-229-right-now-70-off",
          "publishedOn": "2021-09-27T17:55:30.000Z",
          "wordCount": 1103,
          "title": "This 27-in 240Hz Samsung monitor is £229 right now (£70 off)"
        },
        {
          "id": "https://www.rockpapershotgun.com/samsungs-2tb-870-evo-ssd-is-down-to-19750-at-amazon",
          "author": "Will Judd",
          "description": "We reckon that Samsung's 870 Evo is the best SATA SSD for gaming, and today the mammoth 2TB model has been reduced on Amazon. It's now retailing for £197.50, the best price we've seen on this drive since the Chia mining craze began and some £45 below RRP. It's even cheaper than the (older and slower) 860 Evo. Here's a link to the deal and a few more words on why we like this particular drive so very much. \nRead more",
          "link": "https://www.rockpapershotgun.com/samsungs-2tb-870-evo-ssd-is-down-to-19750-at-amazon",
          "publishedOn": "2021-09-27T16:55:34.000Z",
          "wordCount": 889,
          "title": "Samsung's 2TB 870 Evo SSD is down to £197.50 at Amazon"
        },
        {
          "id": "https://www.rockpapershotgun.com/netflix-shows-off-more-the-witcher-season-2-clips-and-announces-season-3",
          "author": "Lauren Morton",
          "description": "If you thought there was any risk of Netflix dumping Geralt and company in the near future, you can rest your head easy after this weekend. They've now shown off several more clips for the upcoming second season of their main, Cavill-powered Witcher TV series and also announced that they're definitely going to be going for a third season. Not just that, but there are even more Witcher projects on the way: another animated movie, that Blood Origin series, and—for some unfathomable reason—a children's show. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/netflix-shows-off-more-the-witcher-season-2-clips-and-announces-season-3",
          "publishedOn": "2021-09-27T16:07:35.000Z",
          "wordCount": 877,
          "title": "Netflix shows off more The Witcher season 2 clips and announces season 3"
        },
        {
          "id": "https://www.rockpapershotgun.com/commuting-home-from-work-turns-mighty-spooky-in-this-indie-game",
          "author": "Imogen Beckhelling",
          "description": "The Plane Effect is a moody isometric adventure game about a guy trying to get home. Pretty normal stuff, except there is a cosmic anomaly looming over the city that seems to be causing some weirdness, so good luck with that. Out now, the game will have you puzzling through levels full of high-contrast moody lighting. It reminds me a bit of Inside, if Inside had rooms full of scary-looking red lasers.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/commuting-home-from-work-turns-mighty-spooky-in-this-indie-game",
          "publishedOn": "2021-09-27T15:56:38.000Z",
          "wordCount": 842,
          "title": "Commuting home from work turns mighty spooky in this indie game"
        },
        {
          "id": "https://www.rockpapershotgun.com/smashing-ingredients-in-potion-craft-is-better-than-mediation-or-yoga",
          "author": "Alice Bell",
          "description": "Potion Craft came out in early access last week, and while I still think the economy and haggling bits need a little tweaking, I am really enjoying the methodical nature of being an alchemist. It's part art, part science, because you have to sort of feel your way around the potion map and fudge recipes with the ingredients you have. Your recipe book is limited, so I've started writing down extra recipes in real life, crossing things out and updating them as I find better combinations. It's just like being a real backwoods alchemist throwing twigs in a bucket!\nBut my favourite thing is the pestle and mortar. Smashing ingredients up (and grinding them into sludge) awakens their properties so they move further on your potion map, like how crushing mint will make for a livelier mojito. And I love it intensely.\nRead more",
          "link": "https://www.rockpapershotgun.com/smashing-ingredients-in-potion-craft-is-better-than-mediation-or-yoga",
          "publishedOn": "2021-09-27T14:39:39.000Z",
          "wordCount": 744,
          "title": "Smashing ingredients in Potion Craft is better than meditation or yoga"
        },
        {
          "id": "https://www.rockpapershotgun.com/overwatch-2-will-make-murderbot-bastion-more-mobile",
          "author": "Imogen Beckhelling",
          "description": "Rejoice! The absolute pain in the arse that is Bastion is getting a rework for Overwatch 2, and he'll no longer be able to heal himself or turn into a murderous tank. He will be a lot more mobile and have a sticky grenade however, so watch out for that. Over the weekend, Blizzard revealed the changes coming to both Bastion and Sombra in the sequel. While Sombra's tweaks are a little more minimal, it looks like Bastion's will make him play a whole lot differently. Importantly, he'll also wear one of Torbjorn's caps. Fashion.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/overwatch-2-will-make-murderbot-bastion-more-mobile",
          "publishedOn": "2021-09-27T14:34:22.000Z",
          "wordCount": 1201,
          "title": "Overwatch 2 will make murderbot Bastion more mobile"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-warden-deep-dark",
          "author": "Hayden Hefford",
          "description": "Want to know more about the Warden in Minecraft? The Warden is a new mob that will arrive in Minecraft 1.18, otherwise known as the Caves and Cliffs update. It is set to be a terrifying addition, making every adventure underground a trip that could result in a particularly scary death.\nThis guide will cover everything that we currently know about the Warden in Minecraft, including its behaviour and where it will spawn.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-warden-deep-dark",
          "publishedOn": "2021-09-27T13:07:54.000Z",
          "wordCount": 1128,
          "title": "Everything that we know about the Warden in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/astria-ascending-review",
          "author": "Katharine Castle",
          "description": "On the face of it, Astria Ascending should be right up my street. With its lush visuals, intriguing character designs and often engaging turn-based battle system, this handsome hand drawn adventure could have been a surprise dark horse to rival recent JRPG greats such as Tales Of Arise and Bravely Default II. Colombian RPG Cris Tales managed it, so why not Astria Ascending?\nFrench Canadian developers Artisan Studios have certainly tried hard to fulfill J part of this Japanese-inspired RPG, acquiring the talents of Final Fantasy XII composer Hitoshi Sakimoto and Final Fantasy X writer Kazushige Nojima to bolster their small team, but even these big name veterans can't salvage this game from the depths of its own tedium. Between its bewildering, colour-swap dungeons, cringeworthy voice acting and uneven focus on its large cast, Astria Ascending stumbles before it ever has the chance to soar. \nRead more",
          "link": "https://www.rockpapershotgun.com/astria-ascending-review",
          "publishedOn": "2021-09-27T12:00:00.000Z",
          "wordCount": 2266,
          "title": "Astria Ascending review: peak tedium"
        },
        {
          "id": "https://www.rockpapershotgun.com/valheim-food-cooking",
          "author": "Rebecca Jones",
          "description": "How do you cook in Valheim? Valheim has never been short on food and recipes, but with the recent Hearth & Home update, the game's cooking system has been significantly expanded and overhauled. Gone are the days when nearly every animal dropped the same generic type of meat, or when you could cook sausages without the right spices (ugh, so bland, you monster). The buffs offered by some of the original foods have also been rebalanced, so read on for an up-to-date culinary guide to Valheim.\n Read more",
          "link": "https://www.rockpapershotgun.com/valheim-food-cooking",
          "publishedOn": "2021-09-27T11:25:24.000Z",
          "wordCount": 1579,
          "title": "Valheim food and cooking: all recipes, what buffs they provide, and where to cook them"
        },
        {
          "id": "https://www.rockpapershotgun.com/diablo-2-resurrected-players-still-cant-access-some-of-their-characters",
          "author": "Imogen Beckhelling",
          "description": "Diablo 2: Resurrected launched last week, letting players dive into a remaster of Blizzard's hellish action-RPG. Alas, \"hellish\" seems appropriate in more ways than one, because players are still struggling with launch bugs. While the developers issued a number of fixes over the weekend, some players are still experiencing \"lockout\", meaning they can't play with certain characters because the game thinks they're already in use.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/diablo-2-resurrected-players-still-cant-access-some-of-their-characters",
          "publishedOn": "2021-09-27T11:23:14.000Z",
          "wordCount": 961,
          "title": "Diablo 2: Resurrected players still can't access some of their characters"
        },
        {
          "id": "https://www.rockpapershotgun.com/elder-scrolls-online-video-shows-nvidias-new-dlaa-tech-in-action",
          "author": "James Archer",
          "description": "The Elder Scrolls Online is the first game to implement Nvidia DLAA (Deep Learning Anti-Aliasing), and thanks to YouTuber MxBenchmarkPC you can now see how the AI-powered edge-smoothing system looks in the fantasy MMO. DLAA is a new spin on Nvidia’s existing DLSS (Deep Learning Super-Sampling): whereas DLSS involves rendering a game at a lower resolution then upscaling, reducing the performance hit of the AA it applies, DLAA skips the upscaling part and keeps the resolution native.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/elder-scrolls-online-video-shows-nvidias-new-dlaa-tech-in-action",
          "publishedOn": "2021-09-27T10:37:11.000Z",
          "wordCount": 924,
          "title": "Elder Scrolls Online video shows Nvidia’s new DLAA tech in action"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-sunday-papers-612",
          "author": "Ed Thorn",
          "description": "Sundays are for watching Antiques Roadshow with all your might. Before you tune in, let's read this week's best writing about games.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-sunday-papers-612",
          "publishedOn": "2021-09-26T13:44:17.000Z",
          "wordCount": 1188,
          "title": "The Sunday Papers"
        },
        {
          "id": "https://www.rockpapershotgun.com/im-going-to-use-the-new-n64-controller-on-pc-and-you-cant-stop-me",
          "author": "Graham Smith",
          "description": "During this week's Nintendo Direct, we found out that N64 games would soon be playable on Switch via Nintendo's online subscription. More importantly, we found out that Nintendo are making a new wireless N64 controller for use with the Switch.\r\n\nYou can connect the Switch Pro controller to PC with or without a wire, so it stands to reason I'll be able to use this new N64 controller on PC too, right? Because if so, I'm gonna.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/im-going-to-use-the-new-n64-controller-on-pc-and-you-cant-stop-me",
          "publishedOn": "2021-09-25T22:57:03.000Z",
          "wordCount": 1027,
          "title": "I'm going to use the new N64 controller on PC and you can't stop me"
        },
        {
          "id": "https://www.rockpapershotgun.com/foxholes-entrenched-update-makes-the-massive-multiplayer-shooter-even-bigger",
          "author": "Graham Smith",
          "description": "Foxhole has made foxholes better. The Entrenched update for the massive, multiplayer sandbox war game adds a lot, but top of the pile is new building tools for crafting better bunkers, trenches, and frontline defenses. The update is live now, and there's a video introducing its many features below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/foxholes-entrenched-update-makes-the-massive-multiplayer-shooter-even-bigger",
          "publishedOn": "2021-09-25T21:44:32.000Z",
          "wordCount": 805,
          "title": "Foxhole's Entrenched update makes the massive multiplayer shooter even bigger"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-signal-state-is-a-zachlike-about-rewiring-synthesizers",
          "author": "Graham Smith",
          "description": "Is it still a Zachlike if it's not made by Zachtronics? Because The Signal State sure looks like a Zachlike. It's about solving logic puzzles inspired by modular synthesizers, which means you'll tinker with ornate machinery by twisting knobs and changing wiring. It's also wrapped in a post-apocalyptic story in which your actions will \"change the fate of agriculture.\"\r\n\nIt's out now. Check out the trailer below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-signal-state-is-a-zachlike-about-rewiring-synthesizers",
          "publishedOn": "2021-09-25T21:10:17.000Z",
          "wordCount": 720,
          "title": "The Signal State is a Zachlike about rewiring synthesizers"
        },
        {
          "id": "https://www.rockpapershotgun.com/hitman-is-now-on-gog-but-getting-slammed-for-its-lack-of-offline-features",
          "author": "Graham Smith",
          "description": "Good news! Hitman: Game Of The Year Edition is now on GOG and 70% off. Bad news! The game requires an internet connection for so many singleplayer features that customers on the DRM-free digital store are real mad about it.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/hitman-is-now-on-gog-but-getting-slammed-for-its-lack-of-offline-features",
          "publishedOn": "2021-09-25T20:22:30.000Z",
          "wordCount": 985,
          "title": "Hitman is now on GOG, but getting slammed for its lack of offline features"
        },
        {
          "id": "https://www.rockpapershotgun.com/battleye-anti-cheat-will-support-steam-deck-and-proton-too",
          "author": "Graham Smith",
          "description": "Valve's claim that the Steam Deck would run every game in your Steam library is looking more and more like fact. Yesterday Easy Anti-Cheat announced support for Linux and the Proton compatibility laters the Deck relies upon. \r\n\nToday, BattlEye Anti-Cheat followed suit, announcing they'd support the Steam Deck and Proton in a tweet.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/battleye-anti-cheat-will-support-steam-deck-and-proton-too",
          "publishedOn": "2021-09-25T19:45:50.000Z",
          "wordCount": 843,
          "title": "BattlEye Anti-Cheat will support Steam Deck and Proton, too"
        },
        {
          "id": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-163",
          "author": "Alice O'Connor",
          "description": "Okay, here we are: it is now autumn. I'm ready. I've folded my summer bedding away, pulled out the big duvet, and bought a bigger Thermos. And this is the nice part of autumn, when things are cosy and transitionary, before the feeling of death sets in. I was cheered by reading about your favourite autumn games this week. But anyway, what are you playing this weekend? Here's what we're clicking on.\nRead more",
          "link": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-163",
          "publishedOn": "2021-09-25T08:00:00.000Z",
          "wordCount": 1133,
          "title": "What are we all playing this weekend?"
        },
        {
          "id": "https://www.rockpapershotgun.com/handcop-is-a-hilariously-horrifying-fist-person-shooter-in-development",
          "author": "Lauren Morton",
          "description": "Handcop is a work in progress \"fist person shooter\" that's just as neat as it is horrifying. This wacky prodecurally-animated cop hand has three legs and chest hair for goodness sake. I can't decide if three \"legs\" is better or worse than three finger \"arms\". Oh, and of course officier Michael McWrist is running about carrying a giant gun. It's relatively early days for Handcop right now, it sounds like, but its wacky animations are already catching the internet's attention.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/handcop-is-a-hilariously-horrifying-fist-person-shooter-in-development",
          "publishedOn": "2021-09-24T22:39:48.000Z",
          "wordCount": 968,
          "title": "Handcop is a hilariously horrifying \"fist person shooter\" in development"
        },
        {
          "id": "https://www.rockpapershotgun.com/frankenstein-and-dracula-are-roomies-in-this-moody-narrative-adventure",
          "author": "Lauren Morton",
          "description": "\"Dracula and Frankenstein are modern day 20-something flatmates who never see one another and only exchange sticky notes. Also they are both very sad. Also Dracula wears puple shades,\" is the kind of message I'd expect to see from one of my writing acquaintances with the timestamp [2:15am]. It's also the kind of thing I'd respond to with a \"yes, do it,\" eager to find out exactly how the hell they would. That's the energy that I downloaded Frank And Drake's demo with, and it sure is a moody, somber narrative adventure about two unlikely housemates.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/frankenstein-and-dracula-are-roomies-in-this-moody-narrative-adventure",
          "publishedOn": "2021-09-24T21:36:11.000Z",
          "wordCount": 873,
          "title": "Frankenstein and Dracula are roomies in this moody narrative adventure"
        },
        {
          "id": "https://www.rockpapershotgun.com/castlevania-advance-collection-whips-out-four-classics-now-on-pc",
          "author": "Lauren Morton",
          "description": "Dracula's back from the dead again and so are four Castlevania games from the aughts. Three different vampire stomping adventures originally hailing from the Game Boy Advance—and one SNES—have made their way into a new collection on PC via Steam. Two Belmonts, a Graves, and a Cruz all get their time to shine against those undead baddies in Castlevania: Circle Of The Moon, Harmony Of Dissonance, Aria Of Sorrow, and Dracula X. Konami launched the Castlevania Advance Collection yesterday, complete with some modern conveniences for us PC players in the year 2021.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/castlevania-advance-collection-whips-out-four-classics-now-on-pc",
          "publishedOn": "2021-09-24T20:11:56.000Z",
          "wordCount": 791,
          "title": "Castlevania Advance Collection whips out four classics now on PC"
        },
        {
          "id": "https://www.rockpapershotgun.com/this-mod-adds-a-universal-photo-mode-to-over-300-unreal-engine-games",
          "author": "Lauren Morton",
          "description": "Photo modes are undeniably in fashion now, so much so that I've just started assuming most major RPGs and third-person action games will have one built in at launch. I've never put in the time to get particularly skilled at lining up the best shots, but I'm always well impressed by those who do. It's a bummer though when a looker of a game doesn't have a way to really get up close and personal with its pretty cast and environments. Tales Of Arise, which just launched this month, doesn't have one yet, for instance. That's where the extremely nifty and very handy Universal Unreal Engine 4 Unlocker comes in. It's a mod that lets you toggle a free camera to take amazing screenshots in over 300 Unreal Engine games.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/this-mod-adds-a-universal-photo-mode-to-over-300-unreal-engine-games",
          "publishedOn": "2021-09-24T18:46:50.000Z",
          "wordCount": 988,
          "title": "This mod adds a universal photo mode to over 300 Unreal Engine games"
        },
        {
          "id": "https://www.rockpapershotgun.com/tmorpg-book-of-travels-will-launch-in-early-access-on-october-11th",
          "author": "Lauren Morton",
          "description": "Might And Delight's \"tiny Multiplayer Online RPG\" Book Of Travels has scheduled itself a new early access launch date after its most recent delay. As M&D previously reassured fans, it is indeed a shorter wait than I'd feared. Their cozy online RPG is now setting out into early access on October 11th, with plans to work towards a full launch in two years.  \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/tmorpg-book-of-travels-will-launch-in-early-access-on-october-11th",
          "publishedOn": "2021-09-24T16:15:28.000Z",
          "wordCount": 1054,
          "title": "\"TMORPG\" Book Of Travels will launch in early access on October 11th"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-castle-ideas",
          "author": "Hayden Hefford",
          "description": "Want to build an epic Castle in Minecraft? How about 8 castles? That’s how many we’ve got for you in this list, so you’d best get building! These castles look truly stunning, but we're sure they'll be even better atop the new mountains that are coming when the Minecraft 1.18 update launches later this year.\nCheck out all of these builds to get some inspiration for your own world in Minecraft, or just follow along with the Youtube tutorials if you like what you see!\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-castle-ideas",
          "publishedOn": "2021-09-24T15:41:32.000Z",
          "wordCount": 1425,
          "title": "8 Minecraft castle ideas to build in 1.17"
        },
        {
          "id": "https://www.rockpapershotgun.com/squid-game-is-the-perfect-netflix-show-for-zero-escape-danganronpa-likers",
          "author": "Katharine Castle",
          "description": "Listen up, escape room fans. There's a new Korean drama you need to watch. It's called Squid Game, it's on Netflix, and it's real good. It's a show about 456 down and outers - folks with no life, family or who are in huge piles of debt - who enter a deadly competition to win a truck ton of money to help them turn their life around. All they need to do is compete in six games. Easy peasy, everyone thinks. How hard can that be? Only the first of those games, a riff on the classic children's game Statues / Grandma's Footsteps / Red Light Green Light - involves running toward a giant automaton with motion sensors in her eyes, as well as a team of snipers waiting in the rafters to take down anyone who does stay perfectly at the right time. \nIt's grim, but it's also the perfect blend of some of my favourite things ever: Zero Escape, Danganronpa and Battle Royale (the Japanese thriller, not the game genre) - and I implore you to give it a go.\nRead more",
          "link": "https://www.rockpapershotgun.com/squid-game-is-the-perfect-netflix-show-for-zero-escape-danganronpa-likers",
          "publishedOn": "2021-09-24T15:30:00.000Z",
          "wordCount": 841,
          "title": "Squid Game is the perfect Netflix show for Zero Escape & Danganronpa likers"
        },
        {
          "id": "https://www.rockpapershotgun.com/tfi-friday-3-new-indie-games-about-soaking-things-in-water",
          "author": "Alice Bell",
          "description": "I love doing this column because it means a) it is the end of a working week (working hard or hardly working, amiright?) and b) I get to play something nice and (often) small, and usually a bit weird. I am also, as it turns out, really smug about the theme I discovered for this week. Last night I had a bath, so am ideally positioned to extoll the benefits of dunking things in water. May I present to you three brand new indie games: a frog's tea party, a potion workshop and a rainy walk.\nRead more",
          "link": "https://www.rockpapershotgun.com/tfi-friday-3-new-indie-games-about-soaking-things-in-water",
          "publishedOn": "2021-09-24T15:07:25.000Z",
          "wordCount": 1505,
          "title": "TFI Friday: 3 new indie games about soaking things in water"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-warrior-path-walkthrough-toshis-love",
          "author": "Ollie Toms",
          "description": "Stuck on the Warrior Path in Kena: Bridge Of Spirits? You're not alone. The sheer number of portals and zipping between locations throughout the Warrior Path has led many a player to distraction and frustration. At least, until they found this handy walkthrough, which guides you carefully through every part of the Toshi's Love quest, through every combat area and puzzle, until you reach the end and defeat the Warrior himself.\nKeep scrolling to read our written and our video walkthrough of the Warrior Path in Kena: Bridge Of Spirits.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-warrior-path-walkthrough-toshis-love",
          "publishedOn": "2021-09-24T14:19:55.000Z",
          "wordCount": 1801,
          "title": "Kena: Bridge Of Spirits Warrior Path walkthrough"
        },
        {
          "id": "https://www.rockpapershotgun.com/tomb-raider-reboot-studio-now-working-on-perfect-dark-reboot",
          "author": "Alice O'Connor",
          "description": "After rebooting Lara Croft with 2013's Tomb Raider, Square Enix's Crystal Dynamics studio are now helping reboot another vintage hero: Joanna Dark. They'll be chipping in on Microsoft's mysterious new Perfect Dark, helping out the mysterious Santa Monica studio named The Initiative. Secrecy might be thematically appropriate for a game about a futuristic superspy but we don't know much of anything about it so all you can really say is \"Yup, I guess they're doing that.\"\nRead more",
          "link": "https://www.rockpapershotgun.com/tomb-raider-reboot-studio-now-working-on-perfect-dark-reboot",
          "publishedOn": "2021-09-24T14:18:10.000Z",
          "wordCount": 856,
          "title": "Tomb Raider reboot studio now working on Perfect Dark reboot"
        },
        {
          "id": "https://www.rockpapershotgun.com/embrace-the-machine-gun-metal-dogs",
          "author": "Sin Vega",
          "description": "It's all very silly. Having survived the grey, po-faced gruntman domination of the 2000s, I love that games can still be very silly.\nMetal Dogs is a twin stick (sort of) shooter about sending heavy weapons platforms into irradiated future deserts to fight giant insects, ghost tanks, and robot hippos. Naturally, those heavy weapons platforms are strapped onto dogs.\nRead more",
          "link": "https://www.rockpapershotgun.com/embrace-the-machine-gun-metal-dogs",
          "publishedOn": "2021-09-24T14:00:00.000Z",
          "wordCount": 627,
          "title": "Embrace the machine gun, Metal Dogs"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-to-install-ram",
          "author": "James Archer",
          "description": "Installing RAM is both one of the easiest steps to building a PC and one of the simplest ways to upgrade an existing gaming rig. In a physical sense, anyway. Just like installing an M.2 SSD, there are no power or data cables to worry about, and as long as your RAM sticks fit the RAM slots on your motherboard, ultimately you just need to push them in. There is room for error, though, hence why this article is going to continue beyond the introductory paragraph. See? RAM can be interesting.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/how-to-install-ram",
          "publishedOn": "2021-09-24T13:31:27.000Z",
          "wordCount": 1390,
          "title": "How to install RAM"
        },
        {
          "id": "https://www.rockpapershotgun.com/mystery-steam-reviews-054-video-games-robots",
          "author": "Colm Ahern",
          "description": "Humans are boring. All fleshy and feelings and Netflix. Like this quiz, robots don't have hidden agendas. Robots want to wish Paulie a happy birthday, and we want to entertain you for quarter of an hour. It's the perfect match.\r\n  \nRead more",
          "link": "https://www.rockpapershotgun.com/mystery-steam-reviews-054-video-games-robots",
          "publishedOn": "2021-09-24T13:30:04.000Z",
          "wordCount": 948,
          "title": "Robot beings rule Mystery Steam Reviews"
        },
        {
          "id": "https://www.rockpapershotgun.com/send-thatcher-back-to-hell-in-this-new-doom-2-mod-today",
          "author": "Alice O'Connor",
          "description": "Following a short delay caused by Tennent's Lager (actual true story), Margaret Thatcher has returned from Hell to menace us once more. Thankfully, one doomed space marine will stand up and venture into the tenth circle of Hell (aka the UK) to put the reviled British prime minister down for good. Thatcher's Techbase is its name, and Doom 2 is the game you'll need to play this free mod now it's out. It is quite the thing, and even has a custom soundtrack from Paradise Killer's composer.\nRead more",
          "link": "https://www.rockpapershotgun.com/send-thatcher-back-to-hell-in-this-new-doom-2-mod-today",
          "publishedOn": "2021-09-24T13:08:19.000Z",
          "wordCount": 898,
          "title": "Send Thatcher back to Hell in this new Doom 2 mod today"
        },
        {
          "id": "https://www.rockpapershotgun.com/cult-classic-snes-platformer-actraiser-now-on-pc-with-a-remaster",
          "author": "Imogen Beckhelling",
          "description": "What's up 90s kids, how would you like to jump back into a SNES platforming city-builder that was first released 30 years ago? Last night's Nintendo Direct had a surprising amount of PC news on offer, including the announcement that a remake of ActRaiser is available to play on PC right now. Named ActRaiser Renaissance, Square Enix say they've given the game a \"complete graphical overhaul\", as well as added some new features for players to try.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/cult-classic-snes-platformer-actraiser-now-on-pc-with-a-remaster",
          "publishedOn": "2021-09-24T13:02:55.000Z",
          "wordCount": 872,
          "title": "Cult classic SNES platformer ActRaiser now on PC with a remaster"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-tower-ideas",
          "author": "Hayden Hefford",
          "description": "Looking for a cool tower to build in Minecraft? This list is filled with exciting tower ideas that you can try out in Minecraft, with everything from a simple base to a magical Wizard tower.\nTake a look through all of these suggestions to get inspired, or follow along with one of the videos and get building right now!\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-tower-ideas",
          "publishedOn": "2021-09-24T11:56:37.000Z",
          "wordCount": 1292,
          "title": "7 Minecraft tower ideas to build in 1.17"
        },
        {
          "id": "https://www.rockpapershotgun.com/valheim-crystal-shards",
          "author": "Rebecca Jones",
          "description": "Where do you get Crystal Shards in Valheim, and what are they used for? Crystal has existed as a resource in Valheim for a while, but like many crafting materials in this Early Access cult hit, it's only recently been given a use. The Hearth & Home update has added Crystal Battleaxe and Crystal Wall recipes, and now this previously purely decorative resource is in high demand.\nRead more",
          "link": "https://www.rockpapershotgun.com/valheim-crystal-shards",
          "publishedOn": "2021-09-24T11:39:34.000Z",
          "wordCount": 1195,
          "title": "Valheim Crystal: how to get crafting materials for the Crystal Battleaxe and Crystal Wall"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-incense-pots-puzzle-toshis-fear",
          "author": "Ollie Toms",
          "description": "Wondering how to solve the Incense Pots puzzle in Kena: Bridge Of Spirits? If you've followed the Mask Maker path as part of the Toshi's Fear quest and you're stuck on these infernal Incense Pots, you've come to exactly the right place. There's not much to say here, so let's jump right into our walkthrough of how to solve this particular puzzle in Kena: Bridge Of Spirits.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-incense-pots-puzzle-toshis-fear",
          "publishedOn": "2021-09-24T11:34:27.000Z",
          "wordCount": 1028,
          "title": "Kena: Bridge Of Spirits Incense Pots puzzle"
        },
        {
          "id": "https://www.rockpapershotgun.com/valheim-obliterator-thunder-stones",
          "author": "Rebecca Jones",
          "description": "How do you craft and use the Obliterator in Valheim? The Obliterator was added to Valheim with the Hearth & Home update, and exists to address a recurring problem experienced by Valheim players in older iterations of the Early Access smash hit. Previously, there was no way to actually get rid of items you didn't need — which could include a surplus of crafting materials and even trophies made from the body parts of slain enemies. The Obliterator gives you the option to neatly dispose of all the inventory junk you don't want to display or store.\n Read more",
          "link": "https://www.rockpapershotgun.com/valheim-obliterator-thunder-stones",
          "publishedOn": "2021-09-24T10:37:56.000Z",
          "wordCount": 1078,
          "title": "Valheim Obliterator: how to craft and use an Obliterator"
        },
        {
          "id": "https://www.rockpapershotgun.com/monster-hunter-rise-announces-sunbreak-expansion-before-even-hitting-pc",
          "author": "Alice O'Connor",
          "description": "Though Monster Hunter Rise isn't even out on PC for months yet, Capcom have announced an expansion is coming our way. During last night's Nintendo Direct stream they revealed Monter Hunter Rise: Sunbreak, which will launch simultaneously on Switch and PC in summer 2022. Hey, at least that means while consoleers had to wait over a year for the expansion, we'll have it after only a few months. Have a peek in the announcement trailer.\nRead more",
          "link": "https://www.rockpapershotgun.com/monster-hunter-rise-announces-sunbreak-expansion-before-even-hitting-pc",
          "publishedOn": "2021-09-24T10:37:31.000Z",
          "wordCount": 782,
          "title": "Monster Hunter Rise announces Sunbreak expansion before even hitting PC"
        },
        {
          "id": "https://www.rockpapershotgun.com/voice-of-cards-the-isle-dragon-roars-is-yoko-taros-new-card-based-rpg",
          "author": "Imogen Beckhelling",
          "description": "Nier director Yoko Taro is making a new role-playing game in which everything is depicted through cards, and somehow it's not called Yoko Tarot. Story? There are cards for that. Combat? Turn-based card battles, of course. Travelling through the world? Flip over some cards, see what you find! It's called Voice Of Cards: The Isle Dragon Roars, and it's set to release this October. On top of that, a demo will be available later today if you fancy trying it out. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/voice-of-cards-the-isle-dragon-roars-is-yoko-taros-new-card-based-rpg",
          "publishedOn": "2021-09-24T10:07:35.000Z",
          "wordCount": 962,
          "title": "Voice Of Cards: The Isle Dragon Roars is Yoko Taro's new card-based RPG"
        },
        {
          "id": "https://www.rockpapershotgun.com/warhammer-40000-space-marine-adds-dlc-in-surprise-anniversary-edition",
          "author": "Alice O'Connor",
          "description": "Rise, brothers, to venerate Warhammer 40,000: Space Marine as it celebrates its tenth birthday this month. Relic Entertainment and Sega have a surprise for us all too, turning the third-person ork-smasher into an 'Anniversary Edition' which includes all the DLC as well as bonuses like the soundtrack. That's all for free, which is nice.\nRead more",
          "link": "https://www.rockpapershotgun.com/warhammer-40000-space-marine-adds-dlc-in-surprise-anniversary-edition",
          "publishedOn": "2021-09-24T09:43:46.000Z",
          "wordCount": 853,
          "title": "Warhammer 40,000: Space Marine adds DLC in surprise 'Anniversary Edition'"
        },
        {
          "id": "https://www.rockpapershotgun.com/steam-deck-compatibility-conundrum-partially-solved-with-easy-anti-cheat-support",
          "author": "James Archer",
          "description": "The Steam Deck has just broken through a major compatibility barrier: one that would have made it difficult for some of Steam’s most-played multiplayer games to properly function on the Valve handheld. Gabe and co. have Epic to thank for this one, though, as the latter’s Easy Anti-Cheat (EAC) tech is now extending support to Linux and it Wine and Proton compatibility layers. The same layers, you may recall, that the Steam Deck relies on to run games without native Linux ports. In other words, games with multiplayer components that wouldn’t have worked on the Steam Deck - because their use of EAC precluded Linux/Wine/Proton compatibility - should, in theory, be able to run in full.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/steam-deck-compatibility-conundrum-partially-solved-with-easy-anti-cheat-support",
          "publishedOn": "2021-09-24T09:17:41.000Z",
          "wordCount": 965,
          "title": "Steam Deck compatibility conundrum partially solved with Easy Anti-Cheat support"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-slimes-how-to-find-slimes-make-slime-farm",
          "author": "Hayden Hefford",
          "description": "Want to know how to find Slimes in Minecraft? Slimes can vary in size from annoying little blobs to giant monstrosities, but there’s one thing they all have in common. They all drop Slimeballs, which are extremely useful in Minecraft.\nThis guide will take you through everything that you need to know about Slimes, including how to find them, what you can use Slimeballs for, and how to make your own Slime farm.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-slimes-how-to-find-slimes-make-slime-farm",
          "publishedOn": "2021-09-24T08:49:34.000Z",
          "wordCount": 1551,
          "title": "How to find Slimes and make a Slime Farm in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/fuga-memories-of-steel-is-a-strategy-rpg-with-a-giant-child-powered-tank",
          "author": "Graham Smith",
          "description": "Fuga: Melodies Of Steel is set during an anthropomorphic animal anime World War 2 in which your parents have been taken by the dog Nazis. Still with me? You and your fellow cat children find Howl's Moving Tank in a cave and set about getting your families back, with turn-based, RPG battles.\r\n\nYou also discover at the end of the tutorial that your giant angry house has a \"Soul Cannon\", which is a gun that only fires if you feed it the soul - and permanently kill - one of the children.\r\n\nStill with me?\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/fuga-memories-of-steel-is-a-strategy-rpg-with-a-giant-child-powered-tank",
          "publishedOn": "2021-09-23T23:05:15.000Z",
          "wordCount": 876,
          "title": "Fuga: Melodies Of Steel is a strategy RPG with a giant child-powered tank"
        },
        {
          "id": "https://www.rockpapershotgun.com/halo-infinites-multiplayer-test-will-go-ahead-as-planned",
          "author": "Graham Smith",
          "description": "Breaking news: everything is normal and fine. Yesterday Halo Infinite developers 343 Industries mentioned during a livestream that they might need to delay this weekend's beta. Today they confirmed that's not the case, and posted an overview of what to expect.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/halo-infinites-multiplayer-test-will-go-ahead-as-planned",
          "publishedOn": "2021-09-23T21:58:40.000Z",
          "wordCount": 911,
          "title": "Halo Infinite's multiplayer test will go ahead as planned"
        },
        {
          "id": "https://www.rockpapershotgun.com/csgos-operation-riptide-revives-the-riot-shield-and-makes-a-major-change-to-dust2",
          "author": "Graham Smith",
          "description": "The riot shield was probably the most divisive item ever added to Counter-Strike - and now it's back. New update Operation Riptide, out now, introduces the defensive item to Counter-Strike: Global Offensive's casual mode, alongside major tweaks to Dust2, new missions, shorter matches, and private matchmaking queues.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/csgos-operation-riptide-revives-the-riot-shield-and-makes-a-major-change-to-dust2",
          "publishedOn": "2021-09-23T20:52:02.000Z",
          "wordCount": 982,
          "title": "CS:GO's Operation Riptide revives the riot shield"
        },
        {
          "id": "https://www.rockpapershotgun.com/diablo-2-resurrected-characters-keep-disappearing-among-many-launch-issues",
          "author": "Graham Smith",
          "description": "Diablo 2: Resurrected launched earlier today, offering players the chance to relive the classic hack-and-slasher. But why recreate the experience of one Diablo game when you could recreate the experience of two? Resurrected is also experiencing a bunch of launch issues related to its online mode, just like Diablo 3 before it.\r\n\nThose issues include players being unable to see their existing characters, create new characters, or launch the game. Some might say essential features.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/diablo-2-resurrected-characters-keep-disappearing-among-many-launch-issues",
          "publishedOn": "2021-09-23T19:24:31.000Z",
          "wordCount": 917,
          "title": "Diablo 2: Resurrected characters keep disappearing, among many launch issues"
        },
        {
          "id": "https://www.rockpapershotgun.com/diablo-2-resurrected-hotkeys-are-still-a-goddamn-mess",
          "author": "Alice Bell",
          "description": "Terrible news continues to pour out of Blizzard like pus from of a festering wound around a splinter you forgot about and left for way too long. You should really get that looked at. Still, they must be drawing some comfort from the fact that Diablo II: Resurrected is out today, one of Blizz's most beloved games of all time.\nNaturally, a lot of people will be excited for the remastered version. But if my tone is more immediately aggro than the last time I wrote about Diablerrected, that's because I was previously playing the beta through the rose-tinted haze of this game being very important to me and a big part of my childhood, and bonding with my older brother, and so on. This time, I have been playing the final version for several hours, and am cross.\nRead more",
          "link": "https://www.rockpapershotgun.com/diablo-2-resurrected-hotkeys-are-still-a-goddamn-mess",
          "publishedOn": "2021-09-23T16:30:00.000Z",
          "wordCount": 1341,
          "title": "Diablo 2: Resurrected's hotkeys are still a goddamn mess"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-rally-point-putting-mech-engineer-on-trial-and-error",
          "author": "Sin Vega",
          "description": "When you've played a lot of games, or seen a lot of films, or probably eaten at a lot of restaurants or generally oversaturated your life with one subject, it's easy to start making rules and codes for How It Should Be. I given a lot of games a hard time for being opaque and failing to explain themselves. And yet here I am, finally writing about Mech Engineer after watching and playing it for nine months, waiting for it to hit the point where I can almost, sort of, not exactly recommend it... but share my fascination with it.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-rally-point-putting-mech-engineer-on-trial-and-error",
          "publishedOn": "2021-09-23T16:05:50.000Z",
          "wordCount": 2198,
          "title": "The Rally Point: Putting Mech Engineer on trial (and error)"
        },
        {
          "id": "https://www.rockpapershotgun.com/call-of-duty-vanguard-will-sadly-fix-dognados",
          "author": "Alice O'Connor",
          "description": "The primary function of ragdoll physics in video games, everyone knows, is to freak out and make people laugh. Everyone knows this. The technology was created explicitly to bring a subversive touch of merry mayhem to po-faced murdergames. Everyone knows this. But developers are wary of overdoing it or openly acknowledging this fact which everyone knows. This is why, sadly, Call Of Duty: Vanguard will indeed 'fix' the 'bug' which could make attack dogs turn into a giant maelstrom of limbs, teeth, and mashing meat noises, a phenomenom known as the 'dognado'. Tragic.\nRead more",
          "link": "https://www.rockpapershotgun.com/call-of-duty-vanguard-will-sadly-fix-dognados",
          "publishedOn": "2021-09-23T15:50:50.000Z",
          "wordCount": 846,
          "title": "Call Of Duty: Vanguard will, sadly, fix dognados"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-to-set-up-two-monitors",
          "author": "James Archer",
          "description": "It’s funny to think how different the use cases are for setting up two monitors for your gaming PC, compared to setting up three. A trio of displays lets you play in ultrawide with a wraparound effect that even most purpose-built ultrawide monitors can’t match, but while you can configure a dual-monitor setup to run games across displays, it doesn’t make nearly as much sense. With the borders of each screen running straight down the middle, most of the best ultrawide PC games would be nigh-unplayable. Still! If you can budget for it, two remains better than one. It’s an expanded but focused setup for when you’re playing a full-screen game but also want a browser tab, video, or streaming controls visible at the same time.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/how-to-set-up-two-monitors",
          "publishedOn": "2021-09-23T15:23:38.000Z",
          "wordCount": 1531,
          "title": "How to set up two monitors"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-diablo-2-resurrected-classes-and-builds",
          "author": "Charlie Biggerstaff",
          "description": "Looking for the best classes and builds in Diablo 2: Resurrected? The shiny new remaster is finally here, but the gameplay of Diablo 2: Resurrected will be very familiar to veterans. If you’re playing for the first time, however, the game’s complex character progression can seem overwhelming. The foundations of your experience are your choice of class, and the skill(s) you build around on that class. Each of Diablo 2’s seven classes features multiple talent trees that grant you new abilities and define how you approach the game.\nIf you’re planning to play on Hardcore mode or push deep into Hell difficulty, you will want a quality build. Blizzard has not made balance adjustments to Diablo 2: Resurrected, so the long-established meta still holds in the remaster. Prepare for Hell with our guide to the best classes and builds in Diablo 2: Resurrected.\nRead more",
          "link": "https://www.rockpapershotgun.com/best-diablo-2-resurrected-classes-and-builds",
          "publishedOn": "2021-09-23T15:20:53.000Z",
          "wordCount": 2510,
          "title": "Best Diablo 2: Resurrected classes and builds"
        },
        {
          "id": "https://www.rockpapershotgun.com/diablo-2-resurrected-runes-runewords",
          "author": "Charlie Biggerstaff",
          "description": "Trying to wrap your head around Runes in Diablo 2: Resurrected? Runes are the cornerstone of Diablo 2’s gear system. As there are no balance changes in Diablo 2: Resurrected, longtime players will be familiar. If you’re new, however, this system will look entirely unfamiliar, even if you’ve played Diablo 3 or Path of Exile. There’s nothing quite like Diablo 2’s Rune system in the ARPG genre. If you’re having trouble wrapping your head around the quirks of Runes and Runewords, we’re here to help.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/diablo-2-resurrected-runes-runewords",
          "publishedOn": "2021-09-23T15:20:49.000Z",
          "wordCount": 2143,
          "title": "Diablo 2: Resurrected Runes and Runewords"
        },
        {
          "id": "https://www.rockpapershotgun.com/diablo-2-resurrected-farming-level-85",
          "author": "Charlie Biggerstaff",
          "description": "Looking for the best farming spots in Diablo 2? An ARPG would be nothing without a grind. The grind in Diablo 2 is the foundation of the genre’s last 20 years. The genre-defining classic has seen very few changes for the remastered version, Diablo 2: Resurrected, so veterans of the original will have their strategies in place. If you’re a new player looking to optimize your character after beating the game though, you’ll need to know where to farm your gear. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/diablo-2-resurrected-farming-level-85",
          "publishedOn": "2021-09-23T15:20:45.000Z",
          "wordCount": 1294,
          "title": "Diablo 2: Resurrected farming spots"
        }
      ]
    },
    {
      "title": "Root.cz - články",
      "feedUrl": "https://www.root.cz/rss/clanky/",
      "siteUrl": "https://www.root.cz/clanky/",
      "articles": [
        {
          "id": "www.root.cz-text-15551",
          "author": "redakce@root.cz (Root.cz: Karel Kulhavý)",
          "description": "Dcraw koriguje chromatickou aberaci a G'MIC vinětaci jednoduché soustavy dalekohledu a iPhonu, kterým vyfotíme manuálně v režimu raw a data přeneseme do Linuxu přes Wi-Fi nebo USB.",
          "link": "https://www.root.cz/clanky/fotografovani-dalekohledem-priprava-a-softwarova-optimalizace/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-29T22:00:10.000Z",
          "wordCount": 2024,
          "title": "Fotografování dalekohledem: příprava a softwarová optimalizace",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/426/dalekohled-1.jpg",
            "length": "42720",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15685",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "V deváté části seriálu o křivkách si popíšeme některé křivky, které byly po svém objevu nazývány „matematická monstra“, protože neodpovídaly tehdejším představám o chování „správných“ křivek.",
          "link": "https://www.root.cz/clanky/patologicke-krivky-a-jina-matematicka-monstra/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-29T22:00:05.000Z",
          "wordCount": 7553,
          "title": "Patologické křivky a jiná matematická monstra",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/507/krivka-perex-1.jpg",
            "length": "74201",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15683",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "Představíme si projekt nazvaný ULua, což je distribuce tohoto programovacího jazyka pro všechny tři nejpoužívanější operační systémy, která kromě LuaJITu obsahuje i správce balíčků upkg.",
          "link": "https://www.root.cz/clanky/ulua-univerzalni-distribuce-programovaciho-jazyka-lua/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-28T22:00:10.000Z",
          "wordCount": 5090,
          "title": "ULua: univerzální distribuce programovacího jazyka Lua",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/679/lua-mesic-noc-mesto-1.jpg",
            "length": "69823",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15682",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Sonda do světa otevřeného softwaru. Dnes si představíme nástroj pro práci se snímky obrazovky, vyzkoušíme software pro práci s MPO 3D fotografiemi, přeložíme si texty do jiných jazyků a vytvoříme si nějaké ty vědecké grafy.",
          "link": "https://www.root.cz/clanky/softwarova-sklizen-29-9-2021/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-28T22:00:05.000Z",
          "wordCount": 984,
          "title": "Softwarová sklizeň (29. 9. 2021)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/root/368/kombajn-sklizen.jpg",
            "length": "394618",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15681",
          "author": "redakce@root.cz (Root.cz: CESNET CERTS)",
          "description": "Tentokrát se podíváme na zranitelnosti WordPressu, Drupalu, Apache OpenOffice a Nagiosu, na malware Capoae a OpenSUpdater. Naopak potěší, že provozovatel DDoSových serverů i mafiáni dojdou zasloužené odplaty.",
          "link": "https://www.root.cz/clanky/postrehy-z-bezpecnosti-velka-uroda-malwaru-i-zranitelnosti/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-26T22:00:10.000Z",
          "wordCount": 1517,
          "title": "Postřehy z bezpečnosti: velká úroda malwaru i zranitelností",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/213/malware-1.jpg",
            "length": "57907",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15677",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Canonical vydal veřejnou betu Ubuntu 21.10 „Impish Indri“. Tým kolem operačního systému FreeBSD plánuje změnit výchozí root shell. Operační systém LineageOS 18.1 rozšířil seznam podporovaných zařízení.",
          "link": "https://www.root.cz/clanky/distribucni-vestnik-ubuntu-21-10-v-bete-lineageos-podporuje-nova-zarizeni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-26T22:00:05.000Z",
          "wordCount": 1142,
          "title": "Distribuční věstník: Ubuntu 21.10 v betě, LineageOS podporuje nová zařízení",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/537/ubuntu-21-10-impish-indri-1.jpg",
            "length": "13671",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15680",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Beta verze Ubuntu 21.10, MidnightBSD 2.1 přechází na LLVM 10, Apple vydal iPhony 13, nabídne i ProRes video, vývojová verze Wine 6.18, Joe Biden jmenoval šéfku AMD do svého poradního týmu, AMD a Mediatek dohromady.",
          "link": "https://www.root.cz/clanky/novy-textovy-editor-pro-gnome-100procentne-evropske-risc-v-procesory-epi-epac10/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-25T22:00:00.000Z",
          "wordCount": 1596,
          "title": "Nový textový editor pro GNOME, 100% evropské RISC-V procesory EPI EPAC1.0",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/252/dr-lisa-su-1.jpg",
            "length": "21252",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15678",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Exekutivě Evropské unie došla trpělivost a chystá nařízení, kterým sjednotí roztříštěný svět nabíječek (nejen) smartphonů. Postihne to všechny, kdo se vymykají standardu USB-C, v čele s Apple.",
          "link": "https://www.root.cz/clanky/evropska-komise-chce-jednotnou-nabijecku-s-usb-c-a-power-delivery/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-23T22:00:10.000Z",
          "wordCount": 2113,
          "title": "Evropská komise chce jednotnou nabíječku s USB-C a Power Delivery",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/485/usb-c-1.jpg",
            "length": "22817",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15675",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Na konci září vyprší platnost kořenového certifikátu DST Root CA X3, na kterém od začátku stála podpora certifikační autority Let's Encrypt. Ta už sice používá nový kořen, ale staré systémy budou mít problém.",
          "link": "https://www.root.cz/clanky/koren-let-s-encrypt-na-konci-mesice-vyprsi-dotkne-se-to-starsich-klientu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T22:00:10.000Z",
          "wordCount": 1812,
          "title": "Kořen Let's Encrypt na konci měsíce vyprší, dotkne se to starších klientů",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/102/cerveny-zamek-1.jpg",
            "length": "46645",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15676",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "V první polovině osmdesátých let patřilo k dobrému vychování dodávat domácí i osobní počítače vybavené nějakým dialektem programovacího jazyka BASIC. Výjimkou není ani IBM PC, pro které byl dodáván mj. i GW-BASIC, později QBasic.",
          "link": "https://www.root.cz/clanky/pc-basic-reinkarnace-popularniho-i-zatracovaneho-gw-basicu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T22:00:05.000Z",
          "wordCount": 8577,
          "title": "PC-BASIC: reinkarnace populárního i zatracovaného GW-BASICu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/567/pc-basic-1.jpg",
            "length": "61248",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "Root.cz - zprávičky",
      "feedUrl": "https://www.root.cz/rss/zpravicky/",
      "siteUrl": "https://www.root.cz/zpravicky/",
      "articles": [
        {
          "id": "www.root.cz-actuality-42860",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Zhruba před 11 lety přišel Intel s velmi kontroverzním a negativně vnímaným programem Upgrade Service. V rámci něj bylo možné u vybraných CPU za úplatek odemknout do té doby neaktivní části CPU a zvýšit tak jeho parametry (tu odemknout HyperThreading, tu zvýšit frekvence, tu zvětšit cache). Program by přijat s odporem IT komunity a víceméně během roku 2011 vyšuměl do ztracena.",
          "link": "https://www.root.cz/zpravicky/intel-software-defined-silicon-sdsi-softwarove-upgrady-cpu-se-vraci-na-scenu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-29T14:54:38.000Z",
          "wordCount": 2689,
          "title": "Intel Software Defined Silicon (SDSi), softwarové upgrady CPU se vrací na scénu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/338/pat-gelsinger-intel-s-ponte-vecchio-1.jpg",
            "length": "44408",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42859",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "AMD představila svoji vizi pro příští čtyři roky. Firma věří, že do roku 2025 dosáhnou její procesory 30× vyšší efektivity při běhu AI a HPC úloh. Slovem procesory jsou zde myšleny jak modely řady EPYC, tak GPU typu (Radeon) Instinct.",
          "link": "https://www.root.cz/zpravicky/amd-chce-30-efektivnejsi-ai-na-cpu-i-gpu-do-roku-2025/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-29T14:23:02.000Z",
          "wordCount": 1041,
          "title": "AMD chce 30× efektivnější AI na CPU i GPU do roku 2025",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/607/radeon-instinct.jpg",
            "length": "30510",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42858",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Vydání pětatřicáté Fedory se blíží, máme tu beta verzi a s ní i přijatelně fungující možnost vyzkoušet si nejen čerstvé GNOME 41, ale také další novinky, kterými Fedora posouvá linuxový desktop zase více do budoucnosti (v čele třeba s projektem PipeWire). Ostrá verze bude vydána na konci října, beta je k dispozici mimo jiné v podobě Workstation, Server i IoT, samozřejmě pak též v podobě Spinů (s jinými desktopovými prostředími) a Lab(s)ů (předpřipravená pro specifické potřeby) a také pro platformu ARM.",
          "link": "https://www.root.cz/zpravicky/fedora-linux-35-beta-vyzkousejte-si-gnome-41/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-29T09:49:46.000Z",
          "wordCount": 853,
          "title": "Fedora Linux 35 Beta, vyzkoušejte si GNOME 41",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/563/gnome-1.jpg",
            "length": "37205",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-39289",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "HTTPS se stává běžným, většina webů už ho nasadila. Jak to ale udělat správně, opravdu bezpečně a hlavně bezbolestně? Na školení HTTPS pro správce serverů si ukážeme si nejnovější trendy, prakticky si vyzkoušíme vygenerování certifikátu a nasazení na web server.",
          "link": "https://www.root.cz/zpravicky/https-pro-spravce-serveru-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-29T08:26:52.000Z",
          "wordCount": 781,
          "title": "HTTPS pro správce serverů (online školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/131/https-1.jpg",
            "length": "50861",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42857",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Před lety varoval tehdejší šéf Intelu Brian Krzanich před tím, aby AMD získalo 15–20% podíl v serverech (resp. že jej získá), na úkor firemních výdělečných Xeonů. Intel ale stále není schopen dodat novou generaci Xeonů v množství dostatečném pro saturování zákazníků, takže ti častěji pokukují po EPYCech od AMD, které ostatně nabízí lepší parametry.",
          "link": "https://www.root.cz/zpravicky/amd-dosahla-16-podilu-v-serverech-xeony-ice-lake-stale-nedostatkove/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-28T10:53:13.000Z",
          "wordCount": 1257,
          "title": "AMD dosáhla 16% podílu v serverech, Xeony Ice Lake stále nedostatkové",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/612/lisa-su-s-64core-amd-epyc-rome-1.jpg",
            "length": "41520",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42856",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Electronic Frontier Foundation se připravuje na postupné ukončení podpory pro rozšíření HTTPS Everywhere, které na webech automaticky přepíná z HTTP na HTTPS. To už podle organizace začíná být zbytečné, protože rozšíření HTTPS zažilo v posledních letech výrazný nárůst a prohlížeče navíc přišly s vlastním řešením automatického přechodu na HTTPS.",
          "link": "https://www.root.cz/zpravicky/rozsireni-https-everywhere-miri-do-duchodu-uz-neni-potreba/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-27T12:15:46.000Z",
          "wordCount": 1103,
          "title": "Rozšíření HTTPS Everywhere míří do důchodu, už není potřeba",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/483/https-1.jpg",
            "length": "37159",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42855",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Vývojáři uvolnili novou verzi balíku OpenSSH s označením 8.8. Hlavní novinkou je vypnutí podpory protokolu ssh-rsa, který staví na slabém hašovacím algoritmu SHA-1. Na změnu upozorňovalo několik předchozích verzí, většina uživatelů si navíc ničeho nevšimne, protože OpenSSH podporuje algoritmy RSA/SHA-256/512 (RFC8332) od verze 7.2 a automaticky je použije.",
          "link": "https://www.root.cz/zpravicky/openssh-8-8-vypina-podporu-protokolu-ssh-rsa/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-27T12:03:01.000Z",
          "wordCount": 2296,
          "title": "OpenSSH 8.8 vypíná podporu protokolu ssh-rsa",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/218/openssh-1.jpg",
            "length": "23624",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42853",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Na Kickstarteru před několika dny začala kampaň na novou verzi kamery OAK-D-Lite. Umožní snadno a rychle vytvořit aplikaci, která bude pracovat s obsahem videa. Může například rozpoznávat SPZ, překládat znakový jazyk, rozpoznávat gesta rukou a podobně.",
          "link": "https://www.root.cz/zpravicky/kampan-na-programovatelnou-kameru-oak-d-lite-na-kickstarteru/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-27T11:22:03.000Z",
          "wordCount": 952,
          "title": "Kampaň na programovatelnou kameru OAK-D-Lite na Kickstarteru",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/372/oak-d-lite-1.jpg",
            "length": "48912",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42854",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Dňa 29. 9. 2021 od 18:00 do 20:00, 23. stretnutie komunity ohľadne technológií Cloud Native – Kubernetes – ONLINE",
          "link": "https://www.root.cz/zpravicky/23-stretnutie-komunity-ohladne-technologii-cloud-native-kubernetes-online/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-27T11:11:58.000Z",
          "wordCount": 834,
          "title": "23. stretnutie komunity ohľadne technológií Cloud Native – Kubernetes - ONLINE",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/122/kubernetes-1.jpg",
            "length": "21058",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-40262",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Většina počítačových programů generuje logy – tedy zprávy a záznamy o své činnosti. ELK Stack – ElasticSearch, Logstash, Kibana – je populární nástroj, který umí logy efektivně zpracovávat, ukládat a zpřístupňovat.",
          "link": "https://www.root.cz/zpravicky/elk-stack-naucte-se-elasticsearch-logstach-a-kibana-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-27T09:53:21.000Z",
          "wordCount": 794,
          "title": "ELK Stack: naučte se Elasticsearch, Logstash a Kibana (školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/244/elk-logo-1.png",
            "length": "100652",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42851",
          "author": "redakce@root.cz (Root.cz: klokan)",
          "description": "Server This Week in Rust přinesl odkaz na zajímavý článek z pera tří vývojářů projektu Chromium. Autoři v něm rozvíjejí myšlenku implementovat v C++ stejná, nebo alespoň podobná pravidla paměťové bezpečnosti na úrovni typového systému, jako má Rust (tzv. Borrow Checking).",
          "link": "https://www.root.cz/zpravicky/uvahy-o-borrow-checkeru-pro-c/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-25T10:43:21.000Z",
          "wordCount": 17372,
          "title": "Úvahy o Borrow Checkeru pro C++",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/116/fustrovany-programator-1.jpg",
            "length": "53261",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42850",
          "author": "redakce@root.cz (Root.cz: spajk)",
          "description": "Společnost Brave, známá především svým internetovým prohlížečem zaměřeným na soukromí představila novou službu na bezpečné videohovory. Jmenuje se Brave Talk, v základu je zdarma, běží na Jitsi as a Service a je open-source. Začít můžete na talk.brave.com.",
          "link": "https://www.root.cz/zpravicky/brave-vydal-brave-talk-sluzbu-pro-bezpecne-videohovory/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-24T13:35:15.000Z",
          "wordCount": 2689,
          "title": "Brave vydal Brave Talk: službu pro bezpečné videohovory",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/28/brave-talk-1.jpg",
            "length": "47485",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42849",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Vývojáři uvolnili konečnou betaverzi připravovaného Ubuntu 21.10 s kódovým označením Impish Indri (rošťácký lemur). Vše jde podle připraveného časového harmonogramu, čeká nás ještě kandidát na vydání a poté přijde 14. října ostrá verze.",
          "link": "https://www.root.cz/zpravicky/vysla-konecna-betaverze-ubuntu-21-10-vydani-je-planovano-na-14-rijna/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-24T10:35:29.000Z",
          "wordCount": 1329,
          "title": "Vyšla konečná betaverze Ubuntu 21.10, vydání je plánováno na 14. října",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/537/ubuntu-21-10-impish-indri-1.jpg",
            "length": "13671",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-40036",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Na internetu píšou, že začít s automatizací správy serverů můžete do půl hodiny. Dokážeme vám, že s Ansible to je pravda. Stačí navštívit naše pražské školení Ansible – úvod do automatizace a pak navazující Ansible – role a AWX.",
          "link": "https://www.root.cz/zpravicky/ansible-uvod-do-automatizace-role-a-awx-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-24T09:51:46.000Z",
          "wordCount": 778,
          "title": "Ansible: úvod do automatizace, role a AWX (školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/330/ansible-1.jpg",
            "length": "20637",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42848",
          "author": "redakce@root.cz (Root.cz: D.A. Tiger)",
          "description": "Sourcetrail je open-source program, který slouží k statické analýze a vizualizaci zdrojových kódů v jazycích C, C++ a Python. Dnes jeho vývojáři na svém blogu oznámili ukončení jeho vývoje.",
          "link": "https://www.root.cz/zpravicky/sourcetrail-konci-vyvoj-je-prilis-narocny/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-24T07:20:16.000Z",
          "wordCount": 1894,
          "title": "Sourcetrail končí, vývoj je příliš náročný",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/343/sourcetrail-1.jpg",
            "length": "23300",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42846",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Na základě článku laboratoře QRATOR labs firma MikroTik na svých stránkách upozorňuje na další vlnu DDoS útoků.",
          "link": "https://www.root.cz/zpravicky/mikrotik-zaziva-dalsi-vlnu-ddos-utoku/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-23T07:13:54.000Z",
          "wordCount": 5102,
          "title": "MikroTik zažívá další vlnu DDoS útoků",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/639/mikrotik-1.jpg",
            "length": "30507",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42847",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Vývojáři uvolnili pravidelnou půlroční aktualizaci desktopového prostředí GNOME, tentokrát s označením 41. Mezi hlavní novinky patří vylepšení správce software, nastavení multitaskingu a vylepšení power managementu. Kromě toho je tu nová aplikace Connections, aktualizovaná aplikace Music a vylepšení výkonu v celé řadě komponent.",
          "link": "https://www.root.cz/zpravicky/gnome-41-prinasi-vylepseni-vykonu-a-novinky-v-podpore-waylandu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-23T07:10:05.000Z",
          "wordCount": 814,
          "title": "GNOME 41 přináší vylepšení výkonu a novinky v podpoře Waylandu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/563/gnome-1.jpg",
            "length": "37205",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42845",
          "author": "redakce@root.cz (Root.cz: LD)",
          "description": "Včera večer byla vydána opravná verze VMware vCenter 6.5, 6.7 a 7.0. Tato nová sada verzí opravuje několik kritických zranitelností, od XSS, přístupu k skrytým endpointům API, neoprávněnou manipulaci s nastavením sítě virtuálních strojů, vzdálené mazání souborů na vCenteru až po asi nejzávažnější vzdálené spuštění kódu.",
          "link": "https://www.root.cz/zpravicky/rada-kritickych-chyb-ve-vmware-vcenter/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T20:42:02.000Z",
          "wordCount": 1205,
          "title": "Řada kritických chyb ve VMware vCenter",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/295/vmware-1.jpg",
            "length": "60135",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42844",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Možná nejvýznačnější novinkou v Chrome/Chromium 94 pro uživatele je to, že element canvas je nyní implicitně kalibrován na barevný prostor sRGB, nicméně stránka může specifikovat jiný, podporován je i DCI-P3. Pete LaPage dále doporučuje na web.dev věnovat pozornost textu Eugena Zemtsova o WebCodecs s příklady využití přímého videa pomocí hardwarově akcelerovaných kodeků, které již prohlížeč má (aneb blíží se konec nutnosti dodávat v kódu vlastní neakcelerovanou WASM verzi kodeků). Podpora kodeků skrze WebCodecs se týká jak přehrávání, tak komprese.",
          "link": "https://www.root.cz/zpravicky/chrome-94-nasazuje-srgb-u-elementu-canvas-a-pridava-webgpu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T15:45:46.000Z",
          "wordCount": 858,
          "title": "Chrome 94 nasazuje sRGB u elementu canvas a přidává WebGPU",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/328/chrome-1.jpg",
            "length": "14231",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42843",
          "author": "redakce@root.cz (Root.cz: spajk)",
          "description": "Test deseti webových prezentací politických stran odhalil v pěti případech kritické zranitelnosti, nejčastěji se jednalo o cross-site scripting, objevily se ale zranitelné zastaralé knihovny a v jednom případě také děravý jedenáct let starý Apache. Více ve zprávě na webu spajk.cz.",
          "link": "https://www.root.cz/zpravicky/webove-stranky-politickych-stran-obsahuji-zranitelnosti/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T08:12:18.000Z",
          "wordCount": 4415,
          "title": "Webové stránky politických stran obsahují zranitelnosti",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/208/xss-notebook-1.jpg",
            "length": "64540",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42841",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "V Linuxu 5.16 dojde ke změně v ovladači nct6775, který obstarává čtení dat ze senzorů mnohých základních desek značky ASUS. Ovladač dostane podporu přístupu k ASIC za použití funkcí ASUS WMI (desky od Asusteku nepoužívají standardní cestu přes ACPI, kterou ovladač disponuje již nyní). S úpravou pak logicky do jádra zamíří i podpora níže uvedeného seznamu základních desek:",
          "link": "https://www.root.cz/zpravicky/linux-5-16-prinese-podporu-senzoru-dalsich-zakladnich-desek-asus/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T06:00:00.000Z",
          "wordCount": 918,
          "title": "Linux 5.16 přinese podporu senzorů dalších základních desek ASUS",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/52/asus-rog-strix-x470-f-gaming-1.jpg",
            "length": "35903",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42840",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Na GIMP 3.0 si ještě chvíli počkáme, vezměmež tedy zavděk dalším, víceméně opravným vydání dva-desítkové řady. GIMP 2.10.28 totiž přináší solidní množství oprav.",
          "link": "https://www.root.cz/zpravicky/gimp-2-10-28-opravuje-dalsi-chyby/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T05:00:00.000Z",
          "wordCount": 837,
          "title": "GIMP 2.10.28 opravuje další chyby",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/158/gimp-2-10-20-1.jpg",
            "length": "50629",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42839",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Canonical rozhodl o prodloužení podpory starších LTS vydání operačního systému Ubuntu na 10 let od první vydané verze. To znamená, že řada Ubuntu 14.04 LTS „Trusty Tahr“ bude podporována až do dubna 2024 a řada Ubuntu 16.04 LTS „Xenial Xerus“ až do dubna 2026.",
          "link": "https://www.root.cz/zpravicky/podpora-ubuntu-14-04-lts-a-16-04-lts-se-prodluzuje-na-10-let/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-21T22:00:00.000Z",
          "wordCount": 1907,
          "title": "Podpora Ubuntu 14.04 LTS a 16.04 LTS se prodlužuje na 10 let",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/223/ubuntu-14-04-esm-1.jpg",
            "length": "22623",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42842",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Laboratoře CZ.NIC vydaly další verzi mobilní Datovky (1.13.0). Kromě oprav nalezených chyb, jako jsou oprava chyby při načítání uložených informací o datovém trezoru nebo vypnutí upozornění na vypršení platnosti hesla, pokud je zvoleno přihlašování Mobilním klíčem, byl podobně jako v případě desktopové aplikace přidán výběr způsobu platby za odesílané poštovní datové zprávy, pokud má uživatel k dispozici více možností.",
          "link": "https://www.root.cz/zpravicky/nova-mobilni-datovka-nabizi-dalsi-zpusob-platby-za-odesilane-postovni-datove-zpravy/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-21T20:00:08.000Z",
          "wordCount": 840,
          "title": "Nová mobilní Datovka nabízí další způsob platby za odesílané poštovní datové zprávy",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/556/datovka-cz-nic-1.jpg",
            "length": "16539",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42838",
          "author": "redakce@root.cz (Root.cz: Ondřej Nový)",
          "description": "Celodenní soutěžní hackathon pro programátory od české technologické společnosti Seznam.cz zná své vítěze. Nejlepší výkon předvedl tým s názvem EasyPeasy.Net ve složení Tomáš Jurásek, Michal Mrnuštík, Michal Motyčka a Adam Jež (zleva).",
          "link": "https://www.root.cz/zpravicky/v-seznamackem-hackathonu-zvitezil-tym-easypeasy-net/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-21T10:06:05.000Z",
          "wordCount": 2430,
          "title": "V seznamáckém hackathonu zvítězil tým EasyPeasy.Net",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/417/hackaton-seznam-cz-2021-1.jpg",
            "length": "67345",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "abclinuxu - aktuální články",
      "feedUrl": "http://www.abclinuxu.cz/auto/abc.rss",
      "siteUrl": "http://www.abclinuxu.cz/clanky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/clanky/distribucni-novinky-36-37-2021",
          "author": "Redakce",
          "description": "Na sklonku léta vyšel nový Whonix, podíváme se na systém pro klientské stanice ThinStation a aktualizovány byly také distribuce Finnix, Lakka, GhostBSD, Tails, Kali, Ubuntu LTS, Sailfish OS nebo Sparky Linux.",
          "link": "http://www.abclinuxu.cz/clanky/distribucni-novinky-36-37-2021",
          "publishedOn": "2021-09-29T00:00:00.000Z",
          "wordCount": 1889,
          "title": "Distribuční novinky 36-37/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/chcete-vedet-kolik-byste-mohli-vydelavat-u-konkurence-na-stejne-pozici",
          "author": "Reklama",
          "description": "Peníze jsou ožehavé téma, obzvlášť jedná-li se o výplaty v zaměstnání. Člověk přemýšlí, zda kolegové nevydělávají víc nebo jestli by si u jiného zaměstnavatele nepolepšil. Jak to ale zjistit? Teď naštěstí jednoduše, protože IT pracovní portál No Fluff Jobs u všech nabídek zveřejňuje nabízené platové ohodnocení.",
          "link": "http://www.abclinuxu.cz/clanky/chcete-vedet-kolik-byste-mohli-vydelavat-u-konkurence-na-stejne-pozici",
          "publishedOn": "2021-09-26T22:01:00.000Z",
          "wordCount": 1353,
          "title": "Chcete vědět kolik byste mohli vydělávat u konkurence na stejné pozici?"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-umela-inteligence-uprostred-jihoamerickych-lesu-pomaha-zachranit-psiho-samotare",
          "author": "Redakce",
          "description": "Video, se kterým konečně pochopíte rozdíl mezi běžným a moderním úložištěm. Digitalizace zákaznické péče: jak vybrat nejlepší řešení kontaktního centra. Jaké novinky přináší Arcserve UDP 8.1? On-line konference VMworld 2021: stovky přednášek a tutoriálů zdarma. Gartner na křivce seřadil klíčové nastupující technologie. Studie Dell Technologies: hrozba ztráty dat po kyberútoku je větší, než kdy jindy. Umělá inteligence uprostřed jihoamerických lesů pomáhá zachránit psího samotáře.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-umela-inteligence-uprostred-jihoamerickych-lesu-pomaha-zachranit-psiho-samotare",
          "publishedOn": "2021-09-25T22:01:00.000Z",
          "wordCount": 1759,
          "title": "Týden na ITBiz: Umělá inteligence uprostřed jihoamerických lesů pomáhá zachránit psího samotáře"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-38-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-38-2021",
          "publishedOn": "2021-09-24T22:01:00.000Z",
          "wordCount": 2660,
          "title": "Událo se v týdnu 38/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-planety-v-centru-mlecne-drahy",
          "author": "Redakce",
          "description": "Moudrost davu. Dokážeme úspěšně předpovědět, kdy k nám dorazí světlo supernovy? Kvasary jako standardní svíčky. Neutron má na povrchu záporný náboj. Proč se zlato vyskytuje vedle arsenu.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-planety-v-centru-mlecne-drahy",
          "publishedOn": "2021-09-23T22:30:00.000Z",
          "wordCount": 1672,
          "title": "Týden na ScienceMag.cz: Planety v centru Mléčné dráhy"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-komunikace-ma-zvysovat-produktivitu-vyvojaru",
          "author": "Redakce",
          "description": "Hlavní trendy umělé inteligence: Malá a rozprostřená data. Nový typ kybernetických útoků – zneužívání proxyware platforem. Roboti, kteří udělají přesnou díru do hlavy, zachraňují životy. O vstupu do nebe rozhoduje sv. Petr, pro síť je tu ClearPass. Kouzla zbavené? Nepravděpodobné řešení hrozící personální krize ve finančních službách. Honeywell u nás investuje do R&D. Komunikace má zvyšovat produktivitu vývojářů.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-komunikace-ma-zvysovat-produktivitu-vyvojaru",
          "publishedOn": "2021-09-19T22:01:00.000Z",
          "wordCount": 1849,
          "title": "Týden na ITBiz: Komunikace má zvyšovat produktivitu vývojářů"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-prepinane-zrcadlo-z-roztaveneho-kovu",
          "author": "Redakce",
          "description": "Černá díra vyžrala hvězdu. Nanotechnologie s černým oxidem titaničitým. Život v atmosféře subneptunů. Maličké hory na neutronových hvězdách.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-prepinane-zrcadlo-z-roztaveneho-kovu",
          "publishedOn": "2021-09-18T22:01:00.000Z",
          "wordCount": 1659,
          "title": "Týden na ScienceMag.cz: Přepínané zrcadlo z roztaveného kovu"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-37-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-37-2021",
          "publishedOn": "2021-09-17T22:01:00.000Z",
          "wordCount": 2656,
          "title": "Událo se v týdnu 37/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/goodoffer24-dozivotni-licence-windows-10-pouze-za-12-super-slevy-az-91",
          "author": "Reklama",
          "description": "Pořiďte si doživotní aktivační klíč k Windows 10 za 12,52 EUR na prodejním portálu GoodOffer24.com. Kromě toho nástrojů produktivity od Microsoftu zde lze získat i hry a další software. Nezapomeňte zadat před dokončením nákupu slevový kód  AX30.",
          "link": "http://www.abclinuxu.cz/clanky/goodoffer24-dozivotni-licence-windows-10-pouze-za-12-super-slevy-az-91",
          "publishedOn": "2021-09-17T16:00:00.000Z",
          "wordCount": 1446,
          "title": "GoodOffer24: Doživotní licence Windows 10 pouze za 12 €, super slevy až 91%!"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/distribucni-novinky-34-35-2021",
          "author": "Redakce",
          "description": "Závěr letních prázdnin a začátek školního roku přinesly několik významných vydání, LibreELEC s novým Kodi, příručky Linux From Scratch nebo novou stabilní větev OpenWrt, a také aktualizace Clonezilly, Ubuntu LTS, EndeavourOS, EasyOS či NuTyXu.",
          "link": "http://www.abclinuxu.cz/clanky/distribucni-novinky-34-35-2021",
          "publishedOn": "2021-09-13T23:00:00.000Z",
          "wordCount": 1779,
          "title": "Distribuční novinky 34-35/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-sprava-a-analyza-dat-tlaci-podniky-do-cloudu",
          "author": "Redakce",
          "description": "Lenovo představuje hybridní tablety budoucnosti. Canon rozšiřuje nabídku A3 multifunkcí pro hybridní pracovní prostředí. Správa a analýza dat tlačí podniky do cloudu.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-sprava-a-analyza-dat-tlaci-podniky-do-cloudu",
          "publishedOn": "2021-09-12T22:01:00.000Z",
          "wordCount": 1430,
          "title": "Týden na ITBiz: Správa a analýza dat tlačí podniky do cloudu"
        }
      ]
    },
    {
      "title": "abclinuxu - čerstvé zprávičky",
      "feedUrl": "http://www.abclinuxu.cz/auto/zpravicky.rss",
      "siteUrl": "http://www.abclinuxu.cz/zpravicky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/zpravicky/kea-2.0.0",
          "author": "Ladislav Hagara",
          "description": "Vývojáři open source DHCPv4 a DHCPv6 serveru Kea (Wikipedie) oznámili vydání nové stabilní verze 2.0.0. Přehled novinek v příspěvku na blogu.",
          "link": "http://www.abclinuxu.cz/zpravicky/kea-2.0.0",
          "publishedOn": "2021-09-29T21:27:01.000Z",
          "wordCount": 871,
          "title": "Kea 2.0.0"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/soutez-pro-mlade-programatory-youth-hacking-4-freedom-yh4f",
          "author": "Ladislav Hagara",
          "description": "Free Software Foundation Europe (FSFE) organizuje soutěž pro mladé programátory ve věku 14 až 18 let s názvem Youth Hacking 4 Freedom (YH4F). Zaregistrovat se mohou do 31. října. Na vývoj svého svobodného softwaru budou mít pět měsíců, tj. do konce března. Šest nejlepších získá peněžitou výhru (2 x 4 096 €, 2 x 2 048 €, 2 x 1 024 €) a výlet do Bruselu.",
          "link": "http://www.abclinuxu.cz/zpravicky/soutez-pro-mlade-programatory-youth-hacking-4-freedom-yh4f",
          "publishedOn": "2021-09-28T23:52:15.000Z",
          "wordCount": 1044,
          "title": "Soutěž pro mladé programátory: Youth Hacking 4 Freedom (YH4F)"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/intel-software-defined-silicon-sdsi",
          "author": "Ladislav Hagara",
          "description": "Intel poslal do Linuxu patche přinášející podporu pro Intel Software Defined Silicon (SDSi). Uživatelé procesorů Xeon budou moci získat licence pro další funkce procesoru.",
          "link": "http://www.abclinuxu.cz/zpravicky/intel-software-defined-silicon-sdsi",
          "publishedOn": "2021-09-28T22:55:57.000Z",
          "wordCount": 1322,
          "title": "Intel Software Defined Silicon (SDSi)"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/bangle.js-2-open-source-chytre-hodinky",
          "author": "Ladislav Hagara",
          "description": "Na Kickstarteru běží kampaň na podporu open source chytrých hodinek Bangle.js 2. Programovat je lze v JavaScriptu (Espruino Open Source JavaScript interpreter). Koupit je lze za £59 (1 744 korun). Dodání je plánováno na listopad.",
          "link": "http://www.abclinuxu.cz/zpravicky/bangle.js-2-open-source-chytre-hodinky",
          "publishedOn": "2021-09-28T21:40:51.000Z",
          "wordCount": 972,
          "title": "Bangle.js 2, open source chytré hodinky"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/supertuxkart-1.3",
          "author": "Ladislav Hagara",
          "description": "Byla vydána nová verze 1.3 svobodné multiplatformní závodní hry SuperTuxKart (STK). Přehled novinek v příspěvku na blogu v traileru na YouTube. Kompletní seznam změn na GitHubu.",
          "link": "http://www.abclinuxu.cz/zpravicky/supertuxkart-1.3",
          "publishedOn": "2021-09-28T21:02:14.000Z",
          "wordCount": 880,
          "title": "SuperTuxKart 1.3"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/fedora-linux-35-beta",
          "author": "Ladislav Hagara",
          "description": "Byla vydána betaverze Fedora Linuxu 35, tj. o poslední zastávce před vydáním finální verze, která je momentálně naplánována na 19. října. Fedora Workstation přichází s GNOME 41. Nově vychází Fedora Kinoite s prostředím KDE Plasma založena na rpm-ostree, podobně jako Fedora Silverblue s prostředím GNOME.",
          "link": "http://www.abclinuxu.cz/zpravicky/fedora-linux-35-beta",
          "publishedOn": "2021-09-28T20:48:38.000Z",
          "wordCount": 1117,
          "title": "Fedora Linux 35 Beta"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/ars-technica-pohled-na-btrfs-vecne-nedodelany-linuxovy-souborovy-system",
          "author": "Fluttershy, yay!",
          "description": "Jim Salter na webu Ars Technica ve stručnosti shrnuje vlastnosti souborového systému Btrfs ve srovnání s alternativami (OpenZFS, mdraid+LVM+ext4) a ve zbytku článku varuje před jeho implementací RAID. V navazujících textech se plánuje věnovat dalším funkcím Btrfs.",
          "link": "http://www.abclinuxu.cz/zpravicky/ars-technica-pohled-na-btrfs-vecne-nedodelany-linuxovy-souborovy-system",
          "publishedOn": "2021-09-28T02:44:06.000Z",
          "wordCount": 9720,
          "title": "Ars Technica: pohled na Btrfs, věčně nedodělaný linuxový souborový systém"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/ghostscript-9.55.0",
          "author": "Ladislav Hagara",
          "description": "Byla vydána verze 9.55.0 interpretu PostScriptu (PS) a Portable Document Formatu (PDF) Ghostscript. Mimo jiné byla opravena bezpečnostní chyba CVE-2021-3781, na kterou byl nedávno zveřejněn exploit.",
          "link": "http://www.abclinuxu.cz/zpravicky/ghostscript-9.55.0",
          "publishedOn": "2021-09-27T13:57:58.000Z",
          "wordCount": 873,
          "title": "Ghostscript 9.55.0"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/openssh-8.8",
          "author": "Ladislav Hagara",
          "description": "Byla vydána nová verze 8.8 sady aplikací pro SSH komunikaci OpenSSH. Dle plánu je ve výchozím nastavení zakázán algoritmus ssh-rsa kvůli možnému útoku na SHA-1. V blízké budoucnosti bude scp pro přenosy používat SFTP místo SCP/RCP. Řešena je bezpečnostní chyba CVE-2021-41617.",
          "link": "http://www.abclinuxu.cz/zpravicky/openssh-8.8",
          "publishedOn": "2021-09-27T10:09:43.000Z",
          "wordCount": 892,
          "title": "OpenSSH 8.8"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/texstudio-4.0.0",
          "author": "Ladislav Hagara",
          "description": "TeXstudio (Wikipedie), tj. integrované prostředí pro vytváření dokumentů v LaTeXu, bylo vydáno ve verzi 4.0.0. Přehled novinek v changelogu. Díky podpoře Qt6 byla vylepšena podpora HiDPI.",
          "link": "http://www.abclinuxu.cz/zpravicky/texstudio-4.0.0",
          "publishedOn": "2021-09-26T23:17:43.000Z",
          "wordCount": 873,
          "title": "TeXstudio 4.0.0"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMDVLK-2021.Q3.7",
          "author": null,
          "description": "AMD has pushed out one more code drop of their AMDVLK official open-source Vulkan driver before ending out the quarter...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMDVLK-2021.Q3.7",
          "publishedOn": "2021-09-30T10:09:48.000Z",
          "wordCount": 748,
          "title": "AMDVLK 2021.Q3.7 Driver Released With New Extensions, More Optimizations"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ampere-Altra-Max-Pricing",
          "author": null,
          "description": "From our Ampere Altra Max M128-30 Linux performance preview earlier this week, one of the questions a number of readers were wondering about and a question I also still had open was on the Altra Max pricing... I've now received the current price list and actually comes in much lower than expected for a 128-core CPU in 2021...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ampere-Altra-Max-Pricing",
          "publishedOn": "2021-09-30T09:55:28.000Z",
          "wordCount": 847,
          "title": "Ampere Altra Max 128-Core CPU Is Priced Lower Than Flagship Xeon, EPYC CPUs"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.2.3-Released",
          "author": null,
          "description": "Succeeding Mesa 21.2.2 from earlier this month that was a much delayed and in turn very large release, Mesa 21.2.3 is out today and it's on the quieter side...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.2.3-Released",
          "publishedOn": "2021-09-29T23:27:14.000Z",
          "wordCount": 721,
          "title": "Mesa 21.2.3 Released As A Small Update To This Graphics Driver Stack"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-pkill_on_warn",
          "author": null,
          "description": "A new kernel option was proposed today called \"pkill_on_warn\" that would kill all threads in a process if that process provoked a kernel warning...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-pkill_on_warn",
          "publishedOn": "2021-09-29T19:32:45.000Z",
          "wordCount": 851,
          "title": "\"pkill_on_warn\" Proposed For Killing Linux Processes That Cause A Kernel Warning"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=libcamera-2021",
          "author": null,
          "description": "Libcamera as an open-source camera stack that has been coming together over the past few years has been maturing quite well, broadening its supported hardware and feature set, and more in filling a void in the Linux camera ecosystem...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=libcamera-2021",
          "publishedOn": "2021-09-29T18:30:06.000Z",
          "wordCount": 794,
          "title": "Libcamera Maturing Well As Open-Source Camera Stack"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30568",
          "author": null,
          "description": "Recently I carried out some updated Windows 11 benchmarks against Linux to look at how this forthcoming Microsoft operating system release is competing with Ubuntu. In this article is a fresh look at the Windows Subsystem for Linux (WSL2) performance on the near-final Windows 11 against Ubuntu Linux.",
          "link": "https://www.phoronix.com/vr.php?view=30568",
          "publishedOn": "2021-09-29T13:18:02.000Z",
          "wordCount": 855,
          "title": "Windows 11 WSL2 Performance Is Quite Competitive Against Ubuntu 20.04 LTS / Ubuntu 21.10"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-30x-Energy-Efficiency-2025",
          "author": null,
          "description": "AMD this morning announced a goal of increasing the energy efficiency of EPYC processors running AI training and high performance workloads by 30x... Within the next four years...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-30x-Energy-Efficiency-2025",
          "publishedOn": "2021-09-29T13:09:14.000Z",
          "wordCount": 801,
          "title": "AMD Aims For 30x Energy Efficiency Improvement For AI Training + HPC By 2025"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=LibreOffice-Qt6-VCL",
          "author": null,
          "description": "Merged this morning into the LibreOffice code-base is the initial Qt6 VCL plug-in...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=LibreOffice-Qt6-VCL",
          "publishedOn": "2021-09-29T12:54:22.000Z",
          "wordCount": 712,
          "title": "LibreOffice Lands Initial Code For Qt6 Toolkit Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Zstd-Updated-For-Kernel-Soon",
          "author": null,
          "description": "While the Linux kernel is increasingly supporting the use of Zstd for various compression purposes, the current Zstd code within the kernel is out-of-date and efforts so far to re-base it against the closer to upstream Zstd state have been stalled. Fortunately, a new attempt at getting the Zstd code updated for the Linux kernel will be published soon...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Zstd-Updated-For-Kernel-Soon",
          "publishedOn": "2021-09-29T09:45:31.000Z",
          "wordCount": 864,
          "title": "Updated Zstd Implementation For The Linux Kernel Coming Soon"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-Better-VLK-Pre-Cache",
          "author": null,
          "description": "With the initial Steam Deck release quickly approaching, Valve continues to be quite busy on a variety of improvements to enhance their Steam Linux builds...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-Better-VLK-Pre-Cache",
          "publishedOn": "2021-09-29T00:51:22.000Z",
          "wordCount": 762,
          "title": "Steam Beta Improves Its Vulkan Pre-Caching System, PipeWire Capture Now Opt-In"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-RadeonSI-More-NGG",
          "author": null,
          "description": "AMD open-source driver developers today merged another big set of patches providing various micro-optimizations and other enhancements to the RadeonSI Gallium3D driver...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-RadeonSI-More-NGG",
          "publishedOn": "2021-09-28T22:35:54.000Z",
          "wordCount": 900,
          "title": "RadeonSI Driver Merges NGG Improvements, Other Optimizations For Mesa 21.3"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-PSF-Linux-5.16-KVM",
          "author": null,
          "description": "While the Linux kernel still hasn't added any formal control yet for AMD Predictive Store Forwarding to disable it short of also toggling Spectre V4 / SSBD, with the Linux 5.16 kernel the AMD PSF bit will now be exposed to KVM guest virtual machines so that they -- either with a patched/future kernel or for other operating systems -- may choose to toggle explicitly disable this AMD CPU feature...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-PSF-Linux-5.16-KVM",
          "publishedOn": "2021-09-28T18:48:42.000Z",
          "wordCount": 950,
          "title": "Linux 5.16 To Expose AMD PSF Disable Bit To KVM Guests"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Fedora-35-Beta-Released",
          "author": null,
          "description": "After seeing some initial release challenges, Fedora 35 Beta was released today across the Fedora Workstation, Fedora Server, and Fedora IoT flavors as well as their other versions...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Fedora-35-Beta-Released",
          "publishedOn": "2021-09-28T17:48:53.000Z",
          "wordCount": 733,
          "title": "Fedora 35 Beta Released With Many New Features, Countless Package Updates"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30562",
          "author": null,
          "description": "The past month we have started our testing of Ampere's Altra Max M128-30, the company's new 128 core server processor, and in this article today are our initial benchmarks of this promising chip for high core count servers in both 1P and 2P configurations tested.",
          "link": "https://www.phoronix.com/vr.php?view=30562",
          "publishedOn": "2021-09-28T13:30:00.000Z",
          "wordCount": 838,
          "title": "Ampere Altra Max M128-30 Linux Performance Preview"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Vulkan-1.2.194-Released",
          "author": null,
          "description": "Vulkan 1.2.194 is out as the latest spec revision to this high performance graphics and compute API...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Vulkan-1.2.194-Released",
          "publishedOn": "2021-09-28T13:29:28.000Z",
          "wordCount": 791,
          "title": "Vulkan 1.2.194 Brings New Extension For Google's Fuchsia OS"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Picolibc-2021",
          "author": null,
          "description": "While Keith Packard is known for his work on X11/X.Org, the past few years he has also been developing Picolibc as a C library intended for embedded systems. He also recently jumped from SiFive to Amazon and appears at the ecommerce giant to be working on Picolibc in an official capacity, presumably for use on Amazon's growing hardware devices...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Picolibc-2021",
          "publishedOn": "2021-09-28T13:00:12.000Z",
          "wordCount": 782,
          "title": "Picolibc Continues Maturing As Very Lightweight C Library For The Embedded World"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=OmniOS-r151038",
          "author": null,
          "description": "The open-source Solaris/Illumos ecosystem certainly isn't vibrant these days like back during the Sun Microsystems times with OpenSolaris, but OmniOS continues progressing as one of the few still-active and useful Solaris/Illumos-powered platforms...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=OmniOS-r151038",
          "publishedOn": "2021-09-28T12:09:53.000Z",
          "wordCount": 787,
          "title": "OmniOS Adds VirtFS File Sharing For Bhyve, Better System Console Performance"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Fedora-Java-Rough-Shape",
          "author": null,
          "description": "While many years ago Fedora's Java support was in great shape with quickly integrating OpenJDK going back to IcedTea, these days Fedora's Java packages are barely maintained and largely fallen into disrepair...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Fedora-Java-Rough-Shape",
          "publishedOn": "2021-09-28T09:51:46.000Z",
          "wordCount": 817,
          "title": "Fedora's Java Packages Have Fallen Into Rough Shape"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Cyan-Skillfish-DCN-2.01",
          "author": null,
          "description": "Since July we've seen AMD open-source driver engineers posting code for \"Cyan Skillfish\" as an APU with Navi 1x graphics. While initial support for Cyan Skillfish was merged for Linux 5.15, it turns out the display code isn't yet wired up due to being a different DCN2 variant for its display block...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Cyan-Skillfish-DCN-2.01",
          "publishedOn": "2021-09-28T04:00:00.000Z",
          "wordCount": 924,
          "title": "AMD Posts Code Enabling \"Cyan Skillfish\" Display Support Due To Different DCN2 Variant"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMDGPU-DP-2.0-Linux-5.16",
          "author": null,
          "description": "A batch of feature updates was submitted today for DRM-Next of early feature work slated to come to the next version of the Linux kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMDGPU-DP-2.0-Linux-5.16",
          "publishedOn": "2021-09-27T21:46:34.000Z",
          "wordCount": 878,
          "title": "Linux 5.16 To Bring Initial DisplayPort 2.0 Support For AMD Radeon Driver (AMDGPU)"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Software-Defined-Silicon",
          "author": null,
          "description": "There has been talk of Intel moving to offer more license-able/opt-in features for hardware capabilities found within a given processor as an upgrade. We are now seeing the Linux signs of that support coming with a driver for \"Intel Software Defined Silicon\" to allow for the secure activation of such features baked into the processor's silicon but only available as an up-charge option...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Software-Defined-Silicon",
          "publishedOn": "2021-09-27T18:45:32.000Z",
          "wordCount": 949,
          "title": "\"Intel Software Defined Silicon\" Coming To Linux For Activating Extra Licensed Hardware Features"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30554",
          "author": null,
          "description": "With the in-development Linux 5.15 kernel there is now support for ACPI Platform Profiles on supported ASUS laptops. This ASUS laptop platform profile support joins the likes of HP, Dell, and Lenovo laptops already having this support exposed under Linux that allows users to control their power/performance preference. Here are some tests with the ASUS ROG Strix G15 AMD Advantage laptop with the platform profile options under Linux 5.15.",
          "link": "https://www.phoronix.com/vr.php?view=30554",
          "publishedOn": "2021-09-27T12:15:52.000Z",
          "wordCount": 820,
          "title": "Testing The New ASUS Platform Profile Support In Linux 5.15"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Bcachefs-Lands-Snapshots",
          "author": null,
          "description": "It's been a while since having any news to report on Bcachefs as the promising open-source file-system born out of the Linux kernel's block cache code. However, Kent Overstreet continues working tirelessly on it and has now merged Bcachefs' snapshot support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Bcachefs-Lands-Snapshots",
          "publishedOn": "2021-09-27T09:34:45.000Z",
          "wordCount": 722,
          "title": "Bcachefs Merges Support For Btrfs-Like Snapshots"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Nintendo-AES-Crypto-Driver",
          "author": null,
          "description": "The Linux kernel support around the Nintendo Wii and Wii U game console hardware continues to improve and now a new Nintendo crypto driver is being tackled based on reverse-engineered documentation...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Nintendo-AES-Crypto-Driver",
          "publishedOn": "2021-09-27T09:22:03.000Z",
          "wordCount": 724,
          "title": "Nintendo Crypto Driver Being Worked On For Linux, Yields Much Better AES Performance"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Lavapipe-Vulkan-1.2",
          "author": null,
          "description": "Adding to the growing list of Mesa 21.3 features for next quarter's feature release is Lavapipe now supporting Vulkan 1.2...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Lavapipe-Vulkan-1.2",
          "publishedOn": "2021-09-27T09:10:23.000Z",
          "wordCount": 669,
          "title": "Lavapipe Mesa Software Driver Enables Vulkan 1.2 Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=MediaTek-2021-nanoMIPS-GCC",
          "author": null,
          "description": "The nanoMIPS architecture that was announced by MIPS in 2018 for embedded devices to lower power consumption and yield smaller code footprints was announced for the MIPS I7200 but since then there hasn't been much of nanoMIPS. However, MediaTek is now looking to contribute upstream the compiler support for this processor ISA into GCC...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=MediaTek-2021-nanoMIPS-GCC",
          "publishedOn": "2021-09-27T04:00:00.000Z",
          "wordCount": 832,
          "title": "MediaTek Hoping To Bring nanoMIPS Support Upstream Into GCC"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-rc3-Released",
          "author": null,
          "description": "Linus Torvalds has now issued the third weekly release candidate of the forthcoming Linux 5.15 kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-rc3-Released",
          "publishedOn": "2021-09-26T21:38:43.000Z",
          "wordCount": 789,
          "title": "Linux 5.15-rc3 Released - Looking \"Pretty Normal\" Plus Performance Fix"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Firefox-92-Chrome-94-Benchmarks",
          "author": null,
          "description": "Given last week's release of Chrome 94, here are some fresh browser benchmarks looking at Firefox 92 stable against Chrome 94 running on Ubuntu Linux...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Firefox-92-Chrome-94-Benchmarks",
          "publishedOn": "2021-09-26T17:29:49.000Z",
          "wordCount": 701,
          "title": "Firefox 92 vs. Chrome 94 Browser Benchmarks On Ubuntu Linux"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GNU-Wget2-2.0-Released",
          "author": null,
          "description": "GNU Wget2 2.0 has been released for this successor to GNU Wget. There are many improvements to this GPLv3+ licensed program. Over the original GNU Wget, Wget2 is faster, supports more protocols especially around HTTP/2 and compression, supports multi-threading / parallel connections, and other improvements...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GNU-Wget2-2.0-Released",
          "publishedOn": "2021-09-26T14:06:33.000Z",
          "wordCount": 769,
          "title": "GNU Wget2 2.0 Released With HTTP2 & SSL Improvements"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-amd-pstate-v2",
          "author": null,
          "description": "Earlier this month AMD published their \"amd-pstate\" Linux driver that leverages ACPI CPPC data to make more informed CPU frequency scaling decisions with an aim to boost the performance-per-Watt for Zen 3 (and eventually Zen 2) processors on Linux. The second spin of that \"amd-pstate\" Linux kernel driver is now available for testing...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-amd-pstate-v2",
          "publishedOn": "2021-09-26T10:45:43.000Z",
          "wordCount": 814,
          "title": "Updated AMD P-State Driver Published For Linux"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-IO-3.8M-IOPS-Per-Core",
          "author": null,
          "description": "It was just last month when ~3.5M IOPS per-core was impressive with the code for Linux 5.15 to further push Linux's I/O limits. Now for code likely to be included in Linux 5.16 it's currently at 3.8M IOPS with a single tread...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-IO-3.8M-IOPS-Per-Core",
          "publishedOn": "2021-09-26T10:30:23.000Z",
          "wordCount": 733,
          "title": "Linux IO_uring Can Now Achieve Up To ~3.8M IOPS Per-Core"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Plasma-5.24-DRM-Leasing",
          "author": null,
          "description": "With the KDE Plasma 5.23 release quickly approaching, feature development is already heating up for Plasma 5.24 while concurrently driving many fixes into the v5.23 codebase...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Plasma-5.24-DRM-Leasing",
          "publishedOn": "2021-09-25T17:34:20.000Z",
          "wordCount": 852,
          "title": "KDE Plasma 5.24 On Wayland To Support DRM Leasing For VR Headsets"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/rss.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2522/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2522/",
          "publishedOn": "2021-09-29T04:00:00.000Z",
          "wordCount": 187,
          "title": "Two-Factor Security Key"
        },
        {
          "id": "https://xkcd.com/2521/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2521/",
          "publishedOn": "2021-09-27T04:00:00.000Z",
          "wordCount": 183,
          "title": "Toothpaste"
        },
        {
          "id": "https://xkcd.com/2520/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2520/",
          "publishedOn": "2021-09-24T04:00:00.000Z",
          "wordCount": 183,
          "title": "Symbols"
        },
        {
          "id": "https://xkcd.com/2519/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2519/",
          "publishedOn": "2021-09-22T04:00:00.000Z",
          "wordCount": 185,
          "title": "Sloped Border"
        }
      ]
    }
  ],
  "cliVersion": "1.11.2"
}