{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": [
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "author": null,
          "description": "Fixed: Unexpected nested element in author field crashes the parser\nThank you @ad-m",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "publishedOn": "2021-09-16T06:39:32.000Z",
          "wordCount": 348,
          "title": "v1.11.1"
        }
      ]
    },
    {
      "title": "Kotaku",
      "feedUrl": "https://kotaku.com/rss",
      "siteUrl": "https://kotaku.com",
      "articles": [
        {
          "id": "1847746369",
          "author": "Zack Zwiezen",
          "description": "Netflix is continuing to expand The Witcher into a giant franchise, announcing today that the main show starring Henry Cavill is getting a third season, while also announcing a second anime film and oddly, a spin-off aimed at kids and families too. The streaming giant also released some new footage from Witcher’s…\nRead more...",
          "link": "https://kotaku.com/the-witcher-renewed-for-season-3-on-netflix-alongside-a-1847746369",
          "publishedOn": "2021-09-25T19:45:00.000Z",
          "wordCount": 488,
          "title": "The Witcher Renewed For Season 3 On Netflix Alongside A Spin-Off For Kids"
        },
        {
          "id": "1847746068",
          "author": "Zack Zwiezen",
          "description": "I’m still not sure how I feel about this upcoming Netflix adaptation of the classic Cowboy Bebop series, but thanks in large part to the show’s classic “Tank!” theme song, the intro is a banger at least.\n\nRead more...",
          "link": "https://kotaku.com/netflixs-live-action-cowboy-bebop-intro-is-good-1847746068",
          "publishedOn": "2021-09-25T18:30:00.000Z",
          "wordCount": 473,
          "title": "Netflix's Live-Action Cowboy Bebop Intro Is Good"
        },
        {
          "id": "1847745807",
          "author": "Zack Zwiezen",
          "description": "Earlier this week Hitman - Game of the Year Edition launched on GOG. But soon after, players began complaining and review bombing once they discovered that large parts of the stealth game were locked behind online DRM checks. This rubbed many the wrong way because GOG makes a big deal about being DRM-free. \nRead more...",
          "link": "https://kotaku.com/hitman-comes-to-gog-and-gets-review-bombed-due-to-onlin-1847745807",
          "publishedOn": "2021-09-25T17:25:00.000Z",
          "wordCount": 782,
          "title": "Hitman Comes To GOG And Gets Review Bombed Due To Online DRM"
        },
        {
          "id": "1847745578",
          "author": "Zack Zwiezen",
          "description": "The UK’s Advertising Standards Authority has released new, updated guidance on how game developers and publishers should and shouldn’t advertise in-game premium currencies and other purchases. The ASA is pushing back against in-game timers, labels such as “Best Value!” and more. \nRead more...",
          "link": "https://kotaku.com/uk-cracks-down-on-in-game-ads-and-microtransactions-1847745578",
          "publishedOn": "2021-09-25T15:30:00.000Z",
          "wordCount": 501,
          "title": "UK Cracks Down On In-Game Ads And Microtransactions"
        },
        {
          "id": "1847744279",
          "author": "Zack Zwiezen",
          "description": "Every Pokemon is interesting and worth talking about. I don’t play a ton of Pokemon, but I do enjoy the universe and I love learning more about the creatures in it. So, Here’s Another Pokemon! It’s Camerupt!\n\nRead more...",
          "link": "https://kotaku.com/camerupt-literally-explodes-when-it-gets-angry-1847744279",
          "publishedOn": "2021-09-25T14:45:00.000Z",
          "wordCount": 635,
          "title": "Camerupt Literally Explodes When It Gets Angry"
        },
        {
          "id": "1847741825",
          "author": "Ethan Gach",
          "description": "Deathloop is the latest game to play around with time but it’s far from the only one. This summer’s divisive indie game 12 Minutes also centered around a repeating time loop, as have many other games, ranging from the star-charting Outer Wilds to the Nintendo 64 classic The Legend of Zelda: Majora’s Mask. But which…\nRead more...",
          "link": "https://kotaku.com/what-deathloop-gets-right-and-wrong-about-time-loops-1847741825",
          "publishedOn": "2021-09-24T21:45:00.000Z",
          "wordCount": 501,
          "title": "What Deathloop Gets Right And Wrong About Time Loops"
        },
        {
          "id": "1847742846",
          "author": "Sisi Jiang",
          "description": "Rejoice, belt collectors of Final Fantasy XIV. Contrary to what some players and outlets believed, the developers aren’t removing belt items from the game entirely.\nIn the notes for the latest 6.0 patch, known as the Endwalker expansion, the developers said that belts will no longer drop, and they won’t be obtainable…\nRead more...",
          "link": "https://kotaku.com/ffxiv-is-nerfing-belts-not-removing-them-1847742846",
          "publishedOn": "2021-09-24T21:25:00.000Z",
          "wordCount": 451,
          "title": "FFXIV Is Nerfing Belts, Not Removing Them"
        },
        {
          "id": "1847742254",
          "author": "Isaiah Colbert",
          "description": "Joy be unto Jubelius! After 1386 days without any news following Bayonetta 3’s Game Awards teaser trailer way back in 2017, the bad Umbran witch is back, and on Bi Visibility Day no less. During yesterday’s Nintendo Direct, we not only got a sick-ass trailer, but also a tentative release window of 2022. Yes, we …\nRead more...",
          "link": "https://kotaku.com/the-biggest-fan-theories-sparked-by-that-bayonetta-3-tr-1847742254",
          "publishedOn": "2021-09-24T21:00:00.000Z",
          "wordCount": 1360,
          "title": "The Biggest Fan Theories Sparked By That Bayonetta 3 Trailer"
        },
        {
          "id": "1847742334",
          "author": "Ari Notis",
          "description": "Like a circular space structure imbued with the power to destroy all sentient life at the push of a button, some things just go on endlessly. Such is the case with discussion around aim assist features in Halo games. Chatter has kicked off fresh following the not-a-beta for the forthcoming Halo Infinite.\n\nRead more...",
          "link": "https://kotaku.com/i-cant-believe-were-still-debating-halos-aim-assist-1847742334",
          "publishedOn": "2021-09-24T20:45:00.000Z",
          "wordCount": 789,
          "title": "I Can't Believe We're Still Debating Halo's Aim Assist"
        },
        {
          "id": "1847741744",
          "author": "Ian Walker",
          "description": "It’s the year of our lord 2021 and I’m playing Diablo II on my PlayStation 5.\nRead more...",
          "link": "https://kotaku.com/diablo-ii-resurrected-is-mostly-just-diablo-ii-for-be-1847741744",
          "publishedOn": "2021-09-24T20:25:00.000Z",
          "wordCount": 1155,
          "title": "Diablo II: Resurrected Is Mostly Just Diablo II, For Better Or Worse"
        },
        {
          "id": "1847741462",
          "author": "Zack Zwiezen",
          "description": "Yesterday, Nintendo shocked the world when Shigeru Miyamoto announced the main cast for the upcoming animated Mario film. But only some main characters and their Hollywood counterparts were unveiled. Surely Nintendo does not need our help with the casting process, but why not have some fun with it anyway?\nRead more...",
          "link": "https://kotaku.com/okay-nintendo-we-helped-fill-out-the-rest-of-the-mario-1847741462",
          "publishedOn": "2021-09-24T19:30:00.000Z",
          "wordCount": 785,
          "title": "Okay Nintendo, We Helped Fill Out The Rest Of The Mario Movie Cast"
        },
        {
          "id": "1847739685",
          "author": "Ethan Gach",
          "description": "Nintendo lobbed a grenade the size of a King Bob-omb at the social fabric of America yesterday when it announced that Hollywood leading man and charming village idiot Chris Pratt would be Mario. That’s right, the Italian plumber is finally re-appearing on the big screen after a nearly 30-year hiatus. The Marvel…\nRead more...",
          "link": "https://kotaku.com/the-internets-hateboner-for-chris-pratt-as-mario-in-nin-1847739685",
          "publishedOn": "2021-09-24T16:30:00.000Z",
          "wordCount": 1443,
          "title": "The Internet's Hateboner For Chris Pratt As Mario In Nintendo's Movie, Explained"
        },
        {
          "id": "1847739334",
          "author": "Ari Notis",
          "description": "Kirby fans finally get to feast. Yesterday, Nintendo announced Kirby and the Forgotten Land, a 3D adventure platformer set in a post-apocalyptic world whose ruin may or may not have been caused by a certain insatiable pink gelatinous mass. I’m optimistic—cautiously optimistic, but optimistic nonetheless. I haven’t…\nRead more...",
          "link": "https://kotaku.com/kirby-going-full-on-super-mario-odyssey-on-the-switch-i-1847739334",
          "publishedOn": "2021-09-24T15:55:00.000Z",
          "wordCount": 662,
          "title": "Kirby Going Full-On Super Mario Odyssey On The Switch Is Brilliant"
        },
        {
          "id": "1847737734",
          "author": "Brian Ashcraft",
          "description": "Hours before Thursday’s Nintendo Direct, announcements leaked. Kotaku, and other game sites, inevitably published the relevant news. That was expected, but the online pushback wasn’t. Some fans were upset. In the past, these leaks would be called breaking news. In 2021, they’re spoilers—at least, according to some…\nRead more...",
          "link": "https://kotaku.com/fans-were-upset-over-nintendo-direct-spoilers-1847737734",
          "publishedOn": "2021-09-24T14:45:00.000Z",
          "wordCount": 903,
          "title": "Fans Were Upset Over Nintendo Direct \"Spoilers\""
        },
        {
          "id": "1847734306",
          "author": "Zack Zwiezen",
          "description": "I play a lot of games for this job. That’s not a brag, it’s just a fact. And while many of those games are good, most of them tend to blend together. But whenever something comes along that is not only great but also feels fresh and incredibly memorable, it reminds me of how awesome games can be. Lost in Random is one…\nRead more...",
          "link": "https://kotaku.com/lost-in-random-the-kotaku-review-1847734306",
          "publishedOn": "2021-09-24T13:30:00.000Z",
          "wordCount": 1971,
          "title": "Lost In Random: The Kotaku Review"
        },
        {
          "id": "1847737641",
          "author": "Brian Ashcraft",
          "description": "While nearly everyone who desperately wants Pokémon cards waits in line or pays premium prices on the internet, there are the occasional and unfortunate exceptions. \nIn Japan, a 25-year-old man in Hiroshima is accused of attacking a college student as he exited a 7-11 with a box of newly purchased Pokémon cards.…\nRead more...",
          "link": "https://kotaku.com/alleged-assault-and-pokemon-card-robbery-makes-national-1847737641",
          "publishedOn": "2021-09-24T12:32:00.000Z",
          "wordCount": 401,
          "title": "Alleged Assault And Pokémon Card Robbery Makes National News In Japan"
        },
        {
          "id": "1847737350",
          "author": "Brian Ashcraft",
          "description": "Dad jokes are universal. In Japanese, dad jokes are called “oyaji gyagu,”  with oyaji meaning “one’s father” and gyagu meaning “gag” or “joke.”  Like anywhere, these tend to be cheesy puns, but who can resist them? You you can, but I  sure can’t, and it seems Nintendo’s Yoshiaki Koizumi cannot, either. \nSplatoon…\nRead more...",
          "link": "https://kotaku.com/nintendos-low-key-dad-joke-for-splatoon-3-was-pretty-go-1847737350",
          "publishedOn": "2021-09-24T10:30:00.000Z",
          "wordCount": 425,
          "title": "Nintendo's Low-Key Dad Joke For Splatoon 3 Was Pretty Good"
        },
        {
          "id": "1847735522",
          "author": "Luke Plunkett",
          "description": "One of Nintendo’s cuter little announcements during the latest Direct was that, with N64 games coming soon to the system, the company will also start selling recreations of the console’s controller for you to play them on.\n\nRead more...",
          "link": "https://kotaku.com/you-cant-make-me-use-the-n64-controller-again-nintendo-1847735522",
          "publishedOn": "2021-09-24T01:45:00.000Z",
          "wordCount": 920,
          "title": "You Can't Make Me Use The N64 Controller Again, Nintendo"
        },
        {
          "id": "1847735687",
          "author": "Jeremy Winslow",
          "description": "Sometimes, during these surprise Nintendo Direct presentations, developers will just do the darnedest things. This includes the Splatoon 3 studio Nintendo Entertainment Planning & Development (Nintendo EDP) whose nondescript “squid researcher” dazzled us with both late-breaking research findings and his impressive…\nRead more...",
          "link": "https://kotaku.com/why-the-splatoon-3-devs-are-the-best-in-one-gif-1847735687",
          "publishedOn": "2021-09-24T00:45:00.000Z",
          "wordCount": 510,
          "title": "Why The Splatoon 3 Devs Are The Best, In One GIF"
        },
        {
          "id": "1847735646",
          "author": "Luke Plunkett",
          "description": "Late last year it was announced that The Initiative, a new Xbox Game Studio, was starting work an all-new Perfect Dark game. Today, they’ve said that they’re now getting some help, in the form of Tomb Raider developers Crystal Dynamics.\n\nRead more...",
          "link": "https://kotaku.com/square-enixs-crystal-dynamics-also-working-on-the-new-p-1847735646",
          "publishedOn": "2021-09-24T00:00:00.000Z",
          "wordCount": 460,
          "title": "Square Enix's Crystal Dynamics Also Working On The New Perfect Dark Game"
        },
        {
          "id": "1847735359",
          "author": "Luke Plunkett",
          "description": "I’m still physically recovering from the Mario movie cast announcement, mostly because if you’d given me 100 guesses to try and pick who would play the role of Mario—a short, thicc Italian-American—I would not have picked the ripped dude who is a Guardian of the Galaxy.\n\nRead more...",
          "link": "https://kotaku.com/somebody-tried-to-warn-us-about-chris-pratt-as-mario-in-1847735359",
          "publishedOn": "2021-09-23T23:45:00.000Z",
          "wordCount": 492,
          "title": "Somebody Tried To Warn Us About Chris Pratt As Mario In 2020"
        },
        {
          "id": "1847735249",
          "author": "John Walker",
          "description": "Today’s surprise Nintendo Direct offered 40 packed minutes of forthcoming Switch games, new content for old ones, and, er, teasers for forthcoming Directs about specific games like Smash and Animal Crossing. Below you’ll find all the big stories that came out of the presentation.\n\nRead more...",
          "link": "https://kotaku.com/all-the-biggest-announcements-from-nintendos-big-septem-1847735249",
          "publishedOn": "2021-09-23T23:40:00.000Z",
          "wordCount": 937,
          "title": "All The Biggest Announcements From Nintendo's Big September Direct"
        },
        {
          "id": "1847098247",
          "author": "Ash Parrish",
          "description": "Let’s go boys! During today’s Nintendo’s Direct event, we finally got a more in-depth look at Bayonetta 3. And as you can see above, the titular witch has a fresh new look and a 2022 release date.\n\nRead more...",
          "link": "https://kotaku.com/oh-shit-bayonettas-got-braids-in-third-game-1847098247",
          "publishedOn": "2021-09-23T22:40:00.000Z",
          "wordCount": 598,
          "title": "Oh Snap, Bayonetta's Got Braids In Third Game"
        },
        {
          "id": "1847734853",
          "author": "Isaiah Colbert",
          "description": "During the Nintendo Direct, Shigeru Miyamoto made a surprise appearance to discuss the full-length Mario movie in the works from Illumination studios. The release date in North America is December 21, 2022 and release dates for Japan and other regions will be announced at a later date.\nRead more...",
          "link": "https://kotaku.com/shigeru-miyamoto-announces-cast-for-upcoming-mario-movi-1847734853",
          "publishedOn": "2021-09-23T22:28:00.000Z",
          "wordCount": 383,
          "title": "The Super Mario Movie Coming In 2022 Has Quite The Cast"
        },
        {
          "id": "1847727594",
          "author": "Ian Walker",
          "description": "Some of the greatest Castlevania games of all time are coming to PlayStation, Xbox, Switch, and PC later today thanks to the new Castlevania Advance Collection. It bundles all three Game Boy Advance classics—as well as Dracula X, the Super Nintendo’s interesting Rondo of Blood port—into one complete package for the…\nRead more...",
          "link": "https://kotaku.com/castlevania-advance-collection-is-real-and-it-s-out-to-1847727594",
          "publishedOn": "2021-09-23T22:25:00.000Z",
          "wordCount": 495,
          "title": "Castlevania Advance Collection Is Real, And It’s Out Today"
        }
      ]
    },
    {
      "title": "Nintendo Life | Latest Updates",
      "feedUrl": "https://www.nintendolife.com/feeds/latest",
      "siteUrl": "https://www.nintendolife.com/feeds/latest",
      "articles": [
        {
          "id": "https://www.nintendolife.com/#article-121428",
          "author": null,
          "description": "Arriving \"late\" October.\nSwitch Online is bolstering its lineup with a premium tier this October - made up of a collection of N64 and Mega Drive titles.\nFollowing on from the reveal, Nintendo's website has shared some direct screens - revealing what these games will look like with the standard 4:3 template. Unfortunately, there's no menus reveals but the rest looks similar to the SNES and NES libraries.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/gallery_15_screenshots_of_switch_onlines_n64_and_sega_mega_drive_launch_titles",
          "publishedOn": "2021-09-25T23:00:00.000Z",
          "wordCount": 1932,
          "title": "Gallery: 15 Screenshots Of Switch Online's N64 And Sega Mega Drive Launch Titles"
        },
        {
          "id": "https://www.nintendolife.com/#article-98222",
          "author": null,
          "description": "Only skin-deep, but what skin!\nUpdated with new entries.\n\nWhile the Switch might not be able to compete with other platforms in pure processing terms, there's certainly no shortage of beautiful-looking games on the console. Switch may not output at a native 4K at 120 fps, but Nintendo diminutive little hybrid can still pack a punch for the eyeballs. Couple clever programming with excellent art direction and Switch can deliver stunning visuals on a little console you can throw in a backpack. How far we've come since the Game Boy days!\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/guides/best-nintendo-switch-graphics-the-most-beautiful-switch-games",
          "publishedOn": "2021-09-25T17:00:00.000Z",
          "wordCount": 8962,
          "title": "Guide: Best Nintendo Switch Graphics - The Most Beautiful Switch Games"
        },
        {
          "id": "https://www.nintendolife.com/#article-121249",
          "author": null,
          "description": "\"There may or may not be answers to questions that have been asked for years\".\nWhile many know all about the Doctor Who TV show, it's a franchise that has had a lot of optional lore and storytelling through other entertainment mediums — books (including audio books starring the main actors), spin-off shows and of course video games. Just recently the Switch got a port of Doctor Who: The Lonely Assassins, which originally made its mark on mobile devices; it turned out rather well.\nNext up we have Doctor Who: The Edge of Reality arriving on 30th September, and it's another game with a history. A form of the game — called Edge of Time — was previously released on VR platforms. It now comes to Switch and other 'flatscreen' platforms with a new name and, apparently, an overhauled and greatly expanded story. The gameplay has been shaken up too, of course, so the new iteration could potentially feel very different to the original.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/feature_tackling_a_timey_wimey_virus_in_doctor_who_the_edge_of_reality",
          "publishedOn": "2021-09-25T15:00:00.000Z",
          "wordCount": 3112,
          "title": "Feature: Tackling A Timey Wimey Virus In Doctor Who: The Edge Of Reality"
        },
        {
          "id": "https://www.nintendolife.com/#article-121435",
          "author": null,
          "description": "Cute as a button.\nA new image of the upcoming Switch N64 wireless pad shows that it has some extra buttons on the top.\nAs spotted by our pals over at VGC, there are ZR, Home and Share buttons on the top of the device, alongside a USB-C charting port and a sync button. There are also four LED lights, as is the norm with Switch controllers.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/switchs_n64_controller_is_hiding_some_extra_buttons",
          "publishedOn": "2021-09-25T14:05:00.000Z",
          "wordCount": 5343,
          "title": "Switch's N64 Controller Is Hiding Some Extra Buttons"
        },
        {
          "id": "https://www.nintendolife.com/#article-121434",
          "author": null,
          "description": "Stampede into battle!\nPokémon Unite made its debut on mobile devices earlier this week - so what's next for the new free-to-play MOBA?\nNext week on 29th September, the Generation IV Ice/Ground-Type pocket monster, Mamoswine, will be joining the battle. Ahead of its release, the official game account shared the following clip showcasing its moveset:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/mamoswine_joins_pokemon_unite_next_week_on_september_29",
          "publishedOn": "2021-09-25T14:00:00.000Z",
          "wordCount": 1000,
          "title": "Mamoswine Joins Pokémon Unite Next Week On September 29"
        },
        {
          "id": "https://www.nintendolife.com/#article-121228",
          "author": null,
          "description": "A whisker away from competent.\nCats can be devilish creatures. They can be cool as a cucumber one moment, nuzzling their squishy faces into their owners’ neck, before flipping and ripping the furniture apart in a rage that would make even Gordon Ramsay quiver in his boots. Fisti-Fluffs is the latest game to feature the furious felines, focusing on party games that let you unleash your inner rage in a showcase of pure destruction. The problem, however, is it largely fails as a compelling, lasting experience.\nIn a nutshell, Fisti-Fluffs pits you against up to three human or AI opponents in arena environments based on everyday locations such as Apartment, Backyard, Cat Café, and uhh… Magic Cabin. Okay, so they’re not all based on everyday locations. The combat feels absolutely chaotic, but not necessarily in a good way. You can launch yourself at your enemies with ‘Y’, swiping at them with your claws, or you can wriggle the right analogue stick around to simulate the movement of the cats’ limbs, lashing out at your opponents with reckless abandon.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/reviews/switch-eshop/fisti-fluffs",
          "publishedOn": "2021-09-25T13:00:00.000Z",
          "wordCount": 1615,
          "title": "Mini Review: Fisti-Fluffs - A Cute But Limited Kitty Brawler With Control Issues"
        },
        {
          "id": "https://www.nintendolife.com/#article-120781",
          "author": null,
          "description": "Got gaming plans?\nWell, it's been a Nintendo Direct week! The new voice of Mario has been revealed, Brewster's back in Animal Crossing, Kirby's gone all Last of Us in his next 3D adventure, and — biggest news of all — Banjo's coming back on a Nintendo console thanks to the inclusion of Banjo-Kazooie in the upcoming N64 additions to Nintendo Switch Online. Eekum bokum!\nAfter all that it's time to chill out and discuss our weekend gaming plans. A few members of the Nintendo Life team have done just that below, so feel free to give our entries a read and then join in with your own via our comment section. Enjoy!\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/talking_point_what_are_you_playing_this_weekend_september_25th",
          "publishedOn": "2021-09-25T09:00:00.000Z",
          "wordCount": 6966,
          "title": "Talking Point: What Are You Playing This Weekend? (September 25th)"
        },
        {
          "id": "https://www.nintendolife.com/#article-121429",
          "author": null,
          "description": "Three cult-classic cyberpunk fantasy RPGs re-awaken.\nThe highly praised Shadowrun Trilogy - based on the cyberpunk fantasy tabletop RPG - has been announced for Switch.\nIt's comprised of the PC releases Shadowrun Returns, Shadowrun: Dragonfall - Director's Cut and Shadowrun: Hong Kong - Extended Edition, and will launch on the system in 2022. More information will be shared next year. For now, here's a brief rundown:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/the_shadowrun_trilogy_is_coming_to_nintendo_switch_in_2022",
          "publishedOn": "2021-09-25T07:30:00.000Z",
          "wordCount": 2568,
          "title": "The Shadowrun Trilogy Is Coming To Nintendo Switch In 2022"
        },
        {
          "id": "https://www.nintendolife.com/#article-121426",
          "author": null,
          "description": "People who \"don't upgrade\" can still look forward to new additions.\nNintendo's new tier for the Switch Online service has raised some concerns about future support for the SNES and NES libraries.\nWill games continue to be added to this service, or is Nintendo done with these older retro libraries for good? It seems there's no need to worry. Axios writer, Stephen Totilo, has been informed by Nintendo that more games will continue to be added to the original membership service.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/dont_worry_nintendo_isnt_abandoning_switch_onlines_snes_and_nes_libraries",
          "publishedOn": "2021-09-25T04:00:00.000Z",
          "wordCount": 5793,
          "title": "Don't Worry, Nintendo Isn't Abandoning Switch Online's SNES And NES Libraries"
        },
        {
          "id": "https://www.nintendolife.com/#article-121425",
          "author": null,
          "description": "Thank the Switch Online service.\n\nAfter a recent rumour, Nintendo yesterday lifted the lid on N64 games for its Switch Online service. They'll be arriving \"late\" next month as part of an 'Expansion Pass' which also includes Sega Genesis (Mega Drive) titles.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/sin_and_punishment_for_nintendo_64_now_has_an_official_western_box_art",
          "publishedOn": "2021-09-25T03:00:00.000Z",
          "wordCount": 2578,
          "title": "Sin & Punishment For Nintendo 64 Now Has An Official Western Box Art"
        },
        {
          "id": "https://www.nintendolife.com/#article-121422",
          "author": null,
          "description": "Nintendo isn't done with it just yet.\nDuring the Nintendo Direct this week, we got another look at the upcoming 2022 release Splatoon 3 followed by an explanation from a \"Squid Researcher\" breaking down the new trailer.\nWhile Nintendo is hard at work on the latest entry in the squid-shooter multiplayer game, it hasn't completely forgotten about the second game, Splatoon 2. Not long after the Direct had aired, the official Japanese Splatoon Twitter account announced it would deliver a new update next week (Version 5.5.0). Here's a rough translation via Google:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/splatoon_2_is_getting_another_game_update_next_week",
          "publishedOn": "2021-09-25T00:30:00.000Z",
          "wordCount": 3081,
          "title": "Splatoon 2 Is Getting Another Game Update Next Week"
        },
        {
          "id": "https://www.nintendolife.com/#article-121415",
          "author": null,
          "description": "\"Ina was trapped for a reason...\".\nGames very rarely let you play as the princess: the one who's trapped, kidnapped, and powerless, waiting for some guy to come and save her. But in Aspire: Ina's Tale, that's exactly who you are: the girl who was placed under a spell of perpetual sleep in a tower, and who needs to make her own escape.\nThe tower is full of other prisoners, though, and Ina will have to find them and rescue them by solving platforming challenges and puzzles along the way. The tower itself feeds off the dreams of its inhabitants, which means rescuing them isn't just about getting them out of a cage — they have to regain their memories, too.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/escape_a_twisted_tower_with_platforming_in_aspire_inas_tale_out_this_december",
          "publishedOn": "2021-09-24T19:00:00.000Z",
          "wordCount": 782,
          "title": "Escape A Twisted Tower With Platforming In Aspire: Ina's Tale, Out This December"
        },
        {
          "id": "https://www.nintendolife.com/#article-121404",
          "author": null,
          "description": "Zelda X Chrono Trigger X Princess Bride.\nPlaytonic — the folks behind Yooka-Laylee — just announced their publishing arm, Playtonic Friends, and now they're announcing their next title: Blossom Tales 2: The Minotaur Prince, a sequel to the original Zelda-inspired adventure game by Castle Pixel.\n\"Think A Link to the Past meets Princess Bride\" is the pitch for Blossom Tales 2, with the developers focusing on \"marrying fun gameplay with memorable storytelling\". The sequel is a love letter to retro action-RPGs, which is very much in Playtonic's wheelhouse — take a look at these screenshots to get a feel for the game and its inspirations:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/blossom_tales_sequel_to_be_published_by_playtonic_next_year",
          "publishedOn": "2021-09-24T18:30:00.000Z",
          "wordCount": 1499,
          "title": "Blossom Tales Sequel To Be Published By Playtonic Next Year"
        },
        {
          "id": "https://www.nintendolife.com/#article-121399",
          "author": null,
          "description": "Aside from a couple of leaks and old rumours, Nintendo kept its cards close.\nThe latest Nintendo Direct was quite something, one of Nintendo's longer broadcasts and positively packed with reveals and updates. The structure was clever in terms of getting maximum attention, too, showcasing long awaited titles, entirely new games and getting broad multimedia coverage by unveiling the main cast of the upcoming Mario movie. The broadcast and related coverage was trending on whatever social media platforms you prefer.\nVery much job done, from Nintendo's perspective, and early results in our own poll show a majority giving it 'A' or 'B' as a grade, albeit with a fair bit more weight on the 'very good' B grade.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/talking_point_a_nintendo_direct_with_something_for_everyone_and_quite_a_few_surprises",
          "publishedOn": "2021-09-24T18:00:00.000Z",
          "wordCount": 5844,
          "title": "Talking Point: A Nintendo Direct With Something For Everyone, And Quite A Few Surprises"
        },
        {
          "id": "https://www.nintendolife.com/#article-121416",
          "author": null,
          "description": "Only 6 months to go!\nLast night's Nintendo Direct was full of news, surprises, and long-awaited release date announcements, among which was the March 22nd launch date for Rune Factory 5.\nThe farming, fighting, and friendship game is extremely popular among fans of the life-sim genre, and has become even more so after Harvest Moon's poorly-rated games and Story of Seasons' disappointing latest game, Pioneers of Olive Town. Many players are hoping that Rune Factory 5 will pick up the torch, especially as the game has been out in Japan since May 2021, garnering positive reviews.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/rune_factory_5_release_date_finally_confirmed_for_next_year",
          "publishedOn": "2021-09-24T17:45:00.000Z",
          "wordCount": 1991,
          "title": "Rune Factory 5 Release Date Finally Confirmed For Next Year"
        },
        {
          "id": "https://www.nintendolife.com/#article-121403",
          "author": null,
          "description": "Cuteness overload.\n\nOne of the bigger announcements during yesterday's Nintendo Direct, and easily one of the brightest moments of the show in the minds of plenty of the Nintendo Life team, was the reveal of Kirby and the Forgotten Land.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/nintendo_shares_adorable_artwork_for_kirby_and_the_forgotten_land",
          "publishedOn": "2021-09-24T17:35:00.000Z",
          "wordCount": 1904,
          "title": "Nintendo Shares Adorable Artwork For Kirby And The Forgotten Land"
        },
        {
          "id": "https://www.nintendolife.com/#article-121411",
          "author": null,
          "description": "Coming this October.\nMade by a team of university graduates with an average age of 23, Lumione is a impressive platformer that serves as the debut game for Glimmer Studio. With obvious inspiration from other hard-as-nails platformers like Ori and the Blind Forest and Celeste, Lumione takes the genre in a different direction: underwater.\n\n\"The game’s major themes are chasing dreams and having hope. Players will play the part of the beloved deep-sea fairy, Glimmer, as they escape from darkness and follow the path of the Light.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/side-scrolling_platformer_lumione_looks_like_underwater_ori",
          "publishedOn": "2021-09-24T17:30:00.000Z",
          "wordCount": 1097,
          "title": "Side-Scrolling Platformer Lumione Looks Like Underwater Ori"
        },
        {
          "id": "https://www.nintendolife.com/#article-121405",
          "author": null,
          "description": "Room for more?\nNintendo has announced that a new set of Animal Crossing amiibo cards are headed our way, although a release date hasn't yet been set.\nThe new cards will arrive as Series 5, joining the already existing Series 1 - 4 cards that have been popping in and out of stock over the past few months. Nintendo says that \"details on this card series will be announced at a later time.\"\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/animal_crossing_series_5_amiibo_cards_are_coming_soon",
          "publishedOn": "2021-09-24T16:30:00.000Z",
          "wordCount": 2297,
          "title": "Animal Crossing Series 5 amiibo Cards Are \"Coming Soon\""
        },
        {
          "id": "https://www.nintendolife.com/#article-121409",
          "author": null,
          "description": "Nintendo has \"nothing to announce on this topic\" when quizzed.\nYesterday, Nintendo Switch owners got all excited by the prospect of N64 games coming to Nintendo Switch Online – but some eagle-eyed European fans have spotted something rather disturbing.\nDuring the North American version of the Nintendo Direct broadcast, the games shown ran at full speed. However, when compared to the Nintendo UK edition of the broadcast, the footage was noticeably slower, which hints that the games European players will get will be 50Hz, rather than 60Hz.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/uh-oh_nintendo_switch_onlines_n64_games_might_be_50hz_in_europe",
          "publishedOn": "2021-09-24T16:15:00.000Z",
          "wordCount": 9622,
          "title": "Uh-Oh, Nintendo Switch Online's N64 Games Might Be 50Hz In Europe"
        },
        {
          "id": "https://www.nintendolife.com/#article-121391",
          "author": null,
          "description": "Ninji! Koopa Troopa! Snow and sun!\nWhile Mario Golf: Super Rush was arguably a little undercooked at launch, there have been some notable content updates that have fleshed out the experience. The version 2.0 update was significant in early August, adding New Donk City and more importantly Ranked Online matches, boosting replay value. Though it's still not quite the Mario Golf game of our dreams, it's definitely an improved proposition.\nThe latest update that was dropped after this week's Direct is another solid addition, and we hopped in to try the new characters, courses and get our butts kicked by the new CPU difficulty settings.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/feature_our_verdict_on_mario_golf_super_rushs_3_0_update_including_new_characters_and_courses",
          "publishedOn": "2021-09-24T16:00:00.000Z",
          "wordCount": 2796,
          "title": "Feature: Our Verdict On Mario Golf: Super Rush's 3.0 Update, Including New Characters And Courses"
        },
        {
          "id": "https://www.nintendolife.com/#article-121402",
          "author": null,
          "description": "Merry September!\nIf you love horrendous-yet-fantastic Christmas jumpers and you don't mind talking about them three whole months before the big day arrives, then boy do we have the product for you. And if you hate all of that stuff, we're very, very sorry.\nYes, it may well only be September, but Merchoid has already put out one of the first Christmas Pokémon jumpers of the year. Featuring Pikachu, Bulbasaur, Charmander and Squirtle and an incredibly eager model to show it off (seriously, we'd like some of that energy please) the jumper is currently up for pre-order and apparently selling out fast.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/oh_no_the_christmas_pokemon_jumpers_have_already_begun",
          "publishedOn": "2021-09-24T15:30:00.000Z",
          "wordCount": 1028,
          "title": "Oh No, The Christmas Pokémon Jumpers Have Already Begun"
        },
        {
          "id": "https://www.nintendolife.com/#article-121400",
          "author": null,
          "description": "And by the way, the hints lie.\nLaunching today on Nintendo Switch is Don't Touch this Button!, a cheeky puzzle game from 9 Eyes Game Studio and Ratalaika Games.\nA minimalist take on the puzzle genre that has us reminiscing over all of our favourite browser games from back in the day, Don't Touch this Button! has you exploring a series of rooms from a first-person perspective. The general idea is that you'll have to press a certain button in each room to progress, but figuring out which one will become more and more difficult.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/dont_touch_this_button_will_test_your_puzzle_skills_on_switch_out_today_for_just_usd5",
          "publishedOn": "2021-09-24T15:00:00.000Z",
          "wordCount": 967,
          "title": "'Don't Touch This Button!' Will Test Your Puzzle Skills On Switch, Out Today For Just $5"
        },
        {
          "id": "https://www.nintendolife.com/#article-121394",
          "author": null,
          "description": "And they launch next month.\nNintendo fans in Japan will soon be able to pick up new physical versions of both The Legend of Zelda: Breath of the Wild and Splatoon 2 that include their respective DLC, it's been announced.\nNintendo shared the news yesterday during all the Direct commotion (the Japanese broadcasts of Directs often contain the odd difference to the western versions) and have summarised the announcement on social media. Both of the new releases will launch on 8th October.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/zelda_breath_of_the_wild_and_splatoon_2_will_get_new_physical_releases_with_dlc_included_in_japan",
          "publishedOn": "2021-09-24T14:00:00.000Z",
          "wordCount": 1956,
          "title": "Zelda: Breath Of The Wild And Splatoon 2 Will Get New Physical Releases With DLC Included In Japan"
        },
        {
          "id": "https://www.nintendolife.com/#article-121388",
          "author": null,
          "description": "With 16-player online and a \"constant\" 30fps.\nTucked away inside yesterday's Nintendo Direct sizzle reel was the news that Wreckfest, Bugbear Entertainment's demolition racer, is heading to Switch this fall.\nBoasting a variety of tracks, dozens of vehicles, lots of customisation options and plenty of destruction, Wreckfest will be crashing into retail stores and on the eShop for $39.99 / €39.99 / £34.99. The Super Mario movie cast reveal might have taken all the mainstream headlines yesterday, but Wreckfest's press release runs with it in style, giving us a good chuckle in the process:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/wreckfest_brings_destructive_demolition_racing_to_switch_this_fall",
          "publishedOn": "2021-09-24T13:00:00.000Z",
          "wordCount": 2099,
          "title": "Wreckfest Brings Destructive Demolition Racing To Switch This Fall"
        },
        {
          "id": "https://www.nintendolife.com/#article-121373",
          "author": null,
          "description": "Kirby x Nier! Bayonetta 3 exists! Mario movie! More stuff!\nWell well well, Nintendo sure put on quite a show in its September 2021 Nintendo Direct. Whether you liked it or not is the purpose of this poll, but it sure had some notable reveals, updates and big moments.\n\nRound Up: Here's Everything That Was Revealed In Nintendo Direct September 2021\n\nAs you can see in the round up above it was a rather packed show, and one of Nintendo's longer efforts clocking in at 40 minutes. It perhaps speaks to the strength of the line-up that it's hard to pick just a few key moments; there was a lot going on. We had the announcement of a new tier for Nintendo Switch Online, adding Nintendo 64 and Mega Drive / Genesis games and introducing a couple of neat new controllers; pricing for the subscription update is still under wraps. There was the Mario movie cast. Kirby going back into a large 3D world, that looks like an intriguing and impressive spin for the series. Splatoon 3 is looking like more wonderful Splatoon gaming. Brewster.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/poll_what_did_you_think_of_yesterdays_nintendo_direct",
          "publishedOn": "2021-09-24T12:00:00.000Z",
          "wordCount": 13389,
          "title": "Poll: What Did You Think Of Yesterday's Nintendo Direct?"
        }
      ]
    },
    {
      "title": "Rock Paper Shotgun Latest Articles Feed",
      "feedUrl": "https://www.rockpapershotgun.com/feed",
      "siteUrl": "https://www.rockpapershotgun.com/feed",
      "articles": [
        {
          "id": "https://www.rockpapershotgun.com/im-going-to-use-the-new-n64-controller-on-pc-and-you-cant-stop-me",
          "author": "Graham Smith",
          "description": "During this week's Nintendo Direct, we found out that N64 games would soon be playable on Switch via Nintendo's online subscription. More importantly, we found out that Nintendo are making a new wireless N64 controller for use with the Switch.\r\n\nYou can connect the Switch Pro controller to PC with or without a wire, so it stands to reason I'll be able to use this new N64 controller on PC too, right? Because if so, I'm gonna.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/im-going-to-use-the-new-n64-controller-on-pc-and-you-cant-stop-me",
          "publishedOn": "2021-09-25T22:57:03.000Z",
          "wordCount": 1015,
          "title": "I'm going to use the new N64 controller on PC and you can't stop me"
        },
        {
          "id": "https://www.rockpapershotgun.com/foxholes-entrenched-update-makes-the-massive-multiplayer-shooter-even-bigger",
          "author": "Graham Smith",
          "description": "Foxhole has made foxholes better. The Entrenched update for the massive, multiplayer sandbox war game adds a lot, but top of the pile is new building tools for crafting better bunkers, trenches, and frontline defenses. The update is live now, and there's a video introducing its many features below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/foxholes-entrenched-update-makes-the-massive-multiplayer-shooter-even-bigger",
          "publishedOn": "2021-09-25T21:44:32.000Z",
          "wordCount": 808,
          "title": "Foxhole's Entrenched update makes the massive multiplayer shooter even bigger"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-signal-state-is-a-zachlike-about-rewiring-synthesizers",
          "author": "Graham Smith",
          "description": "Is it still a Zachlike if it's not made by Zachtronics? Because The Signal State sure looks like a Zachlike. It's about solving logic puzzles inspired by modular synthesizers, which means you'll tinker with ornate machinery by twisting knobs and changing wiring. It's also wrapped in a post-apocalyptic story in which your actions will \"change the fate of agriculture.\"\r\n\nIt's out now. Check out the trailer below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-signal-state-is-a-zachlike-about-rewiring-synthesizers",
          "publishedOn": "2021-09-25T21:10:17.000Z",
          "wordCount": 722,
          "title": "The Signal State is a Zachlike about rewiring synthesizers"
        },
        {
          "id": "https://www.rockpapershotgun.com/hitman-is-now-on-gog-but-getting-slammed-for-its-lack-of-offline-features",
          "author": "Graham Smith",
          "description": "Good news! Hitman: Game Of The Year Edition is now on GOG and 70% off. Bad news! The game requires an internet connection for so many singleplayer features that customers on the DRM-free digital store are real mad about it.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/hitman-is-now-on-gog-but-getting-slammed-for-its-lack-of-offline-features",
          "publishedOn": "2021-09-25T20:22:30.000Z",
          "wordCount": 969,
          "title": "Hitman is now on GOG, but getting slammed for its lack of offline features"
        },
        {
          "id": "https://www.rockpapershotgun.com/battleye-anti-cheat-will-support-steam-deck-and-proton-too",
          "author": "Graham Smith",
          "description": "Valve's claim that the Steam Deck would run every game in your Steam library is looking more and more like fact. Yesterday Easy Anti-Cheat announced support for Linux and the Proton compatibility laters the Deck relies upon. \r\n\nToday, BattlEye Anti-Cheat followed suit, announcing they'd support the Steam Deck and Proton in a tweet.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/battleye-anti-cheat-will-support-steam-deck-and-proton-too",
          "publishedOn": "2021-09-25T19:45:50.000Z",
          "wordCount": 841,
          "title": "BattlEye Anti-Cheat will support Steam Deck and Proton, too"
        },
        {
          "id": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-163",
          "author": "Alice O'Connor",
          "description": "Okay, here we are: it is now autumn. I'm ready. I've folded my summer bedding away, pulled out the big duvet, and bought a bigger Thermos. And this is the nice part of autumn, when things are cosy and transitionary, before the feeling of death sets in. I was cheered by reading about your favourite autumn games this week. But anyway, what are you playing this weekend? Here's what we're clicking on.\nRead more",
          "link": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-163",
          "publishedOn": "2021-09-25T08:00:00.000Z",
          "wordCount": 1152,
          "title": "What are we all playing this weekend?"
        },
        {
          "id": "https://www.rockpapershotgun.com/handcop-is-a-hilariously-horrifying-fist-person-shooter-in-development",
          "author": "Lauren Morton",
          "description": "Handcop is a work in progress \"fist person shooter\" that's just as neat as it is horrifying. This wacky prodecurally-animated cop hand has three legs and chest hair for goodness sake. I can't decide if three \"legs\" is better or worse than three finger \"arms\". Oh, and of course officier Michael McWrist is running about carrying a giant gun. It's relatively early days for Handcop right now, it sounds like, but its wacky animations are already catching the internet's attention.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/handcop-is-a-hilariously-horrifying-fist-person-shooter-in-development",
          "publishedOn": "2021-09-24T22:39:48.000Z",
          "wordCount": 966,
          "title": "Handcop is a hilariously horrifying \"fist person shooter\" in development"
        },
        {
          "id": "https://www.rockpapershotgun.com/frankenstein-and-dracula-are-roomies-in-this-moody-narrative-adventure",
          "author": "Lauren Morton",
          "description": "\"Dracula and Frankenstein are modern day 20-something flatmates who never see one another and only exchange sticky notes. Also they are both very sad. Also Dracula wears puple shades,\" is the kind of message I'd expect to see from one of my writing acquaintances with the timestamp [2:15am]. It's also the kind of thing I'd respond to with a \"yes, do it,\" eager to find out exactly how the hell they would. That's the energy that I downloaded Frank And Drake's demo with, and it sure is a moody, somber narrative adventure about two unlikely housemates.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/frankenstein-and-dracula-are-roomies-in-this-moody-narrative-adventure",
          "publishedOn": "2021-09-24T21:36:11.000Z",
          "wordCount": 871,
          "title": "Frankenstein and Dracula are roomies in this moody narrative adventure"
        },
        {
          "id": "https://www.rockpapershotgun.com/castlevania-advance-collection-whips-out-four-classics-now-on-pc",
          "author": "Lauren Morton",
          "description": "Dracula's back from the dead again and so are four Castlevania games from the aughts. Three different vampire stomping adventures originally hailing from the Game Boy Advance—and one SNES—have made their way into a new collection on PC via Steam. Two Belmonts, a Graves, and a Cruz all get their time to shine against those undead baddies in Castlevania: Circle Of The Moon, Harmony Of Dissonance, Aria Of Sorrow, and Dracula X. Konami launched the Castlevania Advance Collection yesterday, complete with some modern conveniences for us PC players in the year 2021.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/castlevania-advance-collection-whips-out-four-classics-now-on-pc",
          "publishedOn": "2021-09-24T20:11:56.000Z",
          "wordCount": 789,
          "title": "Castlevania Advance Collection whips out four classics now on PC"
        },
        {
          "id": "https://www.rockpapershotgun.com/this-mod-adds-a-universal-photo-mode-to-over-300-unreal-engine-games",
          "author": "Lauren Morton",
          "description": "Photo modes are undeniably in fashion now, so much so that I've just started assuming most major RPGs and third-person action games will have one built in at launch. I've never put in the time to get particularly skilled at lining up the best shots, but I'm always well impressed by those who do. It's a bummer though when a looker of a game doesn't have a way to really get up close and personal with its pretty cast and environments. Tales Of Arise, which just launched this month, doesn't have one yet, for instance. That's where the extremely nifty and very handy Universal Unreal Engine 4 Unlocker comes in. It's a mod that lets you toggle a free camera to take amazing screenshots in over 300 Unreal Engine games.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/this-mod-adds-a-universal-photo-mode-to-over-300-unreal-engine-games",
          "publishedOn": "2021-09-24T18:46:50.000Z",
          "wordCount": 986,
          "title": "This mod adds a universal photo mode to over 300 Unreal Engine games"
        },
        {
          "id": "https://www.rockpapershotgun.com/tmorpg-book-of-travels-will-launch-in-early-access-on-october-11th",
          "author": "Lauren Morton",
          "description": "Might And Delight's \"tiny Multiplayer Online RPG\" Book Of Travels has scheduled itself a new early access launch date after its most recent delay. As M&D previously reassured fans, it is indeed a shorter wait than I'd feared. Their cozy online RPG is now setting out into early access on October 11th, with plans to work towards a full launch in two years.  \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/tmorpg-book-of-travels-will-launch-in-early-access-on-october-11th",
          "publishedOn": "2021-09-24T16:15:28.000Z",
          "wordCount": 1052,
          "title": "\"TMORPG\" Book Of Travels will launch in early access on October 11th"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-castle-ideas",
          "author": "Hayden Hefford",
          "description": "Want to build an epic Castle in Minecraft? How about 8 castles? That’s how many we’ve got for you in this list, so you’d best get building! These castles look truly stunning, but we're sure they'll be even better atop the new mountains that are coming when the Minecraft 1.18 update launches later this year.\nCheck out all of these builds to get some inspiration for your own world in Minecraft, or just follow along with the Youtube tutorials if you like what you see!\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-castle-ideas",
          "publishedOn": "2021-09-24T15:41:32.000Z",
          "wordCount": 1404,
          "title": "8 Minecraft castle ideas to build in 1.17"
        },
        {
          "id": "https://www.rockpapershotgun.com/squid-game-is-the-perfect-netflix-show-for-zero-escape-danganronpa-likers",
          "author": "Katharine Castle",
          "description": "Listen up, escape room fans. There's a new Korean drama you need to watch. It's called Squid Game, it's on Netflix, and it's real good. It's a show about 456 down and outers - folks with no life, family or who are in huge piles of debt - who enter a deadly competition to win a truck ton of money to help them turn their life around. All they need to do is compete in six games. Easy peasy, everyone thinks. How hard can that be? Only the first of those games, a riff on the classic children's game Statues / Grandma's Footsteps / Red Light Green Light - involves running toward a giant automaton with motion sensors in her eyes, as well as a team of snipers waiting in the rafters to take down anyone who does stay perfectly at the right time. \nIt's grim, but it's also the perfect blend of some of my favourite things ever: Zero Escape, Danganronpa and Battle Royale (the Japanese thriller, not the game genre) - and I implore you to give it a go.\nRead more",
          "link": "https://www.rockpapershotgun.com/squid-game-is-the-perfect-netflix-show-for-zero-escape-danganronpa-likers",
          "publishedOn": "2021-09-24T15:30:00.000Z",
          "wordCount": 852,
          "title": "Squid Game is the perfect Netflix show for Zero Escape & Danganronpa likers"
        },
        {
          "id": "https://www.rockpapershotgun.com/tfi-friday-3-new-indie-games-about-soaking-things-in-water",
          "author": "Alice Bell",
          "description": "I love doing this column because it means a) it is the end of a working week (working hard or hardly working, amiright?) and b) I get to play something nice and (often) small, and usually a bit weird. I am also, as it turns out, really smug about the theme I discovered for this week. Last night I had a bath, so am ideally positioned to extoll the benefits of dunking things in water. May I present to you three brand new indie games: a frog's tea party, a potion workshop and a rainy walk.\nRead more",
          "link": "https://www.rockpapershotgun.com/tfi-friday-3-new-indie-games-about-soaking-things-in-water",
          "publishedOn": "2021-09-24T15:07:25.000Z",
          "wordCount": 1502,
          "title": "TFI Friday: 3 new indie games about soaking things in water"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-warrior-path-walkthrough-toshis-love",
          "author": "Ollie Toms",
          "description": "Stuck on the Warrior Path in Kena: Bridge Of Spirits? You're not alone. The sheer number of portals and zipping between locations throughout the Warrior Path has led many a player to distraction and frustration. At least, until they found this handy walkthrough, which guides you carefully through every part of the Toshi's Love quest, through every combat area and puzzle, until you reach the end and defeat the Warrior himself.\nKeep scrolling to read our written and our video walkthrough of the Warrior Path in Kena: Bridge Of Spirits.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-warrior-path-walkthrough-toshis-love",
          "publishedOn": "2021-09-24T14:19:55.000Z",
          "wordCount": 1782,
          "title": "Kena: Bridge Of Spirits Warrior Path walkthrough"
        },
        {
          "id": "https://www.rockpapershotgun.com/tomb-raider-reboot-studio-now-working-on-perfect-dark-reboot",
          "author": "Alice O'Connor",
          "description": "After rebooting Lara Croft with 2013's Tomb Raider, Square Enix's Crystal Dynamics studio are now helping reboot another vintage hero: Joanna Dark. They'll be chipping in on Microsoft's mysterious new Perfect Dark, helping out the mysterious Santa Monica studio named The Initiative. Secrecy might be thematically appropriate for a game about a futuristic superspy but we don't know much of anything about it so all you can really say is \"Yup, I guess they're doing that.\"\nRead more",
          "link": "https://www.rockpapershotgun.com/tomb-raider-reboot-studio-now-working-on-perfect-dark-reboot",
          "publishedOn": "2021-09-24T14:18:10.000Z",
          "wordCount": 854,
          "title": "Tomb Raider reboot studio now working on Perfect Dark reboot"
        },
        {
          "id": "https://www.rockpapershotgun.com/embrace-the-machine-gun-metal-dogs",
          "author": "Sin Vega",
          "description": "It's all very silly. Having survived the grey, po-faced gruntman domination of the 2000s, I love that games can still be very silly.\nMetal Dogs is a twin stick (sort of) shooter about sending heavy weapons platforms into irradiated future deserts to fight giant insects, ghost tanks, and robot hippos. Naturally, those heavy weapons platforms are strapped onto dogs.\nRead more",
          "link": "https://www.rockpapershotgun.com/embrace-the-machine-gun-metal-dogs",
          "publishedOn": "2021-09-24T14:00:00.000Z",
          "wordCount": 655,
          "title": "Embrace the machine gun, Metal Dogs"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-to-install-ram",
          "author": "James Archer",
          "description": "Installing RAM is both one of the easiest steps to building a PC and one of the simplest ways to upgrade an existing gaming rig. In a physical sense, anyway. Just like installing an M.2 SSD, there are no power or data cables to worry about, and as long as your RAM sticks fit the RAM slots on your motherboard, ultimately you just need to push them in. There is room for error, though, hence why this article is going to continue beyond the introductory paragraph. See? RAM can be interesting.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/how-to-install-ram",
          "publishedOn": "2021-09-24T13:31:27.000Z",
          "wordCount": 1383,
          "title": "How to install RAM"
        },
        {
          "id": "https://www.rockpapershotgun.com/mystery-steam-reviews-054-video-games-robots",
          "author": "Colm Ahern",
          "description": "Humans are boring. All fleshy and feelings and Netflix. Like this quiz, robots don't have hidden agendas. Robots want to wish Paulie a happy birthday, and we want to entertain you for quarter of an hour. It's the perfect match.\r\n  \nRead more",
          "link": "https://www.rockpapershotgun.com/mystery-steam-reviews-054-video-games-robots",
          "publishedOn": "2021-09-24T13:30:04.000Z",
          "wordCount": 947,
          "title": "Robot beings rule Mystery Steam Reviews"
        },
        {
          "id": "https://www.rockpapershotgun.com/send-thatcher-back-to-hell-in-this-new-doom-2-mod-today",
          "author": "Alice O'Connor",
          "description": "Following a short delay caused by Tennent's Lager (actual true story), Margaret Thatcher has returned from Hell to menace us once more. Thankfully, one doomed space marine will stand up and venture into the tenth circle of Hell (aka the UK) to put the reviled British prime minister down for good. Thatcher's Techbase is its name, and Doom 2 is the game you'll need to play this free mod now it's out. It is quite the thing, and even has a custom soundtrack from Paradise Killer's composer.\nRead more",
          "link": "https://www.rockpapershotgun.com/send-thatcher-back-to-hell-in-this-new-doom-2-mod-today",
          "publishedOn": "2021-09-24T13:08:19.000Z",
          "wordCount": 896,
          "title": "Send Thatcher back to Hell in this new Doom 2 mod today"
        },
        {
          "id": "https://www.rockpapershotgun.com/cult-classic-snes-platformer-actraiser-now-on-pc-with-a-remaster",
          "author": "Imogen Beckhelling",
          "description": "What's up 90s kids, how would you like to jump back into a SNES platforming city-builder that was first released 30 years ago? Last night's Nintendo Direct had a surprising amount of PC news on offer, including the announcement that a remake of ActRaiser is available to play on PC right now. Named ActRaiser Renaissance, Square Enix say they've given the game a \"complete graphical overhaul\", as well as added some new features for players to try.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/cult-classic-snes-platformer-actraiser-now-on-pc-with-a-remaster",
          "publishedOn": "2021-09-24T13:02:55.000Z",
          "wordCount": 870,
          "title": "Cult classic SNES platformer ActRaiser now on PC with a remaster"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-tower-ideas",
          "author": "Hayden Hefford",
          "description": "Looking for a cool tower to build in Minecraft? This list is filled with exciting tower ideas that you can try out in Minecraft, with everything from a simple base to a magical Wizard tower.\nTake a look through all of these suggestions to get inspired, or follow along with one of the videos and get building right now!\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-tower-ideas",
          "publishedOn": "2021-09-24T11:56:37.000Z",
          "wordCount": 1275,
          "title": "7 Minecraft tower ideas to build in 1.17"
        },
        {
          "id": "https://www.rockpapershotgun.com/valheim-crystal-shards",
          "author": "Rebecca Jones",
          "description": "Where do you get Crystal Shards in Valheim, and what are they used for? Crystal has existed as a resource in Valheim for a while, but like many crafting materials in this Early Access cult hit, it's only recently been given a use. The Hearth & Home update has added Crystal Battleaxe and Crystal Wall recipes, and now this previously purely decorative resource is in high demand.\nRead more",
          "link": "https://www.rockpapershotgun.com/valheim-crystal-shards",
          "publishedOn": "2021-09-24T11:39:34.000Z",
          "wordCount": 1166,
          "title": "Valheim Crystal: how to get crafting materials for the Crystal Battleaxe and Crystal Wall"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-incense-pots-puzzle-toshis-fear",
          "author": "Ollie Toms",
          "description": "Wondering how to solve the Incense Pots puzzle in Kena: Bridge Of Spirits? If you've followed the Mask Maker path as part of the Toshi's Fear quest and you're stuck on these infernal Incense Pots, you've come to exactly the right place. There's not much to say here, so let's jump right into our walkthrough of how to solve this particular puzzle in Kena: Bridge Of Spirits.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-incense-pots-puzzle-toshis-fear",
          "publishedOn": "2021-09-24T11:34:27.000Z",
          "wordCount": 999,
          "title": "Kena: Bridge Of Spirits Incense Pots puzzle"
        },
        {
          "id": "https://www.rockpapershotgun.com/valheim-obliterator-thunder-stones",
          "author": "Rebecca Jones",
          "description": "How do you craft and use the Obliterator in Valheim? The Obliterator was added to Valheim with the Hearth & Home update, and exists to address a recurring problem experienced by Valheim players in older iterations of the Early Access smash hit. Previously, there was no way to actually get rid of items you didn't need — which could include a surplus of crafting materials and even trophies made from the body parts of slain enemies. The Obliterator gives you the option to neatly dispose of all the inventory junk you don't want to display or store.\n Read more",
          "link": "https://www.rockpapershotgun.com/valheim-obliterator-thunder-stones",
          "publishedOn": "2021-09-24T10:37:56.000Z",
          "wordCount": 1049,
          "title": "Valheim Obliterator: how to craft and use an Obliterator"
        },
        {
          "id": "https://www.rockpapershotgun.com/monster-hunter-rise-announces-sunbreak-expansion-before-even-hitting-pc",
          "author": "Alice O'Connor",
          "description": "Though Monster Hunter Rise isn't even out on PC for months yet, Capcom have announced an expansion is coming our way. During last night's Nintendo Direct stream they revealed Monter Hunter Rise: Sunbreak, which will launch simultaneously on Switch and PC in summer 2022. Hey, at least that means while consoleers had to wait over a year for the expansion, we'll have it after only a few months. Have a peek in the announcement trailer.\nRead more",
          "link": "https://www.rockpapershotgun.com/monster-hunter-rise-announces-sunbreak-expansion-before-even-hitting-pc",
          "publishedOn": "2021-09-24T10:37:31.000Z",
          "wordCount": 780,
          "title": "Monster Hunter Rise announces Sunbreak expansion before even hitting PC"
        },
        {
          "id": "https://www.rockpapershotgun.com/voice-of-cards-the-isle-dragon-roars-is-yoko-taros-new-card-based-rpg",
          "author": "Imogen Beckhelling",
          "description": "Nier director Yoko Taro is making a new role-playing game in which everything is depicted through cards, and somehow it's not called Yoko Tarot. Story? There are cards for that. Combat? Turn-based card battles, of course. Travelling through the world? Flip over some cards, see what you find! It's called Voice Of Cards: The Isle Dragon Roars, and it's set to release this October. On top of that, a demo will be available later today if you fancy trying it out. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/voice-of-cards-the-isle-dragon-roars-is-yoko-taros-new-card-based-rpg",
          "publishedOn": "2021-09-24T10:07:35.000Z",
          "wordCount": 960,
          "title": "Voice Of Cards: The Isle Dragon Roars is Yoko Taro's new card-based RPG"
        },
        {
          "id": "https://www.rockpapershotgun.com/warhammer-40000-space-marine-adds-dlc-in-surprise-anniversary-edition",
          "author": "Alice O'Connor",
          "description": "Rise, brothers, to venerate Warhammer 40,000: Space Marine as it celebrates its tenth birthday this month. Relic Entertainment and Sega have a surprise for us all too, turning the third-person ork-smasher into an 'Anniversary Edition' which includes all the DLC as well as bonuses like the soundtrack. That's all for free, which is nice.\nRead more",
          "link": "https://www.rockpapershotgun.com/warhammer-40000-space-marine-adds-dlc-in-surprise-anniversary-edition",
          "publishedOn": "2021-09-24T09:43:46.000Z",
          "wordCount": 851,
          "title": "Warhammer 40,000: Space Marine adds DLC in surprise 'Anniversary Edition'"
        },
        {
          "id": "https://www.rockpapershotgun.com/steam-deck-compatibility-conundrum-partially-solved-with-easy-anti-cheat-support",
          "author": "James Archer",
          "description": "The Steam Deck has just broken through a major compatibility barrier: one that would have made it difficult for some of Steam’s most-played multiplayer games to properly function on the Valve handheld. Gabe and co. have Epic to thank for this one, though, as the latter’s Easy Anti-Cheat (EAC) tech is now extending support to Linux and it Wine and Proton compatibility layers. The same layers, you may recall, that the Steam Deck relies on to run games without native Linux ports. In other words, games with multiplayer components that wouldn’t have worked on the Steam Deck - because their use of EAC precluded Linux/Wine/Proton compatibility - should, in theory, be able to run in full.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/steam-deck-compatibility-conundrum-partially-solved-with-easy-anti-cheat-support",
          "publishedOn": "2021-09-24T09:17:41.000Z",
          "wordCount": 963,
          "title": "Steam Deck compatibility conundrum partially solved with Easy Anti-Cheat support"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-slimes-how-to-find-slimes-make-slime-farm",
          "author": "Hayden Hefford",
          "description": "Want to know how to find Slimes in Minecraft? Slimes can vary in size from annoying little blobs to giant monstrosities, but there’s one thing they all have in common. They all drop Slimeballs, which are extremely useful in Minecraft.\nThis guide will take you through everything that you need to know about Slimes, including how to find them, what you can use Slimeballs for, and how to make your own Slime farm.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-slimes-how-to-find-slimes-make-slime-farm",
          "publishedOn": "2021-09-24T08:49:34.000Z",
          "wordCount": 1522,
          "title": "How to find Slimes and make a Slime Farm in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/fuga-memories-of-steel-is-a-strategy-rpg-with-a-giant-child-powered-tank",
          "author": "Graham Smith",
          "description": "Fuga: Melodies Of Steel is set during an anthropomorphic animal anime World War 2 in which your parents have been taken by the dog Nazis. Still with me? You and your fellow cat children find Howl's Moving Tank in a cave and set about getting your families back, with turn-based, RPG battles.\r\n\nYou also discover at the end of the tutorial that your giant angry house has a \"Soul Cannon\", which is a gun that only fires if you feed it the soul - and permanently kill - one of the children.\r\n\nStill with me?\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/fuga-memories-of-steel-is-a-strategy-rpg-with-a-giant-child-powered-tank",
          "publishedOn": "2021-09-23T23:05:15.000Z",
          "wordCount": 874,
          "title": "Fuga: Melodies Of Steel is a strategy RPG with a giant child-powered tank"
        },
        {
          "id": "https://www.rockpapershotgun.com/halo-infinites-multiplayer-test-will-go-ahead-as-planned",
          "author": "Graham Smith",
          "description": "Breaking news: everything is normal and fine. Yesterday Halo Infinite developers 343 Industries mentioned during a livestream that they might need to delay this weekend's beta. Today they confirmed that's not the case, and posted an overview of what to expect.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/halo-infinites-multiplayer-test-will-go-ahead-as-planned",
          "publishedOn": "2021-09-23T21:58:40.000Z",
          "wordCount": 909,
          "title": "Halo Infinite's multiplayer test will go ahead as planned"
        },
        {
          "id": "https://www.rockpapershotgun.com/csgos-operation-riptide-revives-the-riot-shield-and-makes-a-major-change-to-dust2",
          "author": "Graham Smith",
          "description": "The riot shield was probably the most divisive item ever added to Counter-Strike - and now it's back. New update Operation Riptide, out now, introduces the defensive item to Counter-Strike: Global Offensive's casual mode, alongside major tweaks to Dust2, new missions, shorter matches, and private matchmaking queues.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/csgos-operation-riptide-revives-the-riot-shield-and-makes-a-major-change-to-dust2",
          "publishedOn": "2021-09-23T20:52:02.000Z",
          "wordCount": 980,
          "title": "CS:GO's Operation Riptide revives the riot shield"
        },
        {
          "id": "https://www.rockpapershotgun.com/diablo-2-resurrected-characters-keep-disappearing-among-many-launch-issues",
          "author": "Graham Smith",
          "description": "Diablo 2: Resurrected launched earlier today, offering players the chance to relive the classic hack-and-slasher. But why recreate the experience of one Diablo game when you could recreate the experience of two? Resurrected is also experiencing a bunch of launch issues related to its online mode, just like Diablo 3 before it.\r\n\nThose issues include players being unable to see their existing characters, create new characters, or launch the game. Some might say essential features.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/diablo-2-resurrected-characters-keep-disappearing-among-many-launch-issues",
          "publishedOn": "2021-09-23T19:24:31.000Z",
          "wordCount": 915,
          "title": "Diablo 2: Resurrected characters keep disappearing, among many launch issues"
        },
        {
          "id": "https://www.rockpapershotgun.com/diablo-2-resurrected-hotkeys-are-still-a-goddamn-mess",
          "author": "Alice Bell",
          "description": "Terrible news continues to pour out of Blizzard like pus from of a festering wound around a splinter you forgot about and left for way too long. You should really get that looked at. Still, they must be drawing some comfort from the fact that Diablo II: Resurrected is out today, one of Blizz's most beloved games of all time.\nNaturally, a lot of people will be excited for the remastered version. But if my tone is more immediately aggro than the last time I wrote about Diablerrected, that's because I was previously playing the beta through the rose-tinted haze of this game being very important to me and a big part of my childhood, and bonding with my older brother, and so on. This time, I have been playing the final version for several hours, and am cross.\nRead more",
          "link": "https://www.rockpapershotgun.com/diablo-2-resurrected-hotkeys-are-still-a-goddamn-mess",
          "publishedOn": "2021-09-23T16:30:00.000Z",
          "wordCount": 1351,
          "title": "Diablo 2: Resurrected's hotkeys are still a goddamn mess"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-rally-point-putting-mech-engineer-on-trial-and-error",
          "author": "Sin Vega",
          "description": "When you've played a lot of games, or seen a lot of films, or probably eaten at a lot of restaurants or generally oversaturated your life with one subject, it's easy to start making rules and codes for How It Should Be. I given a lot of games a hard time for being opaque and failing to explain themselves. And yet here I am, finally writing about Mech Engineer after watching and playing it for nine months, waiting for it to hit the point where I can almost, sort of, not exactly recommend it... but share my fascination with it.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-rally-point-putting-mech-engineer-on-trial-and-error",
          "publishedOn": "2021-09-23T16:05:50.000Z",
          "wordCount": 2207,
          "title": "The Rally Point: Putting Mech Engineer on trial (and error)"
        },
        {
          "id": "https://www.rockpapershotgun.com/call-of-duty-vanguard-will-sadly-fix-dognados",
          "author": "Alice O'Connor",
          "description": "The primary function of ragdoll physics in video games, everyone knows, is to freak out and make people laugh. Everyone knows this. The technology was created explicitly to bring a subversive touch of merry mayhem to po-faced murdergames. Everyone knows this. But developers are wary of overdoing it or openly acknowledging this fact which everyone knows. This is why, sadly, Call Of Duty: Vanguard will indeed 'fix' the 'bug' which could make attack dogs turn into a giant maelstrom of limbs, teeth, and mashing meat noises, a phenomenom known as the 'dognado'. Tragic.\nRead more",
          "link": "https://www.rockpapershotgun.com/call-of-duty-vanguard-will-sadly-fix-dognados",
          "publishedOn": "2021-09-23T15:50:50.000Z",
          "wordCount": 844,
          "title": "Call Of Duty: Vanguard will, sadly, fix dognados"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-to-set-up-two-monitors",
          "author": "James Archer",
          "description": "It’s funny to think how different the use cases are for setting up two monitors for your gaming PC, compared to setting up three. A trio of displays lets you play in ultrawide with a wraparound effect that even most purpose-built ultrawide monitors can’t match, but while you can configure a dual-monitor setup to run games across displays, it doesn’t make nearly as much sense. With the borders of each screen running straight down the middle, most of the best ultrawide PC games would be nigh-unplayable. Still! If you can budget for it, two remains better than one. It’s an expanded but focused setup for when you’re playing a full-screen game but also want a browser tab, video, or streaming controls visible at the same time.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/how-to-set-up-two-monitors",
          "publishedOn": "2021-09-23T15:23:38.000Z",
          "wordCount": 1502,
          "title": "How to set up two monitors"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-diablo-2-resurrected-classes-and-builds",
          "author": "Charlie Biggerstaff",
          "description": "Looking for the best classes and builds in Diablo 2: Resurrected? The shiny new remaster is finally here, but the gameplay of Diablo 2: Resurrected will be very familiar to veterans. If you’re playing for the first time, however, the game’s complex character progression can seem overwhelming. The foundations of your experience are your choice of class, and the skill(s) you build around on that class. Each of Diablo 2’s seven classes features multiple talent trees that grant you new abilities and define how you approach the game.\nIf you’re planning to play on Hardcore mode or push deep into Hell difficulty, you will want a quality build. Blizzard has not made balance adjustments to Diablo 2: Resurrected, so the long-established meta still holds in the remaster. Prepare for Hell with our guide to the best classes and builds in Diablo 2: Resurrected.\nRead more",
          "link": "https://www.rockpapershotgun.com/best-diablo-2-resurrected-classes-and-builds",
          "publishedOn": "2021-09-23T15:20:53.000Z",
          "wordCount": 2481,
          "title": "Best Diablo 2: Resurrected classes and builds"
        },
        {
          "id": "https://www.rockpapershotgun.com/diablo-2-resurrected-runes-runewords",
          "author": "Charlie Biggerstaff",
          "description": "Trying to wrap your head around Runes in Diablo 2: Resurrected? Runes are the cornerstone of Diablo 2’s gear system. As there are no balance changes in Diablo 2: Resurrected, longtime players will be familiar. If you’re new, however, this system will look entirely unfamiliar, even if you’ve played Diablo 3 or Path of Exile. There’s nothing quite like Diablo 2’s Rune system in the ARPG genre. If you’re having trouble wrapping your head around the quirks of Runes and Runewords, we’re here to help.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/diablo-2-resurrected-runes-runewords",
          "publishedOn": "2021-09-23T15:20:49.000Z",
          "wordCount": 2114,
          "title": "Diablo 2: Resurrected Runes and Runewords"
        },
        {
          "id": "https://www.rockpapershotgun.com/diablo-2-resurrected-farming-level-85",
          "author": "Charlie Biggerstaff",
          "description": "Looking for the best farming spots in Diablo 2? An ARPG would be nothing without a grind. The grind in Diablo 2 is the foundation of the genre’s last 20 years. The genre-defining classic has seen very few changes for the remastered version, Diablo 2: Resurrected, so veterans of the original will have their strategies in place. If you’re a new player looking to optimize your character after beating the game though, you’ll need to know where to farm your gear. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/diablo-2-resurrected-farming-level-85",
          "publishedOn": "2021-09-23T15:20:45.000Z",
          "wordCount": 1265,
          "title": "Diablo 2: Resurrected farming spots"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-electronic-wireless-show-episode-157-the-best-animal-companions-in-games-special",
          "author": "Alice Bell",
          "description": "This week on The Electronic Wireless Show podcast I was inspired by the extremely cute little monsters the Rot, who are you besties in Kena: Bridge Of Spirits, to ask Matthew and Nate about their favourite animal companions in video games. You will probably be able to predict some of their answers. Others, not so much.\nA big digression about trains and commuter rage this week, as well as a shocking update from Matthew re. the farewell fizzy drink tour. But most exciting is that the Cavern Of Lies is replaced this week by a Cavern Of Announcements! Yes, we have very special news indeed, and you have to listen to at least two thirds of the podcast to find out what it is. But it is genuinely incredible.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-electronic-wireless-show-episode-157-the-best-animal-companions-in-games-special",
          "publishedOn": "2021-09-23T15:00:00.000Z",
          "wordCount": 873,
          "title": "EWS podcast episode 157: the best animal companions special"
        },
        {
          "id": "https://www.rockpapershotgun.com/valheim-tar-pits",
          "author": "Rebecca Jones",
          "description": "Where can you find Tar Pits in Valheim? Tar is a new resource introduced in Valheim's Hearth & Home update. It's a versatile crafting resource that you'll need before you can make many of the update's new items, including Darkwood furniture and building materials, Raven and Wolf Adornments, and — last but never least — the hot tub.\nRead more",
          "link": "https://www.rockpapershotgun.com/valheim-tar-pits",
          "publishedOn": "2021-09-23T14:42:51.000Z",
          "wordCount": 1100,
          "title": "Valheim Tar: how to find Tar Pits"
        },
        {
          "id": "https://www.rockpapershotgun.com/sea-of-thieves-explores-the-sunken-kingdom-in-new-season-today",
          "author": "Alice O'Connor",
          "description": "A new Sea Of Thieves content update heralds the start of a new season today, encouraging pirates to plunge overboard and explore the beautiful halls and mysteries of the Sunken Kingdom. All sorts of coral-y PvE surprises await, with Shrines to quietly explore and Treasures to plunder by force. As beautiful as the game's water is from above, I'm very keen to see more from below.\nRead more",
          "link": "https://www.rockpapershotgun.com/sea-of-thieves-explores-the-sunken-kingdom-in-new-season-today",
          "publishedOn": "2021-09-23T14:11:43.000Z",
          "wordCount": 924,
          "title": "Sea Of Thieves explores the Sunken Kingdom in new season today"
        },
        {
          "id": "https://www.rockpapershotgun.com/chorus-is-an-exhilarating-space-combat-shooter-with-a-rhythm-all-its-own",
          "author": "Katharine Castle",
          "description": "Ever since Chorus first broke out of hyperspace during Microsoft's Xbox Series X showcase last year, Fishlabs' enigmatic space shooter has been a tricky thing to pin down. The first trailer gave us a taste of its high speed combat and third-person battles, but its deep, ominous narration, hints of a mysterious cosmic power, and that final image of a planet being sucked into a black hole almost looked like it was verging into horror territory rather than plain sci-fi. Having now played around an hour of Chorus, I can safely say it's very much a pure breed of space combat shooter, following in the same, adrenalin-fuelled vein as EVE: Valkyrie and Star Wars Squadrons. \nForsaken, the sentient ship you control in Chorus that's piloted by the rebel cultist Nara, is probably a similarly slippery thing to nail down in the eyes of your enemies, too. Thanks to one of Nara's special Rite powers, bestowed on her by that aforementioned cosmic power you'll be hunting down over the course of the game, Forsaken is able to shift and teleport right behind enemy ships for brutal, bullet-ridden takedowns. It's immensely satisfying, and can also make for daring, last-minute escapes from incoming crosshairs. But you'll need much more than Nara's crafty Rite powers to survive Chorus' unforgiving dogfights. Forsaken went up in flames more times than I care to admit in my hour of hands on time, but I'm very much looking forward to going back for more when it finally launches on Steam and the Epic Games Store on December 3rd later this year.\nRead more",
          "link": "https://www.rockpapershotgun.com/chorus-is-an-exhilarating-space-combat-shooter-with-a-rhythm-all-its-own",
          "publishedOn": "2021-09-23T14:00:00.000Z",
          "wordCount": 2110,
          "title": "Chorus is an exhilarating space combat shooter with a rhythm all its own"
        },
        {
          "id": "https://www.rockpapershotgun.com/discord-testing-youtube-integration-to-let-you-watch-videos-with-pals",
          "author": "Imogen Beckhelling",
          "description": "Discord has started testing official YouTube integration, rolling out a new feature named Watch Together which, well, allows users watch YouTube vids together. It comes just a few weeks after Google's lawyers shut down several third-party Discord bots with a similar function. Watch Together has reportedly been enabled in a limited number of Discord servers for now, with plans to roll it out to everyone by the end of October.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/discord-testing-youtube-integration-to-let-you-watch-videos-with-pals",
          "publishedOn": "2021-09-23T13:43:55.000Z",
          "wordCount": 935,
          "title": "Discord testing YouTube integration to let you watch videos with pals"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-tales-of-arise-rose-up-for-a-new-audience",
          "author": "Nadia Oxford",
          "description": "Bandai Namco's first Tales Of game, Tales Of Phantasia, weighed in at a previously unheard of 48MB when it released in 1995. That's a mere wisp of data nowadays, but a veritable beast for a Super Famicom game cartridge. The cost of these high capacity carts, combined with westerners' ho-hum attitude towards RPGs at the time, likely axed any chance it had of being translated. Later Tales games have had better success in the west - 2003's Tales Of Symphonia was arguably its first breakout hit outside Japan - but the series as a whole has always seemed to exist on the fringes of the JRPG dynasty. While the Tales games certainly have a following outside Japan, western JRPG fans still tend to gravitate toward Square Enix's Final Fantasy and Dragon Quest games, or Atlus' Persona series. \nBut the Tales series' low-key existence is seemingly coming to an end thanks to the recently released Tales Of Arise. With its bright, eye-catching visuals and its uniquely frantic battle system, it turns monster slaying from a chore into an addiction, and has won the hearts of many curious newcomers in the process (including yours truly). With this influx of new blood, Tales might stand a chance of grabbing a throne at the heart of the JRPG genre. I recently talked to Arise producer Yusuke Tomizawa, who worked hard to tailor the adventure for a new Tales audience as much as its established fans. He explains how Arise's development went down a long, risky road, but it paid off in excellent review scores, happy fans, and a refreshing new direction for Tales.\nRead more",
          "link": "https://www.rockpapershotgun.com/how-tales-of-arise-rose-up-for-a-new-audience",
          "publishedOn": "2021-09-23T12:00:00.000Z",
          "wordCount": 1884,
          "title": "How Tales of Arise rose up for a new audience"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-storehouse-door-puzzle",
          "author": "Ollie Toms",
          "description": "Puzzled about how to open the Storehouse Door in Kena: Bridge Of Spirits? The smallest area of the game, the Storehouse, is also one of the more confusing and puzzle-dense areas of the world - and the confusion isn't helped by the fact that you've just been given a new power and must quickly learn how it works in order to get through the Storehouse in one piece.\nBelow we'll walk you through exactly how to activate the two Power Crystals and open the Storehouse Door in Kena: Bridge Of Spirits. You'll find both a written and a video walkthrough of the Storehouse puzzle below, so what are you waiting for? Let's dive in.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-storehouse-door-puzzle",
          "publishedOn": "2021-09-23T11:39:05.000Z",
          "wordCount": 1242,
          "title": "How to open the Storehouse Door in Kena: Bridge Of Spirits"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-long-darks-story-campaign-continues-with-episode-4-in-october",
          "author": "Alice O'Connor",
          "description": "Splendid snowy survival sandbox The Long Dark will launch the much-anticipated fourth episode of its story campaign on the 6th of October, developers Hinterland Studio have announced. Named 'Fury, Then Silence', episode 4 of the 'Wintermute' campaign sees one of our protagonists captured by murderers sheltering from the strange superfreeze in a prison complex. Have a peek at that in the new trailer below.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-long-darks-story-campaign-continues-with-episode-4-in-october",
          "publishedOn": "2021-09-23T11:05:10.000Z",
          "wordCount": 860,
          "title": "The Long Dark's story campaign continues with Episode 4 in October"
        },
        {
          "id": "https://www.rockpapershotgun.com/apex-legends-still-has-stability-issues-after-patch-that-shouldve-fixed-them",
          "author": "Imogen Beckhelling",
          "description": "If you've tried to play Apex Legends over the last week or so and noticed that things have been pretty slow, you're not alone. Since the game's Evolution Collection event launched last week, the battle royale and its servers have been struggling, and Respawn Entertainment have been tinkering away to try and sort it all out. Yesterday, they issued a patch to resolve a number of bugs and improve stability, but having played a few matches myself last night, it seems we're not out of the woods just yet.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/apex-legends-still-has-stability-issues-after-patch-that-shouldve-fixed-them",
          "publishedOn": "2021-09-23T10:34:09.000Z",
          "wordCount": 1057,
          "title": "Apex Legends still has stability issues after patch that should've fixed them"
        },
        {
          "id": "https://www.rockpapershotgun.com/steam-deck-faq-confirms-you-can-use-it-as-a-giant-pc-controller",
          "author": "James Archer",
          "description": "While Valve haven't been overly secretive with the Steam Deck, there are still plenty of burning questions to ask about the upcoming handheld PC. For me, these are usually along the lines of “Will it slip into my big coat pockets as easily as the Switch does?” or “Will it survive my cat pushing it off literally any flat surface?” but the newly-launched Steam Deck FAQ covers enquiries of a generally more techy nature.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/steam-deck-faq-confirms-you-can-use-it-as-a-giant-pc-controller",
          "publishedOn": "2021-09-23T10:10:21.000Z",
          "wordCount": 959,
          "title": "Steam Deck FAQ confirms you can use it as a giant PC controller"
        },
        {
          "id": "https://www.rockpapershotgun.com/i-beg-you-enable-multiplayer-in-deathloop-and-embrace-mortality",
          "author": "Brendan Caldwell",
          "description": "The dastardly multiplayer invasions of Deathloop are some murderous hijinks. But not everybody wants to see a player-controlled assassin with vicious human instincts pop up as they sneak through their time loop adventure. That's fine, say developers Arkane, you can simply switch to single player mode, which will replace player incursions with periodic visits from an NPC Julianna who is (let's be diplomatic) a less feisty opponent. I am here to ask, nay, beg: do not do this. Leave it in Online mode. Welcome malice, embrace pain, receive with warmth that sudden mortal stab in the back. You are strong and capable of overcoming such things. I'm not just giving you an ego boost here. As the tenacious Colt, the fight is fixed in your favour.\nRead more",
          "link": "https://www.rockpapershotgun.com/i-beg-you-enable-multiplayer-in-deathloop-and-embrace-mortality",
          "publishedOn": "2021-09-23T10:00:00.000Z",
          "wordCount": 1902,
          "title": "I beg you, enable multiplayer in Deathloop and embrace mortality"
        },
        {
          "id": "https://www.rockpapershotgun.com/blood-bowl-3-delays-early-access-launch-following-beta-feedback",
          "author": "Alice O'Connor",
          "description": "Fantasy sports management sim Blood Bowl 3 is delayed again, with the early access launch now pushed out of September and into the nebulous future. The official word is that after beta feedback, they realised yeah it wasn't ready. They say, \"our teams are more committed than ever to make Blood Bowl 3 the most comprehensive and polished instalment in the series yet.\" Yeah go on, please do that.\nRead more",
          "link": "https://www.rockpapershotgun.com/blood-bowl-3-delays-early-access-launch-following-beta-feedback",
          "publishedOn": "2021-09-23T09:49:04.000Z",
          "wordCount": 789,
          "title": "Blood Bowl 3 delays early access launch following beta feedback"
        },
        {
          "id": "https://www.rockpapershotgun.com/brewing-and-haggling-sim-potion-craft-opens-for-business-in-early-access",
          "author": "Lauren Morton",
          "description": "Step on in and please don't mind the badly-labelled vials I've left lying about the shop. Potion Craft is now in early access with all its myserious brewing and haggling and alchemy-ing. I've been quite taken with the demos and playtests for this one so far, not least because it brings some spirit back to the act of crafting. It's out now in early access, during which Niceplay Games will be adding even more crafting options to toy with before its full launch.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/brewing-and-haggling-sim-potion-craft-opens-for-business-in-early-access",
          "publishedOn": "2021-09-22T22:52:54.000Z",
          "wordCount": 945,
          "title": "Brewing and haggling sim Potion Craft opens for business in early access"
        },
        {
          "id": "https://www.rockpapershotgun.com/sable-review",
          "author": "Alice Bell",
          "description": "As you might expect from a game set on a desert planet, Sable has a lot of sand. You traverse it on your floating motorbike as the titular character, a young woman who's part of a nomadic culture where adolescents leave home to complete their Gliding. During this gap year of sorts, the Glider does odd jobs and explores the world until they figure out what they want to be for the rest of their life. Sand is a feature. But as they say, sand is coarse and rough and irritating, and it gets everywhere. Each individual grain of sand is small, but a pinch of sand in your bed will change how you feel about your entire sleep experience.\nRead more",
          "link": "https://www.rockpapershotgun.com/sable-review",
          "publishedOn": "2021-09-22T22:01:00.000Z",
          "wordCount": 2109,
          "title": "Sable review: a beautiful adventure beset by troubling bugs"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-chose-to-boot-its-melee-system-in-favor-of-that-excellent-kick",
          "author": "Lauren Morton",
          "description": "Time-looping murder puzzle Deathloop sure seems like it's worth putting on repeat. For all the usual action romp reasons that Arkane are good with, but also for some of its sillier bits. Kicking baddies off ledges sounds like it's the real backbone of Deathloop's comedy. Colt has one damn powerful boot and, according to a new chat with Deathloop director Dinga Bakaba, it's all thanks to Arkane's choice to scrap most of their melee combat system. Here's why Colt traded arm day for leg day. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-chose-to-boot-its-melee-system-in-favor-of-that-excellent-kick",
          "publishedOn": "2021-09-22T21:44:12.000Z",
          "wordCount": 872,
          "title": "Deathloop chose to boot its melee system in favor of that excellent kick"
        },
        {
          "id": "https://www.rockpapershotgun.com/apple-wont-let-fortnite-back-on-the-app-store-until-they-run-out-of-appeals",
          "author": "Lauren Morton",
          "description": "The legal battle between Epic Games and Apple continues as it seems that both are probably willing to cut the proverbial Fortnite baby in half. Earlier this month, the court ruled that Apple must allow third-party payment systems, which was apparently not enough for Epic, who decided to submit an appeal last week. Now, Apple have informed Epic that they will not be allowing Fortnite back into the App Store clubhouse until they've exhausted all their own avenues to appeal. Which means Fortnite could remain off the store for years yet, according to Epic.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/apple-wont-let-fortnite-back-on-the-app-store-until-they-run-out-of-appeals",
          "publishedOn": "2021-09-22T20:32:56.000Z",
          "wordCount": 822,
          "title": "Apple won't let Fortnite back on the App Store until they run out of appeals"
        },
        {
          "id": "https://www.rockpapershotgun.com/lesbian-road-trip-rpg-get-in-the-car-loser-has-just-hit-the-road",
          "author": "Lauren Morton",
          "description": "Get In The Car, Loser! begins as all RPGs about young protagonists with magical powers do—just a lot more bluntly. The world is being threatened by the evil Machine Devil and the Machine Devil cultists, and apparently no one is going to save it if not your plucky party of heroes. So hop on in the back seat, you dork. Get In The Car, Loser!, a free game written by Christine Love of Ladykiller In A Bind fame, is now fueled up and headed out on its self-proclaimed \"lesbian road trip RPG\".\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/lesbian-road-trip-rpg-get-in-the-car-loser-has-just-hit-the-road",
          "publishedOn": "2021-09-22T18:58:07.000Z",
          "wordCount": 857,
          "title": "\"Lesbian road trip RPG\" Get In The Car, Loser! has just hit the road"
        },
        {
          "id": "https://www.rockpapershotgun.com/jett-the-far-shores-fictional-language-started-life-as-gibberish-choral-music",
          "author": "Imogen Beckhelling",
          "description": "Lots of good sci-fi has made up languages, but I don't think many could claim their fictional languages were developed through song. Enter Jett: The Far Shore. It's an upcoming interstellar adventure made by Sword & Sworcery developers Superbrothers with Pine Scented Software, in which a team of scouts take off in their jetts to explore an uncharted planet. Better yet, it features its very own language that sound designer Priscilla Snow developed after finding meaning in the gibberish words she used to form the game's music. \r\n\n\r\nWhile the initial plan was never to have their own in-game language, the Jett team now have a dictionary around 2000 words strong, and I had a chance to talk to them about how it all came to be. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/jett-the-far-shores-fictional-language-started-life-as-gibberish-choral-music",
          "publishedOn": "2021-09-22T17:00:00.000Z",
          "wordCount": 2618,
          "title": "Jett: The Far Shore's fictional language started life as gibberish choral music"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-sims-4-just-added-a-massive-1200-new-color-swatches-to-149-build-items",
          "author": "Lauren Morton",
          "description": "Oh rejoice, a Sims 4 update that's all for me. Maxis have just dropped a free update which they say their art team totally took over by whipping up around 1200 new color swatches for 149 different Buy and Build Mode objects. There are tons of new window drape colors, new countertop swatches, wood furniture choices, and even plants. That is a lot of new color choices for a lot of items and oh boy I will probably use them all. Fellow builders, this one is for us. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-sims-4-just-added-a-massive-1200-new-color-swatches-to-149-build-items",
          "publishedOn": "2021-09-22T16:27:42.000Z",
          "wordCount": 873,
          "title": "The Sims 4 just added a massive 1200 new color swatches to 149 build items"
        },
        {
          "id": "https://www.rockpapershotgun.com/whats-better-unit-designers-or-handcrafted-art",
          "author": "Alice O'Connor",
          "description": "Last time, you decided that fiddling with environmental objects (henceforth known as fiddlebits) is better than rocket jumping. A toughie there, no doubt; I thank you for your careful deliberation. Next up, we're settling an issue of whose hand shapes  game, whether you're getting hands-on with your mens or having someone else lovingly handcraft the entire world for you.\r\nWhat's better: unit designers, or handcrafted art?\nRead more",
          "link": "https://www.rockpapershotgun.com/whats-better-unit-designers-or-handcrafted-art",
          "publishedOn": "2021-09-22T16:16:15.000Z",
          "wordCount": 1081,
          "title": "What's better: unit designers, or handcrafted art?"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-beacon-how-to-make-activate-beacon",
          "author": "Hayden Hefford",
          "description": "Want to know how to make and activate a Beacon in Minecraft? Beacons have two very important uses in Minecraft, as they give you status effects whilst also emitting a beam of light that can act as a waypoint marker to guide you and your friends home.\nThis guide will walk you through everything you need to know to make and use a Beacon in Minecraft, including how to get a Nether Star, which is one of the ingredients you will need.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-beacon-how-to-make-activate-beacon",
          "publishedOn": "2021-09-22T14:39:54.000Z",
          "wordCount": 1530,
          "title": "How to make and activate a Beacon in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/an-ode-to-cutting-off-boss-tails-in-dark-souls",
          "author": "Ed Thorn",
          "description": "Happy 10th anniversary Dark Souls! Here's to you, Sin the Slumbering Dragon. And to you, Crossbreed Priscilla. Chin-chin! Oi, not to you Ornstein, or to you, Smough. How did you even get in, anyway? This is an invitation only event for bosses who have cuttable tails.\nThere's a tinge of sadness to this celebration, though. Cuttable tails were all the rage back in the original Dark Souls but now they're lost to time, never to be seen again, just like the tails you cut off themselves. Although a part of me hopes that the cycle will renew (like the sort of tails that grow back after you cut them off). And just like skinny jeans are slowly going out of fashion in favour of the 90s wide leg, I'm hoping FromSoftware's bosses won't cling so closely to their tails in Elden Ring and maybe, just maybe, they'll let us lop them off again.\nRead more",
          "link": "https://www.rockpapershotgun.com/an-ode-to-cutting-off-boss-tails-in-dark-souls",
          "publishedOn": "2021-09-22T14:30:00.000Z",
          "wordCount": 797,
          "title": "An ode to cutting off boss tails in Dark Souls"
        },
        {
          "id": "https://www.rockpapershotgun.com/marvels-guardians-of-the-galaxys-chaotic-combat-owes-more-to-jrpgs-than-you-think",
          "author": "Ed Thorn",
          "description": "I went hands-on with roughly an hour's worth of Marvel's Guardians Of The Galaxy last week, and I have come away pleasantly surprised. I'll admit, I judged a book by its cover on this one, thinking it would be an action adventure game only Marvel stans with decades worth of MCU facts beamed into their brains could rally behind. But no, even I, who's watched precisely three Marvel films in the last ten years, had a lot of fun with it. Good fun, at that.\nMainly, I liked how the game's combat takes cues from JRPGs, of all things, cribbing off the likes of Final Fantasy XV and Tales Of Arise so your fellow guardians feel just as - if not more - important than yourself.\nRead more",
          "link": "https://www.rockpapershotgun.com/marvels-guardians-of-the-galaxys-chaotic-combat-owes-more-to-jrpgs-than-you-think",
          "publishedOn": "2021-09-22T13:00:00.000Z",
          "wordCount": 1713,
          "title": "Marvel's Guardians Of The Galaxy's chaotic combat owes more to JRPGs than you think"
        },
        {
          "id": "https://www.rockpapershotgun.com/what-are-your-favourite-autumn-games",
          "author": "Alice O'Connor",
          "description": "Today brings the autumn equinox and the start of the season where things, like, fall. It's a good season! I will always mourn the end of summer but I relish the brief window to hike through golden forests, swimming through shoals of leaves in rivers, cosy up around bonfires with cocoa, and break out the warm duvet again. But while we wait for the season to properly kick in, I'm curious: which autumns in video games do you enjoy? Yes, Halloween included.\nRead more",
          "link": "https://www.rockpapershotgun.com/what-are-your-favourite-autumn-games",
          "publishedOn": "2021-09-22T12:40:44.000Z",
          "wordCount": 787,
          "title": "What are your favourite autumn games?"
        },
        {
          "id": "https://www.rockpapershotgun.com/valorants-latest-patch-nerfed-the-floating-knife-fiend-jett",
          "author": "Imogen Beckhelling",
          "description": "If you play Valorant, you undoubtedly know one of those Jett players. The sort that will very un-tactfully launch all three of their smokes in a messy line so they can dash into or out of fights, bamboozling their teammates just as much as the enemy team. It should be a little harder for these speedy knife-slingers to perform such daft feats in the future, because Riot Games have taken away one of Jett's smokes, and they've nerfed her knives to boot.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/valorants-latest-patch-nerfed-the-floating-knife-fiend-jett",
          "publishedOn": "2021-09-22T11:00:27.000Z",
          "wordCount": 1272,
          "title": "Valorant's latest patch nerfed the floating knife-fiend Jett"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-wither-how-to-spawn-defeat-wither",
          "author": "Hayden Hefford",
          "description": "Want to know how to spawn and defeat the Wither boss in Minecraft? The Wither is one of the most formidable enemies in Minecraft, and is one of only two boss mobs that can be encountered in the game.\nIf you’re ready to fight the terrifying monster then gear up and read on, as this guide will walk you through everything that you need to know to find and beat the Wither in Minecraft.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-wither-how-to-spawn-defeat-wither",
          "publishedOn": "2021-09-22T10:27:39.000Z",
          "wordCount": 1553,
          "title": "How to find and defeat the Wither in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/dark-souls-bosses-rated-by-how-much-money-theyd-owe-you-after-a-night-out",
          "author": "Nic Reuben",
          "description": "So, thought you’d take all your great Lordran chums out for a drink to celebrate the 10th anniversary of Dark Souls, did you? Bad times, pal. Sure, they’ll take care of any everlasting dragons you happen to have hanging around on your lawn, but when it comes to a night on the bevvies, they might well be the sorriest bunch of cheapskates since Final Fantasy VIII’s GFs. Consider this your one and only warning before these fantasy grifters clear you out for the month. \nRead more",
          "link": "https://www.rockpapershotgun.com/dark-souls-bosses-rated-by-how-much-money-theyd-owe-you-after-a-night-out",
          "publishedOn": "2021-09-22T10:00:00.000Z",
          "wordCount": 1280,
          "title": "Dark Souls bosses rated by how much money they’d owe you after a night out"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-pc-patch-addresses-framerate-stuttering",
          "author": "Alice O'Connor",
          "description": "New Arkane Studios sneak-o-shooter Deathloop is a good'un, but the PC launch was marred by technical problems which caused the framerate to stutter for many players. One week later, they've put out a patch which should fix the stuttering for many folks playing with a mouse. However, you might not find the game hunky-dory now, as they say they're still investigating another potential stutterorama. Always tricky when multiple issues create similar-looking outcomes.\nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-pc-patch-addresses-framerate-stuttering",
          "publishedOn": "2021-09-22T09:23:30.000Z",
          "wordCount": 760,
          "title": "Deathloop PC patch addresses framerate stuttering"
        },
        {
          "id": "https://www.rockpapershotgun.com/heros-hour-is-a-strategy-rpg-with-huge-automatic-battles",
          "author": "Graham Smith",
          "description": "I spend roughly 90% of my free time watching what the YouTube algorithm offers me. I've not been radicalised yet, although I do now refer to any shopping I buy as a \"haul\" and end all my conversations by thanking Skillshare. \r\n\nTo my surprise, the algorithm has recently started throwing indie games my way. Hero's Hour is among the most interesting it's shown me: a strategy RPG in which you construct armies of pixelated fantasy beasts who then have automated battles.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/heros-hour-is-a-strategy-rpg-with-huge-automatic-battles",
          "publishedOn": "2021-09-21T22:25:50.000Z",
          "wordCount": 789,
          "title": "Hero's Hour is a strategy RPG with huge automatic battles"
        },
        {
          "id": "https://www.rockpapershotgun.com/phoenix-points-corrupted-horizons-will-open-up-on-october-1st",
          "author": "Graham Smith",
          "description": "Phoenix Point's fourth DLC is due on October 1st. Corrupted Horizons adds a new corruption mechanic which can sap the will of your squad, as well as new Mutoid soldiers, pictured above. The Mutoids are immune to corruption, can learn any class's skills, but are unable to heal.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/phoenix-points-corrupted-horizons-will-open-up-on-october-1st",
          "publishedOn": "2021-09-21T21:26:27.000Z",
          "wordCount": 755,
          "title": "Phoenix Point's Corrupted Horizons will open up on October 1st"
        },
        {
          "id": "https://www.rockpapershotgun.com/death-of-the-reprobate-will-complete-a-point-and-click-triptych",
          "author": "Graham Smith",
          "description": "I feel as if the header image successfully conveys the appeal of Joe Richardson's work. He makes point-and-click adventures which take real Renaissance paintings, animate them in cut-out style (think Monty Python), and juxtapose them with modern vernacular.\r\n\nHis next game was announced today. It's called Death Of The Reprobate, and there's a trailer showing both pointing and clicking below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/death-of-the-reprobate-will-complete-a-point-and-click-triptych",
          "publishedOn": "2021-09-21T21:01:59.000Z",
          "wordCount": 744,
          "title": "Death Of The Reprobate will complete a point and click triptych"
        },
        {
          "id": "https://www.rockpapershotgun.com/you-can-once-again-check-whether-your-pc-will-run-windows-11",
          "author": "Graham Smith",
          "description": "Microsoft have put their PC Health Check app back online. The simple tool is designed to tell you whether Windows 11 is compatible with your computer, but it was pulled offline back in June when it kept telling people with modern PCs that they couldn't run the new operating system, with little information as to why not. It's more recently been available to members of the Windows Insider program, but it's back now for all.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/you-can-once-again-check-whether-your-pc-will-run-windows-11",
          "publishedOn": "2021-09-21T20:24:45.000Z",
          "wordCount": 796,
          "title": "You can once again check whether your PC will run Windows 11"
        },
        {
          "id": "https://www.rockpapershotgun.com/neo-the-world-ends-with-you-comes-to-you-on-pc-next-week",
          "author": "Alice O'Connor",
          "description": "Following its debut on PlayStation 4 and Switch in July, Square Enix plan to bring Neo: The World Ends With You over to PC on the 28th of September. That's next Tuesday, day dudes. It's the sequel to an RPG from the Nintendo DS in 2007, set inside a colourful and weird version of Tokyo where young'uns get drawn into a deadly game.\nRead more",
          "link": "https://www.rockpapershotgun.com/neo-the-world-ends-with-you-comes-to-you-on-pc-next-week",
          "publishedOn": "2021-09-21T17:07:49.000Z",
          "wordCount": 738,
          "title": "Neo: The World Ends With You comes to you on PC next week"
        },
        {
          "id": "https://www.rockpapershotgun.com/pc-gaming-weekspot-podcast-054-deathloop-kena",
          "author": "Colm Ahern",
          "description": "After getting a taste last week, both myself and Matthew have spent the last few days in Blackreef. We've been enjoying doing the same things over and over. Yeah, Deathloop is pretty good.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/pc-gaming-weekspot-podcast-054-deathloop-kena",
          "publishedOn": "2021-09-21T16:00:00.000Z",
          "wordCount": 798,
          "title": "The Weekspot podcast #054: bridge of spies"
        },
        {
          "id": "https://www.rockpapershotgun.com/halo-infinite-will-have-back-to-back-tech-previews-this-weekend-and-next",
          "author": "Imogen Beckhelling",
          "description": "If you're not too busy Deathlooping, Kena: Bridge Of Spiriting, or Diablo 2: Resurrecting this weekend, perhaps you'll have a spare moment to drop into Halo Infinite's next technical preview. Between Thursday and Sunday, players registered as a Halo Insider will have a chance to try out the sci-fi FPS's 4v4 Arena mode. But that's not all! 343 have announced that the following weekend, Insiders can jump into another tech test, and have a crack at the game's 12v12 Big Team Battle mode too.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/halo-infinite-will-have-back-to-back-tech-previews-this-weekend-and-next",
          "publishedOn": "2021-09-21T15:54:31.000Z",
          "wordCount": 1069,
          "title": "Halo Infinite will have back-to-back tech previews this weekend and next"
        },
        {
          "id": "https://www.rockpapershotgun.com/call-of-duty-vanguards-open-beta-feels-like-modern-warfare-with-a-lick-of-ww2-paint",
          "author": "Ed Thorn",
          "description": "Call Of Duty: Vanguard's multiplayer feels familiar, have I been here before? Yes, in the past, but also in the future. Despite its World War II setting, Vanguard's open beta has me thinking back to the days of Call Of Duty: Modern Warfare. Having played a sizable chunk of it now, I'm not kidding when I say that it's like the Modern Warfare lot LARPING on a WWII set. For some this will be good. For others this will be bad. For me? It needs Warzone.\nRead more",
          "link": "https://www.rockpapershotgun.com/call-of-duty-vanguards-open-beta-feels-like-modern-warfare-with-a-lick-of-ww2-paint",
          "publishedOn": "2021-09-21T15:30:00.000Z",
          "wordCount": 1507,
          "title": "Call Of Duty: Vanguard's open beta feels like Modern Warfare with a lick of WW2 paint"
        },
        {
          "id": "https://www.rockpapershotgun.com/diablo-2-resurrected-cow-level",
          "author": "Charlie Biggerstaff",
          "description": "Looking for the secret cow level in Diablo 2: Resurrected? The cow level became Diablo 2’s worst-kept secret in the decades following its release. This infamous hidden zone contains armies of halberd-wielding Hell Bovines that swarm players, plus the goofily named Cow King boss. The cow level is a fun little side area to run, and it will of course be present in Diablo 2: Resurrected. If you missed out on the original and don’t know how to find the portal, we’re here to help.\nRead more",
          "link": "https://www.rockpapershotgun.com/diablo-2-resurrected-cow-level",
          "publishedOn": "2021-09-21T15:21:56.000Z",
          "wordCount": 811,
          "title": "How to access the secret cow level in Diablo 2: Resurrected"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-crossbow-loadout-warzone",
          "author": "Kevin Foley",
          "description": "Looking for the best Crossbow loadout to bring into Warzone? It's certainly a unique option to consider in a game all about firearms and high tech weaponry. Still there's fun to be had when wielding this modern take on a medieval weapon, and it's more than capable of one-shotting enemies if you have the skills to wield it. Just don't take the Crossbow into Warzone with the expectation of dominating. It's a novelty at best, and you should be using the best guns in Warzone if your goal is to win.  \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/best-crossbow-loadout-warzone",
          "publishedOn": "2021-09-21T15:07:11.000Z",
          "wordCount": 971,
          "title": "Best Crossbow loadout in Warzone Season 5"
        },
        {
          "id": "https://www.rockpapershotgun.com/jackbox-party-pack-8-arriving-in-time-to-spook-your-halloween-party",
          "author": "Alice O'Connor",
          "description": "You've got a checklist for Halloween: peeled grapes (eyeballs); cold spaghetti (worms); 12-foot skeleton (skeleton); 25 metre bolt of black cotton (costume). But wait, what will people play? Friendo, you're in lucko. Jackbox Games have announced that The Jackbox Party Pack 8, their latest collection of funny party games, will launch on October 14th. It'll pack five games, from murder mystery to a new version of fan-favourite Drawful, this time having players animate their drawings.\nRead more",
          "link": "https://www.rockpapershotgun.com/jackbox-party-pack-8-arriving-in-time-to-spook-your-halloween-party",
          "publishedOn": "2021-09-21T15:04:54.000Z",
          "wordCount": 866,
          "title": "Jackbox Party Pack 8 arriving in time to spook your Halloween party"
        },
        {
          "id": "https://www.rockpapershotgun.com/rogue-lords-is-a-devilishly-fun-roguelike-where-cheating-is-considered-a-virtue",
          "author": "Imogen Beckhelling",
          "description": "Everything about Rogue Lords is very Halloween-y. It's an upcoming gothic roguelike in which you, the devil, send disciples out into the world to wage war with demon hunters and cause general mischief in the mortal world. Having played a bit myself, I already feel the need to start carving pumpkins and hanging up fake cobwebs around my house. It reminds me of all the spooky animated films you see on the telly throughout October, which makes sense because the developers at Cyanide and Leikir Studios tell me the game's art style is partially inspired by Tim Burton films.\nRead more",
          "link": "https://www.rockpapershotgun.com/rogue-lords-is-a-devilishly-fun-roguelike-where-cheating-is-considered-a-virtue",
          "publishedOn": "2021-09-21T15:00:00.000Z",
          "wordCount": 1754,
          "title": "Rogue Lords is a devilishly fun roguelike where cheating is considered a virtue"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-how-to-make-a-book",
          "author": "Hayden Hefford",
          "description": "Want to know how to make a Book in Minecraft? Books are very important, as you will need them to enchant your armour and weapons with various effects. You can also make pretty bookshelves to spruce up your home, if you aren’t interested in becoming an all-powerful wizard.\nThis guide will walk you through everything that you need to know to make a Book in Minecraft, including how to get Paper and Leather, which you will need.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-how-to-make-a-book",
          "publishedOn": "2021-09-21T14:39:27.000Z",
          "wordCount": 1371,
          "title": "How to make a Book in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-genshin-impact-sangonomiya-kokomi-build",
          "author": "Rebecca Jones",
          "description": "Want to learn how to create the best build for Sangonomiya Kokomi in Genshin Impact? Kokomi has been present in Genshin Impact since August's V2.0 update as an NPC, but a playable version of the character is now available as part of the Drifting Luminescence event (running from September 21st to October 12th).\n Read more",
          "link": "https://www.rockpapershotgun.com/best-genshin-impact-sangonomiya-kokomi-build",
          "publishedOn": "2021-09-21T14:17:21.000Z",
          "wordCount": 1967,
          "title": "The best Genshin Impact Sangonomiya Kokomi build"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-bosses-boss-fights",
          "author": "Ollie Toms",
          "description": "Want to learn about all the boss fights in Kena: Bridge Of Spirits? There is a grand total of 16 boss fights (that is, fights with big boss health bars at the top) in Kena: Bridge Of Spirits - and like everything else in Ember Lab's marvellous action-adventure game, each one offers some true spectacle. If you're looking for a list of all the boss fights and some advice on how to beat each one, you've come to the right place.\nKeep scrolling to check out all 16 bosses in Kena: Bridge Of Spirits. I've also included footage of myself beating each boss on Master Spirit Guide difficulty.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-bosses-boss-fights",
          "publishedOn": "2021-09-21T13:42:37.000Z",
          "wordCount": 2840,
          "title": "Kena: Bridge Of Spirits bosses and how to beat them"
        },
        {
          "id": "https://www.rockpapershotgun.com/activision-blizzard-are-now-being-investigated-by-the-us-government",
          "author": "Imogen Beckhelling",
          "description": "The US government's Securities and Exchange Commission (SEC) are investigating Activision Blizzard over the company's handling of sexual misconduct and harassment allegations. This comes just two months after the Call Of Duty publishers were sued by a State department for alleged workplace harassment, discrimination, and retaliation. Now, The SEC have subpoenaed a number of high-level executives, reportedly including CEO Bobby Kotick, and have requested internal documents relating to the allegations. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/activision-blizzard-are-now-being-investigated-by-the-us-government",
          "publishedOn": "2021-09-21T12:59:42.000Z",
          "wordCount": 945,
          "title": "Activision Blizzard are now being investigated by the US government"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-fishing-shrine",
          "author": "Ollie Toms",
          "description": "Wondering how to restore the Fishing Shrine in Kena: Bridge Of Spirits? Each of the other Shrines in the Forgotten Forest of Kena: Bridge Of Spirits are guarded by enemies, but the Fishing Shrine is guarded by a puzzle. And at first glance this puzzle may be a confusing one, because you may not even realise that a puzzle needs to be solved.\nFollow the steps below to learn how to restore the Fishing Shrine in Kena: Bridge Of Spirits!\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-fishing-shrine",
          "publishedOn": "2021-09-21T11:01:29.000Z",
          "wordCount": 1034,
          "title": "How to restore the Fishing Shrine in Kena: Bridge Of Spirits"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-invasion-is-a-zero-sum-mind-game-i-cant-stop-playing",
          "author": "Jeremy Peel",
          "description": "As I pass the eroding façade of a fisherman’s hut, a beret-topped goon strides by in the opposite direction, casually swinging a machete. They’d be conspicuous were it not for the fact that there are no fishermen in this village anymore. If anyone were to bother putting up a welcome sign, it’d read ‘Population: Goons’. They like me, though. This thug’s two-tone mask might be impassive, but the voice beneath it betrays starstruck awe. “Julianna,” they say. “It’s an honour, really.”\n“Shut the fuck up,” I hiss under my breath. “I’m in disguise. If the player hears you, we’re both mince. And thanks.”\nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-invasion-is-a-zero-sum-mind-game-i-cant-stop-playing",
          "publishedOn": "2021-09-21T11:00:00.000Z",
          "wordCount": 1529,
          "title": "Deathloop invasion is a zero-sum mind game I can't stop playing"
        },
        {
          "id": "https://www.rockpapershotgun.com/de-exit-is-about-a-voxel-skeleton-investigating-spooky-goo-in-the-afterlife",
          "author": "Imogen Beckhelling",
          "description": "De-Exit is an upcoming voxel puzzle platformer where you play as a skeleton person investigating strange happenings in the afterlife. You died and landed yourself in the in-between part, not quite heaven and not quite hell, but it's clear that something is a bit wrong. You'll need to explore ruins, collect artifacts and figure out why spooky goo is trying to engulf parts of the world. It's a bit Zelda-y and a bit Tomb Raider-y, but if both those games were filled with cubes.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/de-exit-is-about-a-voxel-skeleton-investigating-spooky-goo-in-the-afterlife",
          "publishedOn": "2021-09-21T10:20:00.000Z",
          "wordCount": 931,
          "title": "De-Exit is about a voxel skeleton investigating spooky goo in the afterlife"
        },
        {
          "id": "https://www.rockpapershotgun.com/scarf-is-a-journey-like-puzzle-platformer-with-a-magic-dragon-scarf",
          "author": "Imogen Beckhelling",
          "description": "Do you ever see something in a game and think, \"Man, I wish that was real\"? And I don't mean magic or spaceships because obviously those are great, but a specific item that would just be so cool to have. I want the scarf from Scarf, an upcoming puzzle platformer about a little blue dude trying to get home. This character has a firey red scarf that does dragon things! When you double jump, it turns into little dragon wings! 10/10 winter wear. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/scarf-is-a-journey-like-puzzle-platformer-with-a-magic-dragon-scarf",
          "publishedOn": "2021-09-21T10:05:00.000Z",
          "wordCount": 855,
          "title": "Scarf is a Journey-like puzzle platformer with a magic dragon scarf"
        },
        {
          "id": "https://www.rockpapershotgun.com/endling-is-a-game-about-a-mama-fox-protecting-her-cubs-in-a-human-ravaged-world",
          "author": "Imogen Beckhelling",
          "description": "Endling is going to break my heart. It's a game about a mama fox trying to look after her pups in an unpleasant future where forests are being destroyed, pollution is rife and these poor animals have been hunted to near-extinction. It's sad, because it really doesn't seem to distant a future from real life, but that's kind of the point. Endling looks gorgeous and poignant, the sort of game that seems important to play, even if it does break my heart.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/endling-is-a-game-about-a-mama-fox-protecting-her-cubs-in-a-human-ravaged-world",
          "publishedOn": "2021-09-21T09:53:31.000Z",
          "wordCount": 1114,
          "title": "Endling is a game about a mama fox protecting her cubs in a human-ravaged world"
        },
        {
          "id": "https://www.rockpapershotgun.com/older-xbox-wireless-controllers-are-getting-quick-switching-between-devices",
          "author": "James Archer",
          "description": "One of the cool things about the official Xbox Series X/S wireless controllers – if we’re using a dramatically expanded definition of the word “cool” – is that they can pair to both the console and a Bluetooth-enabled PC or laptop, then switch between both sources with a double-tap or hold of the pairing button. In what could be good news for owners of older, Xbox One-era wireless controllers, Microsoft are now rolling out a firmware update that brings this same quick-switch functionality to the more aged pads.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/older-xbox-wireless-controllers-are-getting-quick-switching-between-devices",
          "publishedOn": "2021-09-21T09:41:52.000Z",
          "wordCount": 1007,
          "title": "Older Xbox wireless controllers are getting quick-switching between devices"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-map-collectible-locations",
          "author": "Ollie Toms",
          "description": "Looking for a map of Kena: Bridge Of Spirits which shows the locations of all collectibles and hidden areas? Well, you're in luck, because I've spent a painstaking number of hours hundred-percenting Ember Lab's marvellous story-driven action-adventure game, and during my travels I jotted down the exact locations of every single Rot, Hat, Flower Shrine, Meditation Spot, Cursed Chest, and Spirit Mail in the game.\nBelow you'll find ten maps of various areas in Kena: Bridge Of Spirits, annotated with the locations of every single collectible and hidden area in the game, so you can have a far easier time hunting down those pesky remaining achievements. Take a look!\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-map-collectible-locations",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1692,
          "title": "Kena: Bridge Of Spirits map of all collectibles"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-long-is-kena-bridge-of-spirits",
          "author": "Ollie Toms",
          "description": "Wondering how long it'll take you to complete Kena: Bridge Of Spirits? It's a question that's preyed on the minds of many a prospective player since Ember Lab, the developers of this outrageously gorgeous new action-adventure game, previously stated in a tweet that \"you should be able to finish the game over a weekend\".\nBut a weekend of gaming means different things to different people. Does it mean you can blitz through Kena: Bridge Of Spirits in only a few hours, or will it take a solid 20 hours to complete? And does this take into account the many side activities and collectibles, or were Ember Lab simply talking about how quickly you can rush through the main story? Find out exactly how long it takes to complete Kena: Bridge Of Spirits below.\nRead more",
          "link": "https://www.rockpapershotgun.com/how-long-is-kena-bridge-of-spirits",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1032,
          "title": "How long is Kena: Bridge Of Spirits?"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-difficulty-levels",
          "author": "Ollie Toms",
          "description": "Want to know about the four difficulty levels in Kena: Bridge Of Spirits? Or perhaps you simply want to figure out which difficulty is right for you before you get stuck into playing? Kena: Bridge Of Spirits offers a choice of four different difficulty levels which change the game up in various ways to make Kena's journey safer or more perilous, depending on which you choose. Keep reading to find out how to change the difficulty level before and during a playthrough, and what each of the difficulty levels change about the game.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-difficulty-levels",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1156,
          "title": "Kena: Bridge Of Spirits difficulty levels"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-bow",
          "author": "Ollie Toms",
          "description": "Wondering how to unlock the bow in Kena: Bridge Of Spirits? The bow is an extremely useful part of Kena's toolkit, not only as a powerful weapon but also as a traversal tool, as it can be used as a grappling hook when fired at particular blue flowers dotted about the landscape of Kena: Bridge Of Spirits. Read on to find out where, when, and how to unlock the bow so you can get it as quickly as possible.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-bow",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1073,
          "title": "How to unlock the Bow in Kena: Bridge Of Spirits"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-abilities-upgrades-skill-tree",
          "author": "Ollie Toms",
          "description": "Want to learn more about Kena's abilities and upgrades in Kena: Bridge Of Spirits? Early on in Ember Lab's story-driven action-adventure game, you'll learn more about how you can use Karma to upgrade your abilities. Each of these abilities are well worth getting, but some are definitely worth prioritising over others, because they'll help you make quick work of nearly any enemy with some practice.\nBelow we'll walk you through every ability and upgrade in Kena: Bridge Of Spirits and what each one does, along with how to unlock abilities, how to gain Karma, and how to increase your Rot Level to make use of these new abilities.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-abilities-upgrades-skill-tree",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 2094,
          "title": "Kena: Bridge Of Spirits abilities and upgrades"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-spirit-mail-locations",
          "author": "Ollie Toms",
          "description": "Looking for all the Spirit Mail in Kena: Bridge Of Spirits? One of several different types of collectible in Ember Lab's story-focused action-adventure game, Spirit Mail can be collected and delivered back to certain houses in the central Village in order to unlock new areas and gain rewards. But finding them is often far easier said than done, and these puzzles don't get easier just by changing the difficulty level.\nBelow we'll walk you through where to find all 10 Spirit Mail locations in Kena: Bridge Of Spirits, so you can get to work purifying the land of the corruption which has spread across it before you arrived. After you've collected each Spirit Mail you can then see on the map the house in the Village to which it must be delivered.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-spirit-mail-locations",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1959,
          "title": "Kena: Bridge Of Spirits Spirit Mail locations"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-hay-piles",
          "author": "Ollie Toms",
          "description": "Wondering what to do with Hay Piles in Kena: Bridge Of Spirits? You'll find Hay Piles scattered about various areas of the Kena: Bridge Of Spirits map, and it's very unclear at first glance what you're meant to do about them. And it is important that you do something, because sometimes these Hay Piles must be cleared in order to reveal something valuable inside, such as a Rot to add to your growing army of adorable spirits.\nLearn how to destroy Hay Piles in Kena: Bridge Of Spirits below!\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-hay-piles",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 992,
          "title": "How to destroy Hay Piles in Kena: Bridge Of Spirits"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-achievements",
          "author": "Ollie Toms",
          "description": "Looking for a full list of all Kena: Bridge Of Spirits achievements? There is a grand total of 41 achievements to collect in Ember Lab's beautiful and incredibly enjoyable action-adventure title, and they run the gamut in challenge. Some require you to simply play through the story, so you'll unlock them either way eventually. Others require you to go out of your way collecting or setting up particular combat encounters to complete them.\nIn the below trophy guide you'll find a full list of all 41 achievements you can earn in Kena: Bridge Of Spirits, along with a few bits of advice on how to unlock some of the more challenging ones.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-achievements",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1275,
          "title": "Kena: Bridge Of Spirits achievements and trophy guide"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-hats",
          "author": "Ollie Toms",
          "description": "Looking for a list of all the Hats in Kena: Bridge Of Spirits? Yes, you can find Hats for your bouncy little spirit friends in Kena: Bridge Of Spirits, and you can purchase these hats at Hat Carts in order to dress your Rot army up exactly how you'd like. Have you ever heard of anything so sickeningly adorable? I sure haven't.\nBelow you'll be able to take a look at every single Rot Hat in the game, along with their cost in Gems and some information on how these cosmetic items can be procured at a Hat Cart.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-hats",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1267,
          "title": "Kena: Bridge Of Spirits Hats"
        }
      ]
    },
    {
      "title": "Root.cz - články",
      "feedUrl": "https://www.root.cz/rss/clanky/",
      "siteUrl": "https://www.root.cz/clanky/",
      "articles": [
        {
          "id": "www.root.cz-text-15680",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Beta verze Ubuntu 21.10, MidnightBSD 2.1 přechází na LLVM 10, Apple vydal iPhony 13, nabídne i ProRes video, vývojová verze Wine 6.18, Joe Biden jmenoval šéfku AMD do svého poradního týmu, AMD a Mediatek dohromady.",
          "link": "https://www.root.cz/clanky/novy-textovy-editor-pro-gnome-100procentne-evropske-risc-v-procesory-epi-epac10/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-25T22:00:00.000Z",
          "wordCount": 1513,
          "title": "Nový textový editor pro GNOME, 100% evropské RISC-V procesory EPI EPAC1.0",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/252/dr-lisa-su-1.jpg",
            "length": "21252",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15678",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Exekutivě Evropské unie došla trpělivost a chystá nařízení, kterým sjednotí roztříštěný svět nabíječek (nejen) smartphonů. Postihne to všechny, kdo se vymykají standardu USB-C, v čele s Apple.",
          "link": "https://www.root.cz/clanky/evropska-komise-chce-jednotnou-nabijecku-s-usb-c-a-power-delivery/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-23T22:00:10.000Z",
          "wordCount": 2144,
          "title": "Evropská komise chce jednotnou nabíječku s USB-C a Power Delivery",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/485/usb-c-1.jpg",
            "length": "22817",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15675",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Na konci září vyprší platnost kořenového certifikátu DST Root CA X3, na kterém od začátku stála podpora certifikační autority Let's Encrypt. Ta už sice používá nový kořen, ale staré systémy budou mít problém.",
          "link": "https://www.root.cz/clanky/koren-let-s-encrypt-na-konci-mesice-vyprsi-dotkne-se-to-starsich-klientu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T22:00:10.000Z",
          "wordCount": 1768,
          "title": "Kořen Let's Encrypt na konci měsíce vyprší, dotkne se to starších klientů",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/102/cerveny-zamek-1.jpg",
            "length": "46645",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15676",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "V první polovině osmdesátých let patřilo k dobrému vychování dodávat domácí i osobní počítače vybavené nějakým dialektem programovacího jazyka BASIC. Výjimkou není ani IBM PC, pro které byl dodáván mj. i GW-BASIC, později QBasic.",
          "link": "https://www.root.cz/clanky/pc-basic-reinkarnace-popularniho-i-zatracovaneho-gw-basicu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T22:00:05.000Z",
          "wordCount": 8565,
          "title": "PC-BASIC: reinkarnace populárního i zatracovaného GW-BASICu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/567/pc-basic-1.jpg",
            "length": "61248",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15662",
          "author": "redakce@root.cz (Root.cz: Ferenc Lengyel)",
          "description": "Platforma Arduino sa stala veľmi rozšírenou najmä vďaka tomu, že umožňuje veľmi jednoducho naprogramovať rôzne typy kontrolérov pre najrozmanitejšie úlohy. Zároveň využívame väčšinu výhod kontrolérov.",
          "link": "https://www.root.cz/clanky/arduino-mega-na-zbernici-s-pc/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-21T22:00:10.000Z",
          "wordCount": 2096,
          "title": "Arduino Mega na zbernici s PC",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/532/arduino-mega-1.jpg",
            "length": "76480",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15671",
          "author": "redakce@root.cz (Root.cz: Jiří Sluka)",
          "description": "Dnes si představíme jednoduchý editor odvozený z projektu lite, budeme optimalizovat velikost obrázků, začneme si vést vlastní deník a nakonec využijeme průzkumníka slovníků EPWING, LingvoDSL a StarDict.",
          "link": "https://www.root.cz/clanky/softwarova-sklizen-22-9-2021/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-21T22:00:05.000Z",
          "wordCount": 987,
          "title": "Softwarová sklizeň (22. 9. 2021)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/root/368/kombajn-sklizen.jpg",
            "length": "394618",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15642",
          "author": "redakce@root.cz (Root.cz: Michal Tauchman)",
          "description": "V druhé části článků o retrobrightingu se podíváme na samotné výsledky mého snažení. Ve většině případů je výsledek velmi uspokojivý, ale jak uvidíte v jednom případě, ne vždy je vše dokonalé.",
          "link": "https://www.root.cz/clanky/retrobrightin-g-vysledky-procesu-beleni-plastu-a-jeden-prusvih/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T22:00:10.000Z",
          "wordCount": 2697,
          "title": "Retrobrightin­g: výsledky procesu bělení plastu a jeden průšvih",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/324/amiga-retrobrighting-1.jpg",
            "length": "54531",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15668",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "V dnešní části seriálu o křivkách, které nalezneme v přírodě, architektuře, technice i v počítačové grafice, dokončíme popis různých typů spirál. Zabývat se budeme například klotoidou a evolventou.",
          "link": "https://www.root.cz/clanky/krivky-v-prirode-i-v-pocitacove-grafice-svet-spiral-dokonceni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T22:00:05.000Z",
          "wordCount": 7332,
          "title": "Křivky v přírodě i v počítačové grafice – svět spirál (dokončení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/507/krivka-perex-1.jpg",
            "length": "74201",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15667",
          "author": "redakce@root.cz (Root.cz: CSIRT.CZ)",
          "description": "V dnešním díle Postřehů se podíváme na další malý krok směřující ke konci hesel, na agenty NSA, kteří si přivydělávali jako námezdní hackeři, na eskalaci privilegií v HP Omen nebo nový návrh OWASP Top 10.",
          "link": "https://www.root.cz/clanky/postrehy-z-bezpecnosti-ukuste-to-bez-hesel-mily-marconi/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-19T22:00:10.000Z",
          "wordCount": 1433,
          "title": "Postřehy z bezpečnosti: zkuste to bez hesel, milý Marconi!",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/662/mobil-pocitac-1.jpg",
            "length": "40499",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15666",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Firefox Snap bude výchozím prohlížečem v Ubuntu 21.10. Kali Linux 2021.3 NetHunter běží na hodinkách TicWatch Pro. Společnost Jolla oznámila vydání nové verze operačního systému pro chytré telefony Sailfish OS 4.2.0 „Verla“.",
          "link": "https://www.root.cz/clanky/firefox-snap-bude-vychozi-v-ubuntu-kali-linux-na-hodinkach-ticwatch-pro/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-19T22:00:05.000Z",
          "wordCount": 1208,
          "title": "Firefox Snap bude v Ubuntu výchozí, Kali Linux na hodinkách TicWatch Pro",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/172/firefox-ubuntu-1.jpg",
            "length": "19494",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "Root.cz - zprávičky",
      "feedUrl": "https://www.root.cz/rss/zpravicky/",
      "siteUrl": "https://www.root.cz/zpravicky/",
      "articles": [
        {
          "id": "www.root.cz-actuality-42851",
          "author": "redakce@root.cz (Root.cz: klokan)",
          "description": "Server This Week in Rust přinesl odkaz na zajímavý článek z pera tří vývojářů projektu Chromium. Autoři v něm rozvíjejí myšlenku implementovat v C++ stejná, nebo alespoň podobná pravidla paměťové bezpečnosti na úrovni typového systému, jako má Rust (tzv. Borrow Checking).",
          "link": "https://www.root.cz/zpravicky/uvahy-o-borrow-checkeru-pro-c/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-25T10:43:21.000Z",
          "wordCount": 3158,
          "title": "Úvahy o Borrow Checkeru pro C++",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/116/fustrovany-programator-1.jpg",
            "length": "53261",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42850",
          "author": "redakce@root.cz (Root.cz: spajk)",
          "description": "Společnost Brave, známá především svým internetovým prohlížečem zaměřeným na soukromí představila novou službu na bezpečné videohovory. Jmenuje se Brave Talk, v základu je zdarma, běží na Jitsi as a Service a je open-source. Začít můžete na talk.brave.com.",
          "link": "https://www.root.cz/zpravicky/brave-vydal-brave-talk-sluzbu-pro-bezpecne-videohovory/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-24T13:35:15.000Z",
          "wordCount": 1449,
          "title": "Brave vydal Brave Talk: službu pro bezpečné videohovory",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/28/brave-talk-1.jpg",
            "length": "47485",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42849",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Vývojáři uvolnili konečnou betaverzi připravovaného Ubuntu 21.10 s kódovým označením Impish Indri (rošťácký lemur). Vše jde podle připraveného časového harmonogramu, čeká nás ještě kandidát na vydání a poté přijde 14. října ostrá verze.",
          "link": "https://www.root.cz/zpravicky/vysla-konecna-betaverze-ubuntu-21-10-vydani-je-planovano-na-14-rijna/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-24T10:35:29.000Z",
          "wordCount": 1075,
          "title": "Vyšla konečná betaverze Ubuntu 21.10, vydání je plánováno na 14. října",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/537/ubuntu-21-10-impish-indri-1.jpg",
            "length": "13671",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-40036",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Na internetu píšou, že začít s automatizací správy serverů můžete do půl hodiny. Dokážeme vám, že s Ansible to je pravda. Stačí navštívit naše pražské školení Ansible – úvod do automatizace a pak navazující Ansible – role a AWX.",
          "link": "https://www.root.cz/zpravicky/ansible-uvod-do-automatizace-role-a-awx-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-24T09:51:46.000Z",
          "wordCount": 788,
          "title": "Ansible: úvod do automatizace, role a AWX (školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/330/ansible-1.jpg",
            "length": "20637",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42848",
          "author": "redakce@root.cz (Root.cz: D.A. Tiger)",
          "description": "Sourcetrail je open-source program, který slouží k statické analýze a vizualizaci zdrojových kódů v jazycích C, C++ a Python. Dnes jeho vývojáři na svém blogu oznámili ukončení jeho vývoje.",
          "link": "https://www.root.cz/zpravicky/sourcetrail-konci-vyvoj-je-prilis-narocny/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-24T07:20:16.000Z",
          "wordCount": 1461,
          "title": "Sourcetrail končí, vývoj je příliš náročný",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/343/sourcetrail-1.jpg",
            "length": "23300",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42846",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Na základě článku laboratoře QRATOR labs firma MikroTik na svých stránkách upozorňuje na další vlnu DDoS útoků.",
          "link": "https://www.root.cz/zpravicky/mikrotik-zaziva-dalsi-vlnu-ddos-utoku/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-23T07:13:54.000Z",
          "wordCount": 4835,
          "title": "MikroTik zažívá další vlnu DDoS útoků",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/639/mikrotik-1.jpg",
            "length": "30507",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42847",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Vývojáři uvolnili pravidelnou půlroční aktualizaci desktopového prostředí GNOME, tentokrát s označením 41. Mezi hlavní novinky patří vylepšení správce software, nastavení multitaskingu a vylepšení power managementu. Kromě toho je tu nová aplikace Connections, aktualizovaná aplikace Music a vylepšení výkonu v celé řadě komponent.",
          "link": "https://www.root.cz/zpravicky/gnome-41-prinasi-vylepseni-vykonu-a-novinky-v-podpore-waylandu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-23T07:10:05.000Z",
          "wordCount": 797,
          "title": "GNOME 41 přináší vylepšení výkonu a novinky v podpoře Waylandu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/563/gnome-1.jpg",
            "length": "37205",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42845",
          "author": "redakce@root.cz (Root.cz: LD)",
          "description": "Včera večer byla vydána opravná verze VMware vCenter 6.5, 6.7 a 7.0. Tato nová sada verzí opravuje několik kritických zranitelností, od XSS, přístupu k skrytým endpointům API, neoprávněnou manipulaci s nastavením sítě virtuálních strojů, vzdálené mazání souborů na vCenteru až po asi nejzávažnější vzdálené spuštění kódu.",
          "link": "https://www.root.cz/zpravicky/rada-kritickych-chyb-ve-vmware-vcenter/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T20:42:02.000Z",
          "wordCount": 1181,
          "title": "Řada kritických chyb ve VMware vCenter",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/295/vmware-1.jpg",
            "length": "60135",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42844",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Možná nejvýznačnější novinkou v Chrome/Chromium 94 pro uživatele je to, že element canvas je nyní implicitně kalibrován na barevný prostor sRGB, nicméně stránka může specifikovat jiný, podporován je i DCI-P3. Pete LaPage dále doporučuje na web.dev věnovat pozornost textu Eugena Zemtsova o WebCodecs s příklady využití přímého videa pomocí hardwarově akcelerovaných kodeků, které již prohlížeč má (aneb blíží se konec nutnosti dodávat v kódu vlastní neakcelerovanou WASM verzi kodeků). Podpora kodeků skrze WebCodecs se týká jak přehrávání, tak komprese.",
          "link": "https://www.root.cz/zpravicky/chrome-94-nasazuje-srgb-u-elementu-canvas-a-pridava-webgpu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T15:45:46.000Z",
          "wordCount": 854,
          "title": "Chrome 94 nasazuje sRGB u elementu canvas a přidává WebGPU",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/328/chrome-1.jpg",
            "length": "14231",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-41285",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "VPN umožňuje bezpečně propojit různá zařízení pomocí šifrovaných tunelů. Umožňuje také zapojit uživatele do vnitřní sítě přes zabezpečený přístupový bod. Na našem školení VPN a bezpečné připojení k síti s OpenVPN si prakticky ukážeme, jak to celé nastavit a zprovoznit.",
          "link": "https://www.root.cz/zpravicky/vytvorte-si-bezpecnou-vpn-pomoci-openvpn-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T09:49:21.000Z",
          "wordCount": 752,
          "title": "Vytvořte si bezpečnou VPN pomocí OpenVPN (školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/102/openvpn-logo-1.jpg",
            "length": "18777",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42843",
          "author": "redakce@root.cz (Root.cz: spajk)",
          "description": "Test deseti webových prezentací politických stran odhalil v pěti případech kritické zranitelnosti, nejčastěji se jednalo o cross-site scripting, objevily se ale zranitelné zastaralé knihovny a v jednom případě také děravý jedenáct let starý Apache. Více ve zprávě na webu spajk.cz.",
          "link": "https://www.root.cz/zpravicky/webove-stranky-politickych-stran-obsahuji-zranitelnosti/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T08:12:18.000Z",
          "wordCount": 4400,
          "title": "Webové stránky politických stran obsahují zranitelnosti",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/208/xss-notebook-1.jpg",
            "length": "64540",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42841",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "V Linuxu 5.16 dojde ke změně v ovladači nct6775, který obstarává čtení dat ze senzorů mnohých základních desek značky ASUS. Ovladač dostane podporu přístupu k ASIC za použití funkcí ASUS WMI (desky od Asusteku nepoužívají standardní cestu přes ACPI, kterou ovladač disponuje již nyní). S úpravou pak logicky do jádra zamíří i podpora níže uvedeného seznamu základních desek:",
          "link": "https://www.root.cz/zpravicky/linux-5-16-prinese-podporu-senzoru-dalsich-zakladnich-desek-asus/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T06:00:00.000Z",
          "wordCount": 914,
          "title": "Linux 5.16 přinese podporu senzorů dalších základních desek ASUS",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/52/asus-rog-strix-x470-f-gaming-1.jpg",
            "length": "35903",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42840",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Na GIMP 3.0 si ještě chvíli počkáme, vezměmež tedy zavděk dalším, víceméně opravným vydání dva-desítkové řady. GIMP 2.10.28 totiž přináší solidní množství oprav.",
          "link": "https://www.root.cz/zpravicky/gimp-2-10-28-opravuje-dalsi-chyby/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T05:00:00.000Z",
          "wordCount": 824,
          "title": "GIMP 2.10.28 opravuje další chyby",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/158/gimp-2-10-20-1.jpg",
            "length": "50629",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42839",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Canonical rozhodl o prodloužení podpory starších LTS vydání operačního systému Ubuntu na 10 let od první vydané verze. To znamená, že řada Ubuntu 14.04 LTS „Trusty Tahr“ bude podporována až do dubna 2024 a řada Ubuntu 16.04 LTS „Xenial Xerus“ až do dubna 2026.",
          "link": "https://www.root.cz/zpravicky/podpora-ubuntu-14-04-lts-a-16-04-lts-se-prodluzuje-na-10-let/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-21T22:00:00.000Z",
          "wordCount": 1887,
          "title": "Podpora Ubuntu 14.04 LTS a 16.04 LTS se prodlužuje na 10 let",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/223/ubuntu-14-04-esm-1.jpg",
            "length": "22623",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42842",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Laboratoře CZ.NIC vydaly další verzi mobilní Datovky (1.13.0). Kromě oprav nalezených chyb, jako jsou oprava chyby při načítání uložených informací o datovém trezoru nebo vypnutí upozornění na vypršení platnosti hesla, pokud je zvoleno přihlašování Mobilním klíčem, byl podobně jako v případě desktopové aplikace přidán výběr způsobu platby za odesílané poštovní datové zprávy, pokud má uživatel k dispozici více možností.",
          "link": "https://www.root.cz/zpravicky/nova-mobilni-datovka-nabizi-dalsi-zpusob-platby-za-odesilane-postovni-datove-zpravy/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-21T20:00:08.000Z",
          "wordCount": 826,
          "title": "Nová mobilní Datovka nabízí další způsob platby za odesílané poštovní datové zprávy",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/556/datovka-cz-nic-1.jpg",
            "length": "16539",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42838",
          "author": "redakce@root.cz (Root.cz: Ondřej Nový)",
          "description": "Celodenní soutěžní hackathon pro programátory od české technologické společnosti Seznam.cz zná své vítěze. Nejlepší výkon předvedl tým s názvem EasyPeasy.Net ve složení Tomáš Jurásek, Michal Mrnuštík, Michal Motyčka a Adam Jež (zleva).",
          "link": "https://www.root.cz/zpravicky/v-seznamackem-hackathonu-zvitezil-tym-easypeasy-net/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-21T10:06:05.000Z",
          "wordCount": 2407,
          "title": "V seznamáckém hackathonu zvítězil tým EasyPeasy.Net",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/417/hackaton-seznam-cz-2021-1.jpg",
            "length": "67345",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42837",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Kolegové ze serveru Cnews.cz otestovali pět terabajtových SSD pro rozhraní PCIe 4.0. Konkrétně šlo o disky značek WD, Samsung, Adata, Seagate a Aorus, jejichž cena se pohybuje okolo 5500 Kč. Testován byl výkon po připojení na novou sběrnici PCIe 4.0, ale zároveň i ve zpětně kompatibilní PCIe 3.0.",
          "link": "https://www.root.cz/zpravicky/test-terabajtovych-ssd-pro-rozhrani-pcie-4-0-od-wd-samsung-adata-seagate-aorus/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-21T06:34:23.000Z",
          "wordCount": 2352,
          "title": "Test terabajtových SSD pro rozhraní PCIe 4.0 od WD, Samsung, Adata, Seagate, Aorus",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/282/ssd-1.jpg",
            "length": "64824",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42836",
          "author": "redakce@root.cz (Root.cz: Ondřej Caletka)",
          "description": "Chcete-li vytvořit bitovou kopii souborového systému, asi není úplně dobrý nápad používat nástroje jako dd, je-li disk zároveň připojen. Vytváření obrazu bude určitou dobu trvat a pokud se během této doby na disk zapisuje, bude výsledný obraz velmi poškozený.",
          "link": "https://www.root.cz/zpravicky/hot-clone-nastroj-umoznujici-ziskat-obraz-pripojeneho-disku/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T14:58:07.000Z",
          "wordCount": 830,
          "title": "Hot-clone: nástroj umožňující získat obraz připojeného disku",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/508/hdd-pevny-disk-1.jpg",
            "length": "27164",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42835",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "SMB3 server implementovaný v jádře s názvem KSMBD, za kterým stojí Samsung, se dostal do jádra 5.15. To ještě ani nevyšlo a už se v KSMBD objevila závažná zranitelnost, kdy pomocí znaků .. v cestě je možné přistupovat k souborům mimo sdílené adresáře.",
          "link": "https://www.root.cz/zpravicky/smb3-server-v-jadre-5-15-ksmbd-uz-ma-prvni-vaznou-opravu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T14:22:13.000Z",
          "wordCount": 4129,
          "title": "SMB3 server v jádře 5.15 KSMBD už má první vážnou opravu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/567/linux-windows-tux.png",
            "length": "121771",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42834",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Fedora 35 beta by měla vyjít každým dnem. Ostrá verze se očekává 19. října, nebo o týden později. Na serveru mojefedora.cz vyšel dnes článek shrnující novinky očekávané ve Fedoře 35 Workstation.",
          "link": "https://www.root.cz/zpravicky/co-ocekavame-ve-fedore-35/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T14:06:01.000Z",
          "wordCount": 771,
          "title": "Co očekáváme ve Fedoře 35",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/682/fedora-1.jpg",
            "length": "24750",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42833",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Edward Snowden se minulý týden na Twitteru vyjádřil, že nedporučuje používat ExpressVPN. Důvodem je, že bývalý CIO ExpressVPN Daniel Gericke spolu s dalšími dvěma bývalými zaměstnanci NSA pracovali jako nájemní hackeři mezi lety 2016 a 2019 pro firmu DarkMatter ve Spojených arabských emirátech. Za porušení exportních zákonů, jim soud uložil pokutu více jak 1,5 milionů dolarů. Navíc dostali doživotní zákaz bezpečnostní prověrky.",
          "link": "https://www.root.cz/zpravicky/edward-snowden-nedporucuje-pouzivat-expressvpn/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T09:13:40.000Z",
          "wordCount": 2438,
          "title": "Edward Snowden nedoporučuje používat ExpressVPN",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/683/edward-snowden-1.jpg",
            "length": "33281",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-40574",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Linuxových systémů přibývá, každý den se spouštějí nové servery a někdo se o ně musí starat. To znamená spoustu různých dovedností specifických právě pro linuxové prostředí. Jak to zprovoznit, kudy bezpečně dovnitř, co tam najdeme, jak se o to postaráme a jak to nastavíme nebo rozšíříme.",
          "link": "https://www.root.cz/zpravicky/naucte-se-pouzivat-linux-spravne-a-bezpecne-online-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T07:38:28.000Z",
          "wordCount": 774,
          "title": "Naučte se používat Linux správně a bezpečně (online školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/440/skoleni-1.jpg",
            "length": "61676",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42832",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Vývojář jádra Jens Axboe si minulý čtvrtek postěžoval na Lenovo X1 Carbon Gen 9, protože mu při paralelním překladu jádra ( make -j4) notebook sníží frekvenci procesoru až na 400 MHz a stane se prakticky nepoužitelný. Jde o thermal throttling, který má zabránit přehřívání čím dál tenčích a lehčích notebooků.",
          "link": "https://www.root.cz/zpravicky/jak-zabranit-castemu-snizovani-frekvence-u-notebooku/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T06:48:30.000Z",
          "wordCount": 1012,
          "title": "Jak zabránit častému snižování frekvence u notebooků",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/230/fedora-lenovo-thinkpad-x1-carbon-1.jpg",
            "length": "33800",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42831",
          "author": "redakce@root.cz (Root.cz: Calculon)",
          "description": "Byla vydána verze 0.5.0 jazyka Idris 2. Z větších změn lze zmínit přidání inkrementálního překladu a zrychlení typové kontroly omezením redukcí v době překladu.",
          "link": "https://www.root.cz/zpravicky/nova-verze-jazyka-idris-2-pridava-inkrementalni-preklad-a-zrychluje-typovou-kontrolu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-19T19:23:50.000Z",
          "wordCount": 759,
          "title": "Nová verze jazyka Idris 2 přidává inkrementální překlad a zrychluje typovou kontrolu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/388/idris-1.jpg",
            "length": "21059",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42829",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Od 23. do 25. září bude probíhat online konference LibreOffice 2021. Během tří dnů je připraveno okolo padesáti přednášek, workshopů a komunitních setkání s tématy týkající se kancelářského balíku, komunity a open source.",
          "link": "https://www.root.cz/zpravicky/online-konference-libreoffice-2021/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-18T10:47:18.000Z",
          "wordCount": 754,
          "title": "Online konference LibreOffice 2021",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/534/libreoffice-1.jpg",
            "length": "14082",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "abclinuxu - aktuální články",
      "feedUrl": "http://www.abclinuxu.cz/auto/abc.rss",
      "siteUrl": "http://www.abclinuxu.cz/clanky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-umela-inteligence-uprostred-jihoamerickych-lesu-pomaha-zachranit-psiho-samotare",
          "author": "Redakce",
          "description": "Video, se kterým konečně pochopíte rozdíl mezi běžným a moderním úložištěm. Digitalizace zákaznické péče: jak vybrat nejlepší řešení kontaktního centra. Jaké novinky přináší Arcserve UDP 8.1? On-line konference VMworld 2021: stovky přednášek a tutoriálů zdarma. Gartner na křivce seřadil klíčové nastupující technologie. Studie Dell Technologies: hrozba ztráty dat po kyberútoku je větší, než kdy jindy. Umělá inteligence uprostřed jihoamerických lesů pomáhá zachránit psího samotáře.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-umela-inteligence-uprostred-jihoamerickych-lesu-pomaha-zachranit-psiho-samotare",
          "publishedOn": "2021-09-25T22:01:00.000Z",
          "wordCount": 1772,
          "title": "Týden na ITBiz: Umělá inteligence uprostřed jihoamerických lesů pomáhá zachránit psího samotáře"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-38-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-38-2021",
          "publishedOn": "2021-09-24T22:01:00.000Z",
          "wordCount": 2675,
          "title": "Událo se v týdnu 38/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-planety-v-centru-mlecne-drahy",
          "author": "Redakce",
          "description": "Moudrost davu. Dokážeme úspěšně předpovědět, kdy k nám dorazí světlo supernovy? Kvasary jako standardní svíčky. Neutron má na povrchu záporný náboj. Proč se zlato vyskytuje vedle arsenu.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-planety-v-centru-mlecne-drahy",
          "publishedOn": "2021-09-23T22:30:00.000Z",
          "wordCount": 1685,
          "title": "Týden na ScienceMag.cz: Planety v centru Mléčné dráhy"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-komunikace-ma-zvysovat-produktivitu-vyvojaru",
          "author": "Redakce",
          "description": "Hlavní trendy umělé inteligence: Malá a rozprostřená data. Nový typ kybernetických útoků – zneužívání proxyware platforem. Roboti, kteří udělají přesnou díru do hlavy, zachraňují životy. O vstupu do nebe rozhoduje sv. Petr, pro síť je tu ClearPass. Kouzla zbavené? Nepravděpodobné řešení hrozící personální krize ve finančních službách. Honeywell u nás investuje do R&D. Komunikace má zvyšovat produktivitu vývojářů.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-komunikace-ma-zvysovat-produktivitu-vyvojaru",
          "publishedOn": "2021-09-19T22:01:00.000Z",
          "wordCount": 1865,
          "title": "Týden na ITBiz: Komunikace má zvyšovat produktivitu vývojářů"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-prepinane-zrcadlo-z-roztaveneho-kovu",
          "author": "Redakce",
          "description": "Černá díra vyžrala hvězdu. Nanotechnologie s černým oxidem titaničitým. Život v atmosféře subneptunů. Maličké hory na neutronových hvězdách.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-prepinane-zrcadlo-z-roztaveneho-kovu",
          "publishedOn": "2021-09-18T22:01:00.000Z",
          "wordCount": 1672,
          "title": "Týden na ScienceMag.cz: Přepínané zrcadlo z roztaveného kovu"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-37-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-37-2021",
          "publishedOn": "2021-09-17T22:01:00.000Z",
          "wordCount": 2671,
          "title": "Událo se v týdnu 37/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/goodoffer24-dozivotni-licence-windows-10-pouze-za-12-super-slevy-az-91",
          "author": "Reklama",
          "description": "Pořiďte si doživotní aktivační klíč k Windows 10 za 12,52 EUR na prodejním portálu GoodOffer24.com. Kromě toho nástrojů produktivity od Microsoftu zde lze získat i hry a další software. Nezapomeňte zadat před dokončením nákupu slevový kód  AX30.",
          "link": "http://www.abclinuxu.cz/clanky/goodoffer24-dozivotni-licence-windows-10-pouze-za-12-super-slevy-az-91",
          "publishedOn": "2021-09-17T16:00:00.000Z",
          "wordCount": 1458,
          "title": "GoodOffer24: Doživotní licence Windows 10 pouze za 12 €, super slevy až 91%!"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/distribucni-novinky-34-35-2021",
          "author": "Redakce",
          "description": "Závěr letních prázdnin a začátek školního roku přinesly několik významných vydání, LibreELEC s novým Kodi, příručky Linux From Scratch nebo novou stabilní větev OpenWrt, a také aktualizace Clonezilly, Ubuntu LTS, EndeavourOS či EasyOS.",
          "link": "http://www.abclinuxu.cz/clanky/distribucni-novinky-34-35-2021",
          "publishedOn": "2021-09-13T23:00:00.000Z",
          "wordCount": 1733,
          "title": "Distribuční novinky 34-35/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-sprava-a-analyza-dat-tlaci-podniky-do-cloudu",
          "author": "Redakce",
          "description": "Lenovo představuje hybridní tablety budoucnosti. Canon rozšiřuje nabídku A3 multifunkcí pro hybridní pracovní prostředí. Správa a analýza dat tlačí podniky do cloudu.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-sprava-a-analyza-dat-tlaci-podniky-do-cloudu",
          "publishedOn": "2021-09-12T22:01:00.000Z",
          "wordCount": 1443,
          "title": "Týden na ITBiz: Správa a analýza dat tlačí podniky do cloudu"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-dokazali-prepnout-vodivost-z-2d-na-1d",
          "author": "Redakce",
          "description": "Topologické izolátory. Janusovský grafen a baterie. Zachycen nový typ gravitačních vln. Dvojvrstvý borofen. Hledání mimozemských civilizací. Dysonovy sféry u černých děr. Planeta Devět. Oblečení z umělých svalových vláken.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-dokazali-prepnout-vodivost-z-2d-na-1d",
          "publishedOn": "2021-09-11T22:01:00.000Z",
          "wordCount": 1686,
          "title": "Týden na ScienceMag.cz: Dokázali přepnout vodivost z 2D na 1D"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-36-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-36-2021",
          "publishedOn": "2021-09-10T22:01:00.000Z",
          "wordCount": 2341,
          "title": "Událo se v týdnu 36/2021"
        }
      ]
    },
    {
      "title": "abclinuxu - čerstvé zprávičky",
      "feedUrl": "http://www.abclinuxu.cz/auto/zpravicky.rss",
      "siteUrl": "http://www.abclinuxu.cz/zpravicky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/zpravicky/electron-15.0.0",
          "author": "Ladislav Hagara",
          "description": "Byla vydána verze 15.0.0 frameworku pro vývoj multiplatformních desktopových aplikací pomocí JavaScriptu, HTML a CSS Electron (Wikipedie, GitHub). Chromium bylo aktualizováno na verzi 94, V8 na verzi 9.4 a Node.js na verzi 16.5.0. Electron byl původně vyvíjen pro editor Atom pod názvem Atom Shell. Dnes je na Electronu postavena celá řada dalších aplikací.",
          "link": "http://www.abclinuxu.cz/zpravicky/electron-15.0.0",
          "publishedOn": "2021-09-25T15:33:59.000Z",
          "wordCount": 1015,
          "title": "Electron 15.0.0"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/the-official-raspberry-pi-handbook-2022",
          "author": "Ladislav Hagara",
          "description": "Byl vydán The Official Raspberry Pi Handbook 2022 (pdf), tj. oficiální dvousetstránková příručka k Raspberry Pi se spoustou nápadů, tipů, projektů a recenzí.",
          "link": "http://www.abclinuxu.cz/zpravicky/the-official-raspberry-pi-handbook-2022",
          "publishedOn": "2021-09-25T10:26:01.000Z",
          "wordCount": 1055,
          "title": "The Official Raspberry Pi Handbook 2022"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/coreutils-9.0",
          "author": "Ladislav Hagara",
          "description": "Po roce a půl od vydání poslední stabilní verze 8.32 byla vydána nová stabilní major verze 9.0 balíku základních nástrojů Coreutils (GNU Core Utilities). Nová verze přináší celou řadu novinek: příkaz cp má ve výchozím stavu povoleno copy-on-write (CoW), příkaz wc používá AVX2 instrukce k počítání řádků, příkaz cksum má volbu -a pro výběr hašovací funkce, …",
          "link": "http://www.abclinuxu.cz/zpravicky/coreutils-9.0",
          "publishedOn": "2021-09-24T21:53:50.000Z",
          "wordCount": 1002,
          "title": "Coreutils 9.0"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/text-editor-novy-editor-pro-gnome-na-flathubu",
          "author": "Ladislav Hagara",
          "description": "MojeFedora.cz představuje nový editor pro GNOME s názvem Text Editor. Text Editor je postavený na GtkSourceView (komponenta pro zobrazování zdrojového kódu v GNOME Builderu). Instalovat jej lze z Flathubu. Zdrojové kódy jsou k dispozici na GitLabu.",
          "link": "http://www.abclinuxu.cz/zpravicky/text-editor-novy-editor-pro-gnome-na-flathubu",
          "publishedOn": "2021-09-24T14:53:04.000Z",
          "wordCount": 1787,
          "title": "Text Editor, nový editor pro GNOME na Flathubu"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/cinska-centralni-banka-prohlasila-transakce-kryptomenami-za-nezakonne",
          "author": "Ladislav Hagara",
          "description": "Čínská centrální banka prohlásila transakce kryptoměnami za nezákonné.",
          "link": "http://www.abclinuxu.cz/zpravicky/cinska-centralni-banka-prohlasila-transakce-kryptomenami-za-nezakonne",
          "publishedOn": "2021-09-24T11:57:06.000Z",
          "wordCount": 1196,
          "title": "Čínská centrální banka prohlásila transakce kryptoměnami za nezákonné"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/ubuntu-21.10-impish-indri-final-beta",
          "author": "Ladislav Hagara",
          "description": "Byla vydána finální beta verze Ubuntu 21.10 s kódovým názvem Impish Indri. Přehled novinek v poznámkách k vydání. Dle plánu by Ubuntu 21.10 mělo vyjít 14. října 2021.",
          "link": "http://www.abclinuxu.cz/zpravicky/ubuntu-21.10-impish-indri-final-beta",
          "publishedOn": "2021-09-24T08:56:45.000Z",
          "wordCount": 1036,
          "title": "Ubuntu 21.10 (Impish Indri) Final Beta"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/testovaci-vzorky-evropskeho-procesoru-epi-epac1.0-risc-v",
          "author": "Ladislav Hagara",
          "description": "Evropská procesorová iniciativa (European Processor Initiative, EPI) oznámila, že obdržela 143 testovacích vzorků procesoru EPI EPAC1.0 RISC-V. Cílem EPI jsou nízkoenergetické výkonné evropské procesory.",
          "link": "http://www.abclinuxu.cz/zpravicky/testovaci-vzorky-evropskeho-procesoru-epi-epac1.0-risc-v",
          "publishedOn": "2021-09-24T01:04:06.000Z",
          "wordCount": 1413,
          "title": "Testovací vzorky evropského procesoru EPI EPAC1.0 RISC-V"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/easy-anti-cheat-od-epic-games-take-pro-linux",
          "author": "Ladislav Hagara",
          "description": "Společnost Epic Games v souvislosti s přenosným herním PC Steam Deck se SteamOS oznámila, že její Epic Online Services nově nabízí Easy Anti-Cheat také pro vývojáře her pro Linux. Podporováno je Wine i Proton.",
          "link": "http://www.abclinuxu.cz/zpravicky/easy-anti-cheat-od-epic-games-take-pro-linux",
          "publishedOn": "2021-09-23T19:48:31.000Z",
          "wordCount": 921,
          "title": "Easy Anti-Cheat od Epic Games také pro Linux"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/waydroid-android-na-gnu-linuxu",
          "author": "Ladislav Hagara",
          "description": "Waydroid (GitHub) umožňuje spouštět aplikace pro Android na běžných linuxových distribucích. Běhové prostředí vychází z LineageOS. Jedná se o alternativu k Anboxu.",
          "link": "http://www.abclinuxu.cz/zpravicky/waydroid-android-na-gnu-linuxu",
          "publishedOn": "2021-09-23T13:46:27.000Z",
          "wordCount": 970,
          "title": "Waydroid, Android na GNU/Linuxu"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/lennart-poettering-bezpecne-bootovani-a-sifrovani-disku-v-linuxu",
          "author": "Ladislav Hagara",
          "description": "Lennart Poettering se v příspěvku na svém blogu podrobně věnuje bezpečnému bootování a šifrování disků v linuxových distribucích. Začíná kontroverzně: \"Linux již dlouho podporuje šifrování disků a technologie jako UEFI SecureBoot a TPM. Jejich nastavení ale ve většině linuxových distribucí pokulhává. Ve skutečnosti jsou data pravděpodobně bezpečněji uložena na zařízeních s ChromeOS, Android, Windows nebo MacOS než v běžných linuxových distribucích\".",
          "link": "http://www.abclinuxu.cz/zpravicky/lennart-poettering-bezpecne-bootovani-a-sifrovani-disku-v-linuxu",
          "publishedOn": "2021-09-23T11:19:41.000Z",
          "wordCount": 2608,
          "title": "Lennart Poettering: Bezpečné bootování a šifrování disků v Linuxu"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Plasma-5.24-DRM-Leasing",
          "author": null,
          "description": "With the KDE Plasma 5.23 release quickly approaching, feature development is already heating up for Plasma 5.24 while concurrently driving many fixes into the v5.23 codebase...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Plasma-5.24-DRM-Leasing",
          "publishedOn": "2021-09-25T17:34:20.000Z",
          "wordCount": 856,
          "title": "KDE Plasma 5.24 On Wayland To Support DRM Leasing For VR Headsets"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Facebook-BOLTing-The-Kernel",
          "author": null,
          "description": "For several years now Facebook engineers have been working on BOLT as a way to speed-up Linux/ELF binaries. This \"Binary Optimization and Layout Tool\" is able to re-arrange executables once profiled to generate even faster performance than what can be achieved by a compiler's LTO and PGO optimizations. One of the latest BOLT efforts has been on optimizing the Linux kernel image...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Facebook-BOLTing-The-Kernel",
          "publishedOn": "2021-09-25T13:20:47.000Z",
          "wordCount": 809,
          "title": "Facebook Has Been Working On BOLT'ing The Linux Kernel For Greater Performance"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-x86-User-Interrupts-LPC",
          "author": null,
          "description": "Earlier this month Intel engineers posted their initial Linux kernel enablement around x86 User Interrupts with this feature premiering with Xeon \"Sapphire Rapids\" CPUs. As implied by the name, the User Interrupt functionality allows for interrupts to bypass the kernel for more efficient, low-latency, low-utilization interrupts being received by other user-space tasks. Intel talked more about User Interrupts this week at LPC2021...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-x86-User-Interrupts-LPC",
          "publishedOn": "2021-09-25T12:32:10.000Z",
          "wordCount": 856,
          "title": "Intel's User Interrupts With Sapphire Rapids Looking Quite Great For Faster IPC"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=OpenZFS-2.0.6-Released",
          "author": null,
          "description": "While the OpenZFS 2.1 feature release has been available since July, for those still using the OpenZFS 2.0.x series and not yet prepared to make the jump to that big new release with dRAID and other changes, OpenZFS 2.0.6 was released this week...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=OpenZFS-2.0.6-Released",
          "publishedOn": "2021-09-25T10:23:00.000Z",
          "wordCount": 694,
          "title": "OpenZFS 2.0.6 Released With Support For Newer Kernels"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Wine-Staging-6.18",
          "author": null,
          "description": "Building off yesterday's Wine 6.18 development release is now the next Wine-Staging installment that has more than six hundred extra patches on top...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Wine-Staging-6.18",
          "publishedOn": "2021-09-25T09:52:15.000Z",
          "wordCount": 719,
          "title": "Wine-Staging 6.18 Released With 616 Patches Atop Upstream"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=XWayland-sRGB-Support",
          "author": null,
          "description": "Another item is now crossed off the XWayland TODO list with OpenGL sRGB support wired up...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=XWayland-sRGB-Support",
          "publishedOn": "2021-09-25T07:00:00.000Z",
          "wordCount": 772,
          "title": "XWayland GLX Path Enables sRGB Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Wine-6.18-Released",
          "author": null,
          "description": "Wine 6.18 has been popped as the newest bi-weekly development release of this software that allows Windows applications and games to run under Linux and in turn what also powers Steam Play's Proton...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Wine-6.18-Released",
          "publishedOn": "2021-09-24T22:01:31.000Z",
          "wordCount": 740,
          "title": "Wine 6.18 Released With HID Joystick Enabled By Default"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=BattlEye-Proton-Steam-Deck",
          "author": null,
          "description": "Yesterday it was Epic Games confirming Easy Anti-Cheat for Linux and Wine/Proton ahead of the Steam Deck launch and today it's BattlEye confirming Proton / Steam Deck support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=BattlEye-Proton-Steam-Deck",
          "publishedOn": "2021-09-24T19:52:38.000Z",
          "wordCount": 763,
          "title": "BattlEye To Support Valve's Steam Deck / Proton"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=IBM-Possible-Rust-GRUB",
          "author": null,
          "description": "IBM engineer Daniel Axtens presented at this week's Linux Plumbers Conference on the prospects of using the Rust programming language for creating modules for the GRUB2 boot-loader...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=IBM-Possible-Rust-GRUB",
          "publishedOn": "2021-09-24T18:50:24.000Z",
          "wordCount": 827,
          "title": "IBM Engineer Has Been Exploring Possible Rust Modules For GRUB"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GNU-Coreutils-9.0",
          "author": null,
          "description": "Coreutils 9.0 is now available and it's a significant update to this collection of common open-source utilities found on effectively all Linux systems...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GNU-Coreutils-9.0",
          "publishedOn": "2021-09-24T17:36:51.000Z",
          "wordCount": 791,
          "title": "GNU Coreutils 9.0: cp Now Enables CoW By Default + Copy Offload, wc Now Uses AVX2"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30545",
          "author": null,
          "description": "A few weeks ago I finally received the HiFive Unmatched from SiFive as their flagship RISC-V development board. As a reminder this is their mini-ITX development board that is powered by their U740 SoC and features 16GB of DDR4 system memory, one PCI Express x16 slot that can work with AMD Radeon graphics cards on Linux, and other features. It's been a delight playing with this developer platform and enclosed are some early benchmarks as well showing off the U740 performance as well as how the Linux software support/performance has been evolving.",
          "link": "https://www.phoronix.com/vr.php?view=30545",
          "publishedOn": "2021-09-24T13:22:01.000Z",
          "wordCount": 1008,
          "title": "SiFive HiFive Unmatched Hands-On, Initial RISC-V Performance Benchmarks"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=MidnightBSD-2.1-Released",
          "author": null,
          "description": "MidnightBSD 2.1 debuted this week as the latest version of one of the few desktop-focused BSD open-source operating system projects...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=MidnightBSD-2.1-Released",
          "publishedOn": "2021-09-24T09:46:49.000Z",
          "wordCount": 732,
          "title": "MidnightBSD 2.1 Released For This Desktop-Minded BSD"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-21.10-Beta",
          "author": null,
          "description": "Canonical has released the final beta of next month's Ubuntu 21.10 \"Impish Indri\" release...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-21.10-Beta",
          "publishedOn": "2021-09-24T09:16:12.000Z",
          "wordCount": 727,
          "title": "Ubuntu 21.10 Beta Released"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Chrome-95-Beta",
          "author": null,
          "description": "With Chrome 94 having shipped this week, Google has now promoted Chrome 95 to beta...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Chrome-95-Beta",
          "publishedOn": "2021-09-24T04:01:00.000Z",
          "wordCount": 835,
          "title": "Chrome 95 Beta Completely Removes Deprecated FTP Support, Reduced User Agent Info Trial"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Regression-Fixed",
          "author": null,
          "description": "As a follow-up to A Fix Is Pending For That Linux 5.15 Performance Regression, Linus Torvalds decided to pull the fix directly into Linux 5.15 Git today for addressing this real-world, measurable performance regression...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Regression-Fixed",
          "publishedOn": "2021-09-24T04:00:00.000Z",
          "wordCount": 810,
          "title": "Linux 5.15 Lands Memcg Performance Regression Fix"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=BPFILTER-2021",
          "author": null,
          "description": "Generating much excitement back in 2018 was bpfilter for the potential to better Linux's firewall and packet filtering by making it more robust and performance. Recently work on this BPF-based firewall solution was renewed and the performance potential over iptables and nftables is looking very good for the future...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=BPFILTER-2021",
          "publishedOn": "2021-09-23T20:00:00.000Z",
          "wordCount": 831,
          "title": "BPF-Based Linux Firewall \"bpfilter\" Shows Impressive Performance Potential"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Easy-Anti-Cheat-Linux",
          "author": null,
          "description": "Not too surprising given the Steam Deck is inching closer towards release and we've known Valve has been working to improve the anti-cheat situation for games on Linux, but today EAC owner Epic Games officially announced Easy Anti-Cheat for both Linux and macOS...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Easy-Anti-Cheat-Linux",
          "publishedOn": "2021-09-23T18:40:59.000Z",
          "wordCount": 720,
          "title": "Epic Games Announces Easy Anti-Cheat For Linux - Including Wine/Proton"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=FUTEX2-futex_waitv-v2",
          "author": null,
          "description": "The promising FUTEX2 work focused on improving the Linux performance for running Windows games via Wine/Proton by extending futex to wait on multiple locks is still moving forward...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=FUTEX2-futex_waitv-v2",
          "publishedOn": "2021-09-23T18:16:02.000Z",
          "wordCount": 802,
          "title": "Updated \"FUTEX2\" futex_waitv Patches Posted To Address Latest Feedback"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30536",
          "author": null,
          "description": "Last week was the article on noticing various workloads performing slower on the Linux 5.15 development kernel. There is now a patch pending that in testing so far does indeed correct the performance drop on this forthcoming kernel.",
          "link": "https://www.phoronix.com/vr.php?view=30536",
          "publishedOn": "2021-09-23T13:15:19.000Z",
          "wordCount": 730,
          "title": "A Fix Is Pending For That Linux 5.15 Performance Regression"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Microsoft-CLOn12-Mesa-SPIR-V",
          "author": null,
          "description": "Microsoft's \"CLOn12\" effort to allow OpenCL over DirectX 12 by leveraging Mesa now has landed a major rework to its code within Mesa...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Microsoft-CLOn12-Mesa-SPIR-V",
          "publishedOn": "2021-09-23T13:09:48.000Z",
          "wordCount": 715,
          "title": "Microsoft's \"CLOn12\" Mesa Code Adds SPIR/SPIR-V Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GCC-12-Better-Security",
          "author": null,
          "description": "Qing Zhao of Oracle presented yesterday during the LPC2021 GNU Tools Track around the work they and others have been engaged in for improving the security of the GNU Compiler Collection (GCC)...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GCC-12-Better-Security",
          "publishedOn": "2021-09-23T11:17:23.000Z",
          "wordCount": 781,
          "title": "GCC 12 Adds Stack Variable Auto-Initialization, Other Security Improvements Forthcoming"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-FDE-Auth-Boot-Lacking",
          "author": null,
          "description": "Most Linux distributions are currently coming up short from offering adequate security around full disk encryption and authenticated boot. Prominent Linux developer Lennart Poettering even argues that your data is \"probably more secure if stored on current ChromeOS, Android, Windows or macOS devices.\"..",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-FDE-Auth-Boot-Lacking",
          "publishedOn": "2021-09-23T10:23:47.000Z",
          "wordCount": 834,
          "title": "Lennart: Linux Comes Up Short Around Disk Encryption, Authenticated Boot Security"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.16-panel-edp",
          "author": null,
          "description": "The latest batch of miscellaneous Direct Rendering Manager changes are on their way to DRM-Next for Linux 5.16. Notable from this new drm-misc-next batch is the new \"panel-edp\" driver...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.16-panel-edp",
          "publishedOn": "2021-09-23T10:12:38.000Z",
          "wordCount": 813,
          "title": "\"panel-edp\" Driver On Its Way To Linux 5.16 To Make For Less Hard-Coded eDP Panel Configs"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=systemd-oomd-2021",
          "author": null,
          "description": "Systemd-oomd as the out-of-memory daemon originally developed by Facebook has been maturing nicely since being merged last year and then its most notable deployment to date has been with Fedora 34's debut earlier this year. Anita Zhang of Facebook provided an update today on the systemd-oomd effort...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=systemd-oomd-2021",
          "publishedOn": "2021-09-23T04:00:00.000Z",
          "wordCount": 918,
          "title": "systemd OOMD Maturing Nicely, Adds Support For User Services"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-Deck-FAQ",
          "author": null,
          "description": "Valve today published a \"Steam Deck FAQ\" page sharing some additional information on this forthcoming Arch Linux powered handheld game system that will begin shipping at the end of Q4...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-Deck-FAQ",
          "publishedOn": "2021-09-23T00:18:02.000Z",
          "wordCount": 825,
          "title": "Valve Publishes New Steam Deck FAQ With A Few New Details Shared"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Android-Linux-Upstream-First",
          "author": null,
          "description": "Google's Android had been notorious for all of its downstream patches carried by the mobile operating system as well as various vendor/device kernel trees while in recent years more of that code has been upstreamed. Google has also been shifting to the Android Generic Kernel Image (GKI) as the basis for all their product kernels to further reduce the fragmentation. Looking ahead, Google is now talking of an \"upstream first\" approach for pushing new kernel features...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Android-Linux-Upstream-First",
          "publishedOn": "2021-09-22T18:38:46.000Z",
          "wordCount": 924,
          "title": "Google Finally Shifting To \"Upstream First\" Linux Kernel Approach For Android Features"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-RADV-RT-For-Older-GPUs",
          "author": null,
          "description": "Merged yesterday for Mesa 21.3 was open-source Vulkan ray-tracing for AMD RDNA2 / RX 6000 series GPUs with the RADV driver. Opened today now is a merge request that would provide Vulkan ray-tracing with RADV to pre-RDNA2 GPUs on this driver going back to the likes of Polaris, granted the performance is another story...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-RADV-RT-For-Older-GPUs",
          "publishedOn": "2021-09-22T17:14:25.000Z",
          "wordCount": 858,
          "title": "Mesa Merge Pending For Vulkan Ray-Tracing On Older AMD GPUs"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GNOME-41-Released",
          "author": null,
          "description": "GNOME 41 is out as the latest half-year update to this open-source desktop environment...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GNOME-41-Released",
          "publishedOn": "2021-09-22T15:23:58.000Z",
          "wordCount": 707,
          "title": "GNOME 41 Released With Wayland Improvements, More Performance Tuning"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30535",
          "author": null,
          "description": "Earlier this month AMD posted their initial public patches for the AMD P-State CPU frequency scaling driver that leverages ACPI CPPC for ultimately aiming to provide better power efficiency and more responsive CPU frequency scaling / performance state decisions on Zen 3 (and Zen 2 eventually) processors. This is part of the effort around AMD and Valve collaborating for better Linux efficiency especially with the AMD-powered Steam Deck.",
          "link": "https://www.phoronix.com/vr.php?view=30535",
          "publishedOn": "2021-09-22T13:38:59.000Z",
          "wordCount": 902,
          "title": "An Early Look At The AMD P-State CPPC Driver Performance vs. ACPI CPUFreq"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GCC-Better-OpenACC-Performance",
          "author": null,
          "description": "While the GNU Compiler Collection has supported OpenACC for a few years now as this parallel programming standard popular with GPUs/accelerators, the current implementation has been found to be inadequate for many real-world HPC workloads leveraging OpenACC. Fortunately, Siemens has been working to improve GCC's OpenACC kernels support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GCC-Better-OpenACC-Performance",
          "publishedOn": "2021-09-22T10:40:26.000Z",
          "wordCount": 836,
          "title": "Better Support & Performance For OpenACC Kernels Is Coming To GCC"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Aya-LPC2021-Update",
          "author": null,
          "description": "Aya was presented during this week's Linux Plumbers Conference for improving the eBPF developer experience by allowing Rust programs to easily run within the kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Aya-LPC2021-Update",
          "publishedOn": "2021-09-22T09:57:22.000Z",
          "wordCount": 771,
          "title": "Aya Makes It Easy To Write Rust-Based eBPF Programs For The Linux Kernel"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-Touch-OTA-19",
          "author": null,
          "description": "UBports on Tuesday released Ubuntu Touch OTA-19 as the latest refinement to this Ubuntu Linux spin for smartphones and tablets...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-Touch-OTA-19",
          "publishedOn": "2021-09-22T07:40:00.000Z",
          "wordCount": 768,
          "title": "Ubuntu Touch OTA-19 Released - Still Based On Ubuntu 16.04"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/rss.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2520/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2520/",
          "publishedOn": "2021-09-24T04:00:00.000Z",
          "wordCount": 183,
          "title": "Symbols"
        },
        {
          "id": "https://xkcd.com/2519/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2519/",
          "publishedOn": "2021-09-22T04:00:00.000Z",
          "wordCount": 185,
          "title": "Sloped Border"
        },
        {
          "id": "https://xkcd.com/2518/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2518/",
          "publishedOn": "2021-09-20T04:00:00.000Z",
          "wordCount": 187,
          "title": "Lumpers and Splitters"
        },
        {
          "id": "https://xkcd.com/2517/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2517/",
          "publishedOn": "2021-09-17T04:00:00.000Z",
          "wordCount": 185,
          "title": "Rover Replies"
        }
      ]
    }
  ],
  "cliVersion": "1.11.1"
}