{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": [
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "author": null,
          "description": "Fixed: Unexpected nested element in author field crashes the parser\nThank you @ad-m",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "publishedOn": "2021-09-16T06:39:32.000Z",
          "wordCount": 343,
          "title": "v1.11.1"
        }
      ]
    },
    {
      "title": "Kotaku",
      "feedUrl": "https://kotaku.com/rss",
      "siteUrl": "https://kotaku.com",
      "articles": [
        {
          "id": "1847720236",
          "author": "Luke Plunkett",
          "description": "When Paradox announced Victoria III earlier this year, I was very excited, but also a little wary. Simulating the comedic excesses of medieval rulers is one thing, but how was a game coming out in 2022 (?) going to handle depictions of very real and lingering issues like the exploitation of workers and, on even…\nRead more...",
          "link": "https://kotaku.com/pc-game-is-gonna-really-lean-into-slavery-1847720236",
          "publishedOn": "2021-09-22T01:30:00.000Z",
          "wordCount": 1069,
          "title": "PC Game Is Gonna Really Lean Into Slavery"
        },
        {
          "id": "1847719663",
          "author": "Luke Plunkett",
          "description": "With Overwatch 2 still in development, the series’ executive producer has quit Blizzard for what the company says is “some time off”.\n\nRead more...",
          "link": "https://kotaku.com/overwatch-2s-boss-is-quitting-blizzard-for-some-time-o-1847719663",
          "publishedOn": "2021-09-21T23:30:00.000Z",
          "wordCount": 532,
          "title": "Overwatch 2's Boss Is Quitting Blizzard For \"Some Time Off\""
        },
        {
          "id": "1847719489",
          "author": "Isaiah Colbert",
          "description": "The rivalry between Mario and Sonic goes back for decades, but even one of Sonic’s creators was stunned to see the blue hedgehog apparently giving chase to Mario in a whole new realm: that of outrageously priced video game auctions.\nRead more...",
          "link": "https://kotaku.com/even-sonic-dad-yuji-naka-is-shocked-at-game-s-430-000-1847719489",
          "publishedOn": "2021-09-21T23:00:00.000Z",
          "wordCount": 883,
          "title": "Even Sonic Dad Yuji Naka Is Shocked At Game’s $430,500 Auction Price"
        },
        {
          "id": "1847719508",
          "author": "Luke Plunkett",
          "description": "Last year a music industry crackdown on streaming site Twitch resulted in copyright strikes and a mass deletion of videos, as the National Music Publishers’ Association (NMPA) sought to cut down on streamers playing licensed music. Twitch has now made a deal with the NMPA, but for streamers it’s not exactly a…\nRead more...",
          "link": "https://kotaku.com/twitch-and-music-industry-strike-a-deal-but-its-not-gr-1847719508",
          "publishedOn": "2021-09-21T22:40:00.000Z",
          "wordCount": 760,
          "title": "Twitch And Music Industry Strike A Deal, But It's Not Great"
        },
        {
          "id": "1847719143",
          "author": "Ian Walker",
          "description": "The fine folks at Digital Foundry are back with another wonderfully tech-heavy video, this time examining the SSD options available to PlayStation 5 owners now that the console’s storage can be expanded. As it turns out, even the disk-access-heavy Ratchet & Clank: Rift Apart can be thoroughly enjoyed with the…\nRead more...",
          "link": "https://kotaku.com/ratchet-clank-still-runs-fine-on-the-worst-ps5-compat-1847719143",
          "publishedOn": "2021-09-21T22:00:00.000Z",
          "wordCount": 733,
          "title": "Ratchet & Clank Still Runs Fine On The Worst PS5-Compatible SSD"
        },
        {
          "id": "1847718451",
          "author": "Isaiah Colbert",
          "description": "It’s a fact: The women who helped shape the video game industry often go unacknowledged, hidden from history by popular narratives and male-centric scholarship. Mary Kenney, a narrative writer and game designer at Insomniac Games, aims to shed light on some of those overlooked pioneers by highlighting key women who’ve…\nRead more...",
          "link": "https://kotaku.com/uncovering-the-real-history-of-the-women-who-pioneered-1847718451",
          "publishedOn": "2021-09-21T20:30:00.000Z",
          "wordCount": 1373,
          "title": "Uncovering The Real History Of The Women Who Pioneered Video Games"
        },
        {
          "id": "1847717192",
          "author": "Ian Walker",
          "description": "UK developer Kinetic Games updated its multiplayer ghost-hunting game Phasmophobia several times over the last few weeks to celebrate its one-year anniversary, but the latest patch is a doozy, adding an offline single-player mode that I’m never, ever, evereverevereverever going to touch.\nRead more...",
          "link": "https://kotaku.com/phasmophobia-adds-offline-solo-mode-which-i-will-never-1847717192",
          "publishedOn": "2021-09-21T19:50:00.000Z",
          "wordCount": 497,
          "title": "Phasmophobia Adds Offline Solo Mode, Which I Will Never Use"
        },
        {
          "id": "1847716208",
          "author": "Ari Notis",
          "description": "Earlier this summer, developer 343 Industries hosted what was basically a beta for Halo Infinite, the story of one man’s quest to fall in love with a computer. It was bonkers. This week, over on Halo Waypoint, 343 detailed what’s in store for Infinite’s second beta (and, to a lesser degree, the game’s December 8…\nRead more...",
          "link": "https://kotaku.com/the-latest-stuff-coming-to-halo-infinite-you-should-kno-1847716208",
          "publishedOn": "2021-09-21T17:00:00.000Z",
          "wordCount": 890,
          "title": "The Latest Stuff Coming To Halo Infinite You Should Know About"
        },
        {
          "id": "1847716375",
          "author": "Renata Price",
          "description": "Quantic Dream, creators of “so bad, they’re bad” games like Heavy Rain and Detroit: Become Human, recently brought libel action against two French newspapers which had jointly published allegations of misconduct against individuals at the company back in 2018. Now the court has ruled both for and against the…\nRead more...",
          "link": "https://kotaku.com/detroit-dev-quantic-dreams-wins-lawsuit-without-actuall-1847716375",
          "publishedOn": "2021-09-21T16:45:00.000Z",
          "wordCount": 737,
          "title": "Detroit Dev Quantic Dream Wins Lawsuit Without Actually Disproving Misconduct Allegations"
        },
        {
          "id": "1847707750",
          "author": "John Walker",
          "description": "INT. X-WING PILOT APARTMENTS - DAY\nRead more...",
          "link": "https://kotaku.com/leaked-script-from-david-cages-star-wars-game-1847707750",
          "publishedOn": "2021-09-21T15:30:00.000Z",
          "wordCount": 662,
          "title": "Leaked Script From David Cage's Star Wars Game"
        },
        {
          "id": "1847714940",
          "author": "Ari Notis",
          "description": "Blizzard Entertainment’s chief legal officer, Claire Hart, has resigned from the embattled company. She announced the news in a LinkedIn post yesterday, saying that last Friday, September 17, was her final day.\nRead more...",
          "link": "https://kotaku.com/blizzards-chief-legal-officer-quits-amid-lawsuit-1847714940",
          "publishedOn": "2021-09-21T15:00:00.000Z",
          "wordCount": 520,
          "title": "Blizzard's Chief Legal Officer Quits Amid Lawsuit"
        },
        {
          "id": "1847714763",
          "author": "John Walker",
          "description": "Pokémon  Unite finally arrives in its natural home on mobile on Wednesday, and it’s bringing with it a few new neat bits and bobs. There’s a new battle pass called Galactic Ghost 094 that’s adding space-themed items to the game, the arrival of Mamoswine and Sylveon, and a new feature called Unite squads, making it…\nRead more...",
          "link": "https://kotaku.com/pokemon-unites-new-season-is-space-themed-will-bring-s-1847714763",
          "publishedOn": "2021-09-21T14:40:00.000Z",
          "wordCount": 539,
          "title": "Pokémon Unite's New Season Is Space-Themed, Will Bring Squad Features"
        },
        {
          "id": "1847714438",
          "author": "Sisi Jiang",
          "description": "Genshin Impact developer miHoYo has a uniquely generous policy toward fan artists, and its explicit endorsement on Genshin Impact merch has created an incredibly vibrant art community.\nRead more...",
          "link": "https://kotaku.com/genshin-impact-embraces-fan-creators-rather-than-suing-1847714438",
          "publishedOn": "2021-09-21T13:45:00.000Z",
          "wordCount": 1031,
          "title": "Genshin Impact Embraces Fan Creators, Rather Than Suing Them"
        },
        {
          "id": "1847712280",
          "author": "Ari Notis",
          "description": "If nothing else, you’ve gotta respect the bit. Billy Mitchell, the so-called “video game player of the century,” appears to have let ownership over his old website, perfectpacman.com, lapse some years ago. Now someone else has commandeered the domain, and is using it to publish a multipart investigation into the…\nRead more...",
          "link": "https://kotaku.com/billy-mitchell-s-old-website-now-debunks-his-controvers-1847712280",
          "publishedOn": "2021-09-21T13:15:00.000Z",
          "wordCount": 941,
          "title": "Billy Mitchell’s Old Website Now Debunks His Controversial Pac-Man High Scores"
        },
        {
          "id": "1847713780",
          "author": "Brian Ashcraft",
          "description": "Instagram and Pinterest are full of “neon Japan” photos. Video games constantly present Japan as a neon-lit futuristic city. But while neon or neon  lighting certainly still exists in Japan, especially Tokyo or Osaka, its prevalence is nowhere near where it was in decades past. \n\nRead more...",
          "link": "https://kotaku.com/neon-signs-have-been-vanishing-in-japan-for-years-1847713780",
          "publishedOn": "2021-09-21T11:30:00.000Z",
          "wordCount": 802,
          "title": "Neon Signs Have Been Vanishing In Japan For Years"
        },
        {
          "id": "1847713588",
          "author": "Brian Ashcraft",
          "description": "Last month, Sega announced that its Sega Ikebukuro Gigo arcade would be closing on September 20. Yesterday, fans gathered to say goodbye to the legendary game center at a ceremony Sega held to mark the end of its 28-year-run. \n\nRead more...",
          "link": "https://kotaku.com/fans-gather-to-say-goodbye-to-a-legendary-sega-arcade-1847713588",
          "publishedOn": "2021-09-21T09:30:00.000Z",
          "wordCount": 546,
          "title": "Fans Gather To Say Goodbye To A Legendary Sega Arcade"
        },
        {
          "id": "1847712534",
          "author": "Luke Plunkett",
          "description": "Crusader Kings II is a game with a long and proud tradition of “bugs that should be hung in the Louvre,” but I think this new one I’ve learned about today is my favourite.\n\nRead more...",
          "link": "https://kotaku.com/behold-my-new-favorite-crusader-kings-bug-1847712534",
          "publishedOn": "2021-09-21T01:30:00.000Z",
          "wordCount": 485,
          "title": "Behold, My New Favorite Crusader Kings Bug"
        },
        {
          "id": "1847712194",
          "author": "Luke Plunkett",
          "description": "Football is a game of inches, but it’s also a game of seconds, with clock management one of the most important skills in the game. That’s in the real world, anyway, where programming schedules and commercial breaks are a thing. In video games, as we’re about to find out, things can be different.\n\nRead more...",
          "link": "https://kotaku.com/the-quest-to-create-a-never-ending-play-in-madden-1847712194",
          "publishedOn": "2021-09-21T00:30:00.000Z",
          "wordCount": 396,
          "title": "The Quest To Create A Never-Ending Play In Madden"
        },
        {
          "id": "1847711923",
          "author": "Ian Walker",
          "description": "In early builds of the Xbox’s ToeJam & Earl III: Mission to Earth, the eponymous extra-terrestrials beat up a hooded member of the Ku Klux Klan as the final boss fight of the game. Previously we only had the developer’s word from an obscure interview, but now we can finally see it for ourselves thanks to the…\nRead more...",
          "link": "https://kotaku.com/toejam-earl-3s-original-final-boss-was-a-klansman-1847711923",
          "publishedOn": "2021-09-21T00:00:00.000Z",
          "wordCount": 733,
          "title": "ToeJam & Earl III's Original Final Boss Was A Klansman"
        },
        {
          "id": "1847711963",
          "author": "Luke Plunkett",
          "description": "Hello, and welcome to the year 2021, where fashion brand Balenciaga is selling hoodies on a dog in a video game, and you can buy the same hoodie in real life for $725.\nRead more...",
          "link": "https://kotaku.com/the-fortnite-x-balenciaga-collab-is-everything-the-game-1847711963",
          "publishedOn": "2021-09-20T23:30:00.000Z",
          "wordCount": 562,
          "title": "The Fortnite x Balenciaga Collab Is Everything The Game Deserves"
        },
        {
          "id": "1847710889",
          "author": "Zack Zwiezen",
          "description": "The U.S. Securities and Exchange Commission has reportedly launched a wide-reaching investigation into Activision Blizzard, with the government agency looking into how the embattled publisher handled the multiple allegations of sexual harassment, abuse, and toxic behavior that became public following a California…\nRead more...",
          "link": "https://kotaku.com/u-s-government-now-investigating-activision-blizzard-1847710889",
          "publishedOn": "2021-09-20T20:40:00.000Z",
          "wordCount": 787,
          "title": "U.S. Government Now Investigating Activision Blizzard, Bobby Kotick Subpoenaed"
        },
        {
          "id": "1847709985",
          "author": "Isaiah Colbert",
          "description": "Steam Next Fest, previously known as the Steam Game Festival, is a week-long event in which users can play demos and watch previews for upcoming games, chat with developers, and give feedback on new titles, is returning for another round this October. The demos will only be available to play during the week of the…\nRead more...",
          "link": "https://kotaku.com/heres-everything-you-can-play-during-steams-big-october-1847709985",
          "publishedOn": "2021-09-20T19:30:00.000Z",
          "wordCount": 855,
          "title": "Here's Everything You Can Play During Steam's Big October Event"
        },
        {
          "id": "1847709962",
          "author": "Jeremy Winslow",
          "description": "League of Legends players, particularly those who regularly leave their keyboards or an in-progress game, are about to get a harsh sentencing, as specified by an update headed to the popular MOBA.\n\nRead more...",
          "link": "https://kotaku.com/league-of-legends-will-now-discipline-afk-players-more-1847709962",
          "publishedOn": "2021-09-20T19:15:00.000Z",
          "wordCount": 610,
          "title": "League Of Legends Will Now Discipline AFK Players More Harshly"
        },
        {
          "id": "1847698124",
          "author": "Mike Pasquariello",
          "description": "It may not seem like it, but gaming is still in its infancy. Yes, we’re beaming games from $10,000 rigs through the cloud to our phones, and swinging around swords in room-scale wireless virtual reality. That’s some Ready Player One shit, for sure. But while the technology is progressing rapidly, the discourse…\nRead more...",
          "link": "https://kotaku.com/the-bioshock-problem-when-gameplay-and-narrative-clash-1847698124",
          "publishedOn": "2021-09-20T19:00:00.000Z",
          "wordCount": 844,
          "title": "The BioShock Problem: When Gameplay And Narrative Clash"
        },
        {
          "id": "1847709480",
          "author": "Ian Walker",
          "description": "Fighting games are tough even in the best of conditions, but what about competing in one during an earthquake?\n\nRead more...",
          "link": "https://kotaku.com/guilty-gear-player-wins-match-during-earthquake-1847709480",
          "publishedOn": "2021-09-20T18:45:00.000Z",
          "wordCount": 417,
          "title": "Guilty Gear Player Wins Match During Earthquake"
        }
      ]
    },
    {
      "title": "Nintendo Life | Latest Updates",
      "feedUrl": "https://www.nintendolife.com/feeds/latest",
      "siteUrl": "https://www.nintendolife.com/feeds/latest",
      "articles": [
        {
          "id": "https://www.nintendolife.com/#article-121236",
          "author": null,
          "description": "Existing players will be required to transfer their data.\nEarlier this week, The Pokémon Company revealed its new Pokémon Trading Card Game Live app for mobile and PC.\nOf course, it's raised a lot of questions about what's going on with the existing game, Pokémon TGC Online. TPC has now released an extensive FAQ about the older version's \"sunset\" process - explaining how this app will be removed and severs will be shut down \"shortly prior to the launch\" of the new game.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/pokemon_trading_card_game_online_sunset_faq_explains_shut_down_process",
          "publishedOn": "2021-09-22T05:00:00.000Z",
          "wordCount": 981,
          "title": "Pokémon Trading Card Game Online \"Sunset FAQ\" Explains Shut Down Process"
        },
        {
          "id": "https://www.nintendolife.com/#article-121235",
          "author": null,
          "description": "Was also credited for his work on FFXIV and much more.\nWe've got some sad news today if you're a fan of Xenoblade Chronicles 2. The voice of the character Bana, Stephen Critchlow, has passed away at the age of 54.\nCritchlow's colleagues at the production company, Big Finish, were the first to share this information. The British talent was credited for his work in theatre, television, radio, film and voice acting. Apart from the Xenoblade series, he contributed to games like Dragon Quest, World of Warcraft, Star Wars: The Old Republic, Fable 2, The Witcher 2, Inazuma and much more.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/xenoblade_chronicles_2_voice_actor_stephen_critchlow_passes_away_aged_54",
          "publishedOn": "2021-09-22T03:00:00.000Z",
          "wordCount": 949,
          "title": "Xenoblade Chronicles 2 Voice Actor Stephen Critchlow Passes Away, Aged 54"
        },
        {
          "id": "https://www.nintendolife.com/#article-121234",
          "author": null,
          "description": "Estimated release Q1, 2022.\nIt's now been over 20 years since Sega's RPG Skies of Arcadia made its original debut on the Dreamcast. It was followed by the GameCube version 2002 and since then fans have been hoping for more.\nWhile today's news might not be directly game-related, it's at least something. Pre-orders for the Skies of Arcadia Aika First 4 Figures statue are now on sale. There are two versions - a standard edition and an exclusive edition. Here's the full rundown:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/f4f_unveils_its_stunning_skies_of_arcadia_aika_statue_pre-orders_are_now_open",
          "publishedOn": "2021-09-22T02:00:00.000Z",
          "wordCount": 1082,
          "title": "F4F Unveils Its Stunning Skies Of Arcadia Aika Statue, Pre-Orders Are Now Open"
        },
        {
          "id": "https://www.nintendolife.com/#article-121233",
          "author": null,
          "description": "Releasing in stores October 8th.\n\nThe release of Nintendo's Switch OLED model is now just over a few weeks away, and the excitement for this ever-so-slightly improved system with a better and bigger screen, wider stand, and new dock is starting to ramp up.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/gallery_heres_another_look_at_nintendos_switch_oled_model_in_the_wild",
          "publishedOn": "2021-09-22T01:00:00.000Z",
          "wordCount": 2089,
          "title": "Gallery: Here's Another Look At Nintendo's Switch OLED Model \"In The Wild\""
        },
        {
          "id": "https://www.nintendolife.com/#article-121232",
          "author": null,
          "description": "Update: Available now on mobile devices.\nUpdate: Pokémon Unite is now available to download on mobile devices.\n\nAs you might have already seen, the MOBA Pokémon Unite arrives on mobile devices today. Ahead of its release, the game's producer Masaaki Hoshino has delivered a special message on the official site - thanking players for all of their feedback so far and also revealing what to expect in the latest update.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/pokemon_unite_producer_thanks_fans_for_feedback_and_details_latest_patch",
          "publishedOn": "2021-09-22T00:00:00.000Z",
          "wordCount": 1944,
          "title": "Pokémon Unite Producer Thanks Fans For Feedback And Details Latest Patch"
        },
        {
          "id": "https://www.nintendolife.com/#article-121230",
          "author": null,
          "description": "You younguns need to play more NES games.\nIs Chrono Trigger better than Burnout 3? According to IGN's audience, it is not. Also, Skyrim is better than Ocarina of Time, Breath of the Wild is better than Resident Evil 4 and Super Mario Bros. 3, Batman: Arkham City is better than Super Mario 64, Titanfall 2 is better than Animal Crossing: New Horizons, and Bloodborne is better than Tetris.\nIf you can feel your blood pressure rising, you're not alone — many of these match-ups were hard-fought and hard-won, but IGN's audience — which we're going to assume mostly consists of your hardcore FPS players, based on these results — knows what they like, and it certainly ain't Nintendo games.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/random_igns_best_video_game_of_all_time_tournament_is_getting_wild",
          "publishedOn": "2021-09-21T20:30:00.000Z",
          "wordCount": 5795,
          "title": "Random: IGN's 'Best Video Game Of All Time' Tournament Is Getting WILD"
        },
        {
          "id": "https://www.nintendolife.com/#article-121175",
          "author": null,
          "description": "All the DLC and major patches are now out.\nStory of Seasons: Pioneers of Olive Town was a bit of a mess at launch. Unlike its predecessor, the remake of Friends of Mineral Town for Switch, PoOT was just a bit lacklustre, with an empty world, zombie-like NPCs, and a crafting system so slow that you'd save time pressing coal into diamonds yourself with your bare hands. Add in the long loading screens, framerate issues, and a sprinkling of bugs, and it just wasn't a game I would recommend to people, farming fans or not.\nBut six months on, we're now on patch 1.0.8, and a lot of the more egregious issues have been either fixed or improved. With Story of Seasons: Pioneers of Olive Town free for a week on the Nintendo Switch Online service, you might be asking: is it good now? Or, at the very least, is it better now?\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/feature_should_i_play_story_of_seasons_pioneers_of_olive_town_now",
          "publishedOn": "2021-09-21T17:00:00.000Z",
          "wordCount": 4015,
          "title": "Feature: Should I Play Story Of Seasons: Pioneers Of Olive Town Now?"
        },
        {
          "id": "https://www.nintendolife.com/#article-121225",
          "author": null,
          "description": "Randomly announced in Dragon Ball Z: Kakarot launch trailer.\nTime sure flies, and the release of Dragon Ball Z: Kakarot + A New Power Awakens Set has rather crept up - it lands on Switch this week on 24th September. It's all set to be a definitive version of the game, with the Switch getting previous DLC episodes “A New Power Awakens Parts 1 and 2\" included in the pack (the name is a giveaway).\nAs you can see at the top of the page Bandai Namco has unleashed a launch trailer to get everyone in the mood this week, and it has some nice sequences and quite a lot of loud shouting at the start. Just put the volume down a notch before hitting play.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/dragon_ball_card_warriors_is_heading_to_switch_soon",
          "publishedOn": "2021-09-21T16:30:00.000Z",
          "wordCount": 1015,
          "title": "Dragon Ball Card Warriors Is Heading To Switch Soon"
        },
        {
          "id": "https://www.nintendolife.com/#article-121224",
          "author": null,
          "description": "Along with Cotton 100% and Cotton Guardian Force Saturn Tribute.\n\nEarlier this year we had a Western release of Cotton Reboot!, which took a well regarded but niche arcade shoot 'em up title - or more accurately the best port of the arcade - and introduced it to a wider audience. It's pretty darn good, too.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/more_cotton_games_are_coming_including_the_extremely_rare_panorama_cotton",
          "publishedOn": "2021-09-21T16:00:00.000Z",
          "wordCount": 1562,
          "title": "More Cotton Games Are Coming, Including The Extremely Rare Panorama Cotton"
        },
        {
          "id": "https://www.nintendolife.com/#article-121215",
          "author": null,
          "description": "Supporting cross-platform play with Switch.\nAs had been previously promised, Pokémon Unite is set to launch on mobile devices tomorrow with cross-platform play supported. A brand new trailer has been released to celebrate the occasion, also showing off some new Holowear for Gengar and Garchomp, which you can check out up above.\nIf you're keen on jumping into the action the moment the app goes live, you can go ahead and pre-register on the App Store and Google Play right now.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/pokemon_unite_launches_on_mobile_tomorrow_alongside_a_new_balance_patch",
          "publishedOn": "2021-09-21T14:00:00.000Z",
          "wordCount": 1469,
          "title": "Pokémon Unite Launches On Mobile Tomorrow Alongside A New Balance Patch"
        },
        {
          "id": "https://www.nintendolife.com/#article-121040",
          "author": null,
          "description": "Brake drag.\nIn order to very quickly condense exactly what kind of motorcycle sim RiMS Racing is, consider this: There are over 500 fully licenced vehicle parts in this game and just eight actual bikes. This isn't a sleight on Raceward Studio's game, far from it, the eight bikes here are very obviously authentically detailed and lovingly crafted, it's just more of a pointer as to what kind of experience you should be expecting once you dive in here.\nRiMS Racing is all about providing an almost staggeringly in-depth take on the maintenance, fine-tuning and constant upgrading and care that's just as much part and parcel of real-life motorsports as blasting down the track doing wheelies for the fans. If you're looking for a game that lets you investigate and change every aspect of the machine you're riding — one that constantly requires you to get under the hood and tinker — this is the one for you. Or at least it would be, if this Switch port wasn't so disappointingly rough.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/reviews/nintendo-switch/rims_racing",
          "publishedOn": "2021-09-21T13:15:00.000Z",
          "wordCount": 2343,
          "title": "Review: RiMS Racing - A Poor Switch Port Makes For An Uneasy Rider"
        },
        {
          "id": "https://www.nintendolife.com/#article-121212",
          "author": null,
          "description": "More than 300 games included.\nNintendo of Europe has annoucned a mighty Blockbuster Sale for Nintendo Switch, which will discount lots of popular games by as much as 75%.\n\"Hundreds\" of games are set to be included when the sale goes live on the eShop on Thursday, 23rd September. It'll kick off at 3pm CEST on that day and will run until Sundar 3rd October at 23:59 your local time.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/nintendo_blockbuster_sale_discounts_hundreds_of_switch_games_europe",
          "publishedOn": "2021-09-21T13:10:00.000Z",
          "wordCount": 3699,
          "title": "Nintendo 'Blockbuster' Sale Discounts Hundreds Of Switch Games (Europe)"
        },
        {
          "id": "https://www.nintendolife.com/#article-121209",
          "author": null,
          "description": "Playtonic Friends unveils its latest signing.\nPlaytonic Friends - the publishing arm of the rather popular Yooka-Laylee team - is making early waves as it supports and releases smaller Indie games. It's now confirmed its next partnership, teaming up with development newcomers MegaWobble to bring Lil Gator Game to Switch and PC in early 2022.\nAs you can see in the trailer above it's a very cute and wholesome game, seemingly with the Lil Gator's objective being to lure an older sibling back into play full of fantasy and imagination. There are some familiar and fun mechanics on show too, and it's an adventure where the focus is on exploration and experimentation.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/lil_gator_game_is_an_adorable_adventure_waddling_onto_switch",
          "publishedOn": "2021-09-21T13:00:00.000Z",
          "wordCount": 1247,
          "title": "Lil Gator Game Is An Adorable Adventure Waddling Onto Switch"
        },
        {
          "id": "https://www.nintendolife.com/#article-121200",
          "author": null,
          "description": "The Thumby is about as niche as it gets.\n\nNew mods and takes on classic hardware are a fun part of the gaming scene, as those with nostalgia for the good old days mess around with old systems to make them better or - sometimes - just sillier. A little while ago we shared the creation of a wide Game Boy Advance by YouTube channel / website The Retro Future, and now the same channel has brought our attention to a project that is pretty much the opposite.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/random_this_tiny_game_boy_is_probably_the_worlds_smallest_game_console",
          "publishedOn": "2021-09-21T12:30:00.000Z",
          "wordCount": 1812,
          "title": "Random: This Tiny Game Boy Is Probably The World's Smallest Game Console"
        },
        {
          "id": "https://www.nintendolife.com/#article-121198",
          "author": null,
          "description": "A family-friendly adventure RPG.\nSkybound Games and Manavoid Entertainment have announced that Rainbow Billy: The Curse of the Leviathan, a family-friendly RPG, will be launching on Switch \"soon\".\nThe game will be released on other platforms next month, and while Switch owners will have to be a little more patient, it looks like it could well be worth the wait. Rainbow Billy is described as a \"wholesome\" and \"accessible\" 2.5D adventure platformer that – judging by the new trailer above – comes complete with colourful, cosy vibes.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/rainbow_billy_the_curse_of_the_leviathan_brings_wholesome_rpg_vibes_to_switch_soon",
          "publishedOn": "2021-09-21T12:00:00.000Z",
          "wordCount": 1104,
          "title": "Rainbow Billy: The Curse Of The Leviathan Brings Wholesome RPG Vibes To Switch Soon"
        },
        {
          "id": "https://www.nintendolife.com/#article-121193",
          "author": null,
          "description": "They might be stinky giants.\nHeartbeat Interactive's Doom & Destiny Worlds, an open-world, turn-based RPG that sees players build, farm and craft in up to four player local co-op, will release on Switch on 1st October. If that title seems familiar to you, you might be thinking of Doom & Destiny or Doom & Destiny Advanced, both previous titles in the series. Or maybe you've got DOOM or Destiny on the brain, two totally unrelated but rather successful video games you'll definitely have heard of.\nAs you can see from the trailer above, D&DW features some 60 hand-crafted islands with players assuming the roles of amnesiac-afflicted adventurers stranded on an unknown planet. Cue working together to gather up resources, customise your party and work towards unravelling the mystery of Doom & Destiny's three worlds.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/doom_and_destiny_worlds_brings_farting_giants_to_switch_this_october",
          "publishedOn": "2021-09-21T11:00:00.000Z",
          "wordCount": 1060,
          "title": "'Doom & Destiny Worlds' Brings Farting Giants To Switch This October"
        },
        {
          "id": "https://www.nintendolife.com/#article-121195",
          "author": null,
          "description": "Hopefully a Switch version is on the cards.\nFreedom Planet made quite an impact back in 2014, then gracing the Wii U a year later and reminding us of the delights of 16-bit action platformers, particularly on the ol' SEGA Mega Drive / Genesis. It drew comparisons to Sonic games, especially as the project kicked off in part as a fan game, but also established its own style.\nDeveloper GalaxyTrail, started by Sabrina DiDuro and now consisting of a small but committed international team, has been taking its time working on Freedom Planet 2. On the studio's website DiDuro says the following about the goals for the project.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/freedom_planet_2_gets_updated_trailer_hits_steam_in_spring_2022",
          "publishedOn": "2021-09-21T10:00:00.000Z",
          "wordCount": 1817,
          "title": "Freedom Planet 2 Gets Updated Trailer, Hits Steam In Spring 2022"
        },
        {
          "id": "https://www.nintendolife.com/#article-121194",
          "author": null,
          "description": "\"Thank you for your patience\".\nEarlier this month, Inkay and its evolution Malamar were introduced into Pokémon GO for the first time and in a nice touch, the Pokémon's quirky evolution method seen in the mainline games has been carried over, too. Unfortunately, though, the evolution is impossible to pull off for some players, causing Niantic to announce an upcoming fix.\nAs series veterans will know, evolving Inkay involves levelling up the Pokémon and flipping your console upside down; the gyro tech inside the console recognises the system's new placement, allowing the evolution to take place.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/pokemon_go_will_receive_a_fix_for_players_unable_to_evolve_inkay",
          "publishedOn": "2021-09-21T09:30:00.000Z",
          "wordCount": 1108,
          "title": "Pokémon GO Will Receive A Fix For Players Unable To Evolve Inkay"
        },
        {
          "id": "https://www.nintendolife.com/#article-121189",
          "author": null,
          "description": "But Deathloop takes the spoils.\nUK physical chart data is now in for the week ending 18th September, revealing that four Nintendo titles made it into the top ten this week.\nLast week's number one WarioWare: Get It Together! has managed to hold firm in the top ten, falling down to eighth place in its second week on sale, while evergreen stars Mario Kart 8 Deluxe, Minecraft and Animal Crossing: New Horizons continue to shine.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/uk_charts_cruisn_blast_just_sneaks_into_top_40_warioware_stays_in_top_ten",
          "publishedOn": "2021-09-21T09:00:00.000Z",
          "wordCount": 3086,
          "title": "UK Charts: Cruis'n Blast Just Sneaks Into Top 40, WarioWare Stays In Top Ten"
        },
        {
          "id": "https://www.nintendolife.com/#article-121188",
          "author": null,
          "description": "HexaDrive has worked on Wind Waker HD in the past.\nWhile Dragon Quest XII: The Flames of Fate doesn't have any confirmed platforms as yet, we do know who'll be doing the heavy lifting on the Unreal Engine 5-based JRPG.\nJapanese studio HexaDrive is involved (thanks, Push Square), and is a company with which Square Enix fans should be familiar – it also assisted on Final Fantasy XV. Nintendo fans might best know it thanks to the company's involvement with The Legend of Zelda: The Wind Waker HD for the Wii U.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/dragon_quest_xii_is_being_co-developed_by_square_enix_hexadrive_and_orca",
          "publishedOn": "2021-09-21T08:30:00.000Z",
          "wordCount": 1299,
          "title": "Dragon Quest XII Is Being Co-Developed By Square Enix, HexaDrive And Orca"
        },
        {
          "id": "https://www.nintendolife.com/#article-104875",
          "author": null,
          "description": "Update: Launches September 28th!\nUpdate: Antonball Deluxe now has a release date. The game will launch on September 28th, 2021, with Proponent Games handling the publishing duties.\nYou can view the Nintendo Switch launch trailer above.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/antonball_deluxe_is_what_would_happen_if_breakout_and_mario_bros_had_a_baby",
          "publishedOn": "2021-09-21T08:15:00.000Z",
          "wordCount": 850,
          "title": "Antonball Deluxe Is What Would Happen If Breakout And Mario Bros. Had A Baby"
        },
        {
          "id": "https://www.nintendolife.com/#article-121186",
          "author": null,
          "description": "Is Bandai Namco working on remasters?\nBack in September 2019, word spread about the possibility of the classic Namco character Klonoa returning, after Bandai Namco filed some trademarks in Japan.\nFast forward to September 2021, and the Japanese company has now gone and filed some new trademarks for \"Waffuu Encore\" and \"1&2 Encore\" in the same location. The word \"encore\" is what Bamco has been subtitling remasters of games (e.g. Katamari Damacy 'Encore' instead of 'Reroll' ) in Japan, in recent times.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/klonoa_encore_trademarks_surface_online_in_japan",
          "publishedOn": "2021-09-21T05:55:00.000Z",
          "wordCount": 1553,
          "title": "Klonoa \"Encore\" Trademarks Surface Online In Japan"
        },
        {
          "id": "https://www.nintendolife.com/#article-121184",
          "author": null,
          "description": "The same creator behind Deadly Premonition.\nIt's official - the upcoming \"small-town detective thriller\" The Good Life will arrive on Nintendo Switch and all other platforms next month on October 15th.\nThe game, in case you missed it, is from Hidetaka \"Swery\" Suehiro's company White Owls (along with Grounding Inc. and Playism). Swery is perhaps best-known in recent times for the Deadly Premonition series, which has developed a bit of a cult following.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/swerys_small-town_detective_thriller_the_good_life_launches_next_month",
          "publishedOn": "2021-09-21T03:45:00.000Z",
          "wordCount": 1023,
          "title": "Swery's \"Small-Town Detective Thriller\" The Good Life Launches Next Month"
        },
        {
          "id": "https://www.nintendolife.com/#article-121183",
          "author": null,
          "description": "Sonic's co-creator thinks it might be a \"scam\".\nA copy of the original Sonic the Hedgehog game for Sega Genesis has been sold for a record-breaking sale price of $430,500 USD. This isn't just a new record for this Sonic game, either - it also makes it an \"all-time\" record sale for any Genesis title.\nThis graded game has been 'WATA Certified'. As you might recall, WATA is one of the grading companies that has been previously under fire for allegedly manipulating the retro video game market. Just recently, for example, the co-founder was accused of selling the company's games under a different alias on eBay.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/wata_certified_copy_of_sonic_the_hedgehog_sells_for_record_price",
          "publishedOn": "2021-09-21T02:30:00.000Z",
          "wordCount": 4557,
          "title": "'WATA Certified' Copy Of Sonic The Hedgehog Sells For Record Price"
        },
        {
          "id": "https://www.nintendolife.com/#article-121182",
          "author": null,
          "description": "Anime, concerts and more to come!\n\nThe Persona series is currently celebrating its 25th anniversary, and as you might recall, Atlus has teased seven projects.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/atlus_reveals_new_details_about_personas_25th_anniversary_celebrations",
          "publishedOn": "2021-09-21T01:00:00.000Z",
          "wordCount": 3269,
          "title": "Atlus Reveals New Details About Persona's 25th Anniversary Celebrations"
        }
      ]
    },
    {
      "title": "Rock Paper Shotgun Latest Articles Feed",
      "feedUrl": "https://www.rockpapershotgun.com/feed",
      "siteUrl": "https://www.rockpapershotgun.com/feed",
      "articles": [
        {
          "id": "https://www.rockpapershotgun.com/heros-hour-is-a-strategy-rpg-with-huge-automatic-battles",
          "author": "Graham Smith",
          "description": "I spend roughly 90% of my free time watching what the YouTube algorithm offers me. I've not been radicalised yet, although I do now refer to any shopping I buy as a \"haul\" and end all my conversations by thanking Skillshare. \r\n\nTo my surprise, the algorithm has recently started throwing indie games my way. Hero's Hour is among the most interesting it's shown me: a strategy RPG in which you construct armies of pixelated fantasy beasts who then have automated battles.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/heros-hour-is-a-strategy-rpg-with-huge-automatic-battles",
          "publishedOn": "2021-09-21T22:25:50.000Z",
          "wordCount": 791,
          "title": "Hero's Hour is a strategy RPG with huge automatic battles"
        },
        {
          "id": "https://www.rockpapershotgun.com/phoenix-points-corrupted-horizons-will-open-up-on-october-1st",
          "author": "Graham Smith",
          "description": "Phoenix Point's fourth DLC is due on October 1st. Corrupted Horizons adds a new corruption mechanic which can sap the will of your squad, as well as new Mutoid soldiers, pictured above. The Mutoids are immune to corruption, can learn any class's skills, but are unable to heal.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/phoenix-points-corrupted-horizons-will-open-up-on-october-1st",
          "publishedOn": "2021-09-21T21:26:27.000Z",
          "wordCount": 753,
          "title": "Phoenix Point's Corrupted Horizons will open up on October 1st"
        },
        {
          "id": "https://www.rockpapershotgun.com/death-of-the-reprobate-will-complete-a-point-and-click-triptych",
          "author": "Graham Smith",
          "description": "I feel as if the header image successfully conveys the appeal of Joe Richardson's work. He makes point-and-click adventures which take real Renaissance paintings, animate them in cut-out style (think Monty Python), and juxtapose them with modern vernacular.\r\n\nHis next game was announced today. It's called Death Of The Reprobate, and there's a trailer showing both pointing and clicking below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/death-of-the-reprobate-will-complete-a-point-and-click-triptych",
          "publishedOn": "2021-09-21T21:01:59.000Z",
          "wordCount": 746,
          "title": "Death Of The Reprobate will complete a point and click triptych"
        },
        {
          "id": "https://www.rockpapershotgun.com/you-can-once-again-check-whether-your-pc-will-run-windows-11",
          "author": "Graham Smith",
          "description": "Microsoft have put their PC Health Check app back online. The simple tool is designed to tell you whether Windows 11 is compatible with your computer, but it was pulled offline back in June when it kept telling people with modern PCs that they couldn't run the new operating system, with little information as to why not. It's more recently been available to members of the Windows Insider program, but it's back now for all.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/you-can-once-again-check-whether-your-pc-will-run-windows-11",
          "publishedOn": "2021-09-21T20:24:45.000Z",
          "wordCount": 784,
          "title": "You can once again check whether your PC will run Windows 11"
        },
        {
          "id": "https://www.rockpapershotgun.com/neo-the-world-ends-with-you-comes-to-you-on-pc-next-week",
          "author": "Alice O'Connor",
          "description": "Following its debut on PlayStation 4 and Switch in July, Square Enix plan to bring Neo: The World Ends With You over to PC on the 28th of September. That's next Tuesday, day dudes. It's the sequel to an RPG from the Nintendo DS in 2007, set inside a colourful and weird version of Tokyo where young'uns get drawn into a deadly game.\nRead more",
          "link": "https://www.rockpapershotgun.com/neo-the-world-ends-with-you-comes-to-you-on-pc-next-week",
          "publishedOn": "2021-09-21T17:07:49.000Z",
          "wordCount": 726,
          "title": "Neo: The World Ends With You comes to you on PC next week"
        },
        {
          "id": "https://www.rockpapershotgun.com/pc-gaming-weekspot-podcast-054-deathloop-kena",
          "author": "Colm Ahern",
          "description": "After getting a taste last week, both myself and Matthew have spent the last few days in Blackreef. We've been enjoying doing the same things over and over. Yeah, Deathloop is pretty good.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/pc-gaming-weekspot-podcast-054-deathloop-kena",
          "publishedOn": "2021-09-21T16:00:00.000Z",
          "wordCount": 796,
          "title": "The Weekspot podcast #054: bridge of spies"
        },
        {
          "id": "https://www.rockpapershotgun.com/halo-infinite-will-have-back-to-back-tech-previews-this-weekend-and-next",
          "author": "Imogen Beckhelling",
          "description": "If you're not too busy Deathlooping, Kena: Bridge Of Spiriting, or Diablo 2: Resurrecting this weekend, perhaps you'll have a spare moment to drop into Halo Infinite's next technical preview. Between Thursday and Sunday, players registered as a Halo Insider will have a chance to try out the sci-fi FPS's 4v4 Arena mode. But that's not all! 343 have announced that the following weekend, Insiders can jump into another tech test, and have a crack at the game's 12v12 Big Team Battle mode too.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/halo-infinite-will-have-back-to-back-tech-previews-this-weekend-and-next",
          "publishedOn": "2021-09-21T15:54:31.000Z",
          "wordCount": 1057,
          "title": "Halo Infinite will have back-to-back tech previews this weekend and next"
        },
        {
          "id": "https://www.rockpapershotgun.com/call-of-duty-vanguards-open-beta-feels-like-modern-warfare-with-a-lick-of-ww2-paint",
          "author": "Ed Thorn",
          "description": "Call Of Duty: Vanguard's multiplayer feels familiar, have I been here before? Yes, in the past, but also in the future. Despite its World War II setting, Vanguard's open beta has me thinking back to the days of Call Of Duty: Modern Warfare. Having played a sizable chunk of it now, I'm not kidding when I say that it's like the Modern Warfare lot LARPING on a WWII set. For some this will be good. For others this will be bad. For me? It needs Warzone.\nRead more",
          "link": "https://www.rockpapershotgun.com/call-of-duty-vanguards-open-beta-feels-like-modern-warfare-with-a-lick-of-ww2-paint",
          "publishedOn": "2021-09-21T15:30:00.000Z",
          "wordCount": 1518,
          "title": "Call Of Duty: Vanguard's open beta feels like Modern Warfare with a lick of WW2 paint"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-crossbow-loadout-warzone",
          "author": "Kevin Foley",
          "description": "Looking for the best Crossbow loadout to bring into Warzone? It's certainly a unique option to consider in a game all about firearms and high tech weaponry. Still there's fun to be had when wielding this modern take on a medieval weapon, and it's more than capable of one-shotting enemies if you have the skills to wield it. Just don't take the Crossbow into Warzone with the expectation of dominating. It's a novelty at best, and you should be using the best guns in Warzone if your goal is to win.  \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/best-crossbow-loadout-warzone",
          "publishedOn": "2021-09-21T15:07:11.000Z",
          "wordCount": 985,
          "title": "Best Crossbow loadout in Warzone Season 5"
        },
        {
          "id": "https://www.rockpapershotgun.com/jackbox-party-pack-8-arriving-in-time-to-spook-your-halloween-party",
          "author": "Alice O'Connor",
          "description": "You've got a checklist for Halloween: peeled grapes (eyeballs); cold spaghetti (worms); 12-foot skeleton (skeleton); 25 metre bolt of black cotton (costume). But wait, what will people play? Friendo, you're in lucko. Jackbox Games have announced that The Jackbox Party Pack 8, their latest collection of funny party games, will launch on October 14th. It'll pack five games, from murder mystery to a new version of fan-favourite Drawful, this time having players animate their drawings.\nRead more",
          "link": "https://www.rockpapershotgun.com/jackbox-party-pack-8-arriving-in-time-to-spook-your-halloween-party",
          "publishedOn": "2021-09-21T15:04:54.000Z",
          "wordCount": 854,
          "title": "Jackbox Party Pack 8 arriving in time to spook your Halloween party"
        },
        {
          "id": "https://www.rockpapershotgun.com/rogue-lords-is-a-devilishly-fun-roguelike-where-cheating-is-considered-a-virtue",
          "author": "Imogen Beckhelling",
          "description": "Everything about Rogue Lords is very Halloween-y. It's an upcoming gothic roguelike in which you, the devil, send disciples out into the world to wage war with demon hunters and cause general mischief in the mortal world. Having played a bit myself, I already feel the need to start carving pumpkins and hanging up fake cobwebs around my house. It reminds me of all the spooky animated films you see on the telly throughout October, which makes sense because the developers at Cyanide and Leikir Studios tell me the game's art style is partially inspired by Tim Burton films.\nRead more",
          "link": "https://www.rockpapershotgun.com/rogue-lords-is-a-devilishly-fun-roguelike-where-cheating-is-considered-a-virtue",
          "publishedOn": "2021-09-21T15:00:00.000Z",
          "wordCount": 1771,
          "title": "Rogue Lords is a devilishly fun roguelike where cheating is considered a virtue"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-how-to-make-a-book",
          "author": "Hayden Hefford",
          "description": "Want to know how to make a Book in Minecraft? Books are very important, as you will need them to enchant your armour and weapons with various effects. You can also make pretty bookshelves to spruce up your home, if you aren’t interested in becoming an all-powerful wizard.\nThis guide will walk you through everything that you need to know to make a Book in Minecraft, including how to get Paper and Leather, which you will need.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-how-to-make-a-book",
          "publishedOn": "2021-09-21T14:39:27.000Z",
          "wordCount": 1385,
          "title": "How to make a Book in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-genshin-impact-sangonomiya-kokomi-build",
          "author": "Rebecca Jones",
          "description": "Want to learn how to create the best build for Sangonomiya Kokomi in Genshin Impact? Kokomi has been present in Genshin Impact since August's V2.0 update as an NPC, but a playable version of the character is now available as part of the Drifting Luminescence event (running from September 21st to October 12th).\n Read more",
          "link": "https://www.rockpapershotgun.com/best-genshin-impact-sangonomiya-kokomi-build",
          "publishedOn": "2021-09-21T14:17:21.000Z",
          "wordCount": 1980,
          "title": "The best Genshin Impact Sangonomiya Kokomi build"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-bosses-boss-fights",
          "author": "Ollie Toms",
          "description": "Want to learn about all the boss fights in Kena: Bridge Of Spirits? There is a grand total of 16 boss fights (that is, fights with big boss health bars at the top) in Kena: Bridge Of Spirits - and like everything else in Ember Lab's marvellous action-adventure game, each one offers some true spectacle. If you're looking for a list of all the boss fights and some advice on how to beat each one, you've come to the right place.\nKeep scrolling to check out all 16 bosses in Kena: Bridge Of Spirits, presented in the order you'll face them.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-bosses-boss-fights",
          "publishedOn": "2021-09-21T13:42:37.000Z",
          "wordCount": 2755,
          "title": "Kena: Bridge Of Spirits bosses and how to beat them"
        },
        {
          "id": "https://www.rockpapershotgun.com/activision-blizzard-are-now-being-investigated-by-the-us-government",
          "author": "Imogen Beckhelling",
          "description": "The US government's Securities and Exchange Commission (SEC) are investigating Activision Blizzard over the company's handling of sexual misconduct and harassment allegations. This comes just two months after the Call Of Duty publishers were sued by a State department for alleged workplace harassment, discrimination, and retaliation. Now, The SEC have subpoenaed a number of high-level executives, reportedly including CEO Bobby Kotick, and have requested internal documents relating to the allegations. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/activision-blizzard-are-now-being-investigated-by-the-us-government",
          "publishedOn": "2021-09-21T12:59:42.000Z",
          "wordCount": 933,
          "title": "Activision Blizzard are now being investigated by the US government"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-fishing-shrine",
          "author": "Ollie Toms",
          "description": "Wondering how to restore the Fishing Shrine in Kena: Bridge Of Spirits? Each of the other Shrines in the Forgotten Forest of Kena: Bridge Of Spirits are guarded by enemies, but the Fishing Shrine is guarded by a puzzle. And at first glance this puzzle may be a confusing one, because you may not even realise that a puzzle needs to be solved.\nFollow the steps below to learn how to restore the Fishing Shrine in Kena: Bridge Of Spirits!\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-fishing-shrine",
          "publishedOn": "2021-09-21T11:01:29.000Z",
          "wordCount": 1041,
          "title": "How to restore the Fishing Shrine in Kena: Bridge Of Spirits"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-invasion-is-a-zero-sum-mind-game-i-cant-stop-playing",
          "author": "Jeremy Peel",
          "description": "As I pass the eroding façade of a fisherman’s hut, a beret-topped goon strides by in the opposite direction, casually swinging a machete. They’d be conspicuous were it not for the fact that there are no fishermen in this village anymore. If anyone were to bother putting up a welcome sign, it’d read ‘Population: Goons’. They like me, though. This thug’s two-tone mask might be impassive, but the voice beneath it betrays starstruck awe. “Julianna,” they say. “It’s an honour, really.”\n“Shut the fuck up,” I hiss under my breath. “I’m in disguise. If the player hears you, we’re both mince. And thanks.”\nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-invasion-is-a-zero-sum-mind-game-i-cant-stop-playing",
          "publishedOn": "2021-09-21T11:00:00.000Z",
          "wordCount": 1541,
          "title": "Deathloop invasion is a zero-sum mind game I can't stop playing"
        },
        {
          "id": "https://www.rockpapershotgun.com/de-exit-is-about-a-voxel-skeleton-investigating-spooky-goo-in-the-afterlife",
          "author": "Imogen Beckhelling",
          "description": "De-Exit is an upcoming voxel puzzle platformer where you play as a skeleton person investigating strange happenings in the afterlife. You died and landed yourself in the in-between part, not quite heaven and not quite hell, but it's clear that something is a bit wrong. You'll need to explore ruins, collect artifacts and figure out why spooky goo is trying to engulf parts of the world. It's a bit Zelda-y and a bit Tomb Raider-y, but if both those games were filled with cubes.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/de-exit-is-about-a-voxel-skeleton-investigating-spooky-goo-in-the-afterlife",
          "publishedOn": "2021-09-21T10:20:00.000Z",
          "wordCount": 919,
          "title": "De-Exit is about a voxel skeleton investigating spooky goo in the afterlife"
        },
        {
          "id": "https://www.rockpapershotgun.com/scarf-is-a-journey-like-puzzle-platformer-with-a-magic-dragon-scarf",
          "author": "Imogen Beckhelling",
          "description": "Do you ever see something in a game and think, \"Man, I wish that was real\"? And I don't mean magic or spaceships because obviously those are great, but a specific item that would just be so cool to have. I want the scarf from Scarf, an upcoming puzzle platformer about a little blue dude trying to get home. This character has a firey red scarf that does dragon things! When you double jump, it turns into little dragon wings! 10/10 winter wear. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/scarf-is-a-journey-like-puzzle-platformer-with-a-magic-dragon-scarf",
          "publishedOn": "2021-09-21T10:05:00.000Z",
          "wordCount": 843,
          "title": "Scarf is a Journey-like puzzle platformer with a magic dragon scarf"
        },
        {
          "id": "https://www.rockpapershotgun.com/endling-is-a-game-about-a-mama-fox-protecting-her-cubs-in-a-human-ravaged-world",
          "author": "Imogen Beckhelling",
          "description": "Endling is going to break my heart. It's a game about a mama fox trying to look after her pups in an unpleasant future where forests are being destroyed, pollution is rife and these poor animals have been hunted to near-extinction. It's sad, because it really doesn't seem to distant a future from real life, but that's kind of the point. Endling looks gorgeous and poignant, the sort of game that seems important to play, even if it does break my heart.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/endling-is-a-game-about-a-mama-fox-protecting-her-cubs-in-a-human-ravaged-world",
          "publishedOn": "2021-09-21T09:53:31.000Z",
          "wordCount": 1102,
          "title": "Endling is a game about a mama fox protecting her cubs in a human-ravaged world"
        },
        {
          "id": "https://www.rockpapershotgun.com/older-xbox-wireless-controllers-are-getting-quick-switching-between-devices",
          "author": "James Archer",
          "description": "One of the cool things about the official Xbox Series X/S wireless controllers – if we’re using a dramatically expanded definition of the word “cool” – is that they can pair to both the console and a Bluetooth-enabled PC or laptop, then switch between both sources with a double-tap or hold of the pairing button. In what could be good news for owners of older, Xbox One-era wireless controllers, Microsoft are now rolling out a firmware update that brings this same quick-switch functionality to the more aged pads.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/older-xbox-wireless-controllers-are-getting-quick-switching-between-devices",
          "publishedOn": "2021-09-21T09:41:52.000Z",
          "wordCount": 995,
          "title": "Older Xbox wireless controllers are getting quick-switching between devices"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-map-collectible-locations",
          "author": "Ollie Toms",
          "description": "Looking for a map of Kena: Bridge Of Spirits which shows the locations of all collectibles and hidden areas? Well, you're in luck, because I've spent a painstaking number of hours hundred-percenting Ember Lab's marvellous story-driven action-adventure game, and during my travels I jotted down the exact locations of every single Rot, Hat, Flower Shrine, Meditation Spot, Cursed Chest, and Spirit Mail in the game.\nBelow you'll find ten maps of various areas in Kena: Bridge Of Spirits, annotated with the locations of every single collectible and hidden area in the game, so you can have a far easier time hunting down those pesky remaining achievements. Take a look!\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-map-collectible-locations",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1702,
          "title": "Kena: Bridge Of Spirits map of all collectibles"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-long-is-kena-bridge-of-spirits",
          "author": "Ollie Toms",
          "description": "Wondering how long it'll take you to complete Kena: Bridge Of Spirits? It's a question that's preyed on the minds of many a prospective player since Ember Lab, the developers of this outrageously gorgeous new action-adventure game, previously stated in a tweet that \"you should be able to finish the game over a weekend\".\nBut a weekend of gaming means different things to different people. Does it mean you can blitz through Kena: Bridge Of Spirits in only a few hours, or will it take a solid 20 hours to complete? And does this take into account the many side activities and collectibles, or were Ember Lab simply talking about how quickly you can rush through the main story? Find out exactly how long it takes to complete Kena: Bridge Of Spirits below.\nRead more",
          "link": "https://www.rockpapershotgun.com/how-long-is-kena-bridge-of-spirits",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1042,
          "title": "How long is Kena: Bridge Of Spirits?"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-difficulty-levels",
          "author": "Ollie Toms",
          "description": "Want to know how to change the difficulty level in Kena: Bridge Of Spirits? Or perhaps you simply want to figure out which difficulty is right for you before you get stuck into playing? Kena: Bridge Of Spirits offers a choice of four different difficulty levels which change the game up in various ways to make Kena's journey safer or more perilous, depending on which you choose. Keep reading to find out how to change the difficulty level before and during a playthrough, and what each of the difficulty levels change about the game.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-difficulty-levels",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1133,
          "title": "Kena: Bridge Of Spirits difficulty levels"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-bow",
          "author": "Ollie Toms",
          "description": "Wondering how to unlock the bow in Kena: Bridge Of Spirits? The bow is an extremely useful part of Kena's toolkit, not only as a powerful weapon but also as a traversal tool, as it can be used as a grappling hook when fired at particular blue flowers dotted about the landscape of Kena: Bridge Of Spirits. Read on to find out where, when, and how to unlock the bow so you can get it as quickly as possible.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-bow",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1083,
          "title": "How to unlock the Bow in Kena: Bridge Of Spirits"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-abilities-upgrades-skill-tree",
          "author": "Ollie Toms",
          "description": "Want to learn more about Kena's abilities and upgrades in Kena: Bridge Of Spirits? Early on in Ember Lab's story-driven action-adventure game, you'll learn more about how you can use Karma to upgrade your abilities. Each of these abilities are well worth getting, but some are definitely worth prioritising over others, because they'll help you make quick work of nearly any enemy with some practice.\nBelow we'll walk you through every ability and upgrade in Kena: Bridge Of Spirits and what each one does, along with how to unlock abilities, how to gain Karma, and how to increase your Rot Level to make use of these new abilities.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-abilities-upgrades-skill-tree",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 2027,
          "title": "Kena: Bridge Of Spirits abilities and upgrades"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-spirit-mail-locations",
          "author": "Ollie Toms",
          "description": "Looking for all the Spirit Mail in Kena: Bridge Of Spirits? One of several different types of collectible in Ember Lab's story-focused action-adventure game, Spirit Mail can be collected and delivered back to certain houses in the central Village in order to unlock new areas and gain rewards. But finding them is often far easier said than done, and these puzzles don't get easier just by changing the difficulty level.\nBelow we'll walk you through where to find all 10 Spirit Mail locations in Kena: Bridge Of Spirits, so you can get to work purifying the land of the corruption which has spread across it before you arrived. After you've collected each Spirit Mail you can then see on the map the house in the Village to which it must be delivered.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-spirit-mail-locations",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1969,
          "title": "Kena: Bridge Of Spirits Spirit Mail locations"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-hay-piles",
          "author": "Ollie Toms",
          "description": "Wondering what to do with Hay Piles in Kena: Bridge Of Spirits? You'll find Hay Piles scattered about various areas of the Kena: Bridge Of Spirits map, and it's very unclear at first glance what you're meant to do about them. And it is important that you do something, because sometimes these Hay Piles must be cleared in order to reveal something valuable inside, such as a Rot to add to your growing army of adorable spirits.\nLearn how to destroy Hay Piles in Kena: Bridge Of Spirits below!\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-hay-piles",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1002,
          "title": "How to destroy Hay Piles in Kena: Bridge Of Spirits"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-achievements",
          "author": "Ollie Toms",
          "description": "Looking for a full list of all Kena: Bridge Of Spirits achievements? There is a grand total of 41 achievements to collect in Ember Lab's beautiful and incredibly enjoyable action-adventure title, and they run the gamut in challenge. Some require you to simply play through the story, so you'll unlock them either way eventually. Others require you to go out of your way collecting or setting up particular combat encounters to complete them.\nIn the below trophy guide you'll find a full list of all 41 achievements you can earn in Kena: Bridge Of Spirits, along with a few bits of advice on how to unlock some of the more challenging ones.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-achievements",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1285,
          "title": "Kena: Bridge Of Spirits achievements and trophy guide"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-hats",
          "author": "Ollie Toms",
          "description": "Looking for a list of all the Hats in Kena: Bridge Of Spirits? Yes, you can find Hats for your bouncy little spirit friends in Kena: Bridge Of Spirits, and you can purchase these hats at Hat Carts in order to dress your Rot army up exactly how you'd like. Have you ever heard of anything so sickeningly adorable? I sure haven't.\nBelow you'll be able to take a look at every single Rot Hat in the game, along with their cost in Gems and some information on how these cosmetic items can be procured at a Hat Cart.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-hats",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1277,
          "title": "Kena: Bridge Of Spirits Hats"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-tips",
          "author": "Ollie Toms",
          "description": "Looking for some top tips on beating the puzzles and quests of Kena: Bridge Of Spirits? Ember Lab's sumptuous-looking action-adventure game, Kena: Bridge Of Spirits, throws you into a bright, beautiful, and bittersweet world where Kena, a Spirit Guide, is trying to reach a sacred mountain shrine. But first she needs to cleanse the lands of corruption and uncover the mystery of how nature came to be so unbalanced in this part of the world.\nKena is a tough game at times, filled with dangerous combat segments, tricky platforming areas, and numerous puzzles you must complete with the help of your spirit friends, the Rot. This beginner's guide to Kena: Bridge Of Spirits will walk you through some top tips which will help you conquer (and enjoy) every aspect of Kena's journey.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-tips",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1963,
          "title": "Kena: Bridge Of Spirits tips and tricks"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-review",
          "author": "Amelia Hansford",
          "description": "Atmosphere can feel almost superfluous in video games at the moment. Despite its very obvious importance, there’s sometimes an assumption that if the more mechanical parts of a game serve their purpose - and do so reliably - then elements like immersion, environment and art style are merely contributors to a solid product. But my view is to the contrary; I think it’s usually those elements that turn a game into a phenomenon. This is very clearly proven by Kena: Bridge Of Spirits.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-review",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1588,
          "title": "Kena: Bridge Of Spirits review: a beautiful action-adventure full of joy and wonder"
        },
        {
          "id": "https://www.rockpapershotgun.com/a-new-free-to-play-online-pokemon-trading-card-game-is-coming-to-pc",
          "author": "Lauren Morton",
          "description": "There's been a Pokémon card game on PC for years now which, I suspect, will come as news to some of us who were always more into the Pokémon RPGs. You TCG fans will want to know that the newly-announced Pokémon Trading Card Game Live will be replacing the current Pokémon Trading Card Game Online. Pokémon TCG Live is coming with upgrades like a ranked ladder, 3D avatars, and battle passes. It will also remove some major features such as in-game chat and—crucially—card trading. You can catch the announcement and the details here in the reveal trailer for Pokémon TCG Live.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/a-new-free-to-play-online-pokemon-trading-card-game-is-coming-to-pc",
          "publishedOn": "2021-09-20T23:32:57.000Z",
          "wordCount": 825,
          "title": "A new free-to-play online Pokémon trading card game is coming to PC"
        },
        {
          "id": "https://www.rockpapershotgun.com/swerys-the-good-life-finally-fetches-a-launch-date-for-october",
          "author": "Lauren Morton",
          "description": "Small towns always seem to have secrets afoot and it's no different in The Good Life. This mystery adventure led by Hidetaka 'Swery' Suehiro of Deadly Premonition fame has been publicly kicking about for a while now. It's dug up a date at last, proudly fetching us back an October 15th launch. That's when you'll be headed to the British countryside to photograph your way out of debt and try to learn the secrets of the town where everyone turns into animals.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/swerys-the-good-life-finally-fetches-a-launch-date-for-october",
          "publishedOn": "2021-09-20T20:47:42.000Z",
          "wordCount": 781,
          "title": "Swery's The Good Life finally fetches a launch date for October"
        },
        {
          "id": "https://www.rockpapershotgun.com/deltarune-chapter-2-launched-for-free-because-the-world-is-tough-enough",
          "author": "Lauren Morton",
          "description": "Unlike the cheeky surprise release of its first free chapter back in 2018, we got a warning about Deltarune Chapter 2. It's out now, also free, because creator Toby Fox says the world has been tough enough lately. The not-a-sequel-or-prequel-but-sort-of-related game to Fox's hit RPG Undertale is still a work in progress, but the newest chunk of story should hopefully keep fans busy chatting and hunting for secrets for a while yet. It may indeed be a while, once again. Fox plans to release chapters three through five as a paid release when they're finished but even he doesn't know when that will be just yet.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/deltarune-chapter-2-launched-for-free-because-the-world-is-tough-enough",
          "publishedOn": "2021-09-20T18:13:50.000Z",
          "wordCount": 943,
          "title": "Deltarune Chapter 2 launched for free because the world is tough enough"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-introduces-more-big-bosses-and-adorable-photo-mode",
          "author": "Lauren Morton",
          "description": "The first game from former animation studio Ember Lab heads out on its spirit saving adventure tomorrow. Kena: Bridge Of Spirits definitely looks like it's made by an animation house, complete with excessively adorable little sidekick characters and all. Ahead of tomorrow's launch, Ember Lab have shown off another story trailer to peek a couple more of the big spirit bosses that Kena will be putting to rest along with the photo mode that you'll have to take full advantage of all that big screen-inspired character design.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-introduces-more-big-bosses-and-adorable-photo-mode",
          "publishedOn": "2021-09-20T16:38:56.000Z",
          "wordCount": 1006,
          "title": "Kena: Bridge Of Spirits introduces more big bosses and adorable photo mode"
        },
        {
          "id": "https://www.rockpapershotgun.com/well-need-new-imperial-units-for-the-digital-age",
          "author": "Alice O'Connor",
          "description": "To distract from the ongoing dire consequences of leaving the European Union with all the grace and finesse of a child uninviting someone from their seventh birthday party, the UK government plan to revive imperial units. You know: 66 gallons to a hogshead, 6 hogsheads to a rod, 22 ounces to a watt, 9 Rodneys to a Del Boy, that sort of nostalgic masturbation. But a lot has changed since the dark days of the British Empire. If the obtuse unit system is to return (lol), we need new units for modern technologies. I have ideas.\nRead more",
          "link": "https://www.rockpapershotgun.com/well-need-new-imperial-units-for-the-digital-age",
          "publishedOn": "2021-09-20T16:24:04.000Z",
          "wordCount": 1122,
          "title": "We'll need new imperial units for the digital age"
        },
        {
          "id": "https://www.rockpapershotgun.com/rps-user-avatars-have-arrived",
          "author": "Katharine Castle",
          "description": "Ever since RPS was redesigned at the beginning of the year, our tech team has been hard at work improving our comments system and user ID features. The first of those updates arrives today. Behold, you can now assign an avatar to your Reedpop ID account. \nRead more",
          "link": "https://www.rockpapershotgun.com/rps-user-avatars-have-arrived",
          "publishedOn": "2021-09-20T16:18:38.000Z",
          "wordCount": 852,
          "title": "RPS user avatars have arrived"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-nvidia-rtx-30-series-one-year-on-should-you-upgrade",
          "author": "James Archer",
          "description": "Even if they don’t recall the exact date, plenty of gaming PC owners will remember what they were doing on September 17th 2020. They, and I, were staring at a black-and-green storefront, mashing F5 until a “Notify me” button changed to read “Out of stock”. This was the Nvidia GeForce RTX 3080 launch, and what initially looked like a one-off failure of Nvidia’s anti-bot measures ended up heralding the worst year in memory to upgrade a graphics card.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-nvidia-rtx-30-series-one-year-on-should-you-upgrade",
          "publishedOn": "2021-09-20T15:53:33.000Z",
          "wordCount": 1577,
          "title": "The Nvidia RTX 30 series, one year on: should you upgrade?"
        },
        {
          "id": "https://www.rockpapershotgun.com/rumour-quantic-dream-are-making-a-star-wars-game",
          "author": "Alice O'Connor",
          "description": "Here's a rumour that's wildly unsupported but so horrible that oh god you can imagine it being true: Quantic Dream are secretly making a Star Wars game. According to two separate Internauts, the French studio behind Heavy Rain and Detroit: Become Human have become pally with Disney and are working on some sort of game set in the galaxy which gave us Baby Yoda and probably some other stories or something too idk. Take this all with the hugest pinch of spacesalt, of course.\nRead more",
          "link": "https://www.rockpapershotgun.com/rumour-quantic-dream-are-making-a-star-wars-game",
          "publishedOn": "2021-09-20T14:25:12.000Z",
          "wordCount": 796,
          "title": "Rumour: Quantic Dream are making a Star Wars game"
        },
        {
          "id": "https://www.rockpapershotgun.com/frogwares-and-microids-are-escalating-the-war-for-sexiest-young-detective-in-games",
          "author": "Alice Bell",
          "description": "A few months ago I brought it to your attention that Microids are making a new video game called Agatha Christie - Hercule Poirot: The First Cases, in which Poirot is a young and and hot detective solving his first case. I made a comparison to Sherlock Holmes Chapter One, the also upcoming new entry in Frogwares' long-running detect 'em up series, in which Sherlock Holmes is young and hot and solving his first case. Last week, both developers released new videos for their respective games, and the timing of it all was almost enough to make me believe they were baiting me, specifically.\nLast week was Agatha Christie's birthday, you see, so Microids dropped a more in-depth gameplay video and a new dev diary talking about they were making \"a unique new moustache\", just after they make hot young Poirot wink. Then, the very next day - the next day! The. Next. Day. Frogwares put out a release date trailer that may as well have been called Sherlock Holmes: Eyes Wide Shut. And I'm absolutely here for this escalting sexy war.\nRead more",
          "link": "https://www.rockpapershotgun.com/frogwares-and-microids-are-escalating-the-war-for-sexiest-young-detective-in-games",
          "publishedOn": "2021-09-20T14:00:00.000Z",
          "wordCount": 828,
          "title": "Frogwares and Microids are escalating the war for sexiest young detective in games"
        },
        {
          "id": "https://www.rockpapershotgun.com/nvidia-dlss-now-supported-in-over-100-games-thanks-to-indie-push",
          "author": "James Archer",
          "description": "Nvidia DLSS is usually worth turning on for an easy frame rate bump, but even after DLSS 2.0 made it easier for developers to implement, the list of games that actually support the AI-powered anti-aliasing tech has never exactly been running off the page. That said, Nvidia can now claimed to have reached the milestone of 100 DLSS-compatible games, thanks in large part to a recent adoption wave from indie games.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/nvidia-dlss-now-supported-in-over-100-games-thanks-to-indie-push",
          "publishedOn": "2021-09-20T13:11:01.000Z",
          "wordCount": 906,
          "title": "Nvidia DLSS now supported in over 100 games, thanks to indie push"
        },
        {
          "id": "https://www.rockpapershotgun.com/call-of-duty-vanguards-open-beta-is-extended-so-how-are-you-liking-it",
          "author": "Alice O'Connor",
          "description": "Hey, you, you played the Call Of Duty: Vanguard multiplayer open beta this weekend? You like it? You wanna play more? If you do want more, or thought you'd missed your chance to play, good news: the open beta has (probably predictably) been extended. Originally due to end today, it'll now end Wednesday. More time to see CoD's latest return to World War 2.\nRead more",
          "link": "https://www.rockpapershotgun.com/call-of-duty-vanguards-open-beta-is-extended-so-how-are-you-liking-it",
          "publishedOn": "2021-09-20T12:37:28.000Z",
          "wordCount": 749,
          "title": "Call Of Duty: Vanguard's open beta is extended, so how are you liking it?"
        },
        {
          "id": "https://www.rockpapershotgun.com/valve-are-removing-32-bit-support-from-dota-2",
          "author": "Alice O'Connor",
          "description": "If you have an ancient PC, you may soon be ejected from Valve's wonderful world of warwizards. They have announced plans to strip Dota 2 of \"support for some older systems and configurations\", including 32-bit operating systems, saying it's so they can \"keep the game and the Source 2 engine fresh\". DirectX 9 and OpenGL are on the chopping block too (but Vulkan support will stand, obvs).\nRead more",
          "link": "https://www.rockpapershotgun.com/valve-are-removing-32-bit-support-from-dota-2",
          "publishedOn": "2021-09-20T11:01:50.000Z",
          "wordCount": 882,
          "title": "Valve are removing 32-bit support from Dota 2"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-sks-loadout-warzone",
          "author": "Kevin Foley",
          "description": "Looking for the best SKS loadout to bring into Warzone? It certainly offers a unique role as a Marksman Rifle with its semi-automatic fire rate capability. The SKS performs the odd role of being underpowered compared to Sniper Rifles, and slow to shoot compared to Tactical Rifles, but you may see that as a worthwhile tradeoff for times when Warzone matches require you to play a ranged support role that can consistently land accurate shots. For this reason, we've put together what we consider to be the best SKS loadout to bring into Warzone.\nRead more",
          "link": "https://www.rockpapershotgun.com/best-sks-loadout-warzone",
          "publishedOn": "2021-09-20T10:48:34.000Z",
          "wordCount": 1039,
          "title": "Best SKS loadout in Warzone Season 5"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-sunday-papers-611",
          "author": "Ed Thorn",
          "description": "Sundays are for treating yourself to some fancy hand sanitiser that smells like citrus. Before you press the pump, let's read this week's best writing about games.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-sunday-papers-611",
          "publishedOn": "2021-09-19T10:00:00.000Z",
          "wordCount": 1268,
          "title": "The Sunday Papers"
        },
        {
          "id": "https://www.rockpapershotgun.com/story-of-seasons-pioneers-of-olive-town-has-sprouted-on-steam",
          "author": "Graham Smith",
          "description": "Every Story Of Seasons game starts the same way, with a young person fleeing the big city for a more relaxing and simple life. Good luck to them, sez I, but personally I find takeaway delivery services much more relaxing and simple than growing my own beets. \r\n\nStory Of Seasons: Pioneers Of Olive Town repeats the myth, though I admit its pastoral greens and funny hats make a strong argument for country living. It's out on Steam now.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/story-of-seasons-pioneers-of-olive-town-has-sprouted-on-steam",
          "publishedOn": "2021-09-18T12:51:00.000Z",
          "wordCount": 784,
          "title": "Story Of Seasons: Pioneers Of Olive Town has sprouted on Steam"
        },
        {
          "id": "https://www.rockpapershotgun.com/dicey-spaceship-crisis-sim-tharsis-is-the-latest-epic-games-store-freebie",
          "author": "Graham Smith",
          "description": "Tharsis is a turn-based spaceship management game where your ability to deal with a Sandra Bullock of disasters is determined by a dice roll. Alec once sung its praises while calling it \"cruel as hell\" - and it's one of this week's free games from the Epic Games Store.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/dicey-spaceship-crisis-sim-tharsis-is-the-latest-epic-games-store-freebie",
          "publishedOn": "2021-09-18T11:13:00.000Z",
          "wordCount": 765,
          "title": "Dicey spaceship crisis sim Tharsis is the latest Epic Games Store freebie"
        },
        {
          "id": "https://www.rockpapershotgun.com/fifa-22-ultimate-team-will-let-you-see-inside-loot-boxes-from-launch",
          "author": "Graham Smith",
          "description": "EA have detailed how FIFA Ultimate Team is changing for FIFA 22 when it launches on September 26th. Chief among the new features is the adoption of Preview Packs, which let you see the contents of one of Ultimate Team's lucrative loot boxes before you decide whether to buy it.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/fifa-22-ultimate-team-will-let-you-see-inside-loot-boxes-from-launch",
          "publishedOn": "2021-09-18T10:30:00.000Z",
          "wordCount": 796,
          "title": "FIFA 22 Ultimate Team will let you see inside loot boxes from launch"
        },
        {
          "id": "https://www.rockpapershotgun.com/victoria-iii-details-its-approach-to-slavery-in-new-dev-diary",
          "author": "Graham Smith",
          "description": "The latest development diary post for Victoria III talks in detail about how Paradox's empire builder will deal with the topic of slavery. Extremely carefully, is the answer.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/victoria-iii-details-its-approach-to-slavery-in-new-dev-diary",
          "publishedOn": "2021-09-18T09:25:00.000Z",
          "wordCount": 881,
          "title": "Victoria III details its approach to slavery in new dev diary"
        },
        {
          "id": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-162",
          "author": "Alice O'Connor",
          "description": "Hold tight, it's still summer! Four more days and then you can put on as many jumps as you want and chug pumpkin spice lattes until you hurl but for now please, don't deny me the dregs of summer. I need this. You're probably indoors playing video games anyway, so what does it matter to you? Tell me: what are you playing this weekend?\nRead more",
          "link": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-162",
          "publishedOn": "2021-09-18T08:00:00.000Z",
          "wordCount": 1037,
          "title": "What are we all playing this weekend?"
        },
        {
          "id": "https://www.rockpapershotgun.com/grindstones-monsters-and-mamas-update-adds-new-playable-character",
          "author": "Graham Smith",
          "description": "Beloved puzzle battler Grindstone has received another free content update. \"Monsters And Mamas\" adds the game's first alternate playable character, letting you choose to ascend the mountain as vetern stonegrinder Jorja, pictured above. There's also a new Boss Blitz mode, new rewards, and a high-contrast accessibility feature for the colourblind.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/grindstones-monsters-and-mamas-update-adds-new-playable-character",
          "publishedOn": "2021-09-17T20:24:18.000Z",
          "wordCount": 749,
          "title": "Grindstone's Monsters And Mamas update adds new playable character"
        },
        {
          "id": "https://www.rockpapershotgun.com/crysis-remastered-is-available-on-steam-now",
          "author": "Graham Smith",
          "description": "Crysis Remastered landed on the Epic Games Store last year, and the Crysis Trilogy Remastered will similarly don its freshly dry-cleaned nanosuits for Epic's store on October 15th. But as of today, you can also grab Crysis Remastered from Steam.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/crysis-remastered-is-available-on-steam-now",
          "publishedOn": "2021-09-17T20:00:13.000Z",
          "wordCount": 750,
          "title": "Crysis Remastered is available on Steam now"
        },
        {
          "id": "https://www.rockpapershotgun.com/outcast-is-getting-a-sequel-20-years-after-the-original",
          "author": "Imogen Beckhelling",
          "description": "Hello, the 90s are calling and they'd like to offer you sequels to games you've probably forgotten about. Outcast 2: A New Beginning is the newly announced follow-up to 1999's Outcast. It's an open-world third-person shooter that takes place right after the events of the original, where Cutter Slade (the best-named man in the world) has been stuck in time for 20 years after trying to get home to Earth from the alien planet Adelpha. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/outcast-is-getting-a-sequel-20-years-after-the-original",
          "publishedOn": "2021-09-17T19:45:00.000Z",
          "wordCount": 870,
          "title": "Outcast is getting a sequel 20 years after the original"
        },
        {
          "id": "https://www.rockpapershotgun.com/jagged-alliance-3-is-coming-from-the-developers-of-surviving-mars",
          "author": "Graham Smith",
          "description": "Jagged Aliance 3 has been announced during this evening's THQ Nordic 10th anniversary showcase. The turn-based tactics sequel is the first numbered game in the series since 1999's Jagged Alliance 2. It's being developed by Haemimont Games, who are best known for several Tropico games or most recently citybuilder Surviving Mars.\r\n\nThere's a cinematic and gameplay trailer below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/jagged-alliance-3-is-coming-from-the-developers-of-surviving-mars",
          "publishedOn": "2021-09-17T19:45:00.000Z",
          "wordCount": 855,
          "title": "Jagged Alliance 3 is coming from the developers of Surviving Mars"
        },
        {
          "id": "https://www.rockpapershotgun.com/destroy-all-humans-2-reprobed-is-in-development",
          "author": "Graham Smith",
          "description": "Destroy All Humans 2: Reprobed has been announced. It's a ground-up remake of the 2006 third-person action game in which you go on a globe-trotting adventure to, uh, destroy all humans. Reprobed follows  last year's remake of the first Destroy All Humans, and comes from the same developer, Black Forest Games.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/destroy-all-humans-2-reprobed-is-in-development",
          "publishedOn": "2021-09-17T19:45:00.000Z",
          "wordCount": 762,
          "title": "Destroy All Humans! 2: Reprobed is in development"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-dead-cells-update-makes-it-more-approachable-to-newcomers",
          "author": "Kaan Serin",
          "description": "Dead Cells has received yet another update, named Practice Makes Perfect, which adds a training area, powerful buffs called Aspects, and other more. The devs say the patch is focused \"on improving the ease-of-use and learning curve for everyone (paticularly newcomers & occasional players), without altering the overall difficulty of the game.\" To facilitate this goal, all the new features are optional – allowing players to execute their sweet dodge rolls with the challenge they prefer.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/new-dead-cells-update-makes-it-more-approachable-to-newcomers",
          "publishedOn": "2021-09-17T16:31:26.000Z",
          "wordCount": 880,
          "title": "New Dead Cells update makes it more approachable to newcomers"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-making-of-dishonored-death-of-the-outsider-and-how-arkane-killed-a-god",
          "author": "Hirun Cryer",
          "description": "Dishonored: Death Of The Outsider is a revenge and redemption tale, only here the target of your revenge is god. 'We're going to kill a god’ might seem like a well-trodden path in JRPG country, but Death Of The Outsider brings something new to the table. Here, the god is a trickster, a victim, and the source of the player's power. He's a figure that has come to define the Dishonored series as a whole, and is both revered and pitied by its players. So how, exactly, do you go about killing a god like this? I spoke to the developers at Arkane to find out. \nRead more",
          "link": "https://www.rockpapershotgun.com/the-making-of-dishonored-death-of-the-outsider-and-how-arkane-killed-a-god",
          "publishedOn": "2021-09-17T16:00:00.000Z",
          "wordCount": 3295,
          "title": "The making of Dishonored: Death Of The Outsider, and how Arkane killed a god"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-safe-codes",
          "author": "Rebecca Jones",
          "description": "Where are all of the codes to open safes and doors and unlock machine terminals in Deathloop? In true Arkane tradition, Deathloop is full of safes and locked doors that can only be accessed with three- and four-digit codes. Some of the secrets hidden within are essential to progressing the story, while others just contain some good loot. Some of the Visionaries have also used codes to protect some of their machines, which you'll need to override in order to bypass their security.\n Read more",
          "link": "https://www.rockpapershotgun.com/deathloop-safe-codes",
          "publishedOn": "2021-09-17T15:18:38.000Z",
          "wordCount": 2820,
          "title": "Deathloop codes: safe, door, and machine code locations"
        },
        {
          "id": "https://www.rockpapershotgun.com/ultimate-audio-bang-14-big-meaty-guns-slapping-meat",
          "author": "Ed Thorn",
          "description": "Predictably, Imogen and I begin this week's episode of Ultimate Audio Bang by getting excited about Deathloop before realising that there's plenty of other newsy bits to cover. Listen to get our hot thoughts on the Call Of Duty: Vanguard reveal, Battlefield 2042's delay, the Overwatch League using an early build of Overwatch 2 in 2022, and plenty more shootery things.\nRead more",
          "link": "https://www.rockpapershotgun.com/ultimate-audio-bang-14-big-meaty-guns-slapping-meat",
          "publishedOn": "2021-09-17T15:10:25.000Z",
          "wordCount": 827,
          "title": "Ultimate Audio Bang #14: big meaty guns slapping meat"
        },
        {
          "id": "https://www.rockpapershotgun.com/wuchang-fallen-feathers-looks-like-a-chinese-take-on-bloodborne",
          "author": "Alice O'Connor",
          "description": "Following fawning over the Monkey King violence of Black Myth: Wukong, the latest upcoming Chinese game to turn heads with Souls-inspired action and shiny graphics might be Wuchang: Fallen Feathers. A new gameplay trailer released today gives a long look at a sexy babe fighting against plague-mutated people using her melee weapons, firearms, and gut-gouging counters. Yeah, feeling a lot of Bloodborne inspiration here. Have a look below.\nRead more",
          "link": "https://www.rockpapershotgun.com/wuchang-fallen-feathers-looks-like-a-chinese-take-on-bloodborne",
          "publishedOn": "2021-09-17T15:09:50.000Z",
          "wordCount": 752,
          "title": "Wuchang: Fallen Feathers looks like a Chinese take on Bloodborne"
        },
        {
          "id": "https://www.rockpapershotgun.com/arctic-cpu-coolers-to-get-free-mounting-kit-upgrades-for-intel-lga-1700-socket",
          "author": "James Archer",
          "description": "We haven’t seen much of Intel Alder Lake so far, despite being set for release in a matter of weeks.  One thing we do know is that like the majority of Intel’s last few chip family releases, the desktop contingent of these 12th-gen processors will need a brand-new motherboard socket: LGA 1700. \nRead more",
          "link": "https://www.rockpapershotgun.com/arctic-cpu-coolers-to-get-free-mounting-kit-upgrades-for-intel-lga-1700-socket",
          "publishedOn": "2021-09-17T15:09:34.000Z",
          "wordCount": 1005,
          "title": "Arctic CPU coolers to get free mounting kit upgrades for Intel LGA 1700 socket"
        },
        {
          "id": "https://www.rockpapershotgun.com/benchmarking-has-completely-ruined-my-steam-play-time-profile",
          "author": "Katharine Castle",
          "description": "I don't know if you know this about me, but I love a good list. For the past ten years, I've kept a detailed spreadsheet of all the games I've ever played. The bulk of it catalogues games by platform, but I've also kept a list of all the games I play per year since 2010. Call me crazy, but this document is a great source of joy for me. I love being able to look back and see when I last played a certain game, and it's also interesting to me to see just how many of them I manage to play each year. I also keep similar lists for films I see at the cinema, the books I read, as well as the plays and musicals I see at the theatre. I'm not kidding. I really do love a good list. \nPerhaps unsurprisingly, I'm also fascinated by the amount of time I spend playing games, too (and yes, I do have a list for this as well - albeit only for my Nintendo Wii games at the moment). Steam, of course, keeps excellent track of your play time - and because it's always open on my PC, there's no need to keep my own version of it. I can just load up my Steam profile and gaze lovingly at the hours and minutes in my All Games tab. Except I can't anymore, because four years' worth of professional benchmarking has absolutely ruined my play time figures. It upsets me. Because I haven't really spent 130 hours playing Shadow Of The Tomb Raider. Or 38 hours playing Doom. It's all benchmarking, and I wish there was a way to scrub these games clean again so everything can be nice and neat and orderly again, and most of all, accurate. \nRead more",
          "link": "https://www.rockpapershotgun.com/benchmarking-has-completely-ruined-my-steam-play-time-profile",
          "publishedOn": "2021-09-17T15:09:19.000Z",
          "wordCount": 982,
          "title": "Benchmarking has completely ruined my Steam play time profile"
        },
        {
          "id": "https://www.rockpapershotgun.com/give-yourself-a-good-day-by-playing-webbed",
          "author": "Sin Vega",
          "description": "It was 3am and Hucks the cellar spider was finally surrounded by, instead of carrying, her wee hatchlings. Clarice, her slightly dim neighbour, was resting after another hour spent fruitlessly stumbling around after an even dafter flying thingy that would eventually blunder right into her face.\r\n\nPlaying Webbed seemed inevitable for someone who watches her ceiling spiders when she can't sleep or finish an article. But within about a minute of playing, it became clear that it's the kind of game that will bring joy to almost anyone. Webbed is immediately brilliant.\nRead more",
          "link": "https://www.rockpapershotgun.com/give-yourself-a-good-day-by-playing-webbed",
          "publishedOn": "2021-09-17T14:30:10.000Z",
          "wordCount": 700,
          "title": "Give yourself a good day by playing Webbed"
        },
        {
          "id": "https://www.rockpapershotgun.com/steam-deck-dev-kit-screenshots-show-a-likely-big-picture-replacement-steamos-3-allegedly-leaks",
          "author": "James Archer",
          "description": "Whelp, that didn’t take long. Steam Deck dev kits were only sent out to game developers this week, and it looks like Valve’s handheld PC is already getting picked apart. That’s according to SteamDB creator Pavel Djundik, who tweeted screenshots of the Steam Deck UI before claiming the entire SteamOS 3 operating system has been leaked.\nRead more",
          "link": "https://www.rockpapershotgun.com/steam-deck-dev-kit-screenshots-show-a-likely-big-picture-replacement-steamos-3-allegedly-leaks",
          "publishedOn": "2021-09-17T13:03:49.000Z",
          "wordCount": 1015,
          "title": "Steam Deck dev kit screenshots show a likely Big Picture replacement, SteamOS 3 allegedly leaks"
        },
        {
          "id": "https://www.rockpapershotgun.com/clive-sinclair-who-brought-us-the-zx-spectrum-has-died",
          "author": "Alice O'Connor",
          "description": "Clive Sinclair, the founder of the company which brought us the ZX Spectrum computer, has died. The first encounter with PC gaming for many of a certain age in the UK wasn't through any beige box MS-DOS or Windows, it was on that futuristic wee black keyboard with rubbery keys and a colourful stripe, which loaded software from cassette tapes. I'm too young to have seen its glory days but I think the first PC game I played was a Speccy shoot 'em up, a magical experience I didn't believe would actually work when I first saw my pal plug a tape deck into a keyboard.\nRead more",
          "link": "https://www.rockpapershotgun.com/clive-sinclair-who-brought-us-the-zx-spectrum-has-died",
          "publishedOn": "2021-09-17T12:09:04.000Z",
          "wordCount": 998,
          "title": "Clive Sinclair, who brought us the ZX Spectrum, has died"
        },
        {
          "id": "https://www.rockpapershotgun.com/tails-of-iron-review",
          "author": "Alice Bell",
          "description": "As enquiring minds already know, rats are very cute. I've not had pet rats myself, but a bunch of my friends have. Rats have lovely little pin-prick hands and feet, and they will give you wiffly-nose kisses while they assess whether your hair is worth exploring or not.\nThe rats in Tails Of Iron are cute. Little 2D inhabitants of a feudal rat kingdom, where they get milk from insects that look like cows, and royal succession is determined in trial by combat - which you, Prince Redgi, win, and shortly thereafter become King Redgi when your dad is murdered by frogs right in front of you. Let the amphibian bodies hit the floor. Time to kick this RPG into a side-on soulslike experience. Slice open a frog belly and see the guts spill out. These rats are cute, but also u wot? U wot? Say that again m8. Say that to my face. I'll 'ave you.\nRead more",
          "link": "https://www.rockpapershotgun.com/tails-of-iron-review",
          "publishedOn": "2021-09-17T12:04:39.000Z",
          "wordCount": 1788,
          "title": "Tails Of Iron review: a fun 2D Soulslike with a bit too much padding"
        },
        {
          "id": "https://www.rockpapershotgun.com/tales-of-arise-is-the-fastest-selling-game-in-the-series",
          "author": "Graham Smith",
          "description": "The Tales games stretch back to 1995's Tales Of Phantasia, but the latest entry, Tales Of Arise, is now the fastest selling in the series. In less than a week, it has sold a million copies, Bandai Namco say.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/tales-of-arise-is-the-fastest-selling-game-in-the-series",
          "publishedOn": "2021-09-16T22:36:13.000Z",
          "wordCount": 740,
          "title": "Tales Of Arise is the fastest selling game in the series"
        },
        {
          "id": "https://www.rockpapershotgun.com/titan-quest-and-jagged-alliance-are-free-to-keep-right-now",
          "author": "Graham Smith",
          "description": "THQ Nordic are celebrating their 10th anniversary by giving away free games via Steam. Surprisingly enduring action RPG Titan Quest is currently free-to-keep, and so is the ancient turn-based tactics of Jagged Alliance. \r\n\nThen, if you want something a little more modern, the real-time tactical stealth of Desperados 3 is free-to-try for the next three days.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/titan-quest-and-jagged-alliance-are-free-to-keep-right-now",
          "publishedOn": "2021-09-16T21:41:48.000Z",
          "wordCount": 823,
          "title": "Titan Quest and Jagged Alliance are free to keep right now"
        },
        {
          "id": "https://www.rockpapershotgun.com/please-ikea-make-me-some-grownup-gaming-furniture",
          "author": "Graham Smith",
          "description": "Ikea, makers of large, boring Lego projects for adults, are launching a range of gaming furniture. The set, created in collaboration with Republic Of Gamers, includes desks, chairs, streaming accessories and what The Guardian describes as a \"multi-functional cushion/blanket.\"\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/please-ikea-make-me-some-grownup-gaming-furniture",
          "publishedOn": "2021-09-16T21:01:31.000Z",
          "wordCount": 814,
          "title": "Please Ikea, make me some grownup gaming furniture"
        },
        {
          "id": "https://www.rockpapershotgun.com/call-of-duty-vanguards-beta-opens-to-all-this-weekend",
          "author": "Graham Smith",
          "description": "Call Of Duty: Vanguard has already had a beta on PlayStation, and if you've pre-ordered the game you can play it right now on PC. On Saturday however, the beta will open up to everyone with a Battle.net account. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/call-of-duty-vanguards-beta-opens-to-all-this-weekend",
          "publishedOn": "2021-09-16T20:07:11.000Z",
          "wordCount": 855,
          "title": "Call Of Duty: Vanguard's beta opens to all this weekend"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-to-overclock-gpu",
          "author": "James Archer",
          "description": "Learning how to overclock your GPU sounds like it should be one of gaming PC ownership’s essential skills, like knowing how to clean your PC or how to check CPU temperature. And why not? Coaxing extra performance out of a component will get you more frames-per-second at no additional charge, and you can do it with just about every gaming card under the sun. Even the best graphics cards that come with factory overclocks will leave headroom for additional gains to unlock yourself.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/how-to-overclock-gpu",
          "publishedOn": "2021-09-16T16:26:44.000Z",
          "wordCount": 2245,
          "title": "How to overclock your GPU"
        },
        {
          "id": "https://www.rockpapershotgun.com/valheim-has-added-a-hot-tub-for-vikings-to-unwind",
          "author": "Alice O'Connor",
          "description": "Trying to survive in purgatory isn't easy, having to hunt and build and craft everything you need to slay mighty mythical beasts. Thankfully, the Vikings of Valheim can now relax with their pals in a hot tub, one of many fancy household items added in the 'Home & Hearth' early access update today. Sure sure it brings new weapons and new creatures and balance changes and things too, but: hot tub!\nRead more",
          "link": "https://www.rockpapershotgun.com/valheim-has-added-a-hot-tub-for-vikings-to-unwind",
          "publishedOn": "2021-09-16T16:22:16.000Z",
          "wordCount": 791,
          "title": "Valheim has added a hot tub for Vikings to unwind"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-how-to-beat-yervha",
          "author": "Rebecca Jones",
          "description": "What are the correct answers to the Yervha's questions in Deathloop? The Yervha, a.k.a. Queen of Riddles, is a trivia machine in Deathloop. If you can answer all 10 of its questions correctly you'll win a prize! A very modest prize, but a prize nonetheless. And who doesn't love a good trivia challenge? You certainly seem to, since you're here!\nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-how-to-beat-yervha",
          "publishedOn": "2021-09-16T15:02:46.000Z",
          "wordCount": 1449,
          "title": "The Yervha: how to beat Deathloop's fiendish trivia machine"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-electronic-wireless-show-podcast-episode-156-the-best-doctors-in-games-special",
          "author": "Alice Bell",
          "description": "The recording of this episode of The Electronic Wireless Show podcast turned out to be unfortunately cursed with technical issues, which means I am (probably noticeably) tired and grumpy, and don't let Matthew and Nate reproduce their witty banter from the first time we tried to record. No cold open! Still, nothing to cheer me up like some good bedside manner from a doctor. Oh no, it turns out all game doctors are awful!\nWe discuss our favourite game medical types, and also discuss why doctors in games are so often evil baddies. The saga of Matthew and his teeth continues, as well as envisioning Matthew as a clown who just turns up to your kids birthday party smeared in his wife's lipstick, drinks all your Fanta, and leaves again. Now that's malpractice.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-electronic-wireless-show-podcast-episode-156-the-best-doctors-in-games-special",
          "publishedOn": "2021-09-16T15:00:00.000Z",
          "wordCount": 789,
          "title": "EWS podcast episode 156: the best doctors special"
        },
        {
          "id": "https://www.rockpapershotgun.com/gamedec-review",
          "author": "Khee Hoon Chan",
          "description": "From the stealth-oriented Foreclosed to the twin-sticky The Ascent, there has been a bumper crop of cyberpunk shooters this year, their endless gun fests typically set amidst a gaudy onslaught of neon-tinged billboards, metallic skyscrapers and indiscriminately-placed Asian motifs.\nIn spite of its roots, Gamedec initially seems like a reprieve from this recent blitz of cyberpunk games. It sticks steadfastly to its self-imposed, zero-combat rule, instead leaning heavily towards the genre’s crime fiction elements. That’s because in Gamedec, you’re a detective actually carrying out proper investigative work, rather than simply pointing the smokey end of a gun towards your problems. You’ll sleuth around for clues, make deductions based on your discoveries, and draw conclusions that will shape the outcome of your cases.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/gamedec-review",
          "publishedOn": "2021-09-16T14:00:00.000Z",
          "wordCount": 1793,
          "title": "Gamedec review: a great cyberpunk concept undone by a bloated script"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-trinkets",
          "author": "Rebecca Jones",
          "description": "What are the best trinkets in Deathloop? Trinkets might sound frivolous, but they are in fact Deathloop's answer to mods: applying them provides potentially very powerful combat buffs, and therefore they're actually very important. Deathloop's Trinkets come in two varieties: Character Trinkets (personal mods applied to your player character) and Weapon Trinkets (mods which can be applied individually to every gun in your possession).\n Read more",
          "link": "https://www.rockpapershotgun.com/deathloop-trinkets",
          "publishedOn": "2021-09-16T13:00:51.000Z",
          "wordCount": 2088,
          "title": "Best Deathloop trinkets: what every trinket does and which are best for your loadout"
        },
        {
          "id": "https://www.rockpapershotgun.com/mechwarrior-5-mercenaries-gets-marriage-melee-and-mech-switching-with-its-next-dlc",
          "author": "Imogen Beckhelling",
          "description": "Don't you just hate it when you're getting married to secure an alliance with a certain faction, but another faction insists on existing in-between your borders? Don't worry, it's a simple fix: send in an army of mechs to conquer them, then you and your betrothed get even more space to share! \r\n\n\r\nThis is pretty much the plot of the next MechWarrior 5: Mercenaries DLC, Legend Of The Kestrel Lancers. It's arriving on September 23rd alongside a free update that will finally let players punch other mechs in the face. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/mechwarrior-5-mercenaries-gets-marriage-melee-and-mech-switching-with-its-next-dlc",
          "publishedOn": "2021-09-16T13:00:00.000Z",
          "wordCount": 1332,
          "title": "MechWarrior 5: Mercenaries gets marriage, melee and mech-switching with its next DLC"
        },
        {
          "id": "https://www.rockpapershotgun.com/deltarune-chapter-2-continues-the-undertale-follow-up-tomorrow",
          "author": "Alice O'Connor",
          "description": "This week we'll get to play the second chapter of Deltarune, the neither-sequel-nor-prequel-but-maybe-related follow-up to Undertale, creator Toby Fox has announced. Surprise!\nRead more",
          "link": "https://www.rockpapershotgun.com/deltarune-chapter-2-continues-the-undertale-follow-up-tomorrow",
          "publishedOn": "2021-09-16T11:54:24.000Z",
          "wordCount": 868,
          "title": "Deltarune Chapter 2 continues the Undertale follow-up tomorrow"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-best-battle-royale-games",
          "author": "Ed Thorn",
          "description": "Outlast the rest of the competition and emerge the last person standing, that's the motto for the best battle royale games out there. Often there's a big circle of poison gas pushing people closer together, or like, everyone parachutes in for some reason. Some don't feature any of these things, and opt for obstacle courses, or zany community creations instead. You may have thought battle royale games were quite one-note, but they're actually quite varied. So below I've rounded up some of the best ways to prove you're the fittest survivor of them all.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-best-battle-royale-games",
          "publishedOn": "2021-09-16T11:06:09.000Z",
          "wordCount": 2817,
          "title": "The 10 best battle royale games"
        },
        {
          "id": "https://www.rockpapershotgun.com/skatebird-review",
          "author": "Brendan Caldwell",
          "description": "Skatebird is simultaneously a homage to the Tony Hawk games of old and a celebration of just how stupid birds can be. It's the arcadey kind of kickflipper, handling more like THUG than a Skate game. But don't expect the truly smooth flow of the Hawkster's outings. There's plenty of wobbly physics on show here, much of it intentional and jokey (as you'd expect from a game that seems to have resulted entirely from a single pun). But some of it perhaps not. Still, it's hard to hate on these feathery ones when they squawk so pure, and when their taste in music is im-peck-able.\nRead more",
          "link": "https://www.rockpapershotgun.com/skatebird-review",
          "publishedOn": "2021-09-16T11:02:28.000Z",
          "wordCount": 1844,
          "title": "Skatebird review: tiny hawks win the day in this wonky skating game"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-amazing-american-circus-review",
          "author": "Matt Cox",
          "description": "By the time Henry Ford rolled up to see my show, I was ready to pack my trunk and say goodbye to the circus. I’d been ready a long time ago, truth be told, some time between inciting industrial action amongst JP Morgan’s workers and nabbing an automaton from Tesla. My troupe spread delight wherever we roamed, but the crowds weren’t to know we’d been plying the same tricks for hour after hour - nor that it had hardly taken one to hone my act to the point where failure was inconceivable. Every meagre juggling trick brought whoops from the crowd and impatience to my heart. With every high-wire act, my spirit sank lower still. \r\n\n\r\nThere’s no turn around coming, I’m afraid. The Amazing American Circus is a deckbuilder with some nice ideas, but it’s far more clown than strongman. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-amazing-american-circus-review",
          "publishedOn": "2021-09-16T08:00:00.000Z",
          "wordCount": 1723,
          "title": "The Amazing American Circus review: I hate to say it, but there are better shows in town"
        },
        {
          "id": "https://www.rockpapershotgun.com/corsairs-pretty-240mm-aio-cooler-is-going-cheap-on-amazon-uk",
          "author": "Will Judd",
          "description": "Liquid CPU coolers are all the rage these days, as they look neat and provide the sort of excellent cooling performance you'd normally only get out of an oversized air cooler. Corsair make some of the best AiOs in the business, and today their (draws breath) iCue H100i Pro XT RGB 240mm CPU cooler (phew) is going cheap. It debuted at £115 and normally costs £90, but today you can pick it up for the relative bargain price of £72. \nRead more",
          "link": "https://www.rockpapershotgun.com/corsairs-pretty-240mm-aio-cooler-is-going-cheap-on-amazon-uk",
          "publishedOn": "2021-09-15T20:56:09.000Z",
          "wordCount": 916,
          "title": "Corsair's pretty 240mm AiO cooler is going cheap on Amazon UK"
        },
        {
          "id": "https://www.rockpapershotgun.com/a-crucial-mx500-1tb-ssd-for-85-headlines-a-host-of-newegg-deals",
          "author": "Will Judd",
          "description": "Newegg in the US is discounting a host of PC peripherals and components today, so we thought we'd highlight our favourite three deals especially for you. They include a full-size hot-swappable mechanical keyboard for $50, 16 gigabytes of 3600MHz RAM for $73 and a 1TB SSD for just $85. Here are all the details!\nRead more",
          "link": "https://www.rockpapershotgun.com/a-crucial-mx500-1tb-ssd-for-85-headlines-a-host-of-newegg-deals",
          "publishedOn": "2021-09-15T20:35:40.000Z",
          "wordCount": 1086,
          "title": "A Crucial MX500 1TB SSD for $85 headlines a host of Newegg deals"
        },
        {
          "id": "https://www.rockpapershotgun.com/battlefield-2042-rumoured-to-be-delayed-by-several-weeks",
          "author": "Graham Smith",
          "description": "Battlefield 2042 has been delayed until November 19th. EA Dice's futuristic shooter was originally due to release on October 11th, but a day of rumours was concluded by official confirmation of the new release date by EA.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/battlefield-2042-rumoured-to-be-delayed-by-several-weeks",
          "publishedOn": "2021-09-15T20:18:20.000Z",
          "wordCount": 766,
          "title": "Battlefield 2042 delayed until November 19th"
        },
        {
          "id": "https://www.rockpapershotgun.com/nidhogg-and-nidhogg-2-free-updates-add-new-levels-and-cats",
          "author": "Graham Smith",
          "description": "Good news! Chaotic multiplayer brawler Nidhogg 2 just received a free update adding new costumes and two new levels, including one set upon a train. Even better news: the original Nidhogg also received a free update, adding a new battleground and some new animated cats.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/nidhogg-and-nidhogg-2-free-updates-add-new-levels-and-cats",
          "publishedOn": "2021-09-15T19:35:57.000Z",
          "wordCount": 751,
          "title": "Nidhogg and Nidhogg 2 free updates add new levels and cats"
        },
        {
          "id": "https://www.rockpapershotgun.com/beaver-city-builder-timberborn-is-out-in-early-access-now",
          "author": "Graham Smith",
          "description": "It feels as if the past couple of years have seen a quiet resurgence of Settlers-style town building games, and often those where you're prepping to survive a terrible winter. Timberborn looks like it would sit in that genre but with a distinct twist: all the humans are long dead, and your town is instead inhabited by beavers.\r\n\nIt's out in early access now.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/beaver-city-builder-timberborn-is-out-in-early-access-now",
          "publishedOn": "2021-09-15T18:47:14.000Z",
          "wordCount": 792,
          "title": "Beaver city-builder Timberborn is out in early access now"
        },
        {
          "id": "https://www.rockpapershotgun.com/kerbal-space-program-developers-balsa-model-flight-simulator-is-out-now",
          "author": "Graham Smith",
          "description": "Building balsa models doesn't have the same immediate appeal as constructing space rockets, and yet Balsa Model Flight Simulator still seems extremely appealing. That's partly because it's from the original developer of Kerbal Space Program, and offers a similar physics construction toolset even if on a more terrestrial scale. It's available now in early access.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/kerbal-space-program-developers-balsa-model-flight-simulator-is-out-now",
          "publishedOn": "2021-09-15T18:08:49.000Z",
          "wordCount": 804,
          "title": "Kerbal Space Program developer's Balsa Model Flight Simulator is out now"
        },
        {
          "id": "https://www.rockpapershotgun.com/solar-ash-has-a-very-different-take-on-marios-mushroom-kingdom",
          "author": "Alice Bell",
          "description": "Hey, remember Hyper Light Drifter, your favourite action-RPG of five years ago? The devs Heart Machine are soon to be back with their new game Solar Ash, which is coming out at the end of next month. It is not like Hyper Light Drifer. For starters, Solar Ash is full 3D. Creative director Alx Preston described the elevator pitch to me as \"Super Mario Galaxy meets Shadow Of The Colossus, and sprinkle in a bit of Jet Set Radio\" during a hands off preview event last week, and on the face of it, it looks fantastic - something that you, too, may have gleaned from one of its recent trailers. \nBut Solar Ash is a game about motion, something that's very difficult to convey during a remote hands-off demo. I cannot tell you how Solar Ash feels, but I'm also a toddler with a marshmallow: put something that looks fuckin' sweet in front of me and I want to consume it, and snatch it up with my grabby little fingers. \nRead more",
          "link": "https://www.rockpapershotgun.com/solar-ash-has-a-very-different-take-on-marios-mushroom-kingdom",
          "publishedOn": "2021-09-15T16:00:00.000Z",
          "wordCount": 1389,
          "title": "Solar Ash has a very different take on Mario's Mushroom Kingdom"
        },
        {
          "id": "https://www.rockpapershotgun.com/aragami-2-review",
          "author": "Nic Reuben",
          "description": "‘Breezy’ seems like an odd word to slap on a stealth game - a measured, sometimes plodding genre - but it fits ninj-em-up Aragami 2 perfectly. Flow like water, it says; stabby water, with wings. Flow, then, like an irresponsibly sharp ice-sculpture of a hummingbird. Flow imperfectly and playfully, for the same tools that allow you to strike masterfully silent also let you mitigate sloppiness with improvisational glee. If Tenchu was an armoury to select from, and Shadow Tactics a map to study, Aragami 2 is a toybox. Let’s play ninjas, shall we?\nRead more",
          "link": "https://www.rockpapershotgun.com/aragami-2-review",
          "publishedOn": "2021-09-15T16:00:00.000Z",
          "wordCount": 1634,
          "title": "Aragami 2 review: a breezy ninja stealth 'em up"
        },
        {
          "id": "https://www.rockpapershotgun.com/bethesda-say-theyre-actively-investigating-deathloop-pc-stuttering",
          "author": "Alice O'Connor",
          "description": "While Arkane's time-looping supernatural shooter Deathloop is a good'un, the PC release has not gone down well, with many players reporting suffering framerates—the worst type of timejank. The problem still stands, a day-and-a-half after launch, but there is some comfort to be found in at least an official acknowledgment from publishers Bethesda that yes, they know it's a problem. Not nearly as much comfort as a fix would be. Maybe you'll find some meagre comfort in the unlikely source for this acknowledgement: a nice picture of some burgers.\nRead more",
          "link": "https://www.rockpapershotgun.com/bethesda-say-theyre-actively-investigating-deathloop-pc-stuttering",
          "publishedOn": "2021-09-15T15:58:49.000Z",
          "wordCount": 889,
          "title": "Bethesda \"actively investigating\" Deathloop PC stuttering"
        },
        {
          "id": "https://www.rockpapershotgun.com/shashingo-helps-you-learn-japanese-through-photography-and-id-like-it-now-please",
          "author": "Ed Thorn",
          "description": "Despite being half Japanese, I know very, very little of the language. It pains me, it really does. Occasionally I get this urge to learn it, and lately it's bubbled up because I'm planning on jetting over there next year [laughs in covid]. Unfortunately, all my efforts at self-study have gone down the pan.\nI've tried learning Japanese using audio courses and textbooks, but my discipline wanes only a couple of months in. There are many reasons why I suck at self-study, but flashcards are one of them. Sorry, but they suck and they are tedious. This is where I hope the upcoming 'edutainment' game Shashingo will change my relationship with them.\nRead more",
          "link": "https://www.rockpapershotgun.com/shashingo-helps-you-learn-japanese-through-photography-and-id-like-it-now-please",
          "publishedOn": "2021-09-15T15:25:02.000Z",
          "wordCount": 772,
          "title": "Shashingo helps you learn Japanese through photography and I'd like it now please"
        },
        {
          "id": "https://www.rockpapershotgun.com/now-a-union-have-filed-charges-against-activision-blizzard-too",
          "author": "Alice O'Connor",
          "description": "A group of Activision Blizzard workers have teamed up with a union to file charges of unfair labour practices, accusing the company of \"intimidation and union busting\". This comes less than two months after a California state agency sued the company for alleged discrimination, harrassment, and retaliation. The new charges filed with the labour board claim that Actiblizzard have attempted to stop employees from discussing working conditions or working together to improve them, in violation of labour law.\nRead more",
          "link": "https://www.rockpapershotgun.com/now-a-union-have-filed-charges-against-activision-blizzard-too",
          "publishedOn": "2021-09-15T15:09:12.000Z",
          "wordCount": 1108,
          "title": "Now a union have filed charges against Activision Blizzard too"
        },
        {
          "id": "https://www.rockpapershotgun.com/watch-the-i-am-dead-devs-explain-the-lovely-real-world-inspirations-behind-the-game",
          "author": "Kaan Serin",
          "description": "Hollow Ponds have released a video detailing the real-world inspirations behind their 2020 puzzle game I Am Dead, a game about a ghost returning to their hometown and view it through new (dead) eyes. The cultural specificity in I Am Dead becomes clear as the two lead developers, Richard Hogg and Ricky Haggett, discuss how the British seaside town of Hastings influenced the creation of the game’s fictional setting Shelmerston. It's 25 minutes long, but it's a lovely watch.\nHogg and Haggett give insights on the various buildings, objects, and jokes from Hastings that infiltrated their way into the game. The video shows off previously unseen concept art, photography, diagrams, maps and mood boards that were used in the development of I Am Dead. You will also learn a lot about the town Hastings.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/watch-the-i-am-dead-devs-explain-the-lovely-real-world-inspirations-behind-the-game",
          "publishedOn": "2021-09-15T15:04:39.000Z",
          "wordCount": 1201,
          "title": "Watch the I Am Dead devs explain the lovely real world inspirations behind the game"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-infusion-residuum",
          "author": "Rebecca Jones",
          "description": "How can you carry over weapons and powers in Deathloop? Deathloop is a darkly comedic action-adventure game which sees assassins Colt and Julianna attempting to kill each other time and time again over the course of a single looping day. The titular loop resets itself if the day ends before Colt can kill all eight Visionaries (including Julianna), or if Colt dies three times in a single mission. When this happens, Colt wakes up at the beginning of the day with everything reset — including any weapons, powers, and trinkets he managed to pick up during his last trip through the loop.\nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-infusion-residuum",
          "publishedOn": "2021-09-15T15:01:42.000Z",
          "wordCount": 1770,
          "title": "Deathloop infusion: how to carry over weapons and powers between loops with Residuum"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-water-resistant-is-this-water-resistant-mouse-a-scientific-investigation",
          "author": "James Archer",
          "description": "There are lots of spill-resistant keyboards, including some in our best gaming keyboard rankings, but you hardly ever see mice with similar protection. Despite the fact that they’re always right next to the keyboard, and thus just at risk from low-flying beverages. There are at least two, though: The SteelSeries Aerox 3 and Aerox 3 Wireless. According to SteelSeries, these were the first gaming mice on the market to receive IP54 certification, effectively guaranteeing protection against dust ingress and water splashes.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/how-water-resistant-is-this-water-resistant-mouse-a-scientific-investigation",
          "publishedOn": "2021-09-15T14:56:38.000Z",
          "wordCount": 1687,
          "title": "How water-resistant is this water-resistant mouse? A scientific investigation"
        },
        {
          "id": "https://www.rockpapershotgun.com/this-new-doom-mod-will-let-you-send-thatcher-back-to-hell",
          "author": "Alice O'Connor",
          "description": "Next week, reviled former British prime minister Margaret Thatcher will rise from her grave to bring Hell back to Earth, and only one space marine can stop her. Announced today, Thatcher's Techbase is an upcoming mod for classic Doom which ventures in the tenth circle of Hell (aka the United Kingdom) to battle the demonic forces of the Iron Lady. Modding politicians into games is a vintage jape but Thatcher's Techbase makes a real effort with custom art, its own campaign, music from Paradise Killer's composer, and apparently even the voice behind Demeter and Persephone in Hades. Watch this trailer.\nRead more",
          "link": "https://www.rockpapershotgun.com/this-new-doom-mod-will-let-you-send-thatcher-back-to-hell",
          "publishedOn": "2021-09-15T13:40:15.000Z",
          "wordCount": 915,
          "title": "This new Doom mod will let you send Thatcher back to Hell"
        },
        {
          "id": "https://www.rockpapershotgun.com/i-am-fish-review",
          "author": "Ed Thorn",
          "description": "Like a splash of cold water to the face, I Am Fish is a wonderfully refreshing physics platformer. This isn't a grim tale wrapped in layers of metaphor, or a walking simulator that guides you slowly through a field of feelings. Here, you are simply a fish. The bowl is your prison. The ocean is your freedom. Now imagine Ian Mckellen with the same gravitas as he had playing Gandalf in Lord Of The Rings, except with a farmer's cap on. He is peering into your googly, goldfish eyes. In a west country accent, he bellows, \"Swim, you fool!\"\nRead more",
          "link": "https://www.rockpapershotgun.com/i-am-fish-review",
          "publishedOn": "2021-09-15T13:00:00.000Z",
          "wordCount": 1646,
          "title": "I Am Fish review: a physics platformer with sole"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-weapons",
          "author": "Rebecca Jones",
          "description": "How many weapons are there in Deathloop and how do you get the best ones? Deathloop is about two assassins locked in a time-looping duel to the death, so naturally, there are weapons aplenty in this game. Thanks to the titular loop, you aren't always going to be able to hang on to every weapon you pick up, so knowing where and how to get your favourite weapons back is going to be important.\nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-weapons",
          "publishedOn": "2021-09-15T11:27:14.000Z",
          "wordCount": 2399,
          "title": "Best Deathloop weapons: every weapon in Deathloop explained"
        },
        {
          "id": "https://www.rockpapershotgun.com/death-trash-and-others-want-to-know-how-the-sausage-is-made",
          "author": "Andreas Inderwildi",
          "description": "“What’s with all the meat everywhere, anyway?” my Death Trash alter ego Mildred asks. “It’s just there. Grows.” the meat merchant replies. “Maybe we’re living on a planet full of flesh and right now we’re standing on a crust of stone and dirt. So, do you want a piece of meat now?” I really don’t. But Mildred does. After all, this mystery meat is the main healing item in the game. It’s what keeps you and the world around you alive. It’s harvested from the ground like precious stones, the literal blood flowing in this grotesque world’s barebones economy, eaten raw and served in meat bars.\nBut where does the meat come from? Whence the amorphous flesh blobs and pools of blood? From another planet, another dimension? There are no animals in this strange ecosystem apart from Fleshworms. The strange meat seems to be linked to another mystery, the advent of the flesh titans (which are exactly what the name suggests). Soon we discover that we are able to commune with the meat and, through it, speak to a enigmatic being called The Oracle. The meat is a kind of universal consciousness, a flesh and blood information highway, into which those who are attuned to it can plug in. Whether the meat and the flesh titans are good or bad for humanity is up for debate, and there are factions that deify and others that hate them, vying for power. The clot thickens.\nRead more",
          "link": "https://www.rockpapershotgun.com/death-trash-and-others-want-to-know-how-the-sausage-is-made",
          "publishedOn": "2021-09-15T11:00:00.000Z",
          "wordCount": 1648,
          "title": "Death Trash and others want to know how the sausage is made"
        }
      ]
    },
    {
      "title": "Root.cz - články",
      "feedUrl": "https://www.root.cz/rss/clanky/",
      "siteUrl": "https://www.root.cz/clanky/",
      "articles": [
        {
          "id": "www.root.cz-text-15662",
          "author": "redakce@root.cz (Root.cz: Ferenc Lengyel)",
          "description": "Platforma Arduino sa stala veľmi rozšírenou najmä vďaka tomu, že umožňuje veľmi jednoducho naprogramovať rôzne typy kontrolérov pre najrozmanitejšie úlohy. Zároveň využívame väčšinu výhod kontrolérov.",
          "link": "https://www.root.cz/clanky/arduino-mega-na-zbernici-s-pc/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-21T22:00:10.000Z",
          "wordCount": 2105,
          "title": "Arduino Mega na zbernici s PC",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/532/arduino-mega-1.jpg",
            "length": "76480",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15671",
          "author": "redakce@root.cz (Root.cz: Jiří Sluka)",
          "description": "Dnes si představíme jednoduchý editor odvozený z projektu lite, budeme optimalizovat velikost obrázků, začneme si vést vlastní deník a nakonec využijeme průzkumníka slovníků EPWING, LingvoDSL a StarDict.",
          "link": "https://www.root.cz/clanky/softwarova-sklizen-22-9-2021/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-21T22:00:05.000Z",
          "wordCount": 876,
          "title": "Softwarová sklizeň (22. 9. 2021)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/root/368/kombajn-sklizen.jpg",
            "length": "394618",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15642",
          "author": "redakce@root.cz (Root.cz: Michal Tauchman)",
          "description": "V druhé části článků o retrobrightingu se podíváme na samotné výsledky mého snažení. Ve většině případů je výsledek velmi uspokojivý, ale jak uvidíte v jednom případě, ne vždy je vše dokonalé.",
          "link": "https://www.root.cz/clanky/retrobrightin-g-vysledky-procesu-beleni-plastu-a-jeden-prusvih/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T22:00:10.000Z",
          "wordCount": 2711,
          "title": "Retrobrightin­g: výsledky procesu bělení plastu a jeden průšvih",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/324/amiga-retrobrighting-1.jpg",
            "length": "54531",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15668",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "V dnešní části seriálu o křivkách, které nalezneme v přírodě, architektuře, technice i v počítačové grafice, dokončíme popis různých typů spirál. Zabývat se budeme například klotoidou a evolventou.",
          "link": "https://www.root.cz/clanky/krivky-v-prirode-i-v-pocitacove-grafice-svet-spiral-dokonceni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T22:00:05.000Z",
          "wordCount": 7374,
          "title": "Křivky v přírodě i v počítačové grafice – svět spirál (dokončení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/507/krivka-perex-1.jpg",
            "length": "74201",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15667",
          "author": "redakce@root.cz (Root.cz: CSIRT.CZ)",
          "description": "V dnešním díle Postřehů se podíváme na další malý krok směřující ke konci hesel, na agenty NSA, kteří si přivydělávali jako námezdní hackeři, na eskalaci privilegií v HP Omen nebo nový návrh OWASP Top 10.",
          "link": "https://www.root.cz/clanky/postrehy-z-bezpecnosti-ukuste-to-bez-hesel-mily-marconi/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-19T22:00:10.000Z",
          "wordCount": 1413,
          "title": "Postřehy z bezpečnosti: zkuste to bez hesel, milý Marconi!",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/662/mobil-pocitac-1.jpg",
            "length": "40499",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15666",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Firefox Snap bude výchozím prohlížečem v Ubuntu 21.10. Kali Linux 2021.3 NetHunter běží na hodinkách TicWatch Pro. Společnost Jolla oznámila vydání nové verze operačního systému pro chytré telefony Sailfish OS 4.2.0 „Verla“.",
          "link": "https://www.root.cz/clanky/firefox-snap-bude-vychozi-v-ubuntu-kali-linux-na-hodinkach-ticwatch-pro/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-19T22:00:05.000Z",
          "wordCount": 1173,
          "title": "Firefox Snap bude v Ubuntu výchozí, Kali Linux na hodinkách TicWatch Pro",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/172/firefox-ubuntu-1.jpg",
            "length": "19494",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15669",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Objevily se podrobné informace o připravovaných procesorech z dílen firem Intel a AMD. Red Hat chce konečně pořádně vyřešit podporu HDR na linuxovém desktopu. Xiaomi má nový telefon 11T Pro s 108Mpix foťákem.",
          "link": "https://www.root.cz/clanky/red-hat-resi-hdr-v-linuxu-uniky-informaci-od-intelu-a-amd/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-18T22:00:10.000Z",
          "wordCount": 1367,
          "title": "Red Hat řeší HDR v Linuxu, úniky informací od Intelu a AMD",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/615/amd-epyc-64core-1.jpg",
            "length": "41676",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15653",
          "author": "redakce@root.cz (Root.cz: Petr Škuta)",
          "description": "Se značkou Tuxedo jsme se zde již párkrát setkali. Recenzí prošly dvě generace ultrabooků řady Infinity Book. Nyní ale na redakční stůl zamířil stroj ze zcela opačného spektra, a to herní Tuxedo Stellaris 15. Jak dopadl?",
          "link": "https://www.root.cz/clanky/kanon-na-vrabce-recenze-herniho-notebooku-tuxedo-stellaris-15/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-16T22:00:10.000Z",
          "wordCount": 2429,
          "title": "Kanón na vrabce: recenze herního notebooku Tuxedo Stellaris 15",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/237/tuxedo-stellaris-15-front-1.jpg",
            "length": "47745",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15617",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Kompresní formát ZIP je přes třicet let starý, přesto by mohl být i v současnosti pro někoho zajímavý. Podporuje několik kompresních algoritmů, které si zde postupně rozebereme a na závěr všechny srovnáme.",
          "link": "https://www.root.cz/clanky/kompresni-algoritmy-v-souborech-zip-deflate-implode-a-srovnani/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-15T22:00:10.000Z",
          "wordCount": 2782,
          "title": "Kompresní algoritmy v souborech ZIP: Deflate, Implode a srovnání",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/515/zip-zips-1.jpg",
            "length": "100710",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15665",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "Často se setkáme s požadavkem na umožnění zápisu výrazů do vstupních formulářových polí, pro použití výrazů v konfiguračních souborech atd. Lze to řešit vložením interpretru plnohodnotného jazyka, ale mnohdy stačí doménově specifický jazyk (DSL).",
          "link": "https://www.root.cz/clanky/jazyk-go-a-vyhodnocovani-vyrazu-v-dobe-behu-aplikace/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-15T22:00:05.000Z",
          "wordCount": 4080,
          "title": "Jazyk Go a vyhodnocování výrazů v době běhu aplikace",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/336/golang-1.jpg",
            "length": "23658",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "Root.cz - zprávičky",
      "feedUrl": "https://www.root.cz/rss/zpravicky/",
      "siteUrl": "https://www.root.cz/zpravicky/",
      "articles": [
        {
          "id": "www.root.cz-actuality-42841",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "V Linuxu 5.16 dojde ke změně v ovladači nct6775, který obstarává čtení dat ze senzorů mnohých základních desek značky ASUS. Ovladač dostane podporu přístupu k ASIC za použití funkcí ASUS WMI (desky od Asusteku nepoužívají standardní cestu přes ACPI, kterou ovladač disponuje již nyní). S úpravou pak logicky do jádra zamíří i podpora níže uvedeného seznamu základních desek:",
          "link": "https://www.root.cz/zpravicky/linux-5-16-prinese-podporu-senzoru-dalsich-zakladnich-desek-asus/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T06:00:00.000Z",
          "wordCount": 829,
          "title": "Linux 5.16 přinese podporu senzorů dalších základních desek ASUS",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/52/asus-rog-strix-x470-f-gaming-1.jpg",
            "length": "35903",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42840",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Na GIMP 3.0 si ještě chvíli počkáme, vezměmež tedy zavděk dalším, víceméně opravným vydání dva-desítkové řady. GIMP 2.10.28 totiž přináší solidní množství oprav.",
          "link": "https://www.root.cz/zpravicky/gimp-2-10-28-opravuje-dalsi-chyby/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T05:00:00.000Z",
          "wordCount": 805,
          "title": "GIMP 2.10.28 opravuje další chyby",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/158/gimp-2-10-20-1.jpg",
            "length": "50629",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42839",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Canonical rozhodl o prodloužení podpory starších LTS vydání operačního systému Ubuntu na 10 let od první vydané verze. To znamená, že řada Ubuntu 14.04 LTS „Trusty Tahr“ bude podporována až do dubna 2024 a řada Ubuntu 16.04 LTS „Xenial Xerus“ až do dubna 2026.",
          "link": "https://www.root.cz/zpravicky/podpora-ubuntu-14-04-lts-a-16-04-lts-se-prodluzuje-na-10-let/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-21T22:00:00.000Z",
          "wordCount": 960,
          "title": "Podpora Ubuntu 14.04 LTS a 16.04 LTS se prodlužuje na 10 let",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/223/ubuntu-14-04-esm-1.jpg",
            "length": "22623",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42842",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Laboratoře CZ.NIC vydaly další verzi mobilní Datovky (1.13.0). Kromě oprav nalezených chyb, jako jsou oprava chyby při načítání uložených informací o datovém trezoru nebo vypnutí upozornění na vypršení platnosti hesla, pokud je zvoleno přihlašování Mobilním klíčem, byl podobně jako v případě desktopové aplikace přidán výběr způsobu platby za odesílané poštovní datové zprávy, pokud má uživatel k dispozici více možností.",
          "link": "https://www.root.cz/zpravicky/nova-mobilni-datovka-nabizi-dalsi-zpusob-platby-za-odesilane-postovni-datove-zpravy/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-21T20:00:08.000Z",
          "wordCount": 761,
          "title": "Nová mobilní Datovka nabízí další způsob platby za odesílané poštovní datové zprávy",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/556/datovka-cz-nic-1.jpg",
            "length": "16539",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42838",
          "author": "redakce@root.cz (Root.cz: Ondřej Nový)",
          "description": "Celodenní soutěžní hackathon pro programátory od české technologické společnosti Seznam.cz zná své vítěze. Nejlepší výkon předvedl tým s názvem EasyPeasy.Net ve složení Tomáš Jurásek, Michal Mrnuštík, Michal Motyčka a Adam Jež (zleva).",
          "link": "https://www.root.cz/zpravicky/v-seznamackem-hackathonu-zvitezil-tym-easypeasy-net/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-21T10:06:05.000Z",
          "wordCount": 2128,
          "title": "V seznamáckém hackathonu zvítězil tým EasyPeasy.Net",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/417/hackaton-seznam-cz-2021-1.jpg",
            "length": "67345",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42837",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Kolegové ze serveru Cnews.cz otestovali pět terabajtových SSD pro rozhraní PCIe 4.0. Konkrétně šlo o disky značek WD, Samsung, Adata, Seagate a Aorus, jejichž cena se pohybuje okolo 5500 Kč. Testován byl výkon po připojení na novou sběrnici PCIe 4.0, ale zároveň i ve zpětně kompatibilní PCIe 3.0.",
          "link": "https://www.root.cz/zpravicky/test-terabajtovych-ssd-pro-rozhrani-pcie-4-0-od-wd-samsung-adata-seagate-aorus/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-21T06:34:23.000Z",
          "wordCount": 1847,
          "title": "Test terabajtových SSD pro rozhraní PCIe 4.0 od WD, Samsung, Adata, Seagate, Aorus",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/282/ssd-1.jpg",
            "length": "64824",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42836",
          "author": "redakce@root.cz (Root.cz: Ondřej Caletka)",
          "description": "Chcete-li vytvořit bitovou kopii souborového systému, asi není úplně dobrý nápad používat nástroje jako dd, je-li disk zároveň připojen. Vytváření obrazu bude určitou dobu trvat a pokud se během této doby na disk zapisuje, bude výsledný obraz velmi poškozený.",
          "link": "https://www.root.cz/zpravicky/hot-clone-nastroj-umoznujici-ziskat-obraz-pripojeneho-disku/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T14:58:07.000Z",
          "wordCount": 804,
          "title": "Hot-clone: nástroj umožňující získat obraz připojeného disku",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/508/hdd-pevny-disk-1.jpg",
            "length": "27164",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42835",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "SMB3 server implementovaný v jádře s názvem KSMBD, za kterým stojí Samsung, se dostal do jádra 5.15. To ještě ani nevyšlo a už se v KSMBD objevila závažná zranitelnost, kdy pomocí znaků .. v cestě je možné přistupovat k souborům mimo sdílené adresáře.",
          "link": "https://www.root.cz/zpravicky/smb3-server-v-jadre-5-15-ksmbd-uz-ma-prvni-vaznou-opravu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T14:22:13.000Z",
          "wordCount": 4076,
          "title": "SMB3 server v jádře 5.15 KSMBD už má první vážnou opravu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/567/linux-windows-tux.png",
            "length": "121771",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42834",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Fedora 35 beta by měla vyjít každým dnem. Ostrá verze se očekává 19. října, nebo o týden později. Na serveru mojefedora.cz vyšel dnes článek shrnující novinky očekávané ve Fedoře 35 Workstation.",
          "link": "https://www.root.cz/zpravicky/co-ocekavame-ve-fedore-35/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T14:06:01.000Z",
          "wordCount": 769,
          "title": "Co očekáváme ve Fedoře 35",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/682/fedora-1.jpg",
            "length": "24750",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42833",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Edward Snowden se minulý týden na Twitteru vyjádřil, že nedporučuje používat ExpressVPN. Důvodem je, že bývalý CIO ExpressVPN Daniel Gericke spolu s dalšími dvěma bývalými zaměstnanci NSA pracovali jako nájemní hackeři mezi lety 2016 a 2019 pro firmu DarkMatter ve Spojených arabských emirátech. Za porušení exportních zákonů, jim soud uložil pokutu více jak 1,5 milionů dolarů. Navíc dostali doživotní zákaz bezpečnostní prověrky.",
          "link": "https://www.root.cz/zpravicky/edward-snowden-nedporucuje-pouzivat-expressvpn/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T09:13:40.000Z",
          "wordCount": 2002,
          "title": "Edward Snowden nedoporučuje používat ExpressVPN",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/683/edward-snowden-1.jpg",
            "length": "33281",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-40574",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Linuxových systémů přibývá, každý den se spouštějí nové servery a někdo se o ně musí starat. To znamená spoustu různých dovedností specifických právě pro linuxové prostředí. Jak to zprovoznit, kudy bezpečně dovnitř, co tam najdeme, jak se o to postaráme a jak to nastavíme nebo rozšíříme.",
          "link": "https://www.root.cz/zpravicky/naucte-se-pouzivat-linux-spravne-a-bezpecne-online-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T07:38:28.000Z",
          "wordCount": 752,
          "title": "Naučte se používat Linux správně a bezpečně (online školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/440/skoleni-1.jpg",
            "length": "61676",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42832",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Vývojář jádra Jens Axboe si minulý čtvrtek postěžoval na Lenovo X1 Carbon Gen 9, protože mu při paralelním překladu jádra ( make -j4) notebook sníží frekvenci procesoru až na 400 MHz a stane se prakticky nepoužitelný. Jde o thermal throttling, který má zabránit přehřívání čím dál tenčích a lehčích notebooků.",
          "link": "https://www.root.cz/zpravicky/jak-zabranit-castemu-snizovani-frekvence-u-notebooku/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T06:48:30.000Z",
          "wordCount": 981,
          "title": "Jak zabránit častému snižování frekvence u notebooků",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/230/fedora-lenovo-thinkpad-x1-carbon-1.jpg",
            "length": "33800",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42831",
          "author": "redakce@root.cz (Root.cz: Calculon)",
          "description": "Byla vydána verze 0.5.0 jazyka Idris 2. Z větších změn lze zmínit přidání inkrementálního překladu a zrychlení typové kontroly omezením redukcí v době překladu.",
          "link": "https://www.root.cz/zpravicky/nova-verze-jazyka-idris-2-pridava-inkrementalni-preklad-a-zrychluje-typovou-kontrolu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-19T19:23:50.000Z",
          "wordCount": 727,
          "title": "Nová verze jazyka Idris 2 přidává inkrementální překlad a zrychluje typovou kontrolu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/388/idris-1.jpg",
            "length": "21059",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42829",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Od 23. do 25. září bude probíhat online konference LibreOffice 2021. Během tří dnů je připraveno okolo padesáti přednášek, workshopů a komunitních setkání s tématy týkající se kancelářského balíku, komunity a open source.",
          "link": "https://www.root.cz/zpravicky/online-konference-libreoffice-2021/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-18T10:47:18.000Z",
          "wordCount": 726,
          "title": "Online konference LibreOffice 2021",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/534/libreoffice-1.jpg",
            "length": "14082",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42828",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Český LibreOffice tým vydává překlad příručky LibreOffice Impress 7.0. Tato příručka je určena pro začátečníky i pokročilé uživatele aplikace Impress, prezentační komponenty v LibreOffice. S její pomocí můžete vytvářet snímky, které obsahují text, číslované a odrážkové seznamy, tabulky, grafy, videoklipy, kliparty a další objekty. Impress přichází s předdefinovanými textovými styly a předlohami snímků; můžete si také vytvořit vlastní. Příručka je ke stažení na stránce dokumentace. Tým nyní pracuje na překladu příruček Draw a Base.",
          "link": "https://www.root.cz/zpravicky/cesky-preklad-prirucky-libreoffice-impress-7-0/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-18T06:12:43.000Z",
          "wordCount": 747,
          "title": "Český překlad příručky LibreOffice Impress 7.0",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/534/libreoffice-1.jpg",
            "length": "14082",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42827",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "ČTÚ má nový měřič rychlosti připojení k internetu NetTest. Starý NetMetr bude dál fungovat pod CZ.NIC. NetTest nabízí testování jen přes webové rozhraní, NetMetr měl i mobilní aplikace. NetTest je stejně jako NetMetr založen na open-source řešení rakouského telekomunikačního regulátora RTR. Licence NetTestu by měla být Apache 2.0, ale kód zatím zveřejněn nebyl.",
          "link": "https://www.root.cz/zpravicky/ctu-ma-novy-certifikovany-meric-rychlosti/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-17T15:58:20.000Z",
          "wordCount": 2053,
          "title": "ČTÚ má nový certifikovaný měřič rychlosti NetTest",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/430/tachometr-1.jpg",
            "length": "31442",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42826",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Mozilla a Canonical se dohodly, že Firefox bude v příštím vydání Ubuntu 21.10 dostupný jen jako balíček snap a ne jako doposud balíček deb. Výhodou je, že snap bude vytvářet přímo Mozilla a aktualizovaný Firefox bude tedy dostupný hned v den vydání. V současnosti Canonicalu trvá několik dní vyrobit deb balíček. Snap bude dostupný pro architektury amd64, arm64 a armhf.",
          "link": "https://www.root.cz/zpravicky/firefox-bude-v-ubuntu-21-10-jako-snap/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-17T10:50:03.000Z",
          "wordCount": 4440,
          "title": "Firefox bude v Ubuntu 21.10 jako snap",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/203/firefox-se-vzhledem-proton-1.png",
            "length": "134604",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-41285",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "VPN umožňuje bezpečně propojit různá zařízení pomocí šifrovaných tunelů. Umožňuje také zapojit uživatele do vnitřní sítě přes zabezpečený přístupový bod. Na našem školení VPN a bezpečné připojení k síti s OpenVPN si prakticky ukážeme, jak to celé nastavit a zprovoznit.",
          "link": "https://www.root.cz/zpravicky/vytvorte-si-bezpecnou-vpn-pomoci-openvpn-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-17T07:26:02.000Z",
          "wordCount": 734,
          "title": "Vytvořte si bezpečnou VPN pomocí OpenVPN (školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/102/openvpn-logo-1.jpg",
            "length": "18777",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42825",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "AMC Theaters je největším řetězcem kin na světě, má v Evropě 358 kin a v USA 620. Novinka se však týká jen kin v USA. Před měsícem bylo oznámeno, že do konce tohoto roku bude možné online platit lístky a předplatné pomocí Bitcoinu.",
          "link": "https://www.root.cz/zpravicky/v-kinech-amc-bude-mozne-platit-cryptomenami/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-17T06:40:10.000Z",
          "wordCount": 764,
          "title": "V kinech AMC bude možné platit kryptoměnami"
        },
        {
          "id": "www.root.cz-actuality-42824",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "V Londýně včera ve věku 81 let zemřel Sir Clive Sinclair, britský vynálezce a podnikatel. Známý je především jako tvůrce domácích počítačů ZX Spectrum. O jeho odchodu informoval britský deník The Guardian, s odkazem na informace od dcery Belindy. Příčinou jeho smrti byla dlouhodobá nemoc.",
          "link": "https://www.root.cz/zpravicky/zemrel-sir-clive-sinclair-tvurci-zx-spectra-bylo-81-let/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-17T06:04:37.000Z",
          "wordCount": 1945,
          "title": "Zemřel Sir Clive Sinclair, tvůrci ZX Spectra bylo 81 let",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/460/zx-spectrum-1.jpg",
            "length": "91866",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42821",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Útočníci na internetu vytrvale hledají nové způsoby, jak nelegálně vydělat peníze. Poznatky Cisco Talos ukazují, že stále častěji se tak děje na platformách, které umožňují sdílení síťového provozu, zvaných proxyware, jako jsou Honeygain, IPRoyal Pawns, Nanowire, Peer2Profit nebo PacketStream. Ty ve špatných rukou umožňují využívat konektivitu uživatelů bez jejich vědomí, protože běží na pozadí na infikovaném zařízení.",
          "link": "https://www.root.cz/zpravicky/novy-typ-kybernetickeho-utoku-zneuzitim-platforem-proxyware/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-16T12:28:08.000Z",
          "wordCount": 985,
          "title": "Nový typ kybernetického útoku: zneužitím platforem proxyware",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/165/hacker-call-telefon-podvod-1.jpg",
            "length": "37190",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42820",
          "author": "redakce@root.cz (Root.cz: PeoplePath)",
          "description": "Dne 29. září 2021 od 18:00 společnost PeoplePath pořádá IT workshop s názvem PHP FFI aneb proč (ne)volat C kód z vašich webovek. Akce se koná v salonku v restauraci U Salzmannů v Plzni. Drobné občerstvení a pivo jsou samozřejmostí a vstupné je zdarma.",
          "link": "https://www.root.cz/zpravicky/itworkshop-v-plzni-php-ffi-aneb-proc-ne-volat-c-kod-z-vasich-webovek/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-16T08:31:01.000Z",
          "wordCount": 842,
          "title": "ITWorkshop v Plzni: PHP FFI aneb proč (ne)volat C kód z vašich webovek",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/602/workshop-meeting-konference-setkani-1.jpg",
            "length": "63051",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42819",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Společnost Intel připravuje do Linuxu zajímavou inovaci pro své platformy. První patche už do jádra zamířily a až se vše podaří dotáhnout do konce, bude možné na strojích Intel aktualizovat firmwary (zejména UEFI) bez nutnosti restartu stroje. Vše proběhne v rámci aktuálního běhu operačního systému.",
          "link": "https://www.root.cz/zpravicky/intel-seamless-update-aktualizace-uefi-bez-restartu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-15T07:00:00.000Z",
          "wordCount": 1905,
          "title": "Intel Seamless Update: aktualizace UEFI bez restartu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/640/intel-xeon-ice-lake-1.jpg",
            "length": "45315",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-38836",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Automatizace pomocí continuous integration přímo v Gitlabu. CI vám pomůže automatizovat rutinní procesy a ušetří vám hromadu času. Pomůže vám od automatického testování, buildy po nasazování. Chcete vědět víc? Přijďte na naše školení, které se uskuteční 29. září a proběhne plně online. Školí Ondřej Sika.",
          "link": "https://www.root.cz/zpravicky/gitlab-ci-automatizujte-primo-v-gitlabu-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-15T06:39:09.000Z",
          "wordCount": 730,
          "title": "Gitlab CI: automatizujte přímo v Gitlabu (školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/214/gitlab-ci-1.png",
            "length": "75559",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42818",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Na světě je nová hlavní verze Javy, resp. číselně stejná verze balíku OpenJDK. Sedmnáctka přináší několik novinek, například novou renderovací pipeline pro macOS (používá API Metal, OpenGL končí), podporu portu pro Apple M1, vylepšené pseudo-náhodné generátory čísel, označení Java Applet API za zastralé (naplánováno je odstranění), podpory sealed classes, odstranění experimentální kompilace ahead-of-time (AOT) a just-in-time (JIT), o další krok posunutých prací na Java Vector API či práce na context-specific deserializačních filtrech.",
          "link": "https://www.root.cz/zpravicky/java-17-a-openjdk-17-s-hotovym-maturing-vector-api-a-planovanym-koncem-applet-api/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-15T05:00:00.000Z",
          "wordCount": 13885,
          "title": "Java 17 a OpenJDK 17 s hotovým Vector API a plánovaným koncem Applet API",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/253/java-kava-na-drevu-1.jpg",
            "length": "50247",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "abclinuxu - aktuální články",
      "feedUrl": "http://www.abclinuxu.cz/auto/abc.rss",
      "siteUrl": "http://www.abclinuxu.cz/clanky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-komunikace-ma-zvysovat-produktivitu-vyvojaru",
          "author": "Redakce",
          "description": "Hlavní trendy umělé inteligence: Malá a rozprostřená data. Nový typ kybernetických útoků – zneužívání proxyware platforem. Roboti, kteří udělají přesnou díru do hlavy, zachraňují životy. O vstupu do nebe rozhoduje sv. Petr, pro síť je tu ClearPass. Kouzla zbavené? Nepravděpodobné řešení hrozící personální krize ve finančních službách. Honeywell u nás investuje do R&D. Komunikace má zvyšovat produktivitu vývojářů.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-komunikace-ma-zvysovat-produktivitu-vyvojaru",
          "publishedOn": "2021-09-19T22:01:00.000Z",
          "wordCount": 1789,
          "title": "Týden na ITBiz: Komunikace má zvyšovat produktivitu vývojářů"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-prepinane-zrcadlo-z-roztaveneho-kovu",
          "author": "Redakce",
          "description": "Černá díra vyžrala hvězdu. Nanotechnologie s černým oxidem titaničitým. Život v atmosféře subneptunů. Maličké hory na neutronových hvězdách.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-prepinane-zrcadlo-z-roztaveneho-kovu",
          "publishedOn": "2021-09-18T22:01:00.000Z",
          "wordCount": 1596,
          "title": "Týden na ScienceMag.cz: Přepínané zrcadlo z roztaveného kovu"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-37-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-37-2021",
          "publishedOn": "2021-09-17T22:01:00.000Z",
          "wordCount": 2597,
          "title": "Událo se v týdnu 37/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/goodoffer24-dozivotni-licence-windows-10-pouze-za-12-super-slevy-az-91",
          "author": "Reklama",
          "description": "Pořiďte si doživotní aktivační klíč k Windows 10 za 12,52 EUR na prodejním portálu GoodOffer24.com. Kromě toho nástrojů produktivity od Microsoftu zde lze získat i hry a další software. Nezapomeňte zadat před dokončením nákupu slevový kód  AX30.",
          "link": "http://www.abclinuxu.cz/clanky/goodoffer24-dozivotni-licence-windows-10-pouze-za-12-super-slevy-az-91",
          "publishedOn": "2021-09-17T16:00:00.000Z",
          "wordCount": 1386,
          "title": "GoodOffer24: Doživotní licence Windows 10 pouze za 12 €, super slevy až 91%!"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/distribucni-novinky-34-35-2021",
          "author": "Redakce",
          "description": "Závěr letních prázdnin a začátek školního roku přinesly několik významných vydání, LibreELEC s novým Kodi, příručky Linux From Scratch nebo novou stabilní větev OpenWrt, a také aktualizace Clonezilly, Ubuntu LTS, EndeavourOS či EasyOS.",
          "link": "http://www.abclinuxu.cz/clanky/distribucni-novinky-34-35-2021",
          "publishedOn": "2021-09-13T23:00:00.000Z",
          "wordCount": 1659,
          "title": "Distribuční novinky 34-35/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-sprava-a-analyza-dat-tlaci-podniky-do-cloudu",
          "author": "Redakce",
          "description": "Lenovo představuje hybridní tablety budoucnosti. Canon rozšiřuje nabídku A3 multifunkcí pro hybridní pracovní prostředí. Správa a analýza dat tlačí podniky do cloudu.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-sprava-a-analyza-dat-tlaci-podniky-do-cloudu",
          "publishedOn": "2021-09-12T22:01:00.000Z",
          "wordCount": 1367,
          "title": "Týden na ITBiz: Správa a analýza dat tlačí podniky do cloudu"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-dokazali-prepnout-vodivost-z-2d-na-1d",
          "author": "Redakce",
          "description": "Topologické izolátory. Janusovský grafen a baterie. Zachycen nový typ gravitačních vln. Dvojvrstvý borofen. Hledání mimozemských civilizací. Dysonovy sféry u černých děr. Planeta Devět. Oblečení z umělých svalových vláken.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-dokazali-prepnout-vodivost-z-2d-na-1d",
          "publishedOn": "2021-09-11T22:01:00.000Z",
          "wordCount": 1610,
          "title": "Týden na ScienceMag.cz: Dokázali přepnout vodivost z 2D na 1D"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-36-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-36-2021",
          "publishedOn": "2021-09-10T22:01:00.000Z",
          "wordCount": 2267,
          "title": "Událo se v týdnu 36/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/originalni-dozivotni-aktivacni-klic-windows-10-pro-za-pouhych-12-52-eur-odgoodoffer24.com",
          "author": "Reklama",
          "description": "Získejte doživotní aktivační klíč k Windows 10 za 12,52 EUR na prodejním portálu GoodOffer24.com. Kromě toho zde můžete získat mnohem více, od dalších nástrojů produktivity od Microsoftu, až po hry. Nezapomeňte zadat před dokončením nákupu slevový kód  AX30.",
          "link": "http://www.abclinuxu.cz/clanky/originalni-dozivotni-aktivacni-klic-windows-10-pro-za-pouhych-12-52-eur-odgoodoffer24.com",
          "publishedOn": "2021-09-10T20:30:00.000Z",
          "wordCount": 1398,
          "title": "Originální doživotní aktivační klíč Windows 10 Pro za pouhých 12,52 EUR od Goodoffer24.com"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/jaderne-noviny-prehled-za-srpen-2021",
          "author": "Redakce",
          "description": "Přehled srpnových vydání Jaderných novin: stav vydání jádra, citáty týdne a seznam článků týkajících se jádra.",
          "link": "http://www.abclinuxu.cz/clanky/jaderne-noviny-prehled-za-srpen-2021",
          "publishedOn": "2021-09-06T22:01:00.000Z",
          "wordCount": 2061,
          "title": "Jaderné noviny – přehled za srpen 2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-co-prozradi-mys",
          "author": "Redakce",
          "description": "Grafen vrací do hry pevné disky, hustota dat může vzrůst až 10krát. Hlavní chyby digitální transformace. Kontejnery jsou klíčová technologie při vývoji podnikových aplikací. Co prozradí myš.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-co-prozradi-mys",
          "publishedOn": "2021-09-05T22:01:00.000Z",
          "wordCount": 1345,
          "title": "Týden na ITBiz: Co prozradí myš"
        }
      ]
    },
    {
      "title": "abclinuxu - čerstvé zprávičky",
      "feedUrl": "http://www.abclinuxu.cz/auto/zpravicky.rss",
      "siteUrl": "http://www.abclinuxu.cz/zpravicky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/zpravicky/canonical-prodlouzil-podporu-ubuntu-14.04-a-16.04-na-10-let",
          "author": "Ladislav Hagara",
          "description": "Canonical prodloužil podporu Ubuntu 14.04 LTS (Trusty Tahr) a 16.04 LTS (Xenial Xerus) na 10 let. Ubuntu 14.04 je tedy podporováno do dubna 2024 a Ubuntu 16.04 do dubna 2026.",
          "link": "http://www.abclinuxu.cz/zpravicky/canonical-prodlouzil-podporu-ubuntu-14.04-a-16.04-na-10-let",
          "publishedOn": "2021-09-22T01:58:03.000Z",
          "wordCount": 828,
          "title": "Canonical prodloužil podporu Ubuntu 14.04 a 16.04 na 10 let"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/ubuntu-touch-ota-19",
          "author": "Ladislav Hagara",
          "description": "UBports, nadace a komunita kolem Ubuntu pro telefony a tablety Ubuntu Touch (seznam podporovaných zařízení), vydala Ubuntu Touch OTA-19. Nejnovější verze je pořád založena na Ubuntu 16.04. Pracuje se na přechodu na Ubuntu 20.04.",
          "link": "http://www.abclinuxu.cz/zpravicky/ubuntu-touch-ota-19",
          "publishedOn": "2021-09-21T23:46:23.000Z",
          "wordCount": 816,
          "title": "Ubuntu Touch OTA-19"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/pash-paralelizace-skriptu-v-posix-shellech",
          "author": "Ladislav Hagara",
          "description": "Konsorcium Linux Foundation oznámilo, že bude hostovat projekt PaSh. Cílem PaSh je automatizovaná paralelizace skriptů v POSIX shellech.",
          "link": "http://www.abclinuxu.cz/zpravicky/pash-paralelizace-skriptu-v-posix-shellech",
          "publishedOn": "2021-09-21T18:49:31.000Z",
          "wordCount": 806,
          "title": "PaSh, paralelizace skriptů v POSIX shellech"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/arcan-jako-navrh-operacniho-systemu",
          "author": "Fluttershy, yay!",
          "description": "Bjorn Stahl v obsáhlém zápisku rozebírá architekturu alternativního grafického frameworku a serveru Arcan z pohledu návrhu operačního systému.",
          "link": "http://www.abclinuxu.cz/zpravicky/arcan-jako-navrh-operacniho-systemu",
          "publishedOn": "2021-09-21T18:15:13.000Z",
          "wordCount": 925,
          "title": "Arcan jako návrh operačního systému"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/gthumb-3.12",
          "author": "Ladislav Hagara",
          "description": "Byla vydána verze 3.12 prohlížeče obrázků gThumb (Wikipedie, GitLab). Z novinek lze zdůraznit například přidání podpory AVIF, HEIF a JPEG XL.",
          "link": "http://www.abclinuxu.cz/zpravicky/gthumb-3.12",
          "publishedOn": "2021-09-21T13:46:05.000Z",
          "wordCount": 796,
          "title": "gThumb 3.12"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/swift-5.5",
          "author": "Ladislav Hagara",
          "description": "Byla vydána nová verze 5.5 programovacího jazyka Swift (Wikipedie). Zdrojové kódy jsou k dispozici na GitHubu. Ke stažení jsou oficiální binární balíčky pro Ubuntu 16.04, Ubuntu 18.04, Ubuntu 20.04, CentOS 7, CentOS 8 a Amazon Linux 2.",
          "link": "http://www.abclinuxu.cz/zpravicky/swift-5.5",
          "publishedOn": "2021-09-21T10:11:14.000Z",
          "wordCount": 815,
          "title": "Swift 5.5"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/linux-plumbers-conference-2021-lpc-2021",
          "author": "Ladislav Hagara",
          "description": "Do pátku probíhá konference vývojářů Linuxu aneb linuxových instalatérů Linux Plumbers Conference 2021 (LPC 2021). Přednášky lze sledovat online.",
          "link": "http://www.abclinuxu.cz/zpravicky/linux-plumbers-conference-2021-lpc-2021",
          "publishedOn": "2021-09-20T22:25:08.000Z",
          "wordCount": 840,
          "title": "Linux Plumbers Conference 2021 (LPC 2021)"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/nsxiv-27.1",
          "author": "Ladislav Hagara",
          "description": "Prohlížeč obrázků nsxiv (Neo (or New or Not) Simple (or Small or Suckless) X Image Viewer) byl vydán ve verzi 27.1. Jedná se o fork již nevyvíjeného prohlížeče obrázku sxiv. Přehled novinek v CHANGELOGu.",
          "link": "http://www.abclinuxu.cz/zpravicky/nsxiv-27.1",
          "publishedOn": "2021-09-20T21:14:44.000Z",
          "wordCount": 812,
          "title": "nsxiv 27.1"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/co-noveho-prinese-fedora-workstation-35",
          "author": "Ladislav Hagara",
          "description": "MojeFedora.cz informuje co nového přinese Fedora Workstation 35: Lepší podpora Waylandu pod ovladačem od NVidie, režim pro kiosky, myši s vysokým rozlišením, PipeWire, podpora zatemňovacích obrazovek, OpenGL nad Vulkanem a profily napájení.",
          "link": "http://www.abclinuxu.cz/zpravicky/co-noveho-prinese-fedora-workstation-35",
          "publishedOn": "2021-09-20T19:34:36.000Z",
          "wordCount": 940,
          "title": "Co nového přinese Fedora Workstation 35"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/retroarch-1.9.10",
          "author": "Ladislav Hagara",
          "description": "Byla vydána nová verze 1.9.10 multiplatformního frontendu k emulátorům, herním enginům a multimediálním přehrávačům RetroArch (Wikipedie). Přehled novinek v příspěvku na blogu. RetroArch je nově k dispozici také na Steamu.",
          "link": "http://www.abclinuxu.cz/zpravicky/retroarch-1.9.10",
          "publishedOn": "2021-09-20T09:02:32.000Z",
          "wordCount": 804,
          "title": "RetroArch 1.9.10"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.2.2",
          "author": null,
          "description": "Mesa point releases generally come every two weeks but for the past month have fallen off the wagon. Mesa 21.2.1 came in mid-August and on Tuesday was finally succeeded by Mesa 21.2.2 as a \"late and very large\" update...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.2.2",
          "publishedOn": "2021-09-22T04:00:00.000Z",
          "wordCount": 892,
          "title": "Mesa 21.2.2 Released \"Late & Very Large\""
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=X.Org-Server-21.1-RC1",
          "author": null,
          "description": "More than three years after X.Org Server 1.20 was released, it's set to finally be succeeded soon by X.Org Server 21.1 under its new versioning scheme. Out today is the X.org Server 21.1 release candidate...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=X.Org-Server-21.1-RC1",
          "publishedOn": "2021-09-21T22:55:00.000Z",
          "wordCount": 909,
          "title": "X.Org Server 21.1 RC1 Released With VRR Support For Modesetting Driver, Other Features"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMDGPU-Device-Enumeration-IP",
          "author": null,
          "description": "AMD's open-source Linux graphics driver engineers are working to overhaul how the initial driver loading with device enumeration happens to ultimately make it more robust. In the process though PCI IDs become less important and in turn less of an avenue for exposing possible indicators of new graphics cards...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMDGPU-Device-Enumeration-IP",
          "publishedOn": "2021-09-21T21:00:00.000Z",
          "wordCount": 1125,
          "title": "AMDGPU Linux Driver To Overhaul Its Approach To Device Enumeration"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Blender-3.0-Lands-Cycles-X",
          "author": null,
          "description": "Cycles X as a modernizing of Blender's Cycles rendering engine has now landed in the latest development code for Blender 3.0. Cycles X brings big performance improvements but does eliminate OpenCL support in the process...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Blender-3.0-Lands-Cycles-X",
          "publishedOn": "2021-09-21T19:33:07.000Z",
          "wordCount": 987,
          "title": "Cycles X Merged Into Blender 3.0 With NVIDIA CUDA/OptiX Support, AMD HIP Pending"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Chrome-94-Released",
          "author": null,
          "description": "Chrome 94 is available today as another exciting update for Google's web browser...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Chrome-94-Released",
          "publishedOn": "2021-09-21T18:48:29.000Z",
          "wordCount": 872,
          "title": "Chrome 94 Released With WebGPU For Testing, WebCodecs API Now Official"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GNU-Profiler-gprofng",
          "author": null,
          "description": "Oracle engineers have been working on \"gprofng\" as a next-generation GNU Profiler that can analyze production binaries. Oracle talked up Gprofng today during the GNU Tools Track as part of Linux Plumbers Conference 2021...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GNU-Profiler-gprofng",
          "publishedOn": "2021-09-21T18:21:41.000Z",
          "wordCount": 814,
          "title": "Oracle's Next-Generation GNU Profiler \"gprofng\" Is Looking Great For Developers"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Foundation-PaSh",
          "author": null,
          "description": "The Linux Foundation announced today they will be hosting the PaSh project that is focused on automatically parallelizing POSIX shell scripts...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Foundation-PaSh",
          "publishedOn": "2021-09-21T17:16:59.000Z",
          "wordCount": 772,
          "title": "Linux Foundation To Host PaSh For Automatic Parallelizing Of Shell Scripts"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Samba-4.15",
          "author": null,
          "description": "While there is now KSMBD with Linux 5.15 for offering an in-kernel SMB file server, its scope is much more limited than that of the Samba project in user-space. With that said, Samba 4.15 is out now with its latest batch of features and improvements for open-source SMB/CIFS support on Linux and other platforms...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Samba-4.15",
          "publishedOn": "2021-09-21T12:40:31.000Z",
          "wordCount": 870,
          "title": "Samba 4.15 Released With Improved CLI Experience, Modernized VFS Interface"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-14.04-16.04-Ten-Years",
          "author": null,
          "description": "Canonical is announcing this morning they are extending the Ubuntu 14.04 LTS \"Trusty Tahr\" and Ubuntu 16.04 LTS \"Xenial Xerus\" releases to a ten year lifespan...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-14.04-16.04-Ten-Years",
          "publishedOn": "2021-09-21T12:00:00.000Z",
          "wordCount": 868,
          "title": "Canonical Extending Ubuntu 14.04/16.04 LTS Support To Ten Years"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Vulkan-Video-XDC2021",
          "author": null,
          "description": "Going public back in April was the provisional specification around the Vulkan Video extensions as a new industry-standard video encode/decode interface. While several months have passed, there hasn't been much activity yet in the open-source space around Vulkan Video...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Vulkan-Video-XDC2021",
          "publishedOn": "2021-09-21T10:33:48.000Z",
          "wordCount": 810,
          "title": "Vulkan Video Decoding Still In The Early Stages For Open-Source"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-RADV-Ray-Tracing",
          "author": null,
          "description": "Landing overnight into Mesa 21.3 was experimentally enabling the Vulkan ray-tracing extensions within the open-source Radeon \"RADV\" driver...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-RADV-Ray-Tracing",
          "publishedOn": "2021-09-21T09:25:36.000Z",
          "wordCount": 820,
          "title": "Mesa 21.3 Lands Initial Radeon Ray-Tracing Support In Open-Source RADV Vulkan Driver"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Extending-DWARF-GPUs",
          "author": null,
          "description": "In addition to AMD's increasing Linux kernel contributions, they are also contributing more improvements in user-space too thanks to their super-computing wins and other big enterprise deployments that are Linux-based. One of the areas talked about this week at the Linux Plumbers Conference with the GNU Tools track is how they are working to extend the DWARF debug format to better handle GPU debugging...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Extending-DWARF-GPUs",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 882,
          "title": "AMD Extending DWARF To Better Handle GPU Debugging, Continues Collaborating With GCC & LLVM"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Oktoberfest-2021-Special",
          "author": null,
          "description": "While Oktoberfest was once again cancelled due to the COVID-19 pandemic (then again, due to the state of the ad industry / ad-block users we haven't had any European meet-up / open-source gathering in years), the wiesn would have kicked off this past weekend. So as is tradition, there is the Phoronix Premium Oktoberfest sale where you can join the ad-free service as a reduced rate. If you enjoy the daily, original Linux and open-source content on Phoronix with plenty of benchmarking, you can do so at a reduced rate...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Oktoberfest-2021-Special",
          "publishedOn": "2021-09-21T03:59:36.000Z",
          "wordCount": 1017,
          "title": "Phoronix Ad-Free/Premium Special For Oktoberfest 2021"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-ENQCMD-Restoring-Patches",
          "author": null,
          "description": "While Intel is normally quite good with their new hardware support being in good shape well ahead of launch, their new code for supporting the ENQCMD functionality for the Data Streaming Accelerator (DSA) with Xeon \"Sapphire Rapids\" has been an exception. This summer the mainline Linux kernel disabled ENQCMD support since the code was \"broken beyond repair\" while now Intel engineers have sent out a new series looking to get it re-enabled...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-ENQCMD-Restoring-Patches",
          "publishedOn": "2021-09-20T20:25:44.000Z",
          "wordCount": 870,
          "title": "Intel Posts New Linux Patches Looking To Re-Enable ENQCMD Ahead Of Sapphire Rapids"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=CUPS-2.4-Next-Year-Then-2.5-3.0",
          "author": null,
          "description": "An Open Printing micro-conference took place today during the Linux Plumbers Conference 2021 week. While it's hard to get excited about printers in 2021, it is exciting the renewed effort around CUPS with it now being back to effectively led by the community and CUPS founder Michael Sweet who left Apple. CUPS 2.4 is coming as the first feature release in quite a while and then CUPS 2.5 followed by CUPS 3.0 are already being talked about with features being discussed...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=CUPS-2.4-Next-Year-Then-2.5-3.0",
          "publishedOn": "2021-09-20T19:02:04.000Z",
          "wordCount": 996,
          "title": "CUPS 2.4 Coming Next Month, CUPS 2.5 + CUPS 3.0 Already In Planning"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=OpenVPN-DCO-Kernel",
          "author": null,
          "description": "OpenVPN has been implementing a kernel module for data channel offload (DCO) capabilities to enhance the performance of this virtual private network system...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=OpenVPN-DCO-Kernel",
          "publishedOn": "2021-09-20T18:31:55.000Z",
          "wordCount": 874,
          "title": "OpenVPN DCO Linux Kernel Module Aims To Offer Faster VPN Performance"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-470.74-Linux",
          "author": null,
          "description": "NVIDIA has released their latest 470 series Linux driver point release...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-470.74-Linux",
          "publishedOn": "2021-09-20T13:47:07.000Z",
          "wordCount": 939,
          "title": "NVIDIA 470.74 Linux Driver Released With Several Fixes"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=DXVK-1.9.2-Released",
          "author": null,
          "description": "DXVK 1.9.2 is out as the newest version of this key library necessary to the success of Valve's Steam Play (Proton) by translating Direct3D 9/10/11 calls to Vulkan for a much more performant Windows gaming experience on Linux...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=DXVK-1.9.2-Released",
          "publishedOn": "2021-09-20T13:36:52.000Z",
          "wordCount": 989,
          "title": "DXVK 1.9.2 Released With More Games In Better Shape"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Rust-Adds-Motorola-M68k",
          "author": null,
          "description": "With the m68k community continuing to be active around supporting the vintage Motorola 68000 series with modern open-source software, Rust has now merged support for these old processors...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Rust-Adds-Motorola-M68k",
          "publishedOn": "2021-09-20T13:02:30.000Z",
          "wordCount": 731,
          "title": "Rust Lands Support For The Motorola 68000 Processors"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-ROCm-CRIU-XDC2021",
          "author": null,
          "description": "Earlier this year AMD went public with prototyping CRIU support for Radeon GPUs around ROCm to be able to checkpoint/freeze running compute workloads and to then restore them at a later point. This CRIU focus is driven by their big accelerator needs and forthcoming supercomputers for migrating workloads particularly within containers. AMD continues working on CRIU support for GPUs and last week provided an update on the project...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-ROCm-CRIU-XDC2021",
          "publishedOn": "2021-09-20T12:21:50.000Z",
          "wordCount": 899,
          "title": "AMD Continues CRIU Work To Checkpoint/Restore ROCm Compute Workloads"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-EC-Driven-Backlights",
          "author": null,
          "description": "NVIDIA is contributing a new open-source driver to the upstream Linux kernel for dealing with upcoming laptops where the backlight controls are handled by the device's embedded controller (EC)...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-EC-Driven-Backlights",
          "publishedOn": "2021-09-20T11:17:47.000Z",
          "wordCount": 783,
          "title": "NVIDIA Prepares The Linux Kernel For Future Laptops With EC-Driven Backlights"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Fedora-35-Great-Features-Coming",
          "author": null,
          "description": "Fedora Workstation 35 will hopefully be out at the end of October (currently the beta is running behind schedule) and when it does ship it's once again at the bleeding-edge of Linux features. Fedora Workstation 35 is shaping up to be another great release for those interested in a feature-rich desktop experience...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Fedora-35-Great-Features-Coming",
          "publishedOn": "2021-09-20T10:00:59.000Z",
          "wordCount": 1015,
          "title": "Red Hat's Upstream Contributions Are Making For A Great Fedora Workstation 35"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=xf86-input-libinput-1.2",
          "author": null,
          "description": "For those continuing to make use of the X.Org Server, xf86-input-libinput 1.2 is now available for integrating the latest functionality of libinput input handling library...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=xf86-input-libinput-1.2",
          "publishedOn": "2021-09-20T09:38:07.000Z",
          "wordCount": 786,
          "title": "xf86-input-libinput 1.2 Brings Touchpad Gestures, High Resolution Scrolling"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-rc2",
          "author": null,
          "description": "Linux 5.15-rc2 is now available as the latest weekly release candidate for this next version of the Linux kernel. Linux 5.15 in turn should be out as stable around the start of November...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-rc2",
          "publishedOn": "2021-09-20T00:48:15.000Z",
          "wordCount": 989,
          "title": "Linux 5.15-rc2 Released With Many Fixes, Addressing Issues Raised By \"-Werror\""
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=HarfBuzz-3.0",
          "author": null,
          "description": "HarfBuzz 3.0 has been released as a new version of this widely-used, open-source text shaping library that is used by the major Linux desktop environments along with Chrome OS, Java, Android, Chrome, and a plethora of other software projects and UI toolkits...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=HarfBuzz-3.0",
          "publishedOn": "2021-09-19T20:11:39.000Z",
          "wordCount": 740,
          "title": "HarfBuzz 3.0 Released With Unicode 14.0 Support, More APIs Considered Stable"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=SMB3-File-Server-Security-Fix",
          "author": null,
          "description": "It was just a few weeks back that KSMBD was merged into Linux 5.15 while now it's seeing its first important security fix...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=SMB3-File-Server-Security-Fix",
          "publishedOn": "2021-09-19T17:05:25.000Z",
          "wordCount": 843,
          "title": "That Didn't Take Long: KSMBD In-Kernel File Server Already Needs Important Security Fix"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=ASUS-WMI-NCT6775",
          "author": null,
          "description": "With a change to the nct6775 hardware monitoring sensor driver, more ASUS motherboards should enjoy working sensor support come Linux 5.16...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=ASUS-WMI-NCT6775",
          "publishedOn": "2021-09-19T10:19:19.000Z",
          "wordCount": 875,
          "title": "Linux 5.16 To Support Sensor Readings On More ASUS Motherboards"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Jolla-Sailfish-OS-4.2",
          "author": null,
          "description": "Jolla this week released Sailfish OS 4.2 \"Verla\" as the newest version of this Linux-based smartphone operating system that continues to be made commercially available for various devices...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Jolla-Sailfish-OS-4.2",
          "publishedOn": "2021-09-19T09:53:59.000Z",
          "wordCount": 783,
          "title": "Jolla Releases Sailfish OS 4.2 For Continuing To Improve This Linux-Based Smartphone OS"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=SDL-Wayland-State-2021",
          "author": null,
          "description": "The recently released SDL 2.0.16 brought much-improved Wayland support but it's still not quite good enough yet to have it be the default over the SDL X11 path. However, developers continue working in that direction to eventually use it by default...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=SDL-Wayland-State-2021",
          "publishedOn": "2021-09-19T09:45:57.000Z",
          "wordCount": 833,
          "title": "SDL Still Has A Number Of Issues To Address Before Defaulting To Wayland"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Less-Broken-Jensen",
          "author": null,
          "description": "One has to wonder how much longer the Linux kernel will keep around some very old and known to be borked hardware support but at least for now the DECpc AXP 150 \"Jensen\" platform support is sticking around and with Linux 5.15 is no longer marked as \"broken\" outright...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Less-Broken-Jensen",
          "publishedOn": "2021-09-18T23:36:07.000Z",
          "wordCount": 894,
          "title": "Linux 5.15 Is Now Slightly Less Broken For The DEC Alpha \"Jensen\""
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30531",
          "author": null,
          "description": "As usual when the Linux 5.15 merge window began wrapping up, I set out to dive into its performance to see what is in store for this next version of the kernel and whether there was any regressions or other performance changes worth noting. Linux 5.15 overall has been in good shape for the \"-rc1\" state except noticing that code compilation workloads were taking longer on multiple Linux 5.15-rc1-running systems than Linux 5.14 or prior. Seeing it across multiple systems and a very real-world regression, it was worth bisecting and looking closer so here are the details.",
          "link": "https://www.phoronix.com/vr.php?view=30531",
          "publishedOn": "2021-09-16T11:00:00.000Z",
          "wordCount": 990,
          "title": "Running Linux 5.15-rc1 Causing A New Slowdown... Here's A Look"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30523",
          "author": null,
          "description": "While NVIDIA has been supporting Resizable BAR for a while now with their GeForce RTX 30 series graphics cards, for those exclusively using Linux it remains more of a challenge due to AIB partners generally not releasing any vBIOS updates for ReBAR support that can be easily applied under Linux. But if you do carry out an update -- such as under Windows -- the performance uplift can be worthwhile if using a game that can benefit from the support.",
          "link": "https://www.phoronix.com/vr.php?view=30523",
          "publishedOn": "2021-09-14T13:09:13.000Z",
          "wordCount": 871,
          "title": "NVIDIA RTX 30 Series Resizable BAR Support Continues Helping Performance On Linux"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/rss.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2518/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2518/",
          "publishedOn": "2021-09-20T04:00:00.000Z",
          "wordCount": 187,
          "title": "Lumpers and Splitters"
        },
        {
          "id": "https://xkcd.com/2517/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2517/",
          "publishedOn": "2021-09-17T04:00:00.000Z",
          "wordCount": 185,
          "title": "Rover Replies"
        },
        {
          "id": "https://xkcd.com/2516/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2516/",
          "publishedOn": "2021-09-15T04:00:00.000Z",
          "wordCount": 185,
          "title": "Hubble Tension"
        },
        {
          "id": "https://xkcd.com/2515/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2515/",
          "publishedOn": "2021-09-13T04:00:00.000Z",
          "wordCount": 185,
          "title": "Vaccine Research"
        }
      ]
    }
  ],
  "cliVersion": "1.11.1"
}