{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": [
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "author": null,
          "description": "Fixed: Unexpected nested element in author field crashes the parser\nThank you @ad-m",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "publishedOn": "2021-09-16T06:39:32.000Z",
          "wordCount": 343,
          "title": "v1.11.1"
        }
      ]
    },
    {
      "title": "Kotaku",
      "feedUrl": "https://kotaku.com/rss",
      "siteUrl": "https://kotaku.com",
      "articles": [
        {
          "id": "1847712534",
          "author": "Luke Plunkett",
          "description": "Crusader Kings II is a game with a long and proud tradition of “bugs that should be hung in the Louvre”, but I think this new one I’ve learned about today is my favourite.\n\nRead more...",
          "link": "https://kotaku.com/behold-my-new-favorite-crusader-kings-bug-1847712534",
          "publishedOn": "2021-09-21T01:30:00.000Z",
          "wordCount": 487,
          "title": "Behold, My New Favorite Crusader Kings Bug"
        },
        {
          "id": "1847712194",
          "author": "Luke Plunkett",
          "description": "Football is a game of inches, but it’s also a game of seconds, with clock management one of the most important skills in the game. That’s in the real world, anyway, where programming schedules and commercial breaks are a thing. In video games, as we’re about to find out, things can be different.\n\nRead more...",
          "link": "https://kotaku.com/the-quest-to-create-a-never-ending-play-in-madden-1847712194",
          "publishedOn": "2021-09-21T00:30:00.000Z",
          "wordCount": 434,
          "title": "The Quest To Create A Never-Ending Play In Madden"
        },
        {
          "id": "1847711923",
          "author": "Ian Walker",
          "description": "In early builds of the Xbox’s ToeJam & Earl III: Mission to Earth, the eponymous extra-terrestrials beat up a hooded member of the Ku Klux Klan as the final boss fight of the game. Previously we only had the developer’s word from an obscure interview, but now we can finally see it for ourselves thanks to the…\nRead more...",
          "link": "https://kotaku.com/toejam-earl-3s-original-final-boss-was-a-klansman-1847711923",
          "publishedOn": "2021-09-21T00:00:00.000Z",
          "wordCount": 733,
          "title": "ToeJam & Earl III's Original Final Boss Was A Klansman"
        },
        {
          "id": "1847711963",
          "author": "Luke Plunkett",
          "description": "Hello, and welcome to the year 2021, where fashion brand Balenciaga is selling hoodies on a dog in a video game, and you can buy the same hoodie in real life for $725.\nRead more...",
          "link": "https://kotaku.com/the-fortnite-x-balenciaga-collab-is-everything-the-game-1847711963",
          "publishedOn": "2021-09-20T23:30:00.000Z",
          "wordCount": 564,
          "title": "The Fortnite x Balenciaga Collab Is Everything The Game Deserves"
        },
        {
          "id": "1847710889",
          "author": "Zack Zwiezen",
          "description": "The U.S. Securities and Exchange Commission has reportedly launched a wide-reaching investigation into Activision Blizzard, with the government agency looking into how the embattled publisher handled the multiple allegations of sexual harassment, abuse, and toxic behavior that became public following a California…\nRead more...",
          "link": "https://kotaku.com/u-s-government-now-investigating-activision-blizzard-1847710889",
          "publishedOn": "2021-09-20T20:40:00.000Z",
          "wordCount": 679,
          "title": "U.S. Government Now Investigating Activision Blizzard, Bobby Kotick Subpoenaed"
        },
        {
          "id": "1847709985",
          "author": "Isaiah Colbert",
          "description": "Steam Next Fest, previously known as the Steam Game Festival, is a week-long event in which users can play demos and watch previews for upcoming games, chat with developers, and give feedback on new titles, is returning for another round this October. The demos will only be available to play during the week of the…\nRead more...",
          "link": "https://kotaku.com/heres-everything-you-can-play-during-steams-big-october-1847709985",
          "publishedOn": "2021-09-20T19:30:00.000Z",
          "wordCount": 855,
          "title": "Here's Everything You Can Play During Steam's Big October Event"
        },
        {
          "id": "1847709962",
          "author": "Jeremy Winslow",
          "description": "League of Legends players, particularly those who regularly leave their keyboards or an in-progress game, are about to get a harsh sentencing, as specified by an update headed to the popular MOBA.\n\nRead more...",
          "link": "https://kotaku.com/league-of-legends-will-now-discipline-afk-players-more-1847709962",
          "publishedOn": "2021-09-20T19:15:00.000Z",
          "wordCount": 610,
          "title": "League Of Legends Will Now Discipline AFK Players More Harshly"
        },
        {
          "id": "1847698124",
          "author": "Mike Pasquariello",
          "description": "It may not seem like it, but gaming is still in its infancy. Yes, we’re beaming games from $10,000 rigs through the cloud to our phones, and swinging around swords in room-scale wireless virtual reality. That’s some Ready Player One shit, for sure. But while the technology is progressing rapidly, the discourse…\nRead more...",
          "link": "https://kotaku.com/the-bioshock-problem-when-gameplay-and-narrative-clash-1847698124",
          "publishedOn": "2021-09-20T19:00:00.000Z",
          "wordCount": 868,
          "title": "The BioShock Problem: When Gameplay And Narrative Clash"
        },
        {
          "id": "1847709480",
          "author": "Ian Walker",
          "description": "Fighting games are tough even in the best of conditions, but what about competing in one during an earthquake?\n\nRead more...",
          "link": "https://kotaku.com/guilty-gear-player-wins-match-during-earthquake-1847709480",
          "publishedOn": "2021-09-20T18:45:00.000Z",
          "wordCount": 417,
          "title": "Guilty Gear Player Wins Match During Earthquake"
        },
        {
          "id": "1847709465",
          "author": "Zack Zwiezen",
          "description": "Eight years ago, the MMO Warhammer Online: Age of Reckoning shut down. But the fans of Warhammer Online won’t let the game die. A passionate team of fan developers has maintained an emulated version of the game on their own server since 2013. And they just announced they are adding new cities to the MMO, nearly a…\nRead more...",
          "link": "https://kotaku.com/warhammer-mmo-gets-unreleased-cities-nearly-a-decade-af-1847709465",
          "publishedOn": "2021-09-20T18:30:00.000Z",
          "wordCount": 547,
          "title": "Warhammer MMO Gets Unreleased Cities Nearly A Decade After It Shut Down"
        },
        {
          "id": "1847709260",
          "author": "Sisi Jiang",
          "description": "It’s been a rough week for anyone who’s looking forward to playing Kokomi, a new healer coming to Genshin Impact tomorrow. Ever since leakers revealed that her passive talent boosts her healing abilities in exchange for completely nuking her critical hit rate (severely limiting her ability to deal much damage…\nRead more...",
          "link": "https://kotaku.com/genshin-impact-character-that-isnt-even-out-yet-already-1847709260",
          "publishedOn": "2021-09-20T18:15:00.000Z",
          "wordCount": 744,
          "title": "Genshin Impact Character That Isn't Even Out Yet Already Causing Fan Turmoil"
        },
        {
          "id": "1847708898",
          "author": "Jeremy Winslow",
          "description": "Weapon durability in video games carries a semblance of realism, illustrating that nothing lasts forever no matter how well it’s built. Still, having my shiny new sword break in something like The Legend of Zelda: Breath of the Wild is some bullshit. It not only disrupts game flow when I’m pulling off a flashy combo,…\nRead more...",
          "link": "https://kotaku.com/action-game-shows-botw-up-has-a-great-weapon-durabilit-1847708898",
          "publishedOn": "2021-09-20T18:00:00.000Z",
          "wordCount": 918,
          "title": "Action Game Shows BotW Up, Has A Great Weapon Durability System"
        },
        {
          "id": "1847708974",
          "author": "Renata Price",
          "description": "Project Deluge, a video game archival project from The Hidden Palace, may be the single biggest game preservation effort yet undertaken. Since March, this dedicated group of video game archivists has been releasing many hundreds of unreleased prototypes for classic systems, and now, it’s the Dreamcast and Xbox’s turn.\nRead more...",
          "link": "https://kotaku.com/almost-500-new-xbox-dreamcast-prototypes-just-got-re-1847708974",
          "publishedOn": "2021-09-20T17:40:00.000Z",
          "wordCount": 848,
          "title": "Almost 500 ‘New’ Xbox, Dreamcast Prototypes Just Got Released"
        },
        {
          "id": "1847708431",
          "author": "Ethan Gach",
          "description": "Reports started to circulate last week that Detroit: Become Human developer, Quantic Dream, was working on an unlikely new project: a Star Wars game. While Kotaku can’t currently confirm if this is 100% accurate, we have heard something similar from an independent source with knowledge of the studio’s plans.\n\nRead more...",
          "link": "https://kotaku.com/what-we-ve-heard-about-a-quantic-dream-star-wars-game-1847708431",
          "publishedOn": "2021-09-20T16:50:00.000Z",
          "wordCount": 752,
          "title": "What We’ve Heard About A Quantic Dream Star Wars Game"
        },
        {
          "id": "1847708244",
          "author": "Ari Notis",
          "description": "Tales of Arise is a big RPG that likes to make every number go up—except for the amount in your bank account. In keeping with series tradition, Tales of Arise’s economy is based on gald, which is kind of, like, a play on “gold” but instead of an “o” they’ve...oh, you get it? Okay, cool. If you stick to the story,…\nRead more...",
          "link": "https://kotaku.com/how-to-get-rich-af-in-tales-of-arise-1847708244",
          "publishedOn": "2021-09-20T16:30:00.000Z",
          "wordCount": 1017,
          "title": "How To Get Rich AF In Tales Of Arise"
        },
        {
          "id": "1847708048",
          "author": "John Walker",
          "description": "Apex Legends players have been having a miserable time of late. When the game’s not being hacked by disgruntled Titanfall players, players sometimes devolve into having enormous fights over controversial in-game strategies, such as tap strafing. The latest grief to befall them is a whole new raft of connection issues,…\nRead more...",
          "link": "https://kotaku.com/apex-legends-servers-to-stay-borked-for-a-bit-1847708048",
          "publishedOn": "2021-09-20T15:50:00.000Z",
          "wordCount": 387,
          "title": "Apex Legends Servers To Stay Borked For A Bit"
        },
        {
          "id": "1847707680",
          "author": "Ethan Gach",
          "description": "It’s actually happening: The Pokémon Company is finally giving the world a straightforward way to play the Pokémon trading card game digitally, online, and on your smartphone. Announced today, the new app is called Pokémon TCG Live and it couldn’t be coming at a better time with the Pokémon card game once again…\nRead more...",
          "link": "https://kotaku.com/theres-a-new-and-free-digital-pokemon-card-game-comin-1847707680",
          "publishedOn": "2021-09-20T14:55:00.000Z",
          "wordCount": 573,
          "title": "There's A New (And Free) Digital Pokémon Card Game Coming"
        },
        {
          "id": "1847707051",
          "author": "Ari Notis",
          "description": "The Ascent is a modern game dev bingo card. First, it debuted at a splashy publisher event. Then, it was announced with a coveted November release date (and as a next-gen launch title, no less); then it was delayed. It was of course hyped as a day-one Game Pass title; and eventually, launched to critical praise—but…\nRead more...",
          "link": "https://kotaku.com/the-ascent-devs-dish-on-the-messy-launch-for-2021-s-bes-1847707051",
          "publishedOn": "2021-09-20T13:45:00.000Z",
          "wordCount": 1649,
          "title": "The Ascent Devs Dish On The Messy Launch For 2021’s Best Sci-Fi RPG"
        },
        {
          "id": "1847705910",
          "author": "Luke Plunkett",
          "description": "Mick McGinty, an artist responsible for many of the most memorable pieces of video game artwork from the 1990s, has died.\n\nRead more...",
          "link": "https://kotaku.com/rip-mick-mcginty-1847705910",
          "publishedOn": "2021-09-20T01:35:00.000Z",
          "wordCount": 382,
          "title": "RIP Mick McGinty"
        },
        {
          "id": "1847705716",
          "author": "Luke Plunkett",
          "description": "The last we saw of DeepFuckingValue, aka Roaring Kitty, aka Keith Gill, he was giving testimony to Congress and standing accused of market manipulation over his part in hyping up GameStop stocks earlier this year. Now his former employer, MassMutual, has been fined over Gill’s conduct while working there.\n\nRead more...",
          "link": "https://kotaku.com/mister-deepfuckingvalues-former-workplace-fined-over-me-1847705716",
          "publishedOn": "2021-09-20T00:10:00.000Z",
          "wordCount": 530,
          "title": "GameStonk Cheerleader's Former Workplace Fined Over Meme Stock Conduct"
        },
        {
          "id": "1847705621",
          "author": "Luke Plunkett",
          "description": "For the first time in years, I’ve been trying to play some serious Madden, and while I’m surprised to be enjoying myself quite a bit—taking a few seasons off annual sports games like this is good for that—I am very disappointed in one particularly weird hangup the game has with my name.\n\nRead more...",
          "link": "https://kotaku.com/madden-22-thinks-my-name-is-profanity-1847705621",
          "publishedOn": "2021-09-19T23:30:00.000Z",
          "wordCount": 636,
          "title": "Madden 22 Thinks My Name Is Profanity"
        },
        {
          "id": "1847705479",
          "author": "Zack Zwiezen",
          "description": "Lost Judgment is out later this week on PlayStation and Xbox. Don’t expect a PC release anytime soon...\nRead more...",
          "link": "https://kotaku.com/the-week-in-games-lost-judgment-is-out-soon-1847705479",
          "publishedOn": "2021-09-19T23:00:00.000Z",
          "wordCount": 518,
          "title": "The Week In Games: Lost Judgment Is Out Soon"
        },
        {
          "id": "1847705311",
          "author": "Zack Zwiezen",
          "description": "Nintendo’s famous Mario has a brother named Luigi and for some reason, the taller of the bros has been found in a prototype build of the Sega Dreamcast racing game Sega GT. Luigi was found in a prototype that’s part of a massive release of over 40o Xbox and Dreamcast prototypes and unreleased games.\nRead more...",
          "link": "https://kotaku.com/luigi-discovered-in-sega-dreamcast-prototype-1847705311",
          "publishedOn": "2021-09-19T21:45:00.000Z",
          "wordCount": 488,
          "title": "Luigi Discovered In Sega Dreamcast Prototype"
        },
        {
          "id": "1847705167",
          "author": "Zack Zwiezen",
          "description": "Splitgate was first released in 2019 and while it did well at first, it quickly dropped off the radar for most folks. But earlier this year the game made its leap to consoles and almost overnight became a massive success. Now the devs, with more money and investors, are excited about the future and have big plans for…\nRead more...",
          "link": "https://kotaku.com/splitgate-devs-say-popular-shooter-is-only-25-complete-1847705167",
          "publishedOn": "2021-09-19T20:30:00.000Z",
          "wordCount": 546,
          "title": "Splitgate Devs Say Popular Shooter Is Only '25% Complete'"
        },
        {
          "id": "1847704919",
          "author": "Zack Zwiezen",
          "description": "The internet’s mission to help LeVar Burton become the host of the long-running game show Jeopardy! has come to an end now that Burton himself ain’t interested in the gig. This adds another chapter into this Summer’s odd saga of “Who Will Host Jeopardy!”\nRead more...",
          "link": "https://kotaku.com/levar-burton-no-longer-wants-to-be-jeopardy-host-1847704919",
          "publishedOn": "2021-09-19T19:00:00.000Z",
          "wordCount": 750,
          "title": "LeVar Burton No Longer Wants To Be Jeopardy! Host"
        }
      ]
    },
    {
      "title": "Nintendo Life | Latest Updates",
      "feedUrl": "https://www.nintendolife.com/feeds/latest",
      "siteUrl": "https://www.nintendolife.com/feeds/latest",
      "articles": [
        {
          "id": "https://www.nintendolife.com/#article-121186",
          "author": null,
          "description": "Is Bandai Namco working on remasters?\nBack in September 2019, word spread about the possibility of the classic Namco character Klonoa returning, after Bandai Namco filed some trademarks in Japan.\nFast forward to September 2021, and the Japanese company has now gone and filed some new trademarks for \"Waffuu Encore\" and \"1&2 Encore\" in the same location. The word \"encore\" is what Bamco has been subtitling remasters of games (e.g. Katamari Damacy 'Encore' instead of 'Reroll' ) in Japan, in recent times.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/klonoa_encore_trademarks_surface_online_in_japan",
          "publishedOn": "2021-09-21T05:55:00.000Z",
          "wordCount": 1028,
          "title": "Klonoa \"Encore\" Trademarks Surface Online In Japan"
        },
        {
          "id": "https://www.nintendolife.com/#article-121184",
          "author": null,
          "description": "The same creator behind Deadly Premonition.\nIt's official - the upcoming \"small-town detective thriller\" The Good Life will arrive on Nintendo Switch and all other platforms next month on October 15th.\nThe game, in case you missed it, is from Hidetaka \"Swery\" Suehiro's company White Owls (along with Grounding Inc. and Playism). Swery is perhaps best-known in recent times for the Deadly Premonition series, which has developed a bit of a cult following.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/swerys_small-town_detective_thriller_the_good_life_launches_next_month",
          "publishedOn": "2021-09-21T03:45:00.000Z",
          "wordCount": 841,
          "title": "Swery's \"Small-Town Detective Thriller\" The Good Life Launches Next Month"
        },
        {
          "id": "https://www.nintendolife.com/#article-121183",
          "author": null,
          "description": "Sonic's co-creator thinks it might be a \"scam\".\nA copy of the original Sonic the Hedgehog game for Sega Genesis has been sold for a record-breaking sale price of $430,500 USD. This isn't just a new record for this Sonic game, either - it also makes it an \"all-time\" record sale for any Genesis title.\nThis graded game has been 'WATA Certified'. As you might recall, WATA is one of the grading companies that has been previously under fire for allegedly manipulating the retro video game market. Just recently, for example, the co-founder was accused of selling the company's games under a different alias on eBay.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/wata_certified_copy_of_sonic_the_hedgehog_sells_for_record_price",
          "publishedOn": "2021-09-21T02:30:00.000Z",
          "wordCount": 2534,
          "title": "'WATA Certified' Copy Of Sonic The Hedgehog Sells For Record Price"
        },
        {
          "id": "https://www.nintendolife.com/#article-121182",
          "author": null,
          "description": "Anime, concerts and more to come!\n\nThe Persona series is currently celebrating its 25th anniversary, and as you might recall, Atlus has teased seven projects.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/atlus_reveals_new_details_about_personas_25th_anniversary_celebrations",
          "publishedOn": "2021-09-21T01:00:00.000Z",
          "wordCount": 2715,
          "title": "Atlus Reveals New Details About Persona's 25th Anniversary Celebrations"
        },
        {
          "id": "https://www.nintendolife.com/#article-121181",
          "author": null,
          "description": "Expected to arrive this November.\n\nBack in August, an ESRB rating revealed the 2019 Switch release Disney Classic Games: Aladdin And The Lion King would be repackaged with The Jungle Book.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/disney_classic_games_collection_adds_aladdin_snes_and_all_versions_of_the_jungle_book",
          "publishedOn": "2021-09-21T00:00:00.000Z",
          "wordCount": 2725,
          "title": "'Disney Classic Games Collection' Adds Aladdin SNES And \"All Versions\" Of The Jungle Book"
        },
        {
          "id": "https://www.nintendolife.com/#article-121180",
          "author": null,
          "description": "Classification spotted in Brazil.\nIt looks like Remedy Entertainment - the creator of Control - might be bringing its action-adventure game, Alan Wake Remastered, across to the Nintendo Switch.\nA new listing on the Brazil Advisory Rating Board suggests the title is en route to Nintendo's hybrid platform in some way or form. Being the \"remastered\" version, there's the possibility it could be a cloud release - just like Control.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/alan_wake_remastered_has_been_rated_for_nintendo_switch",
          "publishedOn": "2021-09-20T23:00:00.000Z",
          "wordCount": 1949,
          "title": "Alan Wake Remastered Has Been Rated For Nintendo Switch"
        },
        {
          "id": "https://www.nintendolife.com/#article-121174",
          "author": null,
          "description": "Free PoOT!\nFollowing on from DAEMON X MACHINA's free trial for Nintendo Switch Online members (which ended yesterday), Nintendo has announced that the next free trial will be Story of Seasons: Pioneers of Olive Town.\nFrom the 22nd September, subscribers to Nintendo's online service will have access to Story of Seasons: PoOT for free, and can then buy it for 10% off if they choose to. The trial ends on the 28th September at 11:59pm Pacific.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/story_of_seasons_pioneers_of_olive_town_is_the_next_free_trial_for_nintendo_switch_online",
          "publishedOn": "2021-09-20T18:00:00.000Z",
          "wordCount": 1699,
          "title": "Story Of Seasons: Pioneers Of Olive Town Is The Next Free Trial For Nintendo Switch Online"
        },
        {
          "id": "https://www.nintendolife.com/#article-121139",
          "author": null,
          "description": "Slowed down, but familiar.\n\nWith the Nintendo Switch OLED model now just a couple of short weeks away, we're heading into the system's fifth Holiday season with three distinct 'tiers' in its hardware family. We've written previously about how each Switch iteration offers something different, in terms of features and price points, and how that stacks up against other gaming systems as we head towards the year's most competitive and important shopping season. Nintendo is in its own 'bubble' with its first-party games and the different role of the Switch compared to other hardware, but it's still competing for a lot of the same dollars as Sony and Microsoft.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/talking_point_the_switch_is_following_nintendos_successful_portable_playbook",
          "publishedOn": "2021-09-20T16:00:00.000Z",
          "wordCount": 5757,
          "title": "Talking Point: The Switch Is Following Nintendo's Successful Portable Playbook"
        },
        {
          "id": "https://www.nintendolife.com/#article-121160",
          "author": null,
          "description": "Buy the real baseball cap for just £295.\nEpic, that plucky underdog that courageously fights corporations with even more billions of dollars in the bank, has confirmed another big-name collaboration for Fortnite. This time it isn't another notable game brand, or a Hollywood star, but rather a high fashion brand.\nRolling out at 5pm Pacific / 8pm Eastern today (20th September) is a 'digital fashion' collab with Balenciaga. Being the cheap t-shirts from a supermarket type we had to look up details on the fashion house, which is headquartered in Paris and at last count had over 1300 employees globally.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/fortnites_latest_collaboration_is_with_fancy_fashion_house_balenciaga",
          "publishedOn": "2021-09-20T15:15:00.000Z",
          "wordCount": 1732,
          "title": "Fortnite's Latest Collaboration Is With Fancy Fashion House Balenciaga"
        },
        {
          "id": "https://www.nintendolife.com/#article-121157",
          "author": null,
          "description": "Get 'em downloaded.\nMetroid Dread is just weeks away from launching on Switch and everyone's getting a little too excited – okay, maybe not everyone, but we are so shush. It's probably pretty handy, then, that Nintendo's decided to drop a collection of gorgeous Metroid art for us to hoover up and use as we see fit.\nYes, in a Twitter thread today, Nintendo has shared the following key art images cataloguing Samus' journey so far, all leading up to Dread which launches next month. They're all at a high enough resolution to be suitable for all of your wallpaper needs, so go ahead and get them downloaded to show off your love for all things Metroid while you're out and about...\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/random_nintendo_shares_gorgeous_metroid_art_thats_just_perfect_for_your_phone_wallpaper",
          "publishedOn": "2021-09-20T14:00:00.000Z",
          "wordCount": 2884,
          "title": "Random: Nintendo Shares Gorgeous Metroid Art That's Just Perfect For Your Phone Wallpaper"
        },
        {
          "id": "https://www.nintendolife.com/#article-121158",
          "author": null,
          "description": "\"Are you ready for a fresh challenge?\".\nThe Pokémon Company has shared a quick teaser video for Pokémon Trading Card Game Live, a new app set to launch \"soon\".\nSeemingly serving as a new take on Pokémon TGC Online, this new app will let players enjoy matches anywhere, anytime on mobile and desktop. The trailer shows off some of the customisation options, gameplay and additional features you can expect to see when it launches.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/heres_our_first_look_at_pokemon_trading_card_game_live_coming_soon",
          "publishedOn": "2021-09-20T13:20:00.000Z",
          "wordCount": 2109,
          "title": "Here's Our First Look At Pokémon Trading Card Game Live, Coming \"Soon\""
        },
        {
          "id": "https://www.nintendolife.com/#article-120751",
          "author": null,
          "description": "Isometric action inspired by Mega Man.\nThe venerable hobby of “games” has borne witness to innumerable robotic sprogs. Metallic Child attempts to be a definitive answer to the likes of Mega Man, Astro Boy and - most formidably of all - Mighty No. 9. We jest, of course. Inafune's infamous crowdfunded project (resulting in an incredibly mediocre game) isn't really competition for this one. We bring it up, though, because Metallic Child sort of reminded us of it. Wait, don't run off! We promise it's not a bad thing. You see, Metallic Child is an isometric Mega Man roguelite, as absurd as that sounds, with character designs that immediately bring Mighty No. 9 to mind. You pick a target, then head off into the game world to beat them up.\nThe roguelite elements are actually quite limited, to the point where we're not even sure if it's accurate to call it a roguelite. Rather than starting from scratch on every run, you'll only have one shot through to complete each level/dungeon; upgrades and boons found therein will be lost on death, but if you've cleared a level it will stay cleared. Arguably this very much stretches the roguelite definition; it's the use of randomised positive and negative stat changes that contribute to it. However, the risk of losing \"time\" is rather high, with each multi-floor stage taking a good hour or so to play through even at speed.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/reviews/switch-eshop/metallic_child",
          "publishedOn": "2021-09-20T13:00:00.000Z",
          "wordCount": 2262,
          "title": "Review: Metallic Child - A Robot Smashing 'Roguelite' Anime Adventure"
        },
        {
          "id": "https://www.nintendolife.com/#article-121143",
          "author": null,
          "description": "Power in your pocket.\nApple has just announced its shiny new fondle-slabs for 2021, and amid the raft of yearly oh-so-slight improvements, larger battery capacity is one of the big enhancements across the entire iPhone 13 range.\nOn average, the battery size has jumped 13 percent compared to last year's models, which means we're getting closer to the battery size seen in the Nintendo Switch – but in a smartphone.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/random_apples_iphone_13_pro_max_has_a_larger_battery_capacity_than_the_nintendo_switch",
          "publishedOn": "2021-09-20T12:30:00.000Z",
          "wordCount": 5331,
          "title": "Random: Apple's iPhone 13 Pro Max Has A Larger Battery Capacity Than The Nintendo Switch"
        },
        {
          "id": "https://www.nintendolife.com/#article-121132",
          "author": null,
          "description": "SpongeBob, Darksiders, Destroy All Humans and more.\nLast week THQ Nordic celebrated its 10th anniversary, culminating in a showcase event and the announcement of another SpongeBob game for Switch; it also unveiled a batch of eShop discounts for the NA and EU stores that are running up to 29th September.\nIt's a decent mix of old and new titles, from retail to 'Indie'-style games - details are below (all dollar prices are USD).\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/thq_nordic_celebrates_its_anniversary_with_a_bunch_of_switch_eshop_discounts",
          "publishedOn": "2021-09-20T12:00:00.000Z",
          "wordCount": 1547,
          "title": "THQ Nordic Celebrates Its Anniversary With A Bunch Of Switch eShop Discounts"
        },
        {
          "id": "https://www.nintendolife.com/#article-121144",
          "author": null,
          "description": "Arcade footie for a fiver.\nNintendo Switch is being treated to a new arcade football game today, complete with a launch discount that makes the deal even sweeter.\nSuper Arcade Football, developed by OutOfTheBit, lets up to four players enjoy a couch co-op kickabout. You can take on the computer in a single-player mode, too, and match modifiers let you do all sorts of crazy stuff like alter the size of the goals, adjust the game speed, or litter the pitch with meteorites and slippery oil. You don't see that in the Champions League.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/super_arcade_football_launches_on_switch_today_and_its_currently_half_price",
          "publishedOn": "2021-09-20T11:30:00.000Z",
          "wordCount": 1114,
          "title": "Super Arcade Football Launches On Switch Today, And It's Currently Half Price"
        },
        {
          "id": "https://www.nintendolife.com/#article-121138",
          "author": null,
          "description": "Custom spawns this December.\nScreenwave Media Games and Mokuzai Studios have announced that the third entry in the challenging retro platformer LOVE franchise will launch on Switch on December 7th.\nThe cunningly titled LOVE 3 will include every level from LOVE, LOVE 2: kuso, and a remastered version of the original game, just in case you've missed out on the series up until this point.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/love_3_brings_reductive_retro_platforming_to_switch",
          "publishedOn": "2021-09-20T11:00:00.000Z",
          "wordCount": 931,
          "title": "LOVE 3 Brings Reductive Retro Platforming To Switch"
        },
        {
          "id": "https://www.nintendolife.com/#article-121140",
          "author": null,
          "description": "The Souls-like gets new weapons, bosses and more.\nLaunching next week on Switch is Death's Gambit: Afterlife, an expanded version of the original 2018 release that'll bring new content to Nintendo's platform.\nThe game has you playing as Death's right hand as you explore the unforgiving surroundings of Siradon. You'll need to use a variety of weapons and abilities to challenge the guardians of the realm, purging their souls and uncovering \"the true price of immortality.\" Ooft.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/deaths_gambit_brings_its_hardcore_rpg_action_to_switch_in_expanded_afterlife_edition",
          "publishedOn": "2021-09-20T10:35:00.000Z",
          "wordCount": 1691,
          "title": "Death's Gambit Brings Its Hardcore RPG Action To Switch In Expanded 'Afterlife' Edition"
        },
        {
          "id": "https://www.nintendolife.com/#article-121136",
          "author": null,
          "description": "The best pre-order bonus yet?\nIf you're wanting to get your hands on a Pokémon Legends: Arceus pre-order ahead of the game's upcoming release, you might want to consider this new bundle from Amazon UK.\nThe retailer has updated its listing of the game to include a SteelBook case and a special Poké Ball replica based upon the ancient ball design seen in the game. The ball is listed as a 'Poké Ball Cartridge', and while it probably (definitely) won't fit inside your Switch's cart slot, we're assuming that means it might double up as a cartridge holder.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/pre-order_pokemon_legends_arceus_at_amazon_uk_to_get_a_steelbook_and_poke_ball_replica",
          "publishedOn": "2021-09-20T10:00:00.000Z",
          "wordCount": 1639,
          "title": "Pre-Order Pokémon Legends: Arceus At Amazon UK To Get A SteelBook And Poké Ball Replica"
        },
        {
          "id": "https://www.nintendolife.com/#article-110629",
          "author": null,
          "description": "Update: It's official, coming to E4 later this year.\nUpdate #2: Channel 4 has finally confirmed reports that it is rebooting the classic UK video game-based TV show, GamesMaster (thanks, Eurogamer).\nThe show will initially premiere on E4's YouTube later this year and will be followed by a televised run on E4, Channel 4's youth-focused channel. The project is being described as a \"social-first partnership\" with Facebook's Oculus Quest 2 platform.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/channel_4_is_resurrecting_gamesmaster_the_uks_most_popular_video_game_tv_show",
          "publishedOn": "2021-09-20T09:45:00.000Z",
          "wordCount": 4922,
          "title": "Channel 4 Is Resurrecting GamesMaster, The UK's Most Popular Video Game TV Show"
        },
        {
          "id": "https://www.nintendolife.com/#article-121130",
          "author": null,
          "description": "Also worked on Streets of Rage and Shining Force artwork.\nMick McGinty, the man behind the iconic SNES Street Fighter II cover artwork, has died.\nMcGinty was an immensely talented artist, as is evidenced by the impressive collection of work on his personal site, but for gamers of the '90s, his output will be almost synonymous with video game covers.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/legendary_street_fighter_ii_artist_mick_mcginty_has_passed_away",
          "publishedOn": "2021-09-20T09:30:00.000Z",
          "wordCount": 1495,
          "title": "Legendary Street Fighter II Artist Mick McGinty Has Passed Away"
        },
        {
          "id": "https://www.nintendolife.com/#article-121131",
          "author": null,
          "description": "You'll want the sound on for this.\nThey certainly look the part, but wait until you hear them...\nIf you've ever been to a gaming expo or Comic Con-style event, you'll probably have noticed that Nintendo fans really bring it when it comes to cosplay. We've seen some great efforts over the years, and joining that list today are these fans who brought some extra energy to their Mario and Luigi costumes.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/random_these_mario_and_luigi_cosplays_are_so_good_even_mario_himself_is_impressed",
          "publishedOn": "2021-09-20T09:00:00.000Z",
          "wordCount": 1243,
          "title": "Random: These Mario And Luigi Cosplays Are So Good, Even Mario Himself Is Impressed"
        },
        {
          "id": "https://www.nintendolife.com/#article-121118",
          "author": null,
          "description": "L is real!\n\nOver the course of the '90s, Sega and Nintendo were obviously direct competitors - we've seen this documented in texts like the 'Console Wars' by Blake J. Harris. Despite this, it seems there was some rather incredibly weird stuff going on behind the scenes at one of these video game companies - so weird actually, that it was \"borrowing\" its rival's mascots...\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/random_luigi_has_been_found_inside_the_dreamcast_prototype_of_sega_gt",
          "publishedOn": "2021-09-19T16:00:00.000Z",
          "wordCount": 1520,
          "title": "Random: Luigi Has Been Found Inside The Dreamcast Prototype Of Sega GT"
        },
        {
          "id": "https://www.nintendolife.com/#article-120992",
          "author": null,
          "description": "Top Nintendo Switch games evaluated for players with vision loss.\nWhen it comes to accessibility options in video games, some companies have been quicker than others to acknowledge the need and introduce basic features into their games. While progress has been made over the past few years, there's still much room for improvement and even the most elementary of accessibility options can improve immeasurably the gaming experience for many players. Bespoke hardware like the Hori Flex and the Xbox Adaptive Controller enable gamers to adapt controls to their specific requirements, but there's plenty that developers and platform holders like Nintendo could do at a software level to improve things.\nBelow, legally blind gamer Chad Bouton writes about his personal journey and experience over the last few years, and evaluates the accessibility options of some of Nintendo biggest Switch games...\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/feature_how_accessible_are_zelda_pokemon_and_animal_crossing_for_blind_gamers",
          "publishedOn": "2021-09-19T15:00:00.000Z",
          "wordCount": 9732,
          "title": "Feature: How Accessible Are Zelda, Pokémon And Animal Crossing For Blind Gamers?"
        },
        {
          "id": "https://www.nintendolife.com/#article-120788",
          "author": null,
          "description": "Plus tips & tricks for beginners to late-game players.\nKitaria Fables is here, and we loved it — but it can be quite tricky to learn the ropes, especially when every upgrade costs tons of cash, and your pockets are perpetually empty. Or, perhaps, you've got all the money you need, but no idea where to find some of the required materials. We can help!\n\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/kitaria_fables_-_how_to_make_money_find_materials_and_complete_quests",
          "publishedOn": "2021-09-19T14:30:00.000Z",
          "wordCount": 2799,
          "title": "Guide: Kitaria Fables - How To Make Money, Find Materials, And Complete Quests"
        },
        {
          "id": "https://www.nintendolife.com/#article-120339",
          "author": null,
          "description": "One for the grinders.\nIt's been seven years since Level-5's toylike RPG masterpiece Fantasy Life came to the 3DS in the West, and like addicts seeking our next hit we've been searching for something that replicates that feeling ever since. Between games like Ni No Kuni (also Level-5) and cutesy Rune Factory-likes such as Littlewood, we've come close... but in a surprising twist, Kitaria Fables is the younger sibling to Fantasy Life that we never saw coming.\nThe pitch doesn't really do the game justice: \"a delightfully cute action adventure RPG with farming and crafting\" makes us feel that another-farming-game fatigue that followed in the wake of Stardew Valley, and the cat theming, we'll be honest, left us expecting something twee and hollow. After all, we've been burned by cute-looking stuff before.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/reviews/nintendo-switch/kitaria_fables",
          "publishedOn": "2021-09-19T13:00:00.000Z",
          "wordCount": 3988,
          "title": "Review: Kitaria Fables - A Delightfully Cute, Fantasy Life-Style RPG Adventure"
        }
      ]
    },
    {
      "title": "Rock Paper Shotgun Latest Articles Feed",
      "feedUrl": "https://www.rockpapershotgun.com/feed",
      "siteUrl": "https://www.rockpapershotgun.com/feed",
      "articles": [
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-map-collectible-locations",
          "author": "Ollie Toms",
          "description": "Looking for a map of Kena: Bridge Of Spirits which shows the locations of all collectibles and hidden areas? Well, you're in luck, because I've spent a painstaking number of hours hundred-percenting Ember Lab's marvellous story-driven action-adventure game, and during my travels I jotted down the exact locations of every single Rot, Hat, Flower Shrine, Meditation Spot, Cursed Chest, and Spirit Mail in the game.\nBelow you'll find ten maps of various areas in Kena: Bridge Of Spirits, annotated with the locations of every single collectible and hidden area in the game, so you can have a far easier time hunting down those pesky remaining achievements. Take a look!\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-map-collectible-locations",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1701,
          "title": "Kena: Bridge Of Spirits map of all collectible locations"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-long-is-kena-bridge-of-spirits",
          "author": "Ollie Toms",
          "description": "Wondering how long it'll take you to complete Kena: Bridge Of Spirits? It's a question that's preyed on the minds of many a prospective player since Ember Lab, the developers of this outrageously gorgeous new action-adventure game, previously stated in a tweet that \"you should be able to finish the game over a weekend\".\nBut a weekend of gaming means different things to different people. Does it mean you can blitz through Kena: Bridge Of Spirits in only a few hours, or will it take a solid 20 hours to complete? And does this take into account the many side activities and collectibles, or were Ember Lab simply talking about how quickly you can rush through the main story? Find out exactly how long it takes to complete Kena: Bridge Of Spirits below.\nRead more",
          "link": "https://www.rockpapershotgun.com/how-long-is-kena-bridge-of-spirits",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1027,
          "title": "How long is Kena: Bridge Of Spirits?"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-difficulty-levels",
          "author": "Ollie Toms",
          "description": "Want to know how to change the difficulty level in Kena: Bridge Of Spirits? Or perhaps you simply want to figure out which difficulty is right for you before you get stuck into playing? Kena: Bridge Of Spirits offers a choice of four different difficulty levels which change the game up in various ways to make Kena's journey safer or more perilous, depending on which you choose. Keep reading to find out how to change the difficulty level before and during a playthrough, and what each of the difficulty levels change about the game.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-difficulty-levels",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1133,
          "title": "Kena: Bridge Of Spirits difficulty levels"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-bow",
          "author": "Ollie Toms",
          "description": "Wondering how to unlock the bow in Kena: Bridge Of Spirits? The bow is an extremely useful part of Kena's toolkit, not only as a powerful weapon but also as a traversal tool, as it can be used as a grappling hook when fired at particular blue flowers dotted about the landscape of Kena: Bridge Of Spirits. Read on to find out where, when, and how to unlock the bow so you can get it as quickly as possible.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-bow",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1078,
          "title": "How to unlock the Bow in Kena: Bridge Of Spirits"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-abilities-upgrades-skill-tree",
          "author": "Ollie Toms",
          "description": "Want to learn more about Kena's abilities and upgrades in Kena: Bridge Of Spirits? Early on in Ember Lab's story-driven action-adventure game, you'll learn more about how you can use Karma to upgrade your abilities. Each of these abilities are well worth getting, but some are definitely worth prioritising over others, because they'll help you make quick work of nearly any enemy with some practice.\nBelow we'll walk you through every ability and upgrade in Kena: Bridge Of Spirits and what each one does, along with how to unlock abilities, how to gain Karma, and how to increase your Rot Level to make use of these new abilities.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-abilities-upgrades-skill-tree",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 2025,
          "title": "Kena: Bridge Of Spirits abilities and upgrades"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-spirit-mail-locations",
          "author": "Ollie Toms",
          "description": "Looking for all the Spirit Mail in Kena: Bridge Of Spirits? One of several different types of collectible in Ember Lab's story-focused action-adventure game, Spirit Mail can be collected and delivered back to certain houses in the central Village in order to unlock new areas and gain rewards. But finding them is often far easier said than done, and these puzzles don't get easier just by changing the difficulty level.\nBelow we'll walk you through where to find all 10 Spirit Mail locations in Kena: Bridge Of Spirits, so you can get to work purifying the land of the corruption which has spread across it before you arrived. After you've collected each Spirit Mail you can then see on the map the house in the Village to which it must be delivered.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-spirit-mail-locations",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1967,
          "title": "Kena: Bridge Of Spirits Spirit Mail locations"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-hay-piles",
          "author": "Ollie Toms",
          "description": "Wondering what to do with Hay Piles in Kena: Bridge Of Spirits? You'll find Hay Piles scattered about various areas of the Kena: Bridge Of Spirits map, and it's very unclear at first glance what you're meant to do about them. And it is important that you do something, because sometimes these Hay Piles must be cleared in order to reveal something valuable inside, such as a Rot to add to your growing army of adorable spirits.\nLearn how to destroy Hay Piles in Kena: Bridge Of Spirits below!\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-hay-piles",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1000,
          "title": "How to destroy Hay Piles in Kena: Bridge Of Spirits"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-achievements",
          "author": "Ollie Toms",
          "description": "Looking for a full list of all Kena: Bridge Of Spirits achievements? There is a grand total of 41 achievements to collect in Ember Lab's beautiful and incredibly enjoyable action-adventure title, and they run the gamut in challenge. Some require you to simply play through the story, so you'll unlock them either way eventually. Others require you to go out of your way collecting or setting up particular combat encounters to complete them.\nBelow you'll find a full list of all 41 achievements you can earn in Kena: Bridge Of Spirits, along with a few bits of advice on how to unlock some of the more challenging ones.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-achievements",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1282,
          "title": "Kena: Bridge Of Spirits achievements list"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-hats",
          "author": "Ollie Toms",
          "description": "Looking for a list of all the Hats in Kena: Bridge Of Spirits? Yes, you can find Hats for your bouncy little spirit friends in Kena: Bridge Of Spirits, and you can purchase these hats at Hat Carts in order to dress your Rot army up exactly how you'd like. Have you ever heard of anything so sickeningly adorable? I sure haven't.\nBelow you'll be able to take a look at every single Rot Hat in the game, along with their cost in Gems and some information on how these cosmetic items can be procured at a Hat Cart.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-hats",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1283,
          "title": "Kena: Bridge Of Spirits Hats"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-tips",
          "author": "Ollie Toms",
          "description": "Looking for some top tips on beating the puzzles and quests of Kena: Bridge Of Spirits? Ember Lab's sumptuous-looking action-adventure game, Kena: Bridge Of Spirits, throws you into a bright, beautiful, and bittersweet world where Kena, a Spirit Guide, is trying to reach a sacred mountain shrine. But first she needs to cleanse the lands of corruption and uncover the mystery of how nature came to be so unbalanced in this part of the world.\nKena is a tough game at times, filled with dangerous combat segments, tricky platforming areas, and numerous puzzles you must complete with the help of your spirit friends, the Rot. This beginner's guide to Kena: Bridge Of Spirits will walk you through some top tips which will help you conquer (and enjoy) every aspect of Kena's journey.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-tips",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1967,
          "title": "Kena: Bridge Of Spirits tips and tricks"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-review",
          "author": "Amelia Hansford",
          "description": "Atmosphere can feel almost superfluous in video games at the moment. Despite its very obvious importance, there’s sometimes an assumption that if the more mechanical parts of a game serve their purpose - and do so reliably - then elements like immersion, environment and art style are merely contributors to a solid product. But my view is to the contrary; I think it’s usually those elements that turn a game into a phenomenon. This is very clearly proven by Kena: Bridge Of Spirits.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-review",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1596,
          "title": "Kena: Bridge Of Spirits review: a beautiful action-adventure full of joy and wonder"
        },
        {
          "id": "https://www.rockpapershotgun.com/a-new-free-to-play-online-pokemon-trading-card-game-is-coming-to-pc",
          "author": "Lauren Morton",
          "description": "There's been a Pokémon card game on PC for years now which, I suspect, will come as news to some of us who were always more into the Pokémon RPGs. You TCG fans will want to know that the newly-announced Pokémon Trading Card Game Live will be replacing the current Pokémon Trading Card Game Online. Pokémon TCG Live is coming with upgrades like a ranked ladder, 3D avatars, and battle passes. It will also remove some major features such as in-game chat and—crucially—card trading. You can catch the announcement and the details here in the reveal trailer for Pokémon TCG Live.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/a-new-free-to-play-online-pokemon-trading-card-game-is-coming-to-pc",
          "publishedOn": "2021-09-20T23:32:57.000Z",
          "wordCount": 843,
          "title": "A new free-to-play online Pokémon trading card game is coming to PC"
        },
        {
          "id": "https://www.rockpapershotgun.com/swerys-the-good-life-finally-fetches-a-launch-date-for-october",
          "author": "Lauren Morton",
          "description": "Small towns always seem to have secrets afoot and it's no different in The Good Life. This mystery adventure led by Hidetaka 'Swery' Suehiro of Deadly Premonition fame has been publicly kicking about for a while now. It's dug up a date at last, proudly fetching us back an October 15th launch. That's when you'll be headed to the British countryside to photograph your way out of debt and try to learn the secrets of the town where everyone turns into animals.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/swerys-the-good-life-finally-fetches-a-launch-date-for-october",
          "publishedOn": "2021-09-20T20:47:42.000Z",
          "wordCount": 801,
          "title": "Swery's The Good Life finally fetches a launch date for October"
        },
        {
          "id": "https://www.rockpapershotgun.com/deltarune-chapter-2-launched-for-free-because-the-world-is-tough-enough",
          "author": "Lauren Morton",
          "description": "Unlike the cheeky surprise release of its first free chapter back in 2018, we got a warning about Deltarune Chapter 2. It's out now, also free, because creator Toby Fox says the world has been tough enough lately. The not-a-sequel-or-prequel-but-sort-of-related game to Fox's hit RPG Undertale is still a work in progress, but the newest chunk of story should hopefully keep fans busy chatting and hunting for secrets for a while yet. It may indeed be a while, once again. Fox plans to release chapters three through five as a paid release when they're finished but even he doesn't know when that will be just yet.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/deltarune-chapter-2-launched-for-free-because-the-world-is-tough-enough",
          "publishedOn": "2021-09-20T18:13:50.000Z",
          "wordCount": 963,
          "title": "Deltarune Chapter 2 launched for free because the world is tough enough"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-introduces-more-big-bosses-and-adorable-photo-mode",
          "author": "Lauren Morton",
          "description": "The first game from former animation studio Ember Lab heads out on its spirit saving adventure tomorrow. Kena: Bridge Of Spirits definitely looks like it's made by an animation house, complete with excessively adorable little sidekick characters and all. Ahead of tomorrow's launch, Ember Lab have shown off another story trailer to peek a couple more of the big spirit bosses that Kena will be putting to rest along with the photo mode that you'll have to take full advantage of all that big screen-inspired character design.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-introduces-more-big-bosses-and-adorable-photo-mode",
          "publishedOn": "2021-09-20T16:38:56.000Z",
          "wordCount": 1023,
          "title": "Kena: Bridge Of Spirits introduces more big bosses and adorable photo mode"
        },
        {
          "id": "https://www.rockpapershotgun.com/well-need-new-imperial-units-for-the-digital-age",
          "author": "Alice O'Connor",
          "description": "To distract from the ongoing dire consequences of leaving the European Union with all the grace and finesse of a child uninviting someone from their seventh birthday party, the UK government plan to revive imperial units. You know: 66 gallons to a hogshead, 6 hogsheads to a rod, 22 ounces to a watt, 9 Rodneys to a Del Boy, that sort of nostalgic masturbation. But a lot has changed since the dark days of the British Empire. If the obtuse unit system is to return (lol), we need new units for modern technologies. I have ideas.\nRead more",
          "link": "https://www.rockpapershotgun.com/well-need-new-imperial-units-for-the-digital-age",
          "publishedOn": "2021-09-20T16:24:04.000Z",
          "wordCount": 1138,
          "title": "We'll need new imperial units for the digital age"
        },
        {
          "id": "https://www.rockpapershotgun.com/rps-user-avatars-have-arrived",
          "author": "Katharine Castle",
          "description": "Ever since RPS was redesigned at the beginning of the year, our tech team has been hard at work improving our comments system and user ID features. The first of those updates arrives today. Behold, you can now assign an avatar to your Reedpop ID account. \nRead more",
          "link": "https://www.rockpapershotgun.com/rps-user-avatars-have-arrived",
          "publishedOn": "2021-09-20T16:18:38.000Z",
          "wordCount": 868,
          "title": "RPS user avatars have arrived"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-nvidia-rtx-30-series-one-year-on-should-you-upgrade",
          "author": "James Archer",
          "description": "Even if they don’t recall the exact date, plenty of gaming PC owners will remember what they were doing on September 17th 2020. They, and I, were staring at a black-and-green storefront, mashing F5 until a “Notify me” button changed to read “Out of stock”. This was the Nvidia GeForce RTX 3080 launch, and what initially looked like a one-off failure of Nvidia’s anti-bot measures ended up heralding the worst year in memory to upgrade a graphics card.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-nvidia-rtx-30-series-one-year-on-should-you-upgrade",
          "publishedOn": "2021-09-20T15:53:33.000Z",
          "wordCount": 1549,
          "title": "The Nvidia RTX 30 series, one year on: should you upgrade?"
        },
        {
          "id": "https://www.rockpapershotgun.com/rumour-quantic-dream-are-making-a-star-wars-game",
          "author": "Alice O'Connor",
          "description": "Here's a rumour that's wildly unsupported but so horrible that oh god you can imagine it being true: Quantic Dream are secretly making a Star Wars game. According to two separate Internauts, the French studio behind Heavy Rain and Detroit: Become Human have become pally with Disney and are working on some sort of game set in the galaxy which gave us Baby Yoda and probably some other stories or something too idk. Take this all with the hugest pinch of spacesalt, of course.\nRead more",
          "link": "https://www.rockpapershotgun.com/rumour-quantic-dream-are-making-a-star-wars-game",
          "publishedOn": "2021-09-20T14:25:12.000Z",
          "wordCount": 812,
          "title": "Rumour: Quantic Dream are making a Star Wars game"
        },
        {
          "id": "https://www.rockpapershotgun.com/frogwares-and-microids-are-escalating-the-war-for-sexiest-young-detective-in-games",
          "author": "Alice Bell",
          "description": "A few months ago I brought it to your attention that Microids are making a new video game called Agatha Christie - Hercule Poirot: The First Cases, in which Poirot is a young and and hot detective solving his first case. I made a comparison to Sherlock Holmes Chapter One, the also upcoming new entry in Frogwares' long-running detect 'em up series, in which Sherlock Holmes is young and hot and solving his first case. Last week, both developers released new videos for their respective games, and the timing of it all was almost enough to make me believe they were baiting me, specifically.\nLast week was Agatha Christie's birthday, you see, so Microids dropped a more in-depth gameplay video and a new dev diary talking about they were making \"a unique new moustache\", just after they make hot young Poirot wink. Then, the very next day - the next day! The. Next. Day. Frogwares put out a release date trailer that may as well have been called Sherlock Holmes: Eyes Wide Shut. And I'm absolutely here for this escalting sexy war.\nRead more",
          "link": "https://www.rockpapershotgun.com/frogwares-and-microids-are-escalating-the-war-for-sexiest-young-detective-in-games",
          "publishedOn": "2021-09-20T14:00:00.000Z",
          "wordCount": 800,
          "title": "Frogwares and Microids are escalating the war for sexiest young detective in games"
        },
        {
          "id": "https://www.rockpapershotgun.com/nvidia-dlss-now-supported-in-over-100-games-thanks-to-indie-push",
          "author": "James Archer",
          "description": "Nvidia DLSS is usually worth turning on for an easy frame rate bump, but even after DLSS 2.0 made it easier for developers to implement, the list of games that actually support the AI-powered anti-aliasing tech has never exactly been running off the page. That said, Nvidia can now claimed to have reached the milestone of 100 DLSS-compatible games, thanks in large part to a recent adoption wave from indie games.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/nvidia-dlss-now-supported-in-over-100-games-thanks-to-indie-push",
          "publishedOn": "2021-09-20T13:11:01.000Z",
          "wordCount": 922,
          "title": "Nvidia DLSS now supported in over 100 games, thanks to indie push"
        },
        {
          "id": "https://www.rockpapershotgun.com/call-of-duty-vanguards-open-beta-is-extended-so-how-are-you-liking-it",
          "author": "Alice O'Connor",
          "description": "Hey, you, you played the Call Of Duty: Vanguard multiplayer open beta this weekend? You like it? You wanna play more? If you do want more, or thought you'd missed your chance to play, good news: the open beta has (probably predictably) been extended. Originally due to end today, it'll now end Wednesday. More time to see CoD's latest return to World War 2.\nRead more",
          "link": "https://www.rockpapershotgun.com/call-of-duty-vanguards-open-beta-is-extended-so-how-are-you-liking-it",
          "publishedOn": "2021-09-20T12:37:28.000Z",
          "wordCount": 765,
          "title": "Call Of Duty: Vanguard's open beta is extended, so how are you liking it?"
        },
        {
          "id": "https://www.rockpapershotgun.com/valve-are-removing-32-bit-support-from-dota-2",
          "author": "Alice O'Connor",
          "description": "If you have an ancient PC, you may soon be ejected from Valve's wonderful world of warwizards. They have announced plans to strip Dota 2 of \"support for some older systems and configurations\", including 32-bit operating systems, saying it's so they can \"keep the game and the Source 2 engine fresh\". DirectX 9 and OpenGL are on the chopping block too (but Vulkan support will stand, obvs).\nRead more",
          "link": "https://www.rockpapershotgun.com/valve-are-removing-32-bit-support-from-dota-2",
          "publishedOn": "2021-09-20T11:01:50.000Z",
          "wordCount": 898,
          "title": "Valve are removing 32-bit support from Dota 2"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-sks-loadout-warzone",
          "author": "Kevin Foley",
          "description": "Looking for the best SKS loadout to bring into Warzone? It certainly offers a unique role as a Marksman Rifle with its semi-automatic fire rate capability. The SKS performs the odd role of being underpowered compared to Sniper Rifles, and slow to shoot compared to Tactical Rifles, but you may see that as a worthwhile tradeoff for times when Warzone matches require you to play a ranged support role that can consistently land accurate shots. For this reason, we've put together what we consider to be the best SKS loadout to bring into Warzone.\nRead more",
          "link": "https://www.rockpapershotgun.com/best-sks-loadout-warzone",
          "publishedOn": "2021-09-20T10:48:34.000Z",
          "wordCount": 1037,
          "title": "Best SKS loadout in Warzone Season 5"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-sunday-papers-611",
          "author": "Ed Thorn",
          "description": "Sundays are for treating yourself to some fancy hand sanitiser that smells like citrus. Before you press the pump, let's read this week's best writing about games.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-sunday-papers-611",
          "publishedOn": "2021-09-19T10:00:00.000Z",
          "wordCount": 1256,
          "title": "The Sunday Papers"
        },
        {
          "id": "https://www.rockpapershotgun.com/story-of-seasons-pioneers-of-olive-town-has-sprouted-on-steam",
          "author": "Graham Smith",
          "description": "Every Story Of Seasons game starts the same way, with a young person fleeing the big city for a more relaxing and simple life. Good luck to them, sez I, but personally I find takeaway delivery services much more relaxing and simple than growing my own beets. \r\n\nStory Of Seasons: Pioneers Of Olive Town repeats the myth, though I admit its pastoral greens and funny hats make a strong argument for country living. It's out on Steam now.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/story-of-seasons-pioneers-of-olive-town-has-sprouted-on-steam",
          "publishedOn": "2021-09-18T12:51:00.000Z",
          "wordCount": 800,
          "title": "Story Of Seasons: Pioneers Of Olive Town has sprouted on Steam"
        },
        {
          "id": "https://www.rockpapershotgun.com/dicey-spaceship-crisis-sim-tharsis-is-the-latest-epic-games-store-freebie",
          "author": "Graham Smith",
          "description": "Tharsis is a turn-based spaceship management game where your ability to deal with a Sandra Bullock of disasters is determined by a dice roll. Alec once sung its praises while calling it \"cruel as hell\" - and it's one of this week's free games from the Epic Games Store.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/dicey-spaceship-crisis-sim-tharsis-is-the-latest-epic-games-store-freebie",
          "publishedOn": "2021-09-18T11:13:00.000Z",
          "wordCount": 781,
          "title": "Dicey spaceship crisis sim Tharsis is the latest Epic Games Store freebie"
        },
        {
          "id": "https://www.rockpapershotgun.com/fifa-22-ultimate-team-will-let-you-see-inside-loot-boxes-from-launch",
          "author": "Graham Smith",
          "description": "EA have detailed how FIFA Ultimate Team is changing for FIFA 22 when it launches on September 26th. Chief among the new features is the adoption of Preview Packs, which let you see the contents of one of Ultimate Team's lucrative loot boxes before you decide whether to buy it.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/fifa-22-ultimate-team-will-let-you-see-inside-loot-boxes-from-launch",
          "publishedOn": "2021-09-18T10:30:00.000Z",
          "wordCount": 812,
          "title": "FIFA 22 Ultimate Team will let you see inside loot boxes from launch"
        },
        {
          "id": "https://www.rockpapershotgun.com/victoria-iii-details-its-approach-to-slavery-in-new-dev-diary",
          "author": "Graham Smith",
          "description": "The latest development diary post for Victoria III talks in detail about how Paradox's empire builder will deal with the topic of slavery. Extremely carefully, is the answer.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/victoria-iii-details-its-approach-to-slavery-in-new-dev-diary",
          "publishedOn": "2021-09-18T09:25:00.000Z",
          "wordCount": 897,
          "title": "Victoria III details its approach to slavery in new dev diary"
        },
        {
          "id": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-162",
          "author": "Alice O'Connor",
          "description": "Hold tight, it's still summer! Four more days and then you can put on as many jumps as you want and chug pumpkin spice lattes until you hurl but for now please, don't deny me the dregs of summer. I need this. You're probably indoors playing video games anyway, so what does it matter to you? Tell me: what are you playing this weekend?\nRead more",
          "link": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-162",
          "publishedOn": "2021-09-18T08:00:00.000Z",
          "wordCount": 1022,
          "title": "What are we all playing this weekend?"
        },
        {
          "id": "https://www.rockpapershotgun.com/grindstones-monsters-and-mamas-update-adds-new-playable-character",
          "author": "Graham Smith",
          "description": "Beloved puzzle battler Grindstone has received another free content update. \"Monsters And Mamas\" adds the game's first alternate playable character, letting you choose to ascend the mountain as vetern stonegrinder Jorja, pictured above. There's also a new Boss Blitz mode, new rewards, and a high-contrast accessibility feature for the colourblind.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/grindstones-monsters-and-mamas-update-adds-new-playable-character",
          "publishedOn": "2021-09-17T20:24:18.000Z",
          "wordCount": 765,
          "title": "Grindstone's Monsters And Mamas update adds new playable character"
        },
        {
          "id": "https://www.rockpapershotgun.com/crysis-remastered-is-available-on-steam-now",
          "author": "Graham Smith",
          "description": "Crysis Remastered landed on the Epic Games Store last year, and the Crysis Trilogy Remastered will similarly don its freshly dry-cleaned nanosuits for Epic's store on October 15th. But as of today, you can also grab Crysis Remastered from Steam.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/crysis-remastered-is-available-on-steam-now",
          "publishedOn": "2021-09-17T20:00:13.000Z",
          "wordCount": 766,
          "title": "Crysis Remastered is available on Steam now"
        },
        {
          "id": "https://www.rockpapershotgun.com/outcast-is-getting-a-sequel-20-years-after-the-original",
          "author": "Imogen Beckhelling",
          "description": "Hello, the 90s are calling and they'd like to offer you sequels to games you've probably forgotten about. Outcast 2: A New Beginning is the newly announced follow-up to 1999's Outcast. It's an open-world third-person shooter that takes place right after the events of the original, where Cutter Slade (the best-named man in the world) has been stuck in time for 20 years after trying to get home to Earth from the alien planet Adelpha. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/outcast-is-getting-a-sequel-20-years-after-the-original",
          "publishedOn": "2021-09-17T19:45:00.000Z",
          "wordCount": 886,
          "title": "Outcast is getting a sequel 20 years after the original"
        },
        {
          "id": "https://www.rockpapershotgun.com/jagged-alliance-3-is-coming-from-the-developers-of-surviving-mars",
          "author": "Graham Smith",
          "description": "Jagged Aliance 3 has been announced during this evening's THQ Nordic 10th anniversary showcase. The turn-based tactics sequel is the first numbered game in the series since 1999's Jagged Alliance 2. It's being developed by Haemimont Games, who are best known for several Tropico games or most recently citybuilder Surviving Mars.\r\n\nThere's a cinematic and gameplay trailer below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/jagged-alliance-3-is-coming-from-the-developers-of-surviving-mars",
          "publishedOn": "2021-09-17T19:45:00.000Z",
          "wordCount": 871,
          "title": "Jagged Alliance 3 is coming from the developers of Surviving Mars"
        },
        {
          "id": "https://www.rockpapershotgun.com/destroy-all-humans-2-reprobed-is-in-development",
          "author": "Graham Smith",
          "description": "Destroy All Humans 2: Reprobed has been announced. It's a ground-up remake of the 2006 third-person action game in which you go on a globe-trotting adventure to, uh, destroy all humans. Reprobed follows  last year's remake of the first Destroy All Humans, and comes from the same developer, Black Forest Games.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/destroy-all-humans-2-reprobed-is-in-development",
          "publishedOn": "2021-09-17T19:45:00.000Z",
          "wordCount": 778,
          "title": "Destroy All Humans! 2: Reprobed is in development"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-dead-cells-update-makes-it-more-approachable-to-newcomers",
          "author": "Kaan Serin",
          "description": "Dead Cells has received yet another update, named Practice Makes Perfect, which adds a training area, powerful buffs called Aspects, and other more. The devs say the patch is focused \"on improving the ease-of-use and learning curve for everyone (paticularly newcomers & occasional players), without altering the overall difficulty of the game.\" To facilitate this goal, all the new features are optional – allowing players to execute their sweet dodge rolls with the challenge they prefer.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/new-dead-cells-update-makes-it-more-approachable-to-newcomers",
          "publishedOn": "2021-09-17T16:31:26.000Z",
          "wordCount": 896,
          "title": "New Dead Cells update makes it more approachable to newcomers"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-making-of-dishonored-death-of-the-outsider-and-how-arkane-killed-a-god",
          "author": "Hirun Cryer",
          "description": "Dishonored: Death Of The Outsider is a revenge and redemption tale, only here the target of your revenge is god. 'We're going to kill a god’ might seem like a well-trodden path in JRPG country, but Death Of The Outsider brings something new to the table. Here, the god is a trickster, a victim, and the source of the player's power. He's a figure that has come to define the Dishonored series as a whole, and is both revered and pitied by its players. So how, exactly, do you go about killing a god like this? I spoke to the developers at Arkane to find out. \nRead more",
          "link": "https://www.rockpapershotgun.com/the-making-of-dishonored-death-of-the-outsider-and-how-arkane-killed-a-god",
          "publishedOn": "2021-09-17T16:00:00.000Z",
          "wordCount": 3254,
          "title": "The making of Dishonored: Death Of The Outsider, and how Arkane killed a god"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-safe-codes",
          "author": "Rebecca Jones",
          "description": "Where are all of the codes to open safes and doors and unlock machine terminals in Deathloop? In true Arkane tradition, Deathloop is full of safes and locked doors that can only be accessed with three- and four-digit codes. Some of the secrets hidden within are essential to progressing the story, while others just contain some good loot. Some of the Visionaries have also used codes to protect some of their machines, which you'll need to override in order to bypass their security.\n Read more",
          "link": "https://www.rockpapershotgun.com/deathloop-safe-codes",
          "publishedOn": "2021-09-17T15:18:38.000Z",
          "wordCount": 2818,
          "title": "Deathloop codes: safe, door, and machine code locations"
        },
        {
          "id": "https://www.rockpapershotgun.com/ultimate-audio-bang-14-big-meaty-guns-slapping-meat",
          "author": "Ed Thorn",
          "description": "Predictably, Imogen and I begin this week's episode of Ultimate Audio Bang by getting excited about Deathloop before realising that there's plenty of other newsy bits to cover. Listen to get our hot thoughts on the Call Of Duty: Vanguard reveal, Battlefield 2042's delay, the Overwatch League using an early build of Overwatch 2 in 2022, and plenty more shootery things.\nRead more",
          "link": "https://www.rockpapershotgun.com/ultimate-audio-bang-14-big-meaty-guns-slapping-meat",
          "publishedOn": "2021-09-17T15:10:25.000Z",
          "wordCount": 834,
          "title": "Ultimate Audio Bang #14: big meaty guns slapping meat"
        },
        {
          "id": "https://www.rockpapershotgun.com/wuchang-fallen-feathers-looks-like-a-chinese-take-on-bloodborne",
          "author": "Alice O'Connor",
          "description": "Following fawning over the Monkey King violence of Black Myth: Wukong, the latest upcoming Chinese game to turn heads with Souls-inspired action and shiny graphics might be Wuchang: Fallen Feathers. A new gameplay trailer released today gives a long look at a sexy babe fighting against plague-mutated people using her melee weapons, firearms, and gut-gouging counters. Yeah, feeling a lot of Bloodborne inspiration here. Have a look below.\nRead more",
          "link": "https://www.rockpapershotgun.com/wuchang-fallen-feathers-looks-like-a-chinese-take-on-bloodborne",
          "publishedOn": "2021-09-17T15:09:50.000Z",
          "wordCount": 768,
          "title": "Wuchang: Fallen Feathers looks like a Chinese take on Bloodborne"
        },
        {
          "id": "https://www.rockpapershotgun.com/arctic-cpu-coolers-to-get-free-mounting-kit-upgrades-for-intel-lga-1700-socket",
          "author": "James Archer",
          "description": "We haven’t seen much of Intel Alder Lake so far, despite being set for release in a matter of weeks.  One thing we do know is that like the majority of Intel’s last few chip family releases, the desktop contingent of these 12th-gen processors will need a brand-new motherboard socket: LGA 1700. \nRead more",
          "link": "https://www.rockpapershotgun.com/arctic-cpu-coolers-to-get-free-mounting-kit-upgrades-for-intel-lga-1700-socket",
          "publishedOn": "2021-09-17T15:09:34.000Z",
          "wordCount": 1021,
          "title": "Arctic CPU coolers to get free mounting kit upgrades for Intel LGA 1700 socket"
        },
        {
          "id": "https://www.rockpapershotgun.com/benchmarking-has-completely-ruined-my-steam-play-time-profile",
          "author": "Katharine Castle",
          "description": "I don't know if you know this about me, but I love a good list. For the past ten years, I've kept a detailed spreadsheet of all the games I've ever played. The bulk of it catalogues games by platform, but I've also kept a list of all the games I play per year since 2010. Call me crazy, but this document is a great source of joy for me. I love being able to look back and see when I last played a certain game, and it's also interesting to me to see just how many of them I manage to play each year. I also keep similar lists for films I see at the cinema, the books I read, as well as the plays and musicals I see at the theatre. I'm not kidding. I really do love a good list. \nPerhaps unsurprisingly, I'm also fascinated by the amount of time I spend playing games, too (and yes, I do have a list for this as well - albeit only for my Nintendo Wii games at the moment). Steam, of course, keeps excellent track of your play time - and because it's always open on my PC, there's no need to keep my own version of it. I can just load up my Steam profile and gaze lovingly at the hours and minutes in my All Games tab. Except I can't anymore, because four years' worth of professional benchmarking has absolutely ruined my play time figures. It upsets me. Because I haven't really spent 130 hours playing Shadow Of The Tomb Raider. Or 38 hours playing Doom. It's all benchmarking, and I wish there was a way to scrub these games clean again so everything can be nice and neat and orderly again, and most of all, accurate. \nRead more",
          "link": "https://www.rockpapershotgun.com/benchmarking-has-completely-ruined-my-steam-play-time-profile",
          "publishedOn": "2021-09-17T15:09:19.000Z",
          "wordCount": 941,
          "title": "Benchmarking has completely ruined my Steam play time profile"
        },
        {
          "id": "https://www.rockpapershotgun.com/give-yourself-a-good-day-by-playing-webbed",
          "author": "Sin Vega",
          "description": "It was 3am and Hucks the cellar spider was finally surrounded by, instead of carrying, her wee hatchlings. Clarice, her slightly dim neighbour, was resting after another hour spent fruitlessly stumbling around after an even dafter flying thingy that would eventually blunder right into her face.\r\n\nPlaying Webbed seemed inevitable for someone who watches her ceiling spiders when she can't sleep or finish an article. But within about a minute of playing, it became clear that it's the kind of game that will bring joy to almost anyone. Webbed is immediately brilliant.\nRead more",
          "link": "https://www.rockpapershotgun.com/give-yourself-a-good-day-by-playing-webbed",
          "publishedOn": "2021-09-17T14:30:10.000Z",
          "wordCount": 659,
          "title": "Give yourself a good day by playing Webbed"
        },
        {
          "id": "https://www.rockpapershotgun.com/steam-deck-dev-kit-screenshots-show-a-likely-big-picture-replacement-steamos-3-allegedly-leaks",
          "author": "James Archer",
          "description": "Whelp, that didn’t take long. Steam Deck dev kits were only sent out to game developers this week, and it looks like Valve’s handheld PC is already getting picked apart. That’s according to SteamDB creator Pavel Djundik, who tweeted screenshots of the Steam Deck UI before claiming the entire SteamOS 3 operating system has been leaked.\nRead more",
          "link": "https://www.rockpapershotgun.com/steam-deck-dev-kit-screenshots-show-a-likely-big-picture-replacement-steamos-3-allegedly-leaks",
          "publishedOn": "2021-09-17T13:03:49.000Z",
          "wordCount": 1031,
          "title": "Steam Deck dev kit screenshots show a likely Big Picture replacement, SteamOS 3 allegedly leaks"
        },
        {
          "id": "https://www.rockpapershotgun.com/clive-sinclair-who-brought-us-the-zx-spectrum-has-died",
          "author": "Alice O'Connor",
          "description": "Clive Sinclair, the founder of the company which brought us the ZX Spectrum computer, has died. The first encounter with PC gaming for many of a certain age in the UK wasn't through any beige box MS-DOS or Windows, it was on that futuristic wee black keyboard with rubbery keys and a colourful stripe, which loaded software from cassette tapes. I'm too young to have seen its glory days but I think the first PC game I played was a Speccy shoot 'em up, a magical experience I didn't believe would actually work when I first saw my pal plug a tape deck into a keyboard.\nRead more",
          "link": "https://www.rockpapershotgun.com/clive-sinclair-who-brought-us-the-zx-spectrum-has-died",
          "publishedOn": "2021-09-17T12:09:04.000Z",
          "wordCount": 1014,
          "title": "Clive Sinclair, who brought us the ZX Spectrum, has died"
        },
        {
          "id": "https://www.rockpapershotgun.com/tails-of-iron-review",
          "author": "Alice Bell",
          "description": "As enquiring minds already know, rats are very cute. I've not had pet rats myself, but a bunch of my friends have. Rats have lovely little pin-prick hands and feet, and they will give you wiffly-nose kisses while they assess whether your hair is worth exploring or not.\nThe rats in Tails Of Iron are cute. Little 2D inhabitants of a feudal rat kingdom, where they get milk from insects that look like cows, and royal succession is determined in trial by combat - which you, Prince Redgi, win, and shortly thereafter become King Redgi when your dad is murdered by frogs right in front of you. Let the amphibian bodies hit the floor. Time to kick this RPG into a side-on soulslike experience. Slice open a frog belly and see the guts spill out. These rats are cute, but also u wot? U wot? Say that again m8. Say that to my face. I'll 'ave you.\nRead more",
          "link": "https://www.rockpapershotgun.com/tails-of-iron-review",
          "publishedOn": "2021-09-17T12:04:39.000Z",
          "wordCount": 1790,
          "title": "Tails Of Iron review: a fun 2D Soulslike with a bit too much padding"
        },
        {
          "id": "https://www.rockpapershotgun.com/tales-of-arise-is-the-fastest-selling-game-in-the-series",
          "author": "Graham Smith",
          "description": "The Tales games stretch back to 1995's Tales Of Phantasia, but the latest entry, Tales Of Arise, is now the fastest selling in the series. In less than a week, it has sold a million copies, Bandai Namco say.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/tales-of-arise-is-the-fastest-selling-game-in-the-series",
          "publishedOn": "2021-09-16T22:36:13.000Z",
          "wordCount": 756,
          "title": "Tales Of Arise is the fastest selling game in the series"
        },
        {
          "id": "https://www.rockpapershotgun.com/titan-quest-and-jagged-alliance-are-free-to-keep-right-now",
          "author": "Graham Smith",
          "description": "THQ Nordic are celebrating their 10th anniversary by giving away free games via Steam. Surprisingly enduring action RPG Titan Quest is currently free-to-keep, and so is the ancient turn-based tactics of Jagged Alliance. \r\n\nThen, if you want something a little more modern, the real-time tactical stealth of Desperados 3 is free-to-try for the next three days.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/titan-quest-and-jagged-alliance-are-free-to-keep-right-now",
          "publishedOn": "2021-09-16T21:41:48.000Z",
          "wordCount": 839,
          "title": "Titan Quest and Jagged Alliance are free to keep right now"
        },
        {
          "id": "https://www.rockpapershotgun.com/please-ikea-make-me-some-grownup-gaming-furniture",
          "author": "Graham Smith",
          "description": "Ikea, makers of large, boring Lego projects for adults, are launching a range of gaming furniture. The set, created in collaboration with Republic Of Gamers, includes desks, chairs, streaming accessories and what The Guardian describes as a \"multi-functional cushion/blanket.\"\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/please-ikea-make-me-some-grownup-gaming-furniture",
          "publishedOn": "2021-09-16T21:01:31.000Z",
          "wordCount": 830,
          "title": "Please Ikea, make me some grownup gaming furniture"
        },
        {
          "id": "https://www.rockpapershotgun.com/call-of-duty-vanguards-beta-opens-to-all-this-weekend",
          "author": "Graham Smith",
          "description": "Call Of Duty: Vanguard has already had a beta on PlayStation, and if you've pre-ordered the game you can play it right now on PC. On Saturday however, the beta will open up to everyone with a Battle.net account. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/call-of-duty-vanguards-beta-opens-to-all-this-weekend",
          "publishedOn": "2021-09-16T20:07:11.000Z",
          "wordCount": 871,
          "title": "Call Of Duty: Vanguard's beta opens to all this weekend"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-to-overclock-gpu",
          "author": "James Archer",
          "description": "Learning how to overclock your GPU sounds like it should be one of gaming PC ownership’s essential skills, like knowing how to clean your PC or how to check CPU temperature. And why not? Coaxing extra performance out of a component will get you more frames-per-second at no additional charge, and you can do it with just about every gaming card under the sun. Even the best graphics cards that come with factory overclocks will leave headroom for additional gains to unlock yourself.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/how-to-overclock-gpu",
          "publishedOn": "2021-09-16T16:26:44.000Z",
          "wordCount": 2243,
          "title": "How to overclock your GPU"
        },
        {
          "id": "https://www.rockpapershotgun.com/valheim-has-added-a-hot-tub-for-vikings-to-unwind",
          "author": "Alice O'Connor",
          "description": "Trying to survive in purgatory isn't easy, having to hunt and build and craft everything you need to slay mighty mythical beasts. Thankfully, the Vikings of Valheim can now relax with their pals in a hot tub, one of many fancy household items added in the 'Home & Hearth' early access update today. Sure sure it brings new weapons and new creatures and balance changes and things too, but: hot tub!\nRead more",
          "link": "https://www.rockpapershotgun.com/valheim-has-added-a-hot-tub-for-vikings-to-unwind",
          "publishedOn": "2021-09-16T16:22:16.000Z",
          "wordCount": 807,
          "title": "Valheim has added a hot tub for Vikings to unwind"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-how-to-beat-yervha",
          "author": "Rebecca Jones",
          "description": "What are the correct answers to the Yervha's questions in Deathloop? The Yervha, a.k.a. Queen of Riddles, is a trivia machine in Deathloop. If you can answer all 10 of its questions correctly you'll win a prize! A very modest prize, but a prize nonetheless. And who doesn't love a good trivia challenge? You certainly seem to, since you're here!\nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-how-to-beat-yervha",
          "publishedOn": "2021-09-16T15:02:46.000Z",
          "wordCount": 1447,
          "title": "The Yervha: how to beat Deathloop's fiendish trivia machine"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-electronic-wireless-show-podcast-episode-156-the-best-doctors-in-games-special",
          "author": "Alice Bell",
          "description": "The recording of this episode of The Electronic Wireless Show podcast turned out to be unfortunately cursed with technical issues, which means I am (probably noticeably) tired and grumpy, and don't let Matthew and Nate reproduce their witty banter from the first time we tried to record. No cold open! Still, nothing to cheer me up like some good bedside manner from a doctor. Oh no, it turns out all game doctors are awful!\nWe discuss our favourite game medical types, and also discuss why doctors in games are so often evil baddies. The saga of Matthew and his teeth continues, as well as envisioning Matthew as a clown who just turns up to your kids birthday party smeared in his wife's lipstick, drinks all your Fanta, and leaves again. Now that's malpractice.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-electronic-wireless-show-podcast-episode-156-the-best-doctors-in-games-special",
          "publishedOn": "2021-09-16T15:00:00.000Z",
          "wordCount": 796,
          "title": "EWS podcast episode 156: the best doctors special"
        },
        {
          "id": "https://www.rockpapershotgun.com/gamedec-review",
          "author": "Khee Hoon Chan",
          "description": "From the stealth-oriented Foreclosed to the twin-sticky The Ascent, there has been a bumper crop of cyberpunk shooters this year, their endless gun fests typically set amidst a gaudy onslaught of neon-tinged billboards, metallic skyscrapers and indiscriminately-placed Asian motifs.\nIn spite of its roots, Gamedec initially seems like a reprieve from this recent blitz of cyberpunk games. It sticks steadfastly to its self-imposed, zero-combat rule, instead leaning heavily towards the genre’s crime fiction elements. That’s because in Gamedec, you’re a detective actually carrying out proper investigative work, rather than simply pointing the smokey end of a gun towards your problems. You’ll sleuth around for clues, make deductions based on your discoveries, and draw conclusions that will shape the outcome of your cases.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/gamedec-review",
          "publishedOn": "2021-09-16T14:00:00.000Z",
          "wordCount": 1795,
          "title": "Gamedec review: a great cyberpunk concept undone by a bloated script"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-trinkets",
          "author": "Rebecca Jones",
          "description": "What are the best trinkets in Deathloop? Trinkets might sound frivolous, but they are in fact Deathloop's answer to mods: applying them provides potentially very powerful combat buffs, and therefore they're actually very important. Deathloop's Trinkets come in two varieties: Character Trinkets (personal mods applied to your player character) and Weapon Trinkets (mods which can be applied individually to every gun in your possession).\n Read more",
          "link": "https://www.rockpapershotgun.com/deathloop-trinkets",
          "publishedOn": "2021-09-16T13:00:51.000Z",
          "wordCount": 2086,
          "title": "Best Deathloop trinkets: what every trinket does and which are best for your loadout"
        },
        {
          "id": "https://www.rockpapershotgun.com/mechwarrior-5-mercenaries-gets-marriage-melee-and-mech-switching-with-its-next-dlc",
          "author": "Imogen Beckhelling",
          "description": "Don't you just hate it when you're getting married to secure an alliance with a certain faction, but another faction insists on existing in-between your borders? Don't worry, it's a simple fix: send in an army of mechs to conquer them, then you and your betrothed get even more space to share! \r\n\n\r\nThis is pretty much the plot of the next MechWarrior 5: Mercenaries DLC, Legend Of The Kestrel Lancers. It's arriving on September 23rd alongside a free update that will finally let players punch other mechs in the face. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/mechwarrior-5-mercenaries-gets-marriage-melee-and-mech-switching-with-its-next-dlc",
          "publishedOn": "2021-09-16T13:00:00.000Z",
          "wordCount": 1348,
          "title": "MechWarrior 5: Mercenaries gets marriage, melee and mech-switching with its next DLC"
        },
        {
          "id": "https://www.rockpapershotgun.com/deltarune-chapter-2-continues-the-undertale-follow-up-tomorrow",
          "author": "Alice O'Connor",
          "description": "This week we'll get to play the second chapter of Deltarune, the neither-sequel-nor-prequel-but-maybe-related follow-up to Undertale, creator Toby Fox has announced. Surprise!\nRead more",
          "link": "https://www.rockpapershotgun.com/deltarune-chapter-2-continues-the-undertale-follow-up-tomorrow",
          "publishedOn": "2021-09-16T11:54:24.000Z",
          "wordCount": 884,
          "title": "Deltarune Chapter 2 continues the Undertale follow-up tomorrow"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-best-battle-royale-games",
          "author": "Ed Thorn",
          "description": "Outlast the rest of the competition and emerge the last person standing, that's the motto for the best battle royale games out there. Often there's a big circle of poison gas pushing people closer together, or like, everyone parachutes in for some reason. Some don't feature any of these things, and opt for obstacle courses, or zany community creations instead. You may have thought battle royale games were quite one-note, but they're actually quite varied. So below I've rounded up some of the best ways to prove you're the fittest survivor of them all.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-best-battle-royale-games",
          "publishedOn": "2021-09-16T11:06:09.000Z",
          "wordCount": 2776,
          "title": "The 10 best battle royale games"
        },
        {
          "id": "https://www.rockpapershotgun.com/skatebird-review",
          "author": "Brendan Caldwell",
          "description": "Skatebird is simultaneously a homage to the Tony Hawk games of old and a celebration of just how stupid birds can be. It's the arcadey kind of kickflipper, handling more like THUG than a Skate game. But don't expect the truly smooth flow of the Hawkster's outings. There's plenty of wobbly physics on show here, much of it intentional and jokey (as you'd expect from a game that seems to have resulted entirely from a single pun). But some of it perhaps not. Still, it's hard to hate on these feathery ones when they squawk so pure, and when their taste in music is im-peck-able.\nRead more",
          "link": "https://www.rockpapershotgun.com/skatebird-review",
          "publishedOn": "2021-09-16T11:02:28.000Z",
          "wordCount": 1846,
          "title": "Skatebird review: tiny hawks win the day in this wonky skating game"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-amazing-american-circus-review",
          "author": "Matt Cox",
          "description": "By the time Henry Ford rolled up to see my show, I was ready to pack my trunk and say goodbye to the circus. I’d been ready a long time ago, truth be told, some time between inciting industrial action amongst JP Morgan’s workers and nabbing an automaton from Tesla. My troupe spread delight wherever we roamed, but the crowds weren’t to know we’d been plying the same tricks for hour after hour - nor that it had hardly taken one to hone my act to the point where failure was inconceivable. Every meagre juggling trick brought whoops from the crowd and impatience to my heart. With every high-wire act, my spirit sank lower still. \r\n\n\r\nThere’s no turn around coming, I’m afraid. The Amazing American Circus is a deckbuilder with some nice ideas, but it’s far more clown than strongman. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-amazing-american-circus-review",
          "publishedOn": "2021-09-16T08:00:00.000Z",
          "wordCount": 1725,
          "title": "The Amazing American Circus review: I hate to say it, but there are better shows in town"
        },
        {
          "id": "https://www.rockpapershotgun.com/corsairs-pretty-240mm-aio-cooler-is-going-cheap-on-amazon-uk",
          "author": "Will Judd",
          "description": "Liquid CPU coolers are all the rage these days, as they look neat and provide the sort of excellent cooling performance you'd normally only get out of an oversized air cooler. Corsair make some of the best AiOs in the business, and today their (draws breath) iCue H100i Pro XT RGB 240mm CPU cooler (phew) is going cheap. It debuted at £115 and normally costs £90, but today you can pick it up for the relative bargain price of £72. \nRead more",
          "link": "https://www.rockpapershotgun.com/corsairs-pretty-240mm-aio-cooler-is-going-cheap-on-amazon-uk",
          "publishedOn": "2021-09-15T20:56:09.000Z",
          "wordCount": 918,
          "title": "Corsair's pretty 240mm AiO cooler is going cheap on Amazon UK"
        },
        {
          "id": "https://www.rockpapershotgun.com/a-crucial-mx500-1tb-ssd-for-85-headlines-a-host-of-newegg-deals",
          "author": "Will Judd",
          "description": "Newegg in the US is discounting a host of PC peripherals and components today, so we thought we'd highlight our favourite three deals especially for you. They include a full-size hot-swappable mechanical keyboard for $50, 16 gigabytes of 3600MHz RAM for $73 and a 1TB SSD for just $85. Here are all the details!\nRead more",
          "link": "https://www.rockpapershotgun.com/a-crucial-mx500-1tb-ssd-for-85-headlines-a-host-of-newegg-deals",
          "publishedOn": "2021-09-15T20:35:40.000Z",
          "wordCount": 1088,
          "title": "A Crucial MX500 1TB SSD for $85 headlines a host of Newegg deals"
        },
        {
          "id": "https://www.rockpapershotgun.com/battlefield-2042-rumoured-to-be-delayed-by-several-weeks",
          "author": "Graham Smith",
          "description": "Battlefield 2042 has been delayed until November 19th. EA Dice's futuristic shooter was originally due to release on October 11th, but a day of rumours was concluded by official confirmation of the new release date by EA.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/battlefield-2042-rumoured-to-be-delayed-by-several-weeks",
          "publishedOn": "2021-09-15T20:18:20.000Z",
          "wordCount": 782,
          "title": "Battlefield 2042 delayed until November 19th"
        },
        {
          "id": "https://www.rockpapershotgun.com/nidhogg-and-nidhogg-2-free-updates-add-new-levels-and-cats",
          "author": "Graham Smith",
          "description": "Good news! Chaotic multiplayer brawler Nidhogg 2 just received a free update adding new costumes and two new levels, including one set upon a train. Even better news: the original Nidhogg also received a free update, adding a new battleground and some new animated cats.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/nidhogg-and-nidhogg-2-free-updates-add-new-levels-and-cats",
          "publishedOn": "2021-09-15T19:35:57.000Z",
          "wordCount": 767,
          "title": "Nidhogg and Nidhogg 2 free updates add new levels and cats"
        },
        {
          "id": "https://www.rockpapershotgun.com/beaver-city-builder-timberborn-is-out-in-early-access-now",
          "author": "Graham Smith",
          "description": "It feels as if the past couple of years have seen a quiet resurgence of Settlers-style town building games, and often those where you're prepping to survive a terrible winter. Timberborn looks like it would sit in that genre but with a distinct twist: all the humans are long dead, and your town is instead inhabited by beavers.\r\n\nIt's out in early access now.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/beaver-city-builder-timberborn-is-out-in-early-access-now",
          "publishedOn": "2021-09-15T18:47:14.000Z",
          "wordCount": 808,
          "title": "Beaver city-builder Timberborn is out in early access now"
        },
        {
          "id": "https://www.rockpapershotgun.com/kerbal-space-program-developers-balsa-model-flight-simulator-is-out-now",
          "author": "Graham Smith",
          "description": "Building balsa models doesn't have the same immediate appeal as constructing space rockets, and yet Balsa Model Flight Simulator still seems extremely appealing. That's partly because it's from the original developer of Kerbal Space Program, and offers a similar physics construction toolset even if on a more terrestrial scale. It's available now in early access.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/kerbal-space-program-developers-balsa-model-flight-simulator-is-out-now",
          "publishedOn": "2021-09-15T18:08:49.000Z",
          "wordCount": 820,
          "title": "Kerbal Space Program developer's Balsa Model Flight Simulator is out now"
        },
        {
          "id": "https://www.rockpapershotgun.com/solar-ash-has-a-very-different-take-on-marios-mushroom-kingdom",
          "author": "Alice Bell",
          "description": "Hey, remember Hyper Light Drifter, your favourite action-RPG of five years ago? The devs Heart Machine are soon to be back with their new game Solar Ash, which is coming out at the end of next month. It is not like Hyper Light Drifer. For starters, Solar Ash is full 3D. Creative director Alx Preston described the elevator pitch to me as \"Super Mario Galaxy meets Shadow Of The Colossus, and sprinkle in a bit of Jet Set Radio\" during a hands off preview event last week, and on the face of it, it looks fantastic - something that you, too, may have gleaned from one of its recent trailers. \nBut Solar Ash is a game about motion, something that's very difficult to convey during a remote hands-off demo. I cannot tell you how Solar Ash feels, but I'm also a toddler with a marshmallow: put something that looks fuckin' sweet in front of me and I want to consume it, and snatch it up with my grabby little fingers. \nRead more",
          "link": "https://www.rockpapershotgun.com/solar-ash-has-a-very-different-take-on-marios-mushroom-kingdom",
          "publishedOn": "2021-09-15T16:00:00.000Z",
          "wordCount": 1348,
          "title": "Solar Ash has a very different take on Mario's Mushroom Kingdom"
        },
        {
          "id": "https://www.rockpapershotgun.com/aragami-2-review",
          "author": "Nic Reuben",
          "description": "‘Breezy’ seems like an odd word to slap on a stealth game - a measured, sometimes plodding genre - but it fits ninj-em-up Aragami 2 perfectly. Flow like water, it says; stabby water, with wings. Flow, then, like an irresponsibly sharp ice-sculpture of a hummingbird. Flow imperfectly and playfully, for the same tools that allow you to strike masterfully silent also let you mitigate sloppiness with improvisational glee. If Tenchu was an armoury to select from, and Shadow Tactics a map to study, Aragami 2 is a toybox. Let’s play ninjas, shall we?\nRead more",
          "link": "https://www.rockpapershotgun.com/aragami-2-review",
          "publishedOn": "2021-09-15T16:00:00.000Z",
          "wordCount": 1636,
          "title": "Aragami 2 review: a breezy ninja stealth 'em up"
        },
        {
          "id": "https://www.rockpapershotgun.com/bethesda-say-theyre-actively-investigating-deathloop-pc-stuttering",
          "author": "Alice O'Connor",
          "description": "While Arkane's time-looping supernatural shooter Deathloop is a good'un, the PC release has not gone down well, with many players reporting suffering framerates—the worst type of timejank. The problem still stands, a day-and-a-half after launch, but there is some comfort to be found in at least an official acknowledgment from publishers Bethesda that yes, they know it's a problem. Not nearly as much comfort as a fix would be. Maybe you'll find some meagre comfort in the unlikely source for this acknowledgement: a nice picture of some burgers.\nRead more",
          "link": "https://www.rockpapershotgun.com/bethesda-say-theyre-actively-investigating-deathloop-pc-stuttering",
          "publishedOn": "2021-09-15T15:58:49.000Z",
          "wordCount": 905,
          "title": "Bethesda \"actively investigating\" Deathloop PC stuttering"
        },
        {
          "id": "https://www.rockpapershotgun.com/shashingo-helps-you-learn-japanese-through-photography-and-id-like-it-now-please",
          "author": "Ed Thorn",
          "description": "Despite being half Japanese, I know very, very little of the language. It pains me, it really does. Occasionally I get this urge to learn it, and lately it's bubbled up because I'm planning on jetting over there next year [laughs in covid]. Unfortunately, all my efforts at self-study have gone down the pan.\nI've tried learning Japanese using audio courses and textbooks, but my discipline wanes only a couple of months in. There are many reasons why I suck at self-study, but flashcards are one of them. Sorry, but they suck and they are tedious. This is where I hope the upcoming 'edutainment' game Shashingo will change my relationship with them.\nRead more",
          "link": "https://www.rockpapershotgun.com/shashingo-helps-you-learn-japanese-through-photography-and-id-like-it-now-please",
          "publishedOn": "2021-09-15T15:25:02.000Z",
          "wordCount": 731,
          "title": "Shashingo helps you learn Japanese through photography and I'd like it now please"
        },
        {
          "id": "https://www.rockpapershotgun.com/now-a-union-have-filed-charges-against-activision-blizzard-too",
          "author": "Alice O'Connor",
          "description": "A group of Activision Blizzard workers have teamed up with a union to file charges of unfair labour practices, accusing the company of \"intimidation and union busting\". This comes less than two months after a California state agency sued the company for alleged discrimination, harrassment, and retaliation. The new charges filed with the labour board claim that Actiblizzard have attempted to stop employees from discussing working conditions or working together to improve them, in violation of labour law.\nRead more",
          "link": "https://www.rockpapershotgun.com/now-a-union-have-filed-charges-against-activision-blizzard-too",
          "publishedOn": "2021-09-15T15:09:12.000Z",
          "wordCount": 1124,
          "title": "Now a union have filed charges against Activision Blizzard too"
        },
        {
          "id": "https://www.rockpapershotgun.com/watch-the-i-am-dead-devs-explain-the-lovely-real-world-inspirations-behind-the-game",
          "author": "Kaan Serin",
          "description": "Hollow Ponds have released a video detailing the real-world inspirations behind their 2020 puzzle game I Am Dead, a game about a ghost returning to their hometown and view it through new (dead) eyes. The cultural specificity in I Am Dead becomes clear as the two lead developers, Richard Hogg and Ricky Haggett, discuss how the British seaside town of Hastings influenced the creation of the game’s fictional setting Shelmerston. It's 25 minutes long, but it's a lovely watch.\nHogg and Haggett give insights on the various buildings, objects, and jokes from Hastings that infiltrated their way into the game. The video shows off previously unseen concept art, photography, diagrams, maps and mood boards that were used in the development of I Am Dead. You will also learn a lot about the town Hastings.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/watch-the-i-am-dead-devs-explain-the-lovely-real-world-inspirations-behind-the-game",
          "publishedOn": "2021-09-15T15:04:39.000Z",
          "wordCount": 1217,
          "title": "Watch the I Am Dead devs explain the lovely real world inspirations behind the game"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-infusion-residuum",
          "author": "Rebecca Jones",
          "description": "How can you carry over weapons and powers in Deathloop? Deathloop is a darkly comedic action-adventure game which sees assassins Colt and Julianna attempting to kill each other time and time again over the course of a single looping day. The titular loop resets itself if the day ends before Colt can kill all eight Visionaries (including Julianna), or if Colt dies three times in a single mission. When this happens, Colt wakes up at the beginning of the day with everything reset — including any weapons, powers, and trinkets he managed to pick up during his last trip through the loop.\nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-infusion-residuum",
          "publishedOn": "2021-09-15T15:01:42.000Z",
          "wordCount": 1768,
          "title": "Deathloop infusion: how to carry over weapons and powers between loops with Residuum"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-water-resistant-is-this-water-resistant-mouse-a-scientific-investigation",
          "author": "James Archer",
          "description": "There are lots of spill-resistant keyboards, including some in our best gaming keyboard rankings, but you hardly ever see mice with similar protection. Despite the fact that they’re always right next to the keyboard, and thus just at risk from low-flying beverages. There are at least two, though: The SteelSeries Aerox 3 and Aerox 3 Wireless. According to SteelSeries, these were the first gaming mice on the market to receive IP54 certification, effectively guaranteeing protection against dust ingress and water splashes.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/how-water-resistant-is-this-water-resistant-mouse-a-scientific-investigation",
          "publishedOn": "2021-09-15T14:56:38.000Z",
          "wordCount": 1646,
          "title": "How water-resistant is this water-resistant mouse? A scientific investigation"
        },
        {
          "id": "https://www.rockpapershotgun.com/this-new-doom-mod-will-let-you-send-thatcher-back-to-hell",
          "author": "Alice O'Connor",
          "description": "Next week, reviled former British prime minister Margaret Thatcher will rise from her grave to bring Hell back to Earth, and only one space marine can stop her. Announced today, Thatcher's Techbase is an upcoming mod for classic Doom which ventures in the tenth circle of Hell (aka the United Kingdom) to battle the demonic forces of the Iron Lady. Modding politicians into games is a vintage jape but Thatcher's Techbase makes a real effort with custom art, its own campaign, music from Paradise Killer's composer, and apparently even the voice behind Demeter and Persephone in Hades. Watch this trailer.\nRead more",
          "link": "https://www.rockpapershotgun.com/this-new-doom-mod-will-let-you-send-thatcher-back-to-hell",
          "publishedOn": "2021-09-15T13:40:15.000Z",
          "wordCount": 931,
          "title": "This new Doom mod will let you send Thatcher back to Hell"
        },
        {
          "id": "https://www.rockpapershotgun.com/i-am-fish-review",
          "author": "Ed Thorn",
          "description": "Like a splash of cold water to the face, I Am Fish is a wonderfully refreshing physics platformer. This isn't a grim tale wrapped in layers of metaphor, or a walking simulator that guides you slowly through a field of feelings. Here, you are simply a fish. The bowl is your prison. The ocean is your freedom. Now imagine Ian Mckellen with the same gravitas as he had playing Gandalf in Lord Of The Rings, except with a farmer's cap on. He is peering into your googly, goldfish eyes. In a west country accent, he bellows, \"Swim, you fool!\"\nRead more",
          "link": "https://www.rockpapershotgun.com/i-am-fish-review",
          "publishedOn": "2021-09-15T13:00:00.000Z",
          "wordCount": 1648,
          "title": "I Am Fish review: a physics platformer with sole"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-weapons",
          "author": "Rebecca Jones",
          "description": "How many weapons are there in Deathloop and how do you get the best ones? Deathloop is about two assassins locked in a time-looping duel to the death, so naturally, there are weapons aplenty in this game. Thanks to the titular loop, you aren't always going to be able to hang on to every weapon you pick up, so knowing where and how to get your favourite weapons back is going to be important.\nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-weapons",
          "publishedOn": "2021-09-15T11:27:14.000Z",
          "wordCount": 2397,
          "title": "Best Deathloop weapons: every weapon in Deathloop explained"
        },
        {
          "id": "https://www.rockpapershotgun.com/death-trash-and-others-want-to-know-how-the-sausage-is-made",
          "author": "Andreas Inderwildi",
          "description": "“What’s with all the meat everywhere, anyway?” my Death Trash alter ego Mildred asks. “It’s just there. Grows.” the meat merchant replies. “Maybe we’re living on a planet full of flesh and right now we’re standing on a crust of stone and dirt. So, do you want a piece of meat now?” I really don’t. But Mildred does. After all, this mystery meat is the main healing item in the game. It’s what keeps you and the world around you alive. It’s harvested from the ground like precious stones, the literal blood flowing in this grotesque world’s barebones economy, eaten raw and served in meat bars.\nBut where does the meat come from? Whence the amorphous flesh blobs and pools of blood? From another planet, another dimension? There are no animals in this strange ecosystem apart from Fleshworms. The strange meat seems to be linked to another mystery, the advent of the flesh titans (which are exactly what the name suggests). Soon we discover that we are able to commune with the meat and, through it, speak to a enigmatic being called The Oracle. The meat is a kind of universal consciousness, a flesh and blood information highway, into which those who are attuned to it can plug in. Whether the meat and the flesh titans are good or bad for humanity is up for debate, and there are factions that deify and others that hate them, vying for power. The clot thickens.\nRead more",
          "link": "https://www.rockpapershotgun.com/death-trash-and-others-want-to-know-how-the-sausage-is-made",
          "publishedOn": "2021-09-15T11:00:00.000Z",
          "wordCount": 1607,
          "title": "Death Trash and others want to know how the sausage is made"
        },
        {
          "id": "https://www.rockpapershotgun.com/boyfriend-dungeon-broke-my-heart-and-im-glad-it-did",
          "author": "Kaan Serin",
          "description": "Kitfox’s recently released dating sim Boyfriend Dungeon has a novel premise. In Boyfriend Dungeon you date sword people: humans who transform into weapons that you can take dungeon crawling. And no, not sex dungeons. Classic video game dungeons with loot and monsters. On paper, Boyfriend Dungeon sounds like the best six-ish hours you could have in a game, combining the endorphin rush of monster-slaying with a cast of hotties that’ll make your heart flutter. Sounds like a great time… except one of these hotties slid a sword right through my heart.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/boyfriend-dungeon-broke-my-heart-and-im-glad-it-did",
          "publishedOn": "2021-09-15T10:03:46.000Z",
          "wordCount": 1767,
          "title": "Boyfriend Dungeon broke my heart, and I'm glad it did"
        },
        {
          "id": "https://www.rockpapershotgun.com/valve-posts-steam-deck-dev-kits-on-blog-and-in-mail",
          "author": "James Archer",
          "description": "The Steam Deck, Valve’s attempt at a fully portable handheld PC, has taken another step towards being an actual product. In a Steam blog post, Valve have shown off the Steam Deck dev kits that are leaving the roost to provide game developers with some hands-on time, ahead of the planned launch this December. They grow up so fast, eh?\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/valve-posts-steam-deck-dev-kits-on-blog-and-in-mail",
          "publishedOn": "2021-09-15T09:34:35.000Z",
          "wordCount": 997,
          "title": "Valve posts Steam Deck dev kits, on blog and in mail"
        },
        {
          "id": "https://www.rockpapershotgun.com/everyones-invited-to-play-age-of-empires-4-this-weekend-in-a-stress-test",
          "author": "Alice O'Connor",
          "description": "After running an Age Of Empires 4 closed beta test for lucky ticketholders, the makers now want absolutely everyone to pile in and click men as hard as you can to see if the game explodes. The historical RTS is holding an open \"technical stress test\" this weekend, from Friday to Monday, to give the multiplayer backend a sound kicking and see if it stays stands. In short, hey, you can play AO4's multiplayer for free this weekend.\nRead more",
          "link": "https://www.rockpapershotgun.com/everyones-invited-to-play-age-of-empires-4-this-weekend-in-a-stress-test",
          "publishedOn": "2021-09-15T09:15:51.000Z",
          "wordCount": 833,
          "title": "Everyone's invited to play Age Of Empires 4 this weekend in a stress test"
        },
        {
          "id": "https://www.rockpapershotgun.com/heres-how-to-remove-deathloops-intro-logos",
          "author": "Graham Smith",
          "description": "If there's one thing I hate in this life, it's having to lift my hand onto the Esc key so I can press it to skip logos. Ideally I only lift my arms to deliver food to my maw, or to express my lack of care. So it's nice that someone has already identified which files to delete to remove the logos at the start of Arkane's new shooter Deathloop.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/heres-how-to-remove-deathloops-intro-logos",
          "publishedOn": "2021-09-14T22:46:10.000Z",
          "wordCount": 750,
          "title": "Here's how to remove Deathloop's intro logos"
        },
        {
          "id": "https://www.rockpapershotgun.com/stellaris-31-is-out-and-adds-new-content-to-old-dlc-alongside-many-balance-tweaks",
          "author": "Graham Smith",
          "description": "Scifi grand strategy Stellaris's free 3.1 update, titled \"Lem\", is out now. This is the first update created by \"The Custodians\", a new team formed within developers PDS Green focused on free, quarterly updates which tweak game balance, add new content to old DLC and fix bugs.\r\n\nThe \"Lem\" update does all three, changing how tradition trees work, adding new features to old species packs such as 2016's Planetoids, and rebalancing some Civics and Origins.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/stellaris-31-is-out-and-adds-new-content-to-old-dlc-alongside-many-balance-tweaks",
          "publishedOn": "2021-09-14T22:01:42.000Z",
          "wordCount": 966,
          "title": "Stellaris 3.1 is out and adds new content to old DLC"
        },
        {
          "id": "https://www.rockpapershotgun.com/wds-sn850-1tb-ssd-is-down-to-145-with-a-free-heatsink",
          "author": "Will Judd",
          "description": "The WD Black SN850 is a tremendously fast PCIe 4.0 SSD, capable of hitting some outrageous speeds - up to 7000MB/s reads and 5300MB/s writes. That makes it a great choice for any PC that can handle it (as well as the PS5, which gets external SSD support tomorrow). It's been discounted on Scan to £145 today, where you'll also get a free Akasa NVMe heatsink in the bargain. \nRead more",
          "link": "https://www.rockpapershotgun.com/wds-sn850-1tb-ssd-is-down-to-145-with-a-free-heatsink",
          "publishedOn": "2021-09-14T21:43:56.000Z",
          "wordCount": 971,
          "title": "WD's SN850 1TB SSD is down to £145 with a free heatsink"
        },
        {
          "id": "https://www.rockpapershotgun.com/deep-rock-galactic-now-has-official-mod-support-and-a-mod-that-gives-spiders-beards",
          "author": "Graham Smith",
          "description": "Mods are amazing and can never get enough love, so I'm glad to see that co-operative cave-diving FPS Deep Rock Galactic now has official mod support. It includes mod.io integration for browsing and installing mods, an in-game mod manager, and clearer communication for players joining modded servers, among a lot of other changes.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/deep-rock-galactic-now-has-official-mod-support-and-a-mod-that-gives-spiders-beards",
          "publishedOn": "2021-09-14T21:14:46.000Z",
          "wordCount": 830,
          "title": "Deep Rock Galactic now has official mod support"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-top-rated-dell-s2721dgfa-fast-ips-monitor-is-20-off-today",
          "author": "Will Judd",
          "description": "Dell's S2721DGFA has had a storied history, starting out as a critically acclaimed 27-in gaming monitor that no one could actually buy, to slowly becoming available over the months and finally now to being a great value option in the wake of several big price cuts. \nToday, the S2721DGFA has hit a historic low thanks to a code at the Dell UK site: using the phrase DAE40S at the checkout will knock the price from its usual £329 to just £265.94, a £63 savings and more than £100 cheaper than the same monitor at Amazon. That's an incredible price for one of the best gaming monitors on the planet. \nRead more",
          "link": "https://www.rockpapershotgun.com/the-top-rated-dell-s2721dgfa-fast-ips-monitor-is-20-off-today",
          "publishedOn": "2021-09-14T21:07:35.000Z",
          "wordCount": 1032,
          "title": "The top-rated Dell S2721DGFA Fast IPS monitor is 20% off today"
        },
        {
          "id": "https://www.rockpapershotgun.com/funcom-acquires-the-conan-and-mutant-year-zero-ip",
          "author": "Graham Smith",
          "description": "Funcom have acquired the Cabinet Group, the company which owns the intellectual properties Conan The Barbarian and Mutant Year Zero. Funcom have already developed several Conan games by licensing the IP, including the MMO Age Of Conan and more recently the survival game Conan Exiles. \r\n\nThe announcement also mentioned that a new game is currently in development which will star Conan and \"many of the characters in the Robert E. Howard universe.\"\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/funcom-acquires-the-conan-and-mutant-year-zero-ip",
          "publishedOn": "2021-09-14T20:46:50.000Z",
          "wordCount": 912,
          "title": "Funcom acquires the Conan and Mutant Year Zero IP"
        },
        {
          "id": "https://www.rockpapershotgun.com/cyberpunk-2077s-131-update-is-small-but-has-substantial-fixes",
          "author": "Graham Smith",
          "description": "The latest Cyberpunk 2077 patch is small, but the bugs it fixes aren't. 1.31 addresses issues that only affected some users, but they include issues that would halt progress on critical quests if they happened. The patch is live now.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/cyberpunk-2077s-131-update-is-small-but-has-substantial-fixes",
          "publishedOn": "2021-09-14T20:01:09.000Z",
          "wordCount": 1057,
          "title": "Cyberpunk 2077's 1.31 update is small but has substantial fixes"
        },
        {
          "id": "https://www.rockpapershotgun.com/hopes-for-god-of-war-on-pc-stoked-by-leaked-nvidia-list",
          "author": "Alice O'Connor",
          "description": "Ever since Sony began releasing PlayStation-exclusive games on PC too, many have been clamouring for more of the big'uns: God Of War, Spider-Man, chuffing Bloodborne for god's sake please Bloodborne. While Sony are still being coy about which games are coming our way, hopes were raised by a recent leaked list of games pulled from the digital guts of GeForce Now, which included a mention of God Of War for Steam. I wouldn't get too excited just yet. While Nvidia have confirmed the list itself was real, they say some games on the list were \"speculative\".\nRead more",
          "link": "https://www.rockpapershotgun.com/hopes-for-god-of-war-on-pc-stoked-by-leaked-nvidia-list",
          "publishedOn": "2021-09-14T17:25:11.000Z",
          "wordCount": 961,
          "title": "Hopes for God Of War on PC stoked by leaked Nvidia list"
        },
        {
          "id": "https://www.rockpapershotgun.com/pc-gaming-weekspot-podcast-053-deathloop",
          "author": "Colm Ahern",
          "description": "Yes, we all know the game has a very cool look, and all of us enjoy playing a good time loop game, but what actually is Deathloop? Thankfully, Matthew's played the first few hours and is here to enlighten both you and I.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/pc-gaming-weekspot-podcast-053-deathloop",
          "publishedOn": "2021-09-14T16:00:00.000Z",
          "wordCount": 827,
          "title": "The Weekspot podcast #053: in the loop"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-to-install-an-ssd",
          "author": "James Archer",
          "description": "Welcome to the RPS guide on how to install an SSD, which you’ll note is not titled “How to install an SSD or hard drive”. Yes yes, old-timey mechanical drives are cheaper, and better if you need terrabytes upon terabytes of space, but when you can buy a good-quality NVMe SSD like the WD Blue SN550 at £70 for 1TB…I mean, you should probably do that instead.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/how-to-install-an-ssd",
          "publishedOn": "2021-09-14T15:52:40.000Z",
          "wordCount": 1725,
          "title": "How to install an SSD"
        },
        {
          "id": "https://www.rockpapershotgun.com/met-gala-2021-outfits-remind-me-of-video-game-heroes-and-villains",
          "author": "Kaan Serin",
          "description": "The annual Met Gala event took place last night as some of the world's most famous people gathered to celebrate fashion. This year's theme was \"In America: A Lexicon of Fashion\", which is wildly inaccurate since most of the attendees decided to dress as video game heroes and villains. Fashion brands like Balenciaga and Versace designed outfits that wouldn't be out of place on a JRPG antagonist or in a Platinum game. Let's look at which celebrities decided to take the Paragon route and dress as a hero and who decided to go full Renegade, dressing as a video game boss.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/met-gala-2021-outfits-remind-me-of-video-game-heroes-and-villains",
          "publishedOn": "2021-09-14T15:21:13.000Z",
          "wordCount": 1279,
          "title": "Met Gala 2021 outfits remind me of video game heroes and villains"
        },
        {
          "id": "https://www.rockpapershotgun.com/total-war-warhammer-3-reveals-grand-cathays-army-created-for-the-game",
          "author": "Alice O'Connor",
          "description": "The mysterious army of Grand Cathay have finally been revealed for Total War: Warhammer 3, wearing their Chinese influences plainly. Grand Cathay have existed in the world of Warhammer (Warlore? Lorehammer?) for almost 30 years but not fielded a full plastic army, so one had to be created for Creative Assembly's fantasy strategy game. Led by dragons in human form, they field forces including Jade Warriors, towering Terracotta Sentinels, and the Celestial Dragon Guard. Come meet 'em in the new trailer below.\nRead more",
          "link": "https://www.rockpapershotgun.com/total-war-warhammer-3-reveals-grand-cathays-army-created-for-the-game",
          "publishedOn": "2021-09-14T14:07:05.000Z",
          "wordCount": 913,
          "title": "Total War: Warhammer 3 reveals Grand Cathay's army, created for the game"
        },
        {
          "id": "https://www.rockpapershotgun.com/dying-light-2-delayed-again-shambling-into-february-2022",
          "author": "Alice O'Connor",
          "description": "Parkour enthusiasts will need to wait two months longer to prance around an open-world city full of zombies (and zombies-to-be), because Dying Light 2 has been delayed again. Previously due December 7th, and spring 2020 before that, Dying Light 2 is now scheduled to launch on February 4th, 2022. The developers, Techland say they need extra time to make it good, yeah?\nRead more",
          "link": "https://www.rockpapershotgun.com/dying-light-2-delayed-again-shambling-into-february-2022",
          "publishedOn": "2021-09-14T13:17:55.000Z",
          "wordCount": 769,
          "title": "Dying Light 2 delayed again, shambling into February 2022"
        },
        {
          "id": "https://www.rockpapershotgun.com/come-and-gawp-at-clash-artifacts-of-chaos-gorgeous-sketchy-planet-in-this-new-dev-diary",
          "author": "Katharine Castle",
          "description": "The first-person brawler Zeno Clash games have been long-time favourites here at RPS, and when Chilean developers ACE Team announced they were making a new game set in their weird and wonderful Clash universe back in July, we were over the moon. Admittedly, Clash: Artifact Of Chaos' reveal trailer left a lot of unanswered questions at the time, but the good news is that we've got an early sneak peak at a new developer diary that tells us all about the game's story and what to expect when it eventually releases next year.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/come-and-gawp-at-clash-artifacts-of-chaos-gorgeous-sketchy-planet-in-this-new-dev-diary",
          "publishedOn": "2021-09-14T13:15:17.000Z",
          "wordCount": 966,
          "title": "Come and gawp at Clash: Artifacts Of Chaos' gorgeous, sketchy planet in this new dev diary"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-slabs-abilities",
          "author": "Rebecca Jones",
          "description": "Wondering how to collect and fully upgrade all the slabs in Deathloop? Slab abilities are the paranormal powers in Deathloop, the game's take on Dishonored's Void Powers and Prey's Neuromods. When playing as Colt or Julianna there are five of these slabs to pick up, as well as several levels of upgrades for each.\nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-slabs-abilities",
          "publishedOn": "2021-09-14T13:14:28.000Z",
          "wordCount": 2509,
          "title": "Deathloop slabs and abilities: how to obtain and fully upgrade all paranormal powers in Deathloop"
        },
        {
          "id": "https://www.rockpapershotgun.com/eastward-review",
          "author": "Katharine Castle",
          "description": "Wrangling flying pigs, saving a nerdy kid from the school bullies, cooking up exquisite dishes to appease a local casino boss whose slot machines you accidentally rinsed with your trusted lucky coin... These are the stories most adventure RPGs would stuff into their ever-growing sidequest menus - distractions meant to provide extra flavour to the world you're meant to be saving, or which hold bountiful supplies of EXP to level up your skills and weapons. Not so in Eastward.\nIn this impressive debut from Shanghai developers Pixpil, these humdrum slices of life are placed front and centre, forming much of the narrative backbone that drives the game forward. This is still a game that's ultimately about saving the world from a mysterious and all-consuming miasma, but it's also one that makes damn sure you know what you're doing it all for - and that's its striking cast of NPCs. As you busy yourself with the minutiae of their everyday lives, Eastward makes every person (and robot) count in this deadly post-apocalypse, and the result is an affecting, detail-rich tale that owes as much to the action of top-down Zelda games as it does to the role-playing intimacy of Earthbound. \nRead more",
          "link": "https://www.rockpapershotgun.com/eastward-review",
          "publishedOn": "2021-09-14T13:00:00.000Z",
          "wordCount": 2085,
          "title": "Eastward review: a stunning, but slow burning post-apocalypse adventure"
        },
        {
          "id": "https://www.rockpapershotgun.com/diablo-2-remaster-cutscenes-look-like-how-i-remember-the-originals",
          "author": "Alice O'Connor",
          "description": "I appreciate when a remaster of an old game looks like my memories of the original, a rose-tinted vision which would crumble if I looked at even one screenshot. Blizzard and Vicarious Visions have managed that with Diablo 2: Resurrected, from what I've seen, and a new trailer focuses on the redone cutscenes. And yeah, this is how I remember D2 cutscenes looking? They were dead fancy and high-tech, yeah? Must have looked like this?\nRead more",
          "link": "https://www.rockpapershotgun.com/diablo-2-remaster-cutscenes-look-like-how-i-remember-the-originals",
          "publishedOn": "2021-09-14T11:19:25.000Z",
          "wordCount": 862,
          "title": "Diablo 2 remaster cutscenes look like how I remember the originals"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-worlds-open-beta-hasnt-convinced-me-to-drop-final-fantasy-xiv",
          "author": "Ed Thorn",
          "description": "The last time I got some brief hands-on time with Amazon's upcoming MMO New World, I emerged from Aeternum feeling pretty positive about this new kid on the massively multiplayer block. Crafting, in particular, had me pretty excited. But having spent a big chunk of time in its open beta, I've come away feeling a bit, I don't know, bleh? If anything, I just wanted to go back to my beloved Final Fantasy XIV.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-worlds-open-beta-hasnt-convinced-me-to-drop-final-fantasy-xiv",
          "publishedOn": "2021-09-14T11:00:00.000Z",
          "wordCount": 1506,
          "title": "New World's open beta hasn't convinced me to drop Final Fantasy XIV"
        }
      ]
    },
    {
      "title": "Root.cz - články",
      "feedUrl": "https://www.root.cz/rss/clanky/",
      "siteUrl": "https://www.root.cz/clanky/",
      "articles": [
        {
          "id": "www.root.cz-text-15642",
          "author": "redakce@root.cz (Root.cz: Michal Tauchman)",
          "description": "V druhé části článků o retrobrightingu se podíváme na samotné výsledky mého snažení. Ve většině případů je výsledek velmi uspokojivý, ale jak uvidíte v jednom případě, ne vždy je vše dokonalé.",
          "link": "https://www.root.cz/clanky/retrobrightin-g-vysledky-procesu-beleni-plastu-a-jeden-prusvih/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T22:00:10.000Z",
          "wordCount": 2679,
          "title": "Retrobrightin­g: výsledky procesu bělení plastu a jeden průšvih",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/324/amiga-retrobrighting-1.jpg",
            "length": "54531",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15668",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "V dnešní části seriálu o křivkách, které nalezneme v přírodě, architektuře, technice i v počítačové grafice, dokončíme popis různých typů spirál. Zabývat se budeme například klotoidou a evolventou.",
          "link": "https://www.root.cz/clanky/krivky-v-prirode-i-v-pocitacove-grafice-svet-spiral-dokonceni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T22:00:05.000Z",
          "wordCount": 7299,
          "title": "Křivky v přírodě i v počítačové grafice – svět spirál (dokončení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/507/krivka-perex-1.jpg",
            "length": "74201",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15667",
          "author": "redakce@root.cz (Root.cz: CSIRT.CZ)",
          "description": "V dnešním díle Postřehů se podíváme na další malý krok směřující ke konci hesel, na agenty NSA, kteří si přivydělávali jako námezdní hackeři, na eskalaci privilegií v HP Omen nebo nový návrh OWASP Top 10.",
          "link": "https://www.root.cz/clanky/postrehy-z-bezpecnosti-ukuste-to-bez-hesel-mily-marconi/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-19T22:00:10.000Z",
          "wordCount": 1458,
          "title": "Postřehy z bezpečnosti: zkuste to bez hesel, milý Marconi!",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/662/mobil-pocitac-1.jpg",
            "length": "40499",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15666",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Firefox Snap bude výchozím prohlížečem v Ubuntu 21.10. Kali Linux 2021.3 NetHunter běží na hodinkách TicWatch Pro. Společnost Jolla oznámila vydání nové verze operačního systému pro chytré telefony Sailfish OS 4.2.0 „Verla“.",
          "link": "https://www.root.cz/clanky/firefox-snap-bude-vychozi-v-ubuntu-kali-linux-na-hodinkach-ticwatch-pro/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-19T22:00:05.000Z",
          "wordCount": 1177,
          "title": "Firefox Snap bude v Ubuntu výchozí, Kali Linux na hodinkách TicWatch Pro",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/172/firefox-ubuntu-1.jpg",
            "length": "19494",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15669",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Objevily se podrobné informace o připravovaných procesorech z dílen firem Intel a AMD. Red Hat chce konečně pořádně vyřešit podporu HDR na linuxovém desktopu. Xiaomi má nový telefon 11T Pro s 108Mpix foťákem.",
          "link": "https://www.root.cz/clanky/red-hat-resi-hdr-v-linuxu-uniky-informaci-od-intelu-a-amd/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-18T22:00:10.000Z",
          "wordCount": 1371,
          "title": "Red Hat řeší HDR v Linuxu, úniky informací od Intelu a AMD",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/615/amd-epyc-64core-1.jpg",
            "length": "41676",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15653",
          "author": "redakce@root.cz (Root.cz: Petr Škuta)",
          "description": "Se značkou Tuxedo jsme se zde již párkrát setkali. Recenzí prošly dvě generace ultrabooků řady Infinity Book. Nyní ale na redakční stůl zamířil stroj ze zcela opačného spektra, a to herní Tuxedo Stellaris 15. Jak dopadl?",
          "link": "https://www.root.cz/clanky/kanon-na-vrabce-recenze-herniho-notebooku-tuxedo-stellaris-15/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-16T22:00:10.000Z",
          "wordCount": 2434,
          "title": "Kanón na vrabce: recenze herního notebooku Tuxedo Stellaris 15",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/237/tuxedo-stellaris-15-front-1.jpg",
            "length": "47745",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15617",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Kompresní formát ZIP je přes třicet let starý, přesto by mohl být i v současnosti pro někoho zajímavý. Podporuje několik kompresních algoritmů, které si zde postupně rozebereme a na závěr všechny srovnáme.",
          "link": "https://www.root.cz/clanky/kompresni-algoritmy-v-souborech-zip-deflate-implode-a-srovnani/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-15T22:00:10.000Z",
          "wordCount": 2784,
          "title": "Kompresní algoritmy v souborech ZIP: Deflate, Implode a srovnání",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/515/zip-zips-1.jpg",
            "length": "100710",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15665",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "Často se setkáme s požadavkem na umožnění zápisu výrazů do vstupních formulářových polí, pro použití výrazů v konfiguračních souborech atd. Lze to řešit vložením interpretru plnohodnotného jazyka, ale mnohdy stačí doménově specifický jazyk (DSL).",
          "link": "https://www.root.cz/clanky/jazyk-go-a-vyhodnocovani-vyrazu-v-dobe-behu-aplikace/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-15T22:00:05.000Z",
          "wordCount": 4077,
          "title": "Jazyk Go a vyhodnocování výrazů v době běhu aplikace",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/336/golang-1.jpg",
            "length": "23658",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15664",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Největší setkání bastlířů, vynálezců a inovátorů v Česku se konalo v Průmyslovém paláci pražského Výstaviště. Představilo 150 makerských expozic, workshopů a přednášek, včetně zahraničních hostů.",
          "link": "https://www.root.cz/clanky/maker-faire-prague-2021-obrazem-setkani-bastliru-vynalezcu-a-inovatoru/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-14T22:00:10.000Z",
          "wordCount": 267,
          "title": "Maker Faire Prague 2021 obrazem: setkání bastlířů, vynálezců a inovátorů",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/588/maker-faire-prague-2021-1.jpg",
            "length": "70872",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15663",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Sonda do světa otevřeného softwaru. Dnes si řekneme o svobodné alternativě k Discordu, vyzkoušíme si aplikaci pro ovládání ITUSB1 USB Test Switch, dáme si dohromady knihovnu obrázků a stáhneme si do počítače instalační balíčky pro Android.",
          "link": "https://www.root.cz/clanky/softwarova-sklizen-15-9-2021/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-14T22:00:05.000Z",
          "wordCount": 986,
          "title": "Softwarová sklizeň (15. 9. 2021)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/root/368/kombajn-sklizen.jpg",
            "length": "394618",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "Root.cz - zprávičky",
      "feedUrl": "https://www.root.cz/rss/zpravicky/",
      "siteUrl": "https://www.root.cz/zpravicky/",
      "articles": [
        {
          "id": "www.root.cz-actuality-42837",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Kolegové ze serveru Cnews.cz otestovali pět terabajtových SSD pro rozhraní PCIe 4.0. Konkrétně šlo o disky značek WD, Samsung, Adata, Seagate a Aorus, jejichž cena se pohybuje okolo 5500 Kč. Testován byl výkon po připojení na novou sběrnici PCIe 4.0, ale zároveň i ve zpětně kompatibilní PCIe 3.0.",
          "link": "https://www.root.cz/zpravicky/test-terabajtovych-ssd-pro-rozhrani-pcie-4-0-od-wd-samsung-adata-seagate-aorus/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-21T06:34:23.000Z",
          "wordCount": 932,
          "title": "Test terabajtových SSD pro rozhraní PCIe 4.0 od WD, Samsung, Adata, Seagate, Aorus",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/282/ssd-1.jpg",
            "length": "64824",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42836",
          "author": "redakce@root.cz (Root.cz: Ondřej Caletka)",
          "description": "Chcete-li vytvořit bitovou kopii souborového systému, asi není úplně dobrý nápad používat nástroje jako dd, je-li disk zároveň připojen. Vytváření obrazu bude určitou dobu trvat a pokud se během této doby na disk zapisuje, bude výsledný obraz velmi poškozený.",
          "link": "https://www.root.cz/zpravicky/hot-clone-nastroj-umoznujici-ziskat-obraz-pripojeneho-disku/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T14:58:07.000Z",
          "wordCount": 813,
          "title": "Hot-clone: nástroj umožňující získat obraz připojeného disku",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/508/hdd-pevny-disk-1.jpg",
            "length": "27164",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42835",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "SMB3 server implementovaný v jádře s názvem KSMBD, za kterým stojí Samsung, se dostal do jádra 5.15. To ještě ani nevyšlo a už se v KSMBD objevila závažná zranitelnost, kdy pomocí znaků .. v cestě je možné přistupovat k souborům mimo sdílené adresáře.",
          "link": "https://www.root.cz/zpravicky/smb3-server-v-jadre-5-15-ksmbd-uz-ma-prvni-vaznou-opravu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T14:22:13.000Z",
          "wordCount": 3045,
          "title": "SMB3 server v jádře 5.15 KSMBD už má první vážnou opravu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/567/linux-windows-tux.png",
            "length": "121771",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42834",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Fedora 35 beta by měla vyjít každým dnem. Ostrá verze se očekává 19. října, nebo o týden později. Na serveru mojefedora.cz vyšel dnes článek shrnující novinky očekávané ve Fedoře 35 Workstation.",
          "link": "https://www.root.cz/zpravicky/co-ocekavame-ve-fedore-35/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T14:06:01.000Z",
          "wordCount": 764,
          "title": "Co očekáváme ve Fedoře 35",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/682/fedora-1.jpg",
            "length": "24750",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42833",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Edward Snowden se minulý týden na Twitteru vyjádřil, že nedporučuje používat ExpressVPN. Důvodem je, že bývalý CIO ExpressVPN Daniel Gericke spolu s dalšími dvěma bývalými zaměstnanci NSA pracovali jako nájemní hackeři mezi lety 2016 a 2019 pro firmu DarkMatter ve Spojených arabských emirátech. Za porušení exportních zákonů, jim soud uložil pokutu více jak 1,5 milionů dolarů. Navíc dostali doživotní zákaz bezpečnostní prověrky.",
          "link": "https://www.root.cz/zpravicky/edward-snowden-nedporucuje-pouzivat-expressvpn/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T09:13:40.000Z",
          "wordCount": 1764,
          "title": "Edward Snowden nedoporučuje používat ExpressVPN",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/683/edward-snowden-1.jpg",
            "length": "33281",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-40574",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Linuxových systémů přibývá, každý den se spouštějí nové servery a někdo se o ně musí starat. To znamená spoustu různých dovedností specifických právě pro linuxové prostředí. Jak to zprovoznit, kudy bezpečně dovnitř, co tam najdeme, jak se o to postaráme a jak to nastavíme nebo rozšíříme.",
          "link": "https://www.root.cz/zpravicky/naucte-se-pouzivat-linux-spravne-a-bezpecne-online-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T07:38:28.000Z",
          "wordCount": 738,
          "title": "Naučte se používat Linux správně a bezpečně (online školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/440/skoleni-1.jpg",
            "length": "61676",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42832",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Vývojář jádra Jens Axboe si minulý čtvrtek postěžoval na Lenovo X1 Carbon Gen 9, protože mu při paralelním překladu jádra ( make -j4) notebook sníží frekvenci procesoru až na 400 MHz a stane se prakticky nepoužitelný. Jde o thermal throttling, který má zabránit přehřívání čím dál tenčích a lehčích notebooků.",
          "link": "https://www.root.cz/zpravicky/jak-zabranit-castemu-snizovani-frekvence-u-notebooku/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T06:48:30.000Z",
          "wordCount": 975,
          "title": "Jak zabránit častému snižování frekvence u notebooků",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/230/fedora-lenovo-thinkpad-x1-carbon-1.jpg",
            "length": "33800",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42831",
          "author": "redakce@root.cz (Root.cz: Calculon)",
          "description": "Byla vydána verze 0.5.0 jazyka Idris 2. Z větších změn lze zmínit přidání inkrementálního překladu a zrychlení typové kontroly omezením redukcí v době překladu.",
          "link": "https://www.root.cz/zpravicky/nova-verze-jazyka-idris-2-pridava-inkrementalni-preklad-a-zrychluje-typovou-kontrolu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-19T19:23:50.000Z",
          "wordCount": 738,
          "title": "Nová verze jazyka Idris 2 přidává inkrementální překlad a zrychluje typovou kontrolu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/388/idris-1.jpg",
            "length": "21059",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42829",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Od 23. do 25. září bude probíhat online konference LibreOffice 2021. Během tří dnů je připraveno okolo padesáti přednášek, workshopů a komunitních setkání s tématy týkající se kancelářského balíku, komunity a open source.",
          "link": "https://www.root.cz/zpravicky/online-konference-libreoffice-2021/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-18T10:47:18.000Z",
          "wordCount": 723,
          "title": "Online konference LibreOffice 2021",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/534/libreoffice-1.jpg",
            "length": "14082",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42828",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Český LibreOffice tým vydává překlad příručky LibreOffice Impress 7.0. Tato příručka je určena pro začátečníky i pokročilé uživatele aplikace Impress, prezentační komponenty v LibreOffice. S její pomocí můžete vytvářet snímky, které obsahují text, číslované a odrážkové seznamy, tabulky, grafy, videoklipy, kliparty a další objekty. Impress přichází s předdefinovanými textovými styly a předlohami snímků; můžete si také vytvořit vlastní. Příručka je ke stažení na stránce dokumentace. Tým nyní pracuje na překladu příruček Draw a Base.",
          "link": "https://www.root.cz/zpravicky/cesky-preklad-prirucky-libreoffice-impress-7-0/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-18T06:12:43.000Z",
          "wordCount": 774,
          "title": "Český překlad příručky LibreOffice Impress 7.0",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/534/libreoffice-1.jpg",
            "length": "14082",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42827",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "ČTÚ má nový měřič rychlosti připojení k internetu NetTest. Starý NetMetr bude dál fungovat pod CZ.NIC. NetTest nabízí testování jen přes webové rozhraní, NetMetr měl i mobilní aplikace. NetTest je stejně jako NetMetr založen na open-source řešení rakouského telekomunikačního regulátora RTR. Licence NetTestu by měla být Apache 2.0, ale kód zatím zveřejněn nebyl.",
          "link": "https://www.root.cz/zpravicky/ctu-ma-novy-certifikovany-meric-rychlosti/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-17T15:58:20.000Z",
          "wordCount": 2034,
          "title": "ČTÚ má nový certifikovaný měřič rychlosti NetTest",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/430/tachometr-1.jpg",
            "length": "31442",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42826",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Mozilla a Canonical se dohodly, že Firefox bude v příštím vydání Ubuntu 21.10 dostupný jen jako balíček snap a ne jako doposud balíček deb. Výhodou je, že snap bude vytvářet přímo Mozilla a aktualizovaný Firefox bude tedy dostupný hned v den vydání. V současnosti Canonicalu trvá několik dní vyrobit deb balíček. Snap bude dostupný pro architektury amd64, arm64 a armhf.",
          "link": "https://www.root.cz/zpravicky/firefox-bude-v-ubuntu-21-10-jako-snap/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-17T10:50:03.000Z",
          "wordCount": 4429,
          "title": "Firefox bude v Ubuntu 21.10 jako snap",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/203/firefox-se-vzhledem-proton-1.png",
            "length": "134604",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-41285",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "VPN umožňuje bezpečně propojit různá zařízení pomocí šifrovaných tunelů. Umožňuje také zapojit uživatele do vnitřní sítě přes zabezpečený přístupový bod. Na našem školení VPN a bezpečné připojení k síti s OpenVPN si prakticky ukážeme, jak to celé nastavit a zprovoznit.",
          "link": "https://www.root.cz/zpravicky/vytvorte-si-bezpecnou-vpn-pomoci-openvpn-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-17T07:26:02.000Z",
          "wordCount": 739,
          "title": "Vytvořte si bezpečnou VPN pomocí OpenVPN (školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/102/openvpn-logo-1.jpg",
            "length": "18777",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42825",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "AMC Theaters je největším řetězcem kin na světě, má v Evropě 358 kin a v USA 620. Novinka se však týká jen kin v USA. Před měsícem bylo oznámeno, že do konce tohoto roku bude možné online platit lístky a předplatné pomocí Bitcoinu.",
          "link": "https://www.root.cz/zpravicky/v-kinech-amc-bude-mozne-platit-cryptomenami/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-17T06:40:10.000Z",
          "wordCount": 766,
          "title": "V kinech AMC bude možné platit kryptoměnami"
        },
        {
          "id": "www.root.cz-actuality-42824",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "V Londýně včera ve věku 81 let zemřel Sir Clive Sinclair, britský vynálezce a podnikatel. Známý je především jako tvůrce domácích počítačů ZX Spectrum. O jeho odchodu informoval britský deník The Guardian, s odkazem na informace od dcery Belindy. Příčinou jeho smrti byla dlouhodobá nemoc.",
          "link": "https://www.root.cz/zpravicky/zemrel-sir-clive-sinclair-tvurci-zx-spectra-bylo-81-let/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-17T06:04:37.000Z",
          "wordCount": 1968,
          "title": "Zemřel Sir Clive Sinclair, tvůrci ZX Spectra bylo 81 let",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/460/zx-spectrum-1.jpg",
            "length": "91866",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42821",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Útočníci na internetu vytrvale hledají nové způsoby, jak nelegálně vydělat peníze. Poznatky Cisco Talos ukazují, že stále častěji se tak děje na platformách, které umožňují sdílení síťového provozu, zvaných proxyware, jako jsou Honeygain, IPRoyal Pawns, Nanowire, Peer2Profit nebo PacketStream. Ty ve špatných rukou umožňují využívat konektivitu uživatelů bez jejich vědomí, protože běží na pozadí na infikovaném zařízení.",
          "link": "https://www.root.cz/zpravicky/novy-typ-kybernetickeho-utoku-zneuzitim-platforem-proxyware/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-16T12:28:08.000Z",
          "wordCount": 1018,
          "title": "Nový typ kybernetického útoku: zneužitím platforem proxyware",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/165/hacker-call-telefon-podvod-1.jpg",
            "length": "37190",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42820",
          "author": "redakce@root.cz (Root.cz: PeoplePath)",
          "description": "Dne 29. září 2021 od 18:00 společnost PeoplePath pořádá IT workshop s názvem PHP FFI aneb proč (ne)volat C kód z vašich webovek. Akce se koná v salonku v restauraci U Salzmannů v Plzni. Drobné občerstvení a pivo jsou samozřejmostí a vstupné je zdarma.",
          "link": "https://www.root.cz/zpravicky/itworkshop-v-plzni-php-ffi-aneb-proc-ne-volat-c-kod-z-vasich-webovek/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-16T08:31:01.000Z",
          "wordCount": 853,
          "title": "ITWorkshop v Plzni: PHP FFI aneb proč (ne)volat C kód z vašich webovek",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/602/workshop-meeting-konference-setkani-1.jpg",
            "length": "63051",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42819",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Společnost Intel připravuje do Linuxu zajímavou inovaci pro své platformy. První patche už do jádra zamířily a až se vše podaří dotáhnout do konce, bude možné na strojích Intel aktualizovat firmwary (zejména UEFI) bez nutnosti restartu stroje. Vše proběhne v rámci aktuálního běhu operačního systému.",
          "link": "https://www.root.cz/zpravicky/intel-seamless-update-aktualizace-uefi-bez-restartu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-15T07:00:00.000Z",
          "wordCount": 1912,
          "title": "Intel Seamless Update: aktualizace UEFI bez restartu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/640/intel-xeon-ice-lake-1.jpg",
            "length": "45315",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-38836",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Automatizace pomocí continuous integration přímo v Gitlabu. CI vám pomůže automatizovat rutinní procesy a ušetří vám hromadu času. Pomůže vám od automatického testování, buildy po nasazování. Chcete vědět víc? Přijďte na naše školení, které se uskuteční 29. září a proběhne plně online. Školí Ondřej Sika.",
          "link": "https://www.root.cz/zpravicky/gitlab-ci-automatizujte-primo-v-gitlabu-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-15T06:39:09.000Z",
          "wordCount": 750,
          "title": "Gitlab CI: automatizujte přímo v Gitlabu (školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/214/gitlab-ci-1.png",
            "length": "75559",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42818",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Na světě je nová hlavní verze Javy, resp. číselně stejná verze balíku OpenJDK. Sedmnáctka přináší několik novinek, například novou renderovací pipeline pro macOS (používá API Metal, OpenGL končí), podporu portu pro Apple M1, vylepšené pseudo-náhodné generátory čísel, označení Java Applet API za zastralé (naplánováno je odstranění), podpory sealed classes, odstranění experimentální kompilace ahead-of-time (AOT) a just-in-time (JIT), o další krok posunutých prací na Java Vector API či práce na context-specific deserializačních filtrech.",
          "link": "https://www.root.cz/zpravicky/java-17-a-openjdk-17-s-hotovym-maturing-vector-api-a-planovanym-koncem-applet-api/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-15T05:00:00.000Z",
          "wordCount": 12776,
          "title": "Java 17 a OpenJDK 17 s hotovým Vector API a plánovaným koncem Applet API",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/253/java-kava-na-drevu-1.jpg",
            "length": "50247",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42817",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Jedna z posledních změn v rámci vývoje příští verze jádra Linux 5.15 povyšuje minimální verzi GCC pro kompilaci. Až dosud stačilo GCC 4.9, nyní bude pro sestavení jádra potřeba minimálně GCC 5.1. Jde současně o verzi, která je už delší dobu potřebná pro build na architektuře Aarch64 (64bit ARM).",
          "link": "https://www.root.cz/zpravicky/linux-5-15-uz-nezkompilujete-s-gcc-4-9-a-starsim/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-14T22:00:00.000Z",
          "wordCount": 829,
          "title": "Linux 5.15 už nezkompilujete s GCC 4.9 a starším",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/344/tux-linux-1.jpg",
            "length": "22348",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42816",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Nová cenovka telefonu Librem 5 bude od listopadu tohoto roku 1199 dolarů. Telefon přitom v rámci kampaně šlo v roce 2017 předplatit za 599 dolarů, tedy poloviční částku. Dnes ještě stojí 899 dolarů, plus existuje verze vyráběná v USA s cenovkou 1999 dolarů. Hlavním důvodem dalšího výrazného růstu ceny je samozřejmě situace na trhu s komponentami a materiály.",
          "link": "https://www.root.cz/zpravicky/otevreny-telefon-librem-5-zdrazi-na-1199-usd/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-14T14:48:16.000Z",
          "wordCount": 2901,
          "title": "Otevřený telefon Librem 5 zdraží na 1199 USD",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/563/librem-5-1.jpg",
            "length": "28645",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42815",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Ladislav Lhotka, vedoucí Laboratoří CZ.NIC, je spoluautorem nového internetového standardu (RFC 9108), který v září vydala organizace IETF. Toto RFC převádí dva IANA registry do podoby vhodné pro datové modelování v jazyku YANG. Jde o dva důležité parametry služby DNS – třídy a typy zdrojových záznamů (resource records).",
          "link": "https://www.root.cz/zpravicky/organizace-ietf-schvalila-novy-internetovy-standard-spoluautorem-je-ladislav-lhotka-z-cz-nic/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-14T10:43:13.000Z",
          "wordCount": 770,
          "title": "Organizace IETF schválila nový internetový standard, spoluautorem je Ladislav Lhotka z CZ.NIC",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/595/ladislav-lhotka-1.jpg",
            "length": "32317",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42814",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "S dalším vydáním v rámci LTS řady 18.04 se už po loňské verzi 18.04.5 nepočítalo, nicméně revokace klíčů si vyžaduje vydání aktualizovaných instalačních obrazů této stále podporované LTS verze Ubuntu.",
          "link": "https://www.root.cz/zpravicky/neocekavane-vydani-ubuntu-18-04-6-lts-resi-revokaci-klicu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-14T09:59:32.000Z",
          "wordCount": 1114,
          "title": "Neočekávané vydání Ubuntu 18.04.6 LTS řeší revokaci klíčů",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/588/ubuntu-18-04-1.jpg",
            "length": "44398",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42813",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Jonathan Thomas informuje o nové verzi střižny OpenShot. Ta slouží primárně jako vydání opravující nahlášené chyby předchozí verze 2.6.0 z doby před pár týdny. Najdeme zde ale také automatickou migraci klíčových snímků u ořezu z projektů verze 2.5.1. Zpětná kompatibilita je zde 100%. Opraveny jsou také chyby v některých překladech (včetně slovenštiny) a mnoho překladů bylo vylepšeno.",
          "link": "https://www.root.cz/zpravicky/openshot-2-6-1-prinasi-vylepseni-orezu-a-opravy-chyb/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-13T22:00:00.000Z",
          "wordCount": 799,
          "title": "OpenShot 2.6.1 přináší vylepšení ořezu a opravy chyb",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/446/openshot-2-5-1-1.png",
            "length": "63448",
            "type": "image/png"
          }
        }
      ]
    },
    {
      "title": "abclinuxu - aktuální články",
      "feedUrl": "http://www.abclinuxu.cz/auto/abc.rss",
      "siteUrl": "http://www.abclinuxu.cz/clanky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-komunikace-ma-zvysovat-produktivitu-vyvojaru",
          "author": "Redakce",
          "description": "Hlavní trendy umělé inteligence: Malá a rozprostřená data. Nový typ kybernetických útoků – zneužívání proxyware platforem. Roboti, kteří udělají přesnou díru do hlavy, zachraňují životy. O vstupu do nebe rozhoduje sv. Petr, pro síť je tu ClearPass. Kouzla zbavené? Nepravděpodobné řešení hrozící personální krize ve finančních službách. Honeywell u nás investuje do R&D. Komunikace má zvyšovat produktivitu vývojářů.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-komunikace-ma-zvysovat-produktivitu-vyvojaru",
          "publishedOn": "2021-09-19T22:01:00.000Z",
          "wordCount": 1821,
          "title": "Týden na ITBiz: Komunikace má zvyšovat produktivitu vývojářů"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-prepinane-zrcadlo-z-roztaveneho-kovu",
          "author": "Redakce",
          "description": "Černá díra vyžrala hvězdu. Nanotechnologie s černým oxidem titaničitým. Život v atmosféře subneptunů. Maličké hory na neutronových hvězdách.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-prepinane-zrcadlo-z-roztaveneho-kovu",
          "publishedOn": "2021-09-18T22:01:00.000Z",
          "wordCount": 1685,
          "title": "Týden na ScienceMag.cz: Přepínané zrcadlo z roztaveného kovu"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-37-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-37-2021",
          "publishedOn": "2021-09-17T22:01:00.000Z",
          "wordCount": 2686,
          "title": "Událo se v týdnu 37/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/goodoffer24-dozivotni-licence-windows-10-pouze-za-12-super-slevy-az-91",
          "author": "Reklama",
          "description": "Pořiďte si doživotní aktivační klíč k Windows 10 za 12,52 EUR na prodejním portálu GoodOffer24.com. Kromě toho nástrojů produktivity od Microsoftu zde lze získat i hry a další software. Nezapomeňte zadat před dokončením nákupu slevový kód  AX30.",
          "link": "http://www.abclinuxu.cz/clanky/goodoffer24-dozivotni-licence-windows-10-pouze-za-12-super-slevy-az-91",
          "publishedOn": "2021-09-17T16:00:00.000Z",
          "wordCount": 1475,
          "title": "GoodOffer24: Doživotní licence Windows 10 pouze za 12 €, super slevy až 91%!"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/distribucni-novinky-34-35-2021",
          "author": "Redakce",
          "description": "Závěr letních prázdnin a začátek školního roku přinesly několik významných vydání, LibreELEC s novým Kodi, příručky Linux From Scratch nebo novou stabilní větev OpenWrt, a také aktualizace Clonezilly, Ubuntu LTS, EndeavourOS či EasyOS.",
          "link": "http://www.abclinuxu.cz/clanky/distribucni-novinky-34-35-2021",
          "publishedOn": "2021-09-13T23:00:00.000Z",
          "wordCount": 1748,
          "title": "Distribuční novinky 34-35/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-sprava-a-analyza-dat-tlaci-podniky-do-cloudu",
          "author": "Redakce",
          "description": "Lenovo představuje hybridní tablety budoucnosti. Canon rozšiřuje nabídku A3 multifunkcí pro hybridní pracovní prostředí. Správa a analýza dat tlačí podniky do cloudu.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-sprava-a-analyza-dat-tlaci-podniky-do-cloudu",
          "publishedOn": "2021-09-12T22:01:00.000Z",
          "wordCount": 1456,
          "title": "Týden na ITBiz: Správa a analýza dat tlačí podniky do cloudu"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-dokazali-prepnout-vodivost-z-2d-na-1d",
          "author": "Redakce",
          "description": "Topologické izolátory. Janusovský grafen a baterie. Zachycen nový typ gravitačních vln. Dvojvrstvý borofen. Hledání mimozemských civilizací. Dysonovy sféry u černých děr. Planeta Devět. Oblečení z umělých svalových vláken.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-dokazali-prepnout-vodivost-z-2d-na-1d",
          "publishedOn": "2021-09-11T22:01:00.000Z",
          "wordCount": 1699,
          "title": "Týden na ScienceMag.cz: Dokázali přepnout vodivost z 2D na 1D"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-36-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-36-2021",
          "publishedOn": "2021-09-10T22:01:00.000Z",
          "wordCount": 2356,
          "title": "Událo se v týdnu 36/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/originalni-dozivotni-aktivacni-klic-windows-10-pro-za-pouhych-12-52-eur-odgoodoffer24.com",
          "author": "Reklama",
          "description": "Získejte doživotní aktivační klíč k Windows 10 za 12,52 EUR na prodejním portálu GoodOffer24.com. Kromě toho zde můžete získat mnohem více, od dalších nástrojů produktivity od Microsoftu, až po hry. Nezapomeňte zadat před dokončením nákupu slevový kód  AX30.",
          "link": "http://www.abclinuxu.cz/clanky/originalni-dozivotni-aktivacni-klic-windows-10-pro-za-pouhych-12-52-eur-odgoodoffer24.com",
          "publishedOn": "2021-09-10T20:30:00.000Z",
          "wordCount": 1487,
          "title": "Originální doživotní aktivační klíč Windows 10 Pro za pouhých 12,52 EUR od Goodoffer24.com"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/jaderne-noviny-prehled-za-srpen-2021",
          "author": "Redakce",
          "description": "Přehled srpnových vydání Jaderných novin: stav vydání jádra, citáty týdne a seznam článků týkajících se jádra.",
          "link": "http://www.abclinuxu.cz/clanky/jaderne-noviny-prehled-za-srpen-2021",
          "publishedOn": "2021-09-06T22:01:00.000Z",
          "wordCount": 2150,
          "title": "Jaderné noviny – přehled za srpen 2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-co-prozradi-mys",
          "author": "Redakce",
          "description": "Grafen vrací do hry pevné disky, hustota dat může vzrůst až 10krát. Hlavní chyby digitální transformace. Kontejnery jsou klíčová technologie při vývoji podnikových aplikací. Co prozradí myš.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-co-prozradi-mys",
          "publishedOn": "2021-09-05T22:01:00.000Z",
          "wordCount": 1434,
          "title": "Týden na ITBiz: Co prozradí myš"
        }
      ]
    },
    {
      "title": "abclinuxu - čerstvé zprávičky",
      "feedUrl": "http://www.abclinuxu.cz/auto/zpravicky.rss",
      "siteUrl": "http://www.abclinuxu.cz/zpravicky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/zpravicky/linux-plumbers-conference-2021-lpc-2021",
          "author": "Ladislav Hagara",
          "description": "Do pátku probíhá konference vývojářů Linuxu aneb linuxových instalatérů Linux Plumbers Conference 2021 (LPC 2021). Přednášky lze sledovat online.",
          "link": "http://www.abclinuxu.cz/zpravicky/linux-plumbers-conference-2021-lpc-2021",
          "publishedOn": "2021-09-20T22:25:08.000Z",
          "wordCount": 894,
          "title": "Linux Plumbers Conference 2021 (LPC 2021)"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/nsxiv-27.1",
          "author": "Ladislav Hagara",
          "description": "Prohlížeč obrázků nsxiv (Neo (or New or Not) Simple (or Small or Suckless) X Image Viewer) byl vydán ve verzi 27.1. Jedná se o fork již nevyvíjeného prohlížeče obrázku sxiv. Přehled novinek v CHANGELOGu.",
          "link": "http://www.abclinuxu.cz/zpravicky/nsxiv-27.1",
          "publishedOn": "2021-09-20T21:14:44.000Z",
          "wordCount": 901,
          "title": "nsxiv 27.1"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/co-noveho-prinese-fedora-workstation-35",
          "author": "Ladislav Hagara",
          "description": "MojeFedora.cz informuje co nového přinese Fedora Workstation 35: Lepší podpora Waylandu pod ovladačem od NVidie, režim pro kiosky, myši s vysokým rozlišením, PipeWire, podpora zatemňovacích obrazovek, OpenGL nad Vulkanem a profily napájení.",
          "link": "http://www.abclinuxu.cz/zpravicky/co-noveho-prinese-fedora-workstation-35",
          "publishedOn": "2021-09-20T19:34:36.000Z",
          "wordCount": 914,
          "title": "Co nového přinese Fedora Workstation 35"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/retroarch-1.9.10",
          "author": "Ladislav Hagara",
          "description": "Byla vydána nová verze 1.9.10 multiplatformního frontendu k emulátorům, herním enginům a multimediálním přehrávačům RetroArch (Wikipedie). Přehled novinek v příspěvku na blogu. RetroArch je nově k dispozici také na Steamu.",
          "link": "http://www.abclinuxu.cz/zpravicky/retroarch-1.9.10",
          "publishedOn": "2021-09-20T09:02:32.000Z",
          "wordCount": 893,
          "title": "RetroArch 1.9.10"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/online-konference-libreoffice-2021",
          "author": "Zdeněk Crhonek",
          "description": "Od 23. do 25. září bude probíhat online konference LibreOffice 2021. Během tří dnů je připraveno okolo padesáti přednášek, workshopů a komunitních setkání s tématy týkající se kancelářského balíku, komunity a open source. Program je k dispozici na stránce konference. Konference se bude konat na komunikační platformě Jitsi a je zdarma. Připravuje se také YouTube přenos. Registrace je dostupná na stránce konference.",
          "link": "http://www.abclinuxu.cz/zpravicky/online-konference-libreoffice-2021",
          "publishedOn": "2021-09-20T08:30:20.000Z",
          "wordCount": 935,
          "title": "Online konference LibreOffice 2021"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/chafa-1.8",
          "author": "Ladislav Hagara",
          "description": "Chafa (GitHub) je utilita a knihovna pro zobrazování libovolných obrázků v terminálu. Novinky v nejnovější verzi 1.8 v příspěvku na blogu.",
          "link": "http://www.abclinuxu.cz/zpravicky/chafa-1.8",
          "publishedOn": "2021-09-19T23:23:51.000Z",
          "wordCount": 1204,
          "title": "Chafa 1.8"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/sailfish-os-4.2.0-verla",
          "author": "Ladislav Hagara",
          "description": "Společnost Jolla oznámila vydání verze 4.2.0 s kódovým názvem Verla mobilního operačního systému Sailfish OS (Wikipedie). Podrobný přehled novinek v poznámkách k vydání.",
          "link": "http://www.abclinuxu.cz/zpravicky/sailfish-os-4.2.0-verla",
          "publishedOn": "2021-09-19T10:10:21.000Z",
          "wordCount": 894,
          "title": "Sailfish OS 4.2.0 Verla"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/foreman-3.0",
          "author": "Ladislav Hagara",
          "description": "Foreman (Wikipedie), nástroj pro kompletní správu životního cyklu fyzických i virtuálních serverů, byl vydán ve verzi 3.0. Přehled novinek v poznámkách k vydání.",
          "link": "http://www.abclinuxu.cz/zpravicky/foreman-3.0",
          "publishedOn": "2021-09-18T18:33:06.000Z",
          "wordCount": 890,
          "title": "Foreman 3.0"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/gimp-2.10.28",
          "author": "Ladislav Hagara",
          "description": "Byla vydána nová stabilní verze 2.10.28 svobodné aplikace pro úpravu a vytváření rastrové grafiky GIMP (GNU Image Manipulation Program). Verze 2.10.26 byla přeskočena. Přehled novinek v oznámení o vydání a v souboru NEWS na GitLabu. Vývojáři zdůrazňují opravu několika chyb ve verzi pro Windows. Nový GIMP je již k dispozici také na Flathubu.",
          "link": "http://www.abclinuxu.cz/zpravicky/gimp-2.10.28",
          "publishedOn": "2021-09-18T12:11:39.000Z",
          "wordCount": 919,
          "title": "GIMP 2.10.28"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/cesky-preklad-prirucky-libreoffice-impress-7.0",
          "author": "Zdeněk Crhonek",
          "description": "Český LibreOffice tým vydává překlad příručky LibreOffice Impress 7.0. Tato příručka je určena pro začátečníky i pokročilé uživatele aplikace Impress, prezentační komponenty v LibreOffice. S její pomocí můžete vytvářet snímky, které obsahují text, číslované a odrážkové seznamy, tabulky, grafy, videoklipy, kliparty a další objekty. Impress přichází s předdefinovanými textovými styly a předlohami snímků; můžete si také vytvořit vlastní.  Příručka je ke stažení na stránce dokumentace. Tým nyní pracuje na překladu příruček Draw a Base.",
          "link": "http://www.abclinuxu.cz/zpravicky/cesky-preklad-prirucky-libreoffice-impress-7.0",
          "publishedOn": "2021-09-18T11:57:32.000Z",
          "wordCount": 957,
          "title": "Český překlad příručky LibreOffice Impress 7.0"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Extending-DWARF-GPUs",
          "author": null,
          "description": "In addition to AMD's increasing Linux kernel contributions, they are also contributing more improvements in user-space too thanks to their super-computing wins and other big enterprise deployments that are Linux-based. One of the areas talked about this week at the Linux Plumbers Conference with the GNU Tools track is how they are working to extend the DWARF debug format to better handle GPU debugging...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Extending-DWARF-GPUs",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 899,
          "title": "AMD Extending DWARF To Better Handle GPU Debugging, Continues Collaborating With GCC & LLVM"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-ENQCMD-Restoring-Patches",
          "author": null,
          "description": "While Intel is normally quite good with their new hardware support being in good shape well ahead of launch, their new code for supporting the ENQCMD functionality for the Data Streaming Accelerator (DSA) with Xeon \"Sapphire Rapids\" has been an exception. This summer the mainline Linux kernel disabled ENQCMD support since the code was \"broken beyond repair\" while now Intel engineers have sent out a new series looking to get it re-enabled...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-ENQCMD-Restoring-Patches",
          "publishedOn": "2021-09-20T20:25:44.000Z",
          "wordCount": 863,
          "title": "Intel Posts New Linux Patches Looking To Re-Enable ENQCMD Ahead Of Sapphire Rapids"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=CUPS-2.4-Next-Year-Then-2.5-3.0",
          "author": null,
          "description": "An Open Printing micro-conference took place today during the Linux Plumbers Conference 2021 week. While it's hard to get excited about printers in 2021, it is exciting the renewed effort around CUPS with it now being back to effectively led by the community and CUPS founder Michael Sweet who left Apple. CUPS 2.4 is coming as the first feature release in quite a while and then CUPS 2.5 followed by CUPS 3.0 are already being talked about with features being discussed...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=CUPS-2.4-Next-Year-Then-2.5-3.0",
          "publishedOn": "2021-09-20T19:02:04.000Z",
          "wordCount": 985,
          "title": "CUPS 2.4 Coming Next Month, CUPS 2.5 + CUPS 3.0 Already In Planning"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=OpenVPN-DCO-Kernel",
          "author": null,
          "description": "OpenVPN has been implementing a kernel module for data channel offload (DCO) capabilities to enhance the performance of this virtual private network system...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=OpenVPN-DCO-Kernel",
          "publishedOn": "2021-09-20T18:31:55.000Z",
          "wordCount": 867,
          "title": "OpenVPN DCO Linux Kernel Module Aims To Offer Faster VPN Performance"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-470.74-Linux",
          "author": null,
          "description": "NVIDIA has released their latest 470 series Linux driver point release...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-470.74-Linux",
          "publishedOn": "2021-09-20T13:47:07.000Z",
          "wordCount": 852,
          "title": "NVIDIA 470.74 Linux Driver Released With Several Fixes"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=DXVK-1.9.2-Released",
          "author": null,
          "description": "DXVK 1.9.2 is out as the newest version of this key library necessary to the success of Valve's Steam Play (Proton) by translating Direct3D 9/10/11 calls to Vulkan for a much more performant Windows gaming experience on Linux...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=DXVK-1.9.2-Released",
          "publishedOn": "2021-09-20T13:36:52.000Z",
          "wordCount": 1016,
          "title": "DXVK 1.9.2 Released With More Games In Better Shape"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Oktoberfest-2021-Special",
          "author": null,
          "description": "While Oktoberfest was once again cancelled due to the COVID-19 pandemic (then again, due to the state of the ad industry / ad-block users we haven't had any European meet-up / open-source gathering in years), the wiesn would have kicked off this past weekend. So as is tradition, there is the Phoronix Premium Oktoberfest sale where you can join the ad-free service as a reduced rate. If you enjoy the daily, original Linux and open-source content on Phoronix with plenty of benchmarking, you can do so at a reduced rate...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Oktoberfest-2021-Special",
          "publishedOn": "2021-09-20T13:10:36.000Z",
          "wordCount": 1090,
          "title": "Phoronix Ad-Free/Premium Special For Oktoberfest 2021"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Rust-Adds-Motorola-M68k",
          "author": null,
          "description": "With the m68k community continuing to be active around supporting the vintage Motorola 68000 series with modern open-source software, Rust has now merged support for these old processors...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Rust-Adds-Motorola-M68k",
          "publishedOn": "2021-09-20T13:02:30.000Z",
          "wordCount": 801,
          "title": "Rust Lands Support For The Motorola 68000 Processors"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-ROCm-CRIU-XDC2021",
          "author": null,
          "description": "Earlier this year AMD went public with prototyping CRIU support for Radeon GPUs around ROCm to be able to checkpoint/freeze running compute workloads and to then restore them at a later point. This CRIU focus is driven by their big accelerator needs and forthcoming supercomputers for migrating workloads particularly within containers. AMD continues working on CRIU support for GPUs and last week provided an update on the project...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-ROCm-CRIU-XDC2021",
          "publishedOn": "2021-09-20T12:21:50.000Z",
          "wordCount": 925,
          "title": "AMD Continues CRIU Work To Checkpoint/Restore ROCm Compute Workloads"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-EC-Driven-Backlights",
          "author": null,
          "description": "NVIDIA is contributing a new open-source driver to the upstream Linux kernel for dealing with upcoming laptops where the backlight controls are handled by the device's embedded controller (EC)...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-EC-Driven-Backlights",
          "publishedOn": "2021-09-20T11:17:47.000Z",
          "wordCount": 856,
          "title": "NVIDIA Prepares The Linux Kernel For Future Laptops With EC-Driven Backlights"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Fedora-35-Great-Features-Coming",
          "author": null,
          "description": "Fedora Workstation 35 will hopefully be out at the end of October (currently the beta is running behind schedule) and when it does ship it's once again at the bleeding-edge of Linux features. Fedora Workstation 35 is shaping up to be another great release for those interested in a feature-rich desktop experience...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Fedora-35-Great-Features-Coming",
          "publishedOn": "2021-09-20T10:00:59.000Z",
          "wordCount": 1088,
          "title": "Red Hat's Upstream Contributions Are Making For A Great Fedora Workstation 35"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=xf86-input-libinput-1.2",
          "author": null,
          "description": "For those continuing to make use of the X.Org Server, xf86-input-libinput 1.2 is now available for integrating the latest functionality of libinput input handling library...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=xf86-input-libinput-1.2",
          "publishedOn": "2021-09-20T09:38:07.000Z",
          "wordCount": 777,
          "title": "xf86-input-libinput 1.2 Brings Touchpad Gestures, High Resolution Scrolling"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-rc2",
          "author": null,
          "description": "Linux 5.15-rc2 is now available as the latest weekly release candidate for this next version of the Linux kernel. Linux 5.15 in turn should be out as stable around the start of November...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-rc2",
          "publishedOn": "2021-09-20T00:48:15.000Z",
          "wordCount": 973,
          "title": "Linux 5.15-rc2 Released With Many Fixes, Addressing Issues Raised By \"-Werror\""
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=HarfBuzz-3.0",
          "author": null,
          "description": "HarfBuzz 3.0 has been released as a new version of this widely-used, open-source text shaping library that is used by the major Linux desktop environments along with Chrome OS, Java, Android, Chrome, and a plethora of other software projects and UI toolkits...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=HarfBuzz-3.0",
          "publishedOn": "2021-09-19T20:11:39.000Z",
          "wordCount": 733,
          "title": "HarfBuzz 3.0 Released With Unicode 14.0 Support, More APIs Considered Stable"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=SMB3-File-Server-Security-Fix",
          "author": null,
          "description": "It was just a few weeks back that KSMBD was merged into Linux 5.15 while now it's seeing its first important security fix...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=SMB3-File-Server-Security-Fix",
          "publishedOn": "2021-09-19T17:05:25.000Z",
          "wordCount": 882,
          "title": "That Didn't Take Long: KSMBD In-Kernel File Server Already Needs Important Security Fix"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=ASUS-WMI-NCT6775",
          "author": null,
          "description": "With a change to the nct6775 hardware monitoring sensor driver, more ASUS motherboards should enjoy working sensor support come Linux 5.16...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=ASUS-WMI-NCT6775",
          "publishedOn": "2021-09-19T10:19:19.000Z",
          "wordCount": 859,
          "title": "Linux 5.16 To Support Sensor Readings On More ASUS Motherboards"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Jolla-Sailfish-OS-4.2",
          "author": null,
          "description": "Jolla this week released Sailfish OS 4.2 \"Verla\" as the newest version of this Linux-based smartphone operating system that continues to be made commercially available for various devices...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Jolla-Sailfish-OS-4.2",
          "publishedOn": "2021-09-19T09:53:59.000Z",
          "wordCount": 696,
          "title": "Jolla Releases Sailfish OS 4.2 For Continuing To Improve This Linux-Based Smartphone OS"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=SDL-Wayland-State-2021",
          "author": null,
          "description": "The recently released SDL 2.0.16 brought much-improved Wayland support but it's still not quite good enough yet to have it be the default over the SDL X11 path. However, developers continue working in that direction to eventually use it by default...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=SDL-Wayland-State-2021",
          "publishedOn": "2021-09-19T09:45:57.000Z",
          "wordCount": 906,
          "title": "SDL Still Has A Number Of Issues To Address Before Defaulting To Wayland"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Less-Broken-Jensen",
          "author": null,
          "description": "One has to wonder how much longer the Linux kernel will keep around some very old and known to be borked hardware support but at least for now the DECpc AXP 150 \"Jensen\" platform support is sticking around and with Linux 5.15 is no longer marked as \"broken\" outright...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Less-Broken-Jensen",
          "publishedOn": "2021-09-18T23:36:07.000Z",
          "wordCount": 887,
          "title": "Linux 5.15 Is Now Slightly Less Broken For The DEC Alpha \"Jensen\""
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=DRM-AI-APU-RFC",
          "author": null,
          "description": "BayLibre developer Alexandre Bailon has posted a \"request for comments\" of a new open-source Direct Rendering Manager (DRM) driver for AI Processing Unit (APU) functionality. Initially the driver is catering to Mediatek SoCs with an AI co-processor but this DRM \"APU\" driver could be adapted to other hardware too...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=DRM-AI-APU-RFC",
          "publishedOn": "2021-09-18T17:12:27.000Z",
          "wordCount": 866,
          "title": "DRM Driver Posted For AI Processing Unit - Initially Focused On Mediatek SoCs"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Apple-M1-USB-Type-C-Linux",
          "author": null,
          "description": "The latest patches sent out for review/testing on the long mission for enabling Apple M1 support on Linux is the USB Type-C connectivity...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Apple-M1-USB-Type-C-Linux",
          "publishedOn": "2021-09-18T13:05:58.000Z",
          "wordCount": 818,
          "title": "Apple M1 USB Type-C Linux Support Code Sent Out For Testing"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-P-State-XDC2021",
          "author": null,
          "description": "As reported at the start of August, AMD and Valve have been working on Linux CPU performance/frequency scaling improvements with the Steam Deck being one of the leading motivators. As speculated at that time, their work would likely revolve around use of ACPI CPPC found with Zen 2 CPUs and newer. Published last week was that AMD P-State driver for Linux systems indeed now leveraging CPPC information. AMD formally presented this new driver yesterday at XDC2021...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-P-State-XDC2021",
          "publishedOn": "2021-09-18T11:26:08.000Z",
          "wordCount": 984,
          "title": "AMD + Valve Focusing On P-State / CPPC Driver With Schedutil For Better Linux Efficiency"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GIMP-2.10.28-Released",
          "author": null,
          "description": "There's still some time to go before seeing the long-awaited GIMP 3.0 release for this open-source image manipulation program but at least out this weekend is GIMP 2.10.28 for bettering the current stable series...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GIMP-2.10.28-Released",
          "publishedOn": "2021-09-18T09:56:56.000Z",
          "wordCount": 728,
          "title": "GIMP 2.10.28 Released With More Fixes"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=More-Plasma-Wayland-Sep-2021",
          "author": null,
          "description": "Along with releasing Plasma 5.23 Beta this week, KDE developers have been busy on driving in a bunch of Plasma Wayland fixes and other refinements to their stack...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=More-Plasma-Wayland-Sep-2021",
          "publishedOn": "2021-09-18T09:42:36.000Z",
          "wordCount": 902,
          "title": "KDE Sees Another Big Batch Of Plasma Wayland Improvements"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Red-Hat-Hiring-For-Linux-HDR",
          "author": null,
          "description": "One of the areas where Linux has struggled on the desktop has been around HDR (high dynamic range) display support while that will hopefully be addressed in the coming months with Red Hat hiring an engineer to focus on that problem...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Red-Hat-Hiring-For-Linux-HDR",
          "publishedOn": "2021-09-17T19:15:34.000Z",
          "wordCount": 876,
          "title": "Red Hat Is Hiring So Linux Can Finally Have Good HDR Display Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GCC-12-Apple-M1-Port-Plan",
          "author": null,
          "description": "Developers are hoping for next year's GCC 12 release they will have Apple AArch64 support on Darwin in place for being able to support Apple Silicon -- initially the M1 SoC -- on macOS with GCC...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GCC-12-Apple-M1-Port-Plan",
          "publishedOn": "2021-09-17T18:41:26.000Z",
          "wordCount": 813,
          "title": "Apple Silicon / M1 Port Planned For GCC 12"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-Rust-2021-Experiment",
          "author": null,
          "description": "Longtime Mesa developer Karol Herbst who has worked extensively on the open-source NVIDIA \"Nouveau\" driver as well as the OpenCL/compute stack while being employed by Red Hat is now toying with the idea of Rust code inside Mesa...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-Rust-2021-Experiment",
          "publishedOn": "2021-09-17T17:39:50.000Z",
          "wordCount": 735,
          "title": "Experimenting Is Underway For Rust Code Within Mesa"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-18.04.6-LTS-Released",
          "author": null,
          "description": "The unplanned Ubuntu 18.04.6 LTS release is available today that was made on short notice for addressing unbootable media with Ubuntu 18.04.5...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-18.04.6-LTS-Released",
          "publishedOn": "2021-09-17T17:06:12.000Z",
          "wordCount": 767,
          "title": "Ubuntu 18.04.6 LTS Released To Correct Broken Install Media"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-DG1-Status-XDC2021",
          "author": null,
          "description": "Along with bringing up DG2/Alchemist graphics card support on Linux, Intel engineers have been working to square away their support for the DG1 developer graphics card. This week thanks to XDC2021 is a fresh status update about what is working with this initial Intel graphics card on their open-source driver and what remains in the works...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-DG1-Status-XDC2021",
          "publishedOn": "2021-09-17T13:25:11.000Z",
          "wordCount": 863,
          "title": "The Current State Of Intel Discrete Graphics On Linux: Almost \"Fully Functional\""
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Platform-Profiles-Axboe",
          "author": null,
          "description": "As covered several times going back to the end of last year, ACPI Platform Profile support has materialized in recent versions of the Linux kernel for the core infrastructure and implementations that work with the latest laptops from the likes of Dell, Lenovo, ASUS, and HP. This platform profile support is becoming increasingly important with expressing your power/cooling/performance preference so that your laptop behaves as one would expect...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Platform-Profiles-Axboe",
          "publishedOn": "2021-09-17T12:58:39.000Z",
          "wordCount": 1033,
          "title": "The Increasing Importance Of ACPI Platform Profiles With Today's Throttle-Happy Hardware"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30531",
          "author": null,
          "description": "As usual when the Linux 5.15 merge window began wrapping up, I set out to dive into its performance to see what is in store for this next version of the kernel and whether there was any regressions or other performance changes worth noting. Linux 5.15 overall has been in good shape for the \"-rc1\" state except noticing that code compilation workloads were taking longer on multiple Linux 5.15-rc1-running systems than Linux 5.14 or prior. Seeing it across multiple systems and a very real-world regression, it was worth bisecting and looking closer so here are the details.",
          "link": "https://www.phoronix.com/vr.php?view=30531",
          "publishedOn": "2021-09-16T11:00:00.000Z",
          "wordCount": 1051,
          "title": "Running Linux 5.15-rc1 Causing A New Slowdown... Here's A Look"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30523",
          "author": null,
          "description": "While NVIDIA has been supporting Resizable BAR for a while now with their GeForce RTX 30 series graphics cards, for those exclusively using Linux it remains more of a challenge due to AIB partners generally not releasing any vBIOS updates for ReBAR support that can be easily applied under Linux. But if you do carry out an update -- such as under Windows -- the performance uplift can be worthwhile if using a game that can benefit from the support.",
          "link": "https://www.phoronix.com/vr.php?view=30523",
          "publishedOn": "2021-09-14T13:09:13.000Z",
          "wordCount": 932,
          "title": "NVIDIA RTX 30 Series Resizable BAR Support Continues Helping Performance On Linux"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/rss.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2518/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2518/",
          "publishedOn": "2021-09-20T04:00:00.000Z",
          "wordCount": 187,
          "title": "Lumpers and Splitters"
        },
        {
          "id": "https://xkcd.com/2517/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2517/",
          "publishedOn": "2021-09-17T04:00:00.000Z",
          "wordCount": 185,
          "title": "Rover Replies"
        },
        {
          "id": "https://xkcd.com/2516/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2516/",
          "publishedOn": "2021-09-15T04:00:00.000Z",
          "wordCount": 185,
          "title": "Hubble Tension"
        },
        {
          "id": "https://xkcd.com/2515/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2515/",
          "publishedOn": "2021-09-13T04:00:00.000Z",
          "wordCount": 185,
          "title": "Vaccine Research"
        }
      ]
    }
  ],
  "cliVersion": "1.11.1"
}