{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": [
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.2",
          "author": null,
          "description": "Fixed: unicode characters in URL caused download error\nFixed: project root npm install error\nAdded: unit test library\nChore: Dependency updates\nThank you: @CaptNo1",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.2",
          "publishedOn": "2021-09-26T18:45:39.000Z",
          "wordCount": 354,
          "title": "v1.11.2"
        },
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "author": null,
          "description": "Fixed: Unexpected nested element in author field crashes the parser\nThank you @ad-m",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "publishedOn": "2021-09-16T06:39:32.000Z",
          "wordCount": 344,
          "title": "v1.11.1"
        }
      ]
    },
    {
      "title": "Kotaku",
      "feedUrl": "https://kotaku.com/rss",
      "siteUrl": "https://kotaku.com",
      "articles": [
        {
          "id": "1847788363",
          "author": "Zack Zwiezen",
          "description": "If you are afraid of spiders and trains, you really shouldn’t have clicked on this blog. I’ll give you a chance to leave now, because this new horror game coming out in 2022 is going to be too much for you and your fears. \nRead more...",
          "link": "https://kotaku.com/new-open-world-horror-game-features-an-evil-spider-trai-1847788363",
          "publishedOn": "2021-10-02T21:30:00.000Z",
          "wordCount": 497,
          "title": "New Open-World Horror Game Features An Evil Spider Train Named Charles"
        },
        {
          "id": "1847401161",
          "author": "Zack Zwiezen",
          "description": "The ongoing lawsuit against Activision Blizzard has made public some truly terrible and horrendous behavior that occurred across multiple studios and offices. Many women were allegedly sexually harassed, assaulted, and psychologically traumatized while the folks in power at the companies involved seemingly did little…\nRead more...",
          "link": "https://kotaku.com/everything-that-has-happened-since-the-activision-blizz-1847401161",
          "publishedOn": "2021-10-02T20:15:00.000Z",
          "wordCount": 3379,
          "title": "Everything That Has Happened Since The Activision Blizzard Lawsuit Was Filed"
        },
        {
          "id": "1847787828",
          "author": "Zack Zwiezen",
          "description": "Google is currently in court over an antitrust order filed in 2018 by the European Union. Along with the order, it received a nearly $5 billion fine after the tech giant was accused of allegedly using unfair tactics to crush any competing search engines, creating a monopoly in the market. Google is denying this, with…\nRead more...",
          "link": "https://kotaku.com/this-is-awkward-but-the-most-searched-word-on-bing-is-1847787828",
          "publishedOn": "2021-10-02T18:00:00.000Z",
          "wordCount": 481,
          "title": "This Is Awkward, But The Most Searched Word On Bing Is 'Google'"
        },
        {
          "id": "1847787478",
          "author": "Zack Zwiezen",
          "description": "It’s likely that if you are reading these words on this website, you already know how hard it can be to get your hands on the new consoles. Well, I’ve got some bad news straight from Xbox VP of gaming Phil Spencer: Finding a console ain’t getting easier anytime soon. \nRead more...",
          "link": "https://kotaku.com/xbox-head-explains-console-shortages-will-continue-into-1847787478",
          "publishedOn": "2021-10-02T16:00:00.000Z",
          "wordCount": 578,
          "title": "Xbox Head Explains Console Shortages Will Continue Into 2022"
        },
        {
          "id": "1847785048",
          "author": "Zack Zwiezen",
          "description": "Every Pokemon is interesting and worth talking about. I don’t play a ton of Pokemon, but I do enjoy the universe and I love learning more about the creatures in it. So, Here’s Another Pokemon! It’s Drifblim!\n\nRead more...",
          "link": "https://kotaku.com/drifblim-carries-people-away-never-to-be-seen-again-1847785048",
          "publishedOn": "2021-10-02T15:00:00.000Z",
          "wordCount": 566,
          "title": "Drifblim Carries People Away, Never To Be Seen Again"
        },
        {
          "id": "1847785411",
          "author": "Isaiah Colbert",
          "description": "Oftentimes the gameplay loop in point-and-click adventures involves uninspired scavenger hunts for trinkets, with no time taken to fully appreciate the history of those objects. The new game Last Call tackles this shortcoming directly, making the backstory of seemingly ordinary items a core part of its gameplay and…\nRead more...",
          "link": "https://kotaku.com/last-call-is-an-intimate-game-about-healing-from-an-abu-1847785411",
          "publishedOn": "2021-10-02T13:00:00.000Z",
          "wordCount": 2113,
          "title": "Last Call Is An Intimate Game About Healing From An Abusive Relationship"
        },
        {
          "id": "1847785170",
          "author": "Jeremy Winslow",
          "description": "Konami Digital Entertainment has released a statement regarding the just-released and frequently mocked eFootball 2022, apologizing for the sorry state the soccer simulation game shipped in and confirming that the development team is preparing an update to release some time this month.\n\nRead more...",
          "link": "https://kotaku.com/konami-apologizes-for-atrocious-efootball-2022-launch-1847785170",
          "publishedOn": "2021-10-01T21:55:00.000Z",
          "wordCount": 423,
          "title": "Konami Apologizes For Atrocious eFootball 2022 Launch, Fixes On The Way"
        },
        {
          "id": "1847784325",
          "author": "Jeremy Winslow",
          "description": "If you’ve spent any time on Twitter recently, you may have noticed Kingdom Hearts’ Sora has been trending. That’s thanks to the ever-vocal Super Smash Bros. Ultimate community once again debating the potential of Square Enix’s big-shoed hero joining the already-packed fighting game as its final new combatant.\nRead more...",
          "link": "https://kotaku.com/smash-bros-ultimate-fans-split-on-kingdom-hearts-sora-1847784325",
          "publishedOn": "2021-10-01T20:00:00.000Z",
          "wordCount": 907,
          "title": "Smash Bros. Ultimate Fans Split On Kingdom Hearts' Sora As Final DLC Fighter"
        },
        {
          "id": "1847784198",
          "author": "Ethan Gach",
          "description": "Way back in 2011, the very first “Nintendo Direct” featured then-Nintendo of America president Reggie Fils-Aimé in a white, echo-y room promoting the struggling 3DS by talking about how it was getting Hulu Plus and could record 3D videos. “Up to 10 minutes of 3D video can be recorded of anything you want,” he said.…\nRead more...",
          "link": "https://kotaku.com/10-years-later-we-cant-stop-watching-nintendo-directs-1847784198",
          "publishedOn": "2021-10-01T19:45:00.000Z",
          "wordCount": 485,
          "title": "10 Years Later, We Can't Stop Watching Nintendo Directs"
        },
        {
          "id": "1847783209",
          "author": "Zack Zwiezen",
          "description": "NFTs (Non-Fungible Tokens) have exploded in popularity in 2021. This sucks. NFTs use blockchain technology to allow artists and creators to sell a “special type of cryptographic token which represents sgomething unique”, so each token is one-of-a-kind. Though to be clear: only the token itself is certified as unique. …\nRead more...",
          "link": "https://kotaku.com/a-list-of-your-fave-celebrities-who-are-now-peddling-nf-1847783209",
          "publishedOn": "2021-10-01T18:20:00.000Z",
          "wordCount": 1150,
          "title": "All Your Celeb Faves Who Are Now Peddling NFTs"
        },
        {
          "id": "1847783307",
          "author": "Sisi Jiang",
          "description": "At the Tokyo Game Show yesterday, Bethesda’s creative director Todd Howard told an audience that upcoming space-faring RPG Starfield will have more than 150,000 lines of dialogue. If that sounds like a lot, that’s because it is. In response to the announcement, some developers at other AAA studios expressed shock at…\nRead more...",
          "link": "https://kotaku.com/starfield-s-massive-script-equals-massive-amounts-of-wo-1847783307",
          "publishedOn": "2021-10-01T17:50:00.000Z",
          "wordCount": 742,
          "title": "Starfield’s Massive Script Equals Massive Amounts Of Work, Say Devs"
        },
        {
          "id": "1847782744",
          "author": "Isaiah Colbert",
          "description": "Whenever I think about the Stranger of Paradise: Final Fantasy Origins E3 trailer, the lasting impression of the game isn’t the fact that it is a Final Fantasy game or even its admittedly cool combat. No, the only thing that comes to mind is how the protagonist just really wants to kill chaos. But after seeing the…\nRead more...",
          "link": "https://kotaku.com/that-new-final-fantasy-origins-trailer-is-actually-pret-1847782744",
          "publishedOn": "2021-10-01T17:00:00.000Z",
          "wordCount": 620,
          "title": "That New Final Fantasy Origins Trailer Is Actually Pretty Cool"
        },
        {
          "id": "1847782564",
          "author": "Renata Price",
          "description": "Yesterday, Twitch announced it will test a new feature that allows streamers and their audiences to pay for heightened visibility. Currently, only a select number of accounts participating in Twitch’s research initiative have access to the feature. Despite this, streamers are, unsurprisingly, not very happy about this…\nRead more...",
          "link": "https://kotaku.com/twitch-announces-test-of-pay-to-win-promotion-feature-1847782564",
          "publishedOn": "2021-10-01T16:35:00.000Z",
          "wordCount": 582,
          "title": "Twitch Announces Test Of ‘Pay-To-Win’ Promotion Feature"
        },
        {
          "id": "1847782307",
          "author": "Ethan Gach",
          "description": "Amazon’s colonialist resource extraction MMO, New World, is currently the hottest new game on Steam, quite literally in some instances. More than a few players are reporting loud fans and high graphics card temperatures while running the game, and occasionally even just while queueing for it. And then there are the…\nRead more...",
          "link": "https://kotaku.com/new-world-still-bricking-expensive-graphics-cards-say-1847782307",
          "publishedOn": "2021-10-01T16:10:00.000Z",
          "wordCount": 542,
          "title": "New World Still Bricking Expensive Graphics Cards, Say Players"
        },
        {
          "id": "1847782279",
          "author": "Mike Fahey",
          "description": "Though it’s been barely a month since its official release, Netmarble’s multiverse-spanning mobile Marvel Comics MMO just received its first major update, giving players a new mystical realm to explore, 10 more experience levels to gain, and a dread ruler of the Dark Dimension to smack down for gear and glory.\nRead more...",
          "link": "https://kotaku.com/the-best-marvel-game-out-right-now-just-got-a-little-be-1847782279",
          "publishedOn": "2021-10-01T16:00:00.000Z",
          "wordCount": 678,
          "title": "The Best Marvel Game Out Right Now Just Got A Little Better"
        },
        {
          "id": "1847781001",
          "author": "John Walker",
          "description": "There’s a scene near the start of the first episode of Korean Netflix phenomenon Squid Game where main character, Seong Gi-hun, is repeatedly trying and failing to get a prize from a claw machine. He’s just been beaten up, lost gambling winnings he’d only possessed for a few minutes, and he’s trying to win a…\nRead more...",
          "link": "https://kotaku.com/netflixs-squid-game-is-a-is-a-furious-prophetic-show-th-1847781001",
          "publishedOn": "2021-10-01T14:05:00.000Z",
          "wordCount": 1452,
          "title": "Netflix's Squid Game Is A Furious Prophetic Show That’s Taking The World By Storm"
        },
        {
          "id": "1847778791",
          "author": "Zack Zwiezen",
          "description": "The Touryst, first released on Switch in 2019 and Xbox in 2020, has finally made its way over to PS4 and PS5. But the PS5 port of this tropical, adventure-filled puzzler carries a special distinction: It’s the first 8K/60 FPS console game ever officially released. But don’t go rushing out to buy an 8K TV just yet. \nRead more...",
          "link": "https://kotaku.com/the-first-ever-8k-60-fps-game-hits-ps5-1847778791",
          "publishedOn": "2021-10-01T13:30:00.000Z",
          "wordCount": 809,
          "title": "The First Ever 8K 60 FPS Game Hits PS5"
        },
        {
          "id": "1847778527",
          "author": "Renata Price",
          "description": "“You are a little mouse with a sword! And you really hate crystals!” Is how I would pitch Beast Breaker if I were in a loud bar and a mysterious stranger asked me for a game recommendation. This has not happened to me yet, but maybe it will someday.\n\nRead more...",
          "link": "https://kotaku.com/a-turn-based-pinball-game-that-will-make-you-feel-like-1847778527",
          "publishedOn": "2021-10-01T13:00:00.000Z",
          "wordCount": 996,
          "title": "A Turn-Based Pinball Game That Will Make You Feel Like A Genius"
        },
        {
          "id": "1845008808",
          "author": "Brian Ashcraft",
          "description": "Today is World Sake Day. October 1 has traditionally been the start of the brewing season, and Japan marks the day as Nihonshu no Hi (日本酒の日) or, literally, “Sake Day.”\nRead more...",
          "link": "https://kotaku.com/how-to-get-into-japans-gift-to-the-world-sake-1845008808",
          "publishedOn": "2021-10-01T11:00:00.000Z",
          "wordCount": 2724,
          "title": "How To Get Into Japan's Gift To The World, Sake"
        },
        {
          "id": "1847780371",
          "author": "Brian Ashcraft",
          "description": "In 2005, Bandai and Namco merged, and the following year, Bandai Namco was born. To mark the new conglomerate, the company got a yellow, red, and orange logo with the company’s name in white font. It’s not a bad look, and stands out among Japanese game companies. But next year, Bandai Namco is getting a redesigned…\nRead more...",
          "link": "https://kotaku.com/bandai-namco-changed-its-logo-and-fans-think-it-kinda-s-1847780371",
          "publishedOn": "2021-10-01T10:00:00.000Z",
          "wordCount": 567,
          "title": "Bandai Namco Changed Its Logo And Fans Think It Kinda Sucks"
        },
        {
          "id": "1847778128",
          "author": "Isaiah Colbert",
          "description": "Today, in advance of the release of Battlefield 2042 this November, EA announced the Battlefield Community Charter, a set of guidelines developed with the stated aim of “ensuring Battlefield remains a welcoming experience that encourages Positive Play.” Positive Play is EA’s set of initiatives which aim to “help keep…\nRead more...",
          "link": "https://kotaku.com/ea-is-encouraging-gamers-to-stop-being-assholes-via-bat-1847778128",
          "publishedOn": "2021-09-30T21:15:00.000Z",
          "wordCount": 493,
          "title": "EA Is Encouraging Gamers To Stop Being Jerks Via Battlefield 2042"
        },
        {
          "id": "1847777988",
          "author": "Jeremy Winslow",
          "description": "Konami’s long-running football simulation series underwent a name change this year, going from PES to eFootball. But this rebranding didn’t cover up the development deficiencies, as evidenced by frustrated Steam fans who are sharing their frustrations for what many say is “the worst football game” ever released.\n\nRead more...",
          "link": "https://kotaku.com/konamis-efootball-is-steams-most-hated-game-right-now-1847777988",
          "publishedOn": "2021-09-30T20:50:00.000Z",
          "wordCount": 597,
          "title": "Konami's eFootball Is Steam's Most-Hated Game Right Now"
        },
        {
          "id": "1847777718",
          "author": "Sisi Jiang",
          "description": "I didn’t pay much attention to the anime fighting game Melty Blood: Type Lumina until just yesterday, when the developers made the official announcement that Saber, Fate/Stay Night protagonist and the “King of Knights” herself, would be joining the new game’s roster. After seeing her video gameplay debut, I…\nRead more...",
          "link": "https://kotaku.com/thank-you-melty-blood-for-adding-fate-stay-night-s-sabe-1847777718",
          "publishedOn": "2021-09-30T20:40:00.000Z",
          "wordCount": 674,
          "title": "Thank You Melty Blood For Adding Fate/Stay Night’s Saber, My Sword Wife"
        },
        {
          "id": "1847777778",
          "author": "Ethan Gach",
          "description": "Almost a year after the PS5 and Xbox Series X came out they’re still incredibly hard to find, and expensive, including at Amazon where the monopolistic retailer appears to be selling at least a few Microsoft consoles for roughly $1,000, or twice what they’re actually supposed to cost.\nRead more...",
          "link": "https://kotaku.com/amazon-is-selling-rare-xbox-series-xs-at-scalper-markup-1847777778",
          "publishedOn": "2021-09-30T20:20:00.000Z",
          "wordCount": 676,
          "title": "Amazon Is Selling Used Xbox Series Xs At Scalper Markup Prices"
        },
        {
          "id": "1847777358",
          "author": "Zack Zwiezen",
          "description": "I have a boring ritual. Every few weeks, I make sure to check out the Prime Gaming Rewards page to see what free games are available. Most of the time it’s nothing too exciting, maybe a few good, smaller games along with some totally forgettable things I’ll never play. But October is different. This time Amazon is…\nRead more...",
          "link": "https://kotaku.com/amazon-prime-s-free-games-for-october-are-shockingly-go-1847777358",
          "publishedOn": "2021-09-30T19:40:00.000Z",
          "wordCount": 557,
          "title": "Amazon Prime’s Free Games For October Are Shockingly Good"
        }
      ]
    },
    {
      "title": "Nintendo Life | Latest Updates",
      "feedUrl": "https://www.nintendolife.com/feeds/latest",
      "siteUrl": "https://www.nintendolife.com/feeds/latest",
      "articles": [
        {
          "id": "https://www.nintendolife.com/#article-121529",
          "author": null,
          "description": "September's best Switch eShop games!\nSeptember was another cracking month for new releases on the Switch eShop, with plenty of new offerings that are worthy of your time.\nThese awards aim to celebrate the best of Nintendo's digital store, giving some love and attention to the games that could so easily be missed in the Switch's ever-growing library.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/features/nintendo-life-eshop-selects-september-2021",
          "publishedOn": "2021-10-03T11:00:00.000Z",
          "wordCount": 1597,
          "title": "Feature: Nintendo Life eShop Selects - September 2021"
        },
        {
          "id": "https://www.nintendolife.com/#article-121757",
          "author": null,
          "description": "Konami will fund and publish the winner's creation.\nKonami is currently hosting a Japanese indie game contest (in cooperation with Shueisha Game Creators Camp), asking small team developers to create action and shooting games based on its classic IP.\nThe winner scores 2 million yen (about $18,000 USD) and will be given the opportunity to commercialise their game - with Konami investing up to 30 million yen (around $270,000 USD) in development funds and providing full support for the product. This includes supervision, production advice, localisation support, promotion and equipment.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/konami-competition-tasks-indie-devs-with-reviving-its-classic-ip",
          "publishedOn": "2021-10-03T10:30:00.000Z",
          "wordCount": 1233,
          "title": "Konami Competition Tasks Indie Devs With Reviving Its Classic IP"
        },
        {
          "id": "https://www.nintendolife.com/#article-121756",
          "author": null,
          "description": "Watch out for spoilers.\n\nIt seems Metroid Dread is the latest victim of a \"leak\". According to social media and websites like ResetEra, footage of the game is now doing the rounds online.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/metroid-dread-footage-has-leaked-online-ahead-of-next-weeks-launch",
          "publishedOn": "2021-10-03T07:05:00.000Z",
          "wordCount": 1502,
          "title": "Metroid Dread Footage Has Leaked Online Ahead Of Next Week's Launch"
        },
        {
          "id": "https://www.nintendolife.com/#article-121755",
          "author": null,
          "description": "Arriving on Switch in 2022.\n\nA few months ago, we got our first look at River City Girls 2, in the form of a series of screenshots and character reveals.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/arc-system-works-reveals-its-debut-trailer-for-river-city-girls-2",
          "publishedOn": "2021-10-03T06:05:00.000Z",
          "wordCount": 1134,
          "title": "Arc System Works Reveals Its Debut Trailer For River City Girls 2"
        },
        {
          "id": "https://www.nintendolife.com/#article-121753",
          "author": null,
          "description": "\"Who will join the battle?!\".\n\nWe've got a very exciting week coming up in the world of Super Smash Bros. Ultimate. October 5th will see the reveal of the very final DLC fighter for the game - bringing an end to the long journey that originally began in December 2018.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/random-smash-bros-twitter-encourages-fans-to-let-their-imaginations-run-wild-before-the-final-fighter-reveal",
          "publishedOn": "2021-10-03T05:00:00.000Z",
          "wordCount": 3110,
          "title": "Random: Smash Bros. Twitter Encourages Fans To Let Their Imaginations \"Run Wild\" Before The Final Fighter Reveal"
        },
        {
          "id": "https://www.nintendolife.com/#article-121746",
          "author": null,
          "description": "Following on from last month's rating board reveal.\nKoei Tecmo and Gust have officially announced the RPG Atelier Sophie 2: The Alchemist of the Mysterious Dream for the Nintendo Switch and multiple other platforms. It will receive a western release next year on 25th February 2022.\nThis is the same title that was previously \"leaked\" by the Australian Classification Board last month and is a follow up to Atelier Sophie: The Alchemist of the Mysterious Book.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/koei-tecmo-officially-announces-atelier-sophie-2-arriving-on-switch-next-february",
          "publishedOn": "2021-10-02T18:00:00.000Z",
          "wordCount": 2184,
          "title": "Koei Tecmo Officially Announces Atelier Sophie 2, Arriving On Switch Next February"
        },
        {
          "id": "https://www.nintendolife.com/#article-121340",
          "author": null,
          "description": "Romanes eunt domus.\nNote: Minor early-game spoilers feature in this review, so if you want to go in totally blind, skip down to the conclusion.\nLet's get the elephant in the room out of here before we begin. At this point in the year, the \"Cloud Version\" suffix is nothing new — and neither are the criticisms. The Forgotten City is a seriously brilliant little time loop narrative game, but there are always going to be the same big provisos: you need a strong internet connection to play this, and despite costing the same as the PC version, there's no guarantee how long you'll have access before the servers are shut down.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/reviews/switch-eshop/the-forgotten-city-cloud-version",
          "publishedOn": "2021-10-02T17:00:00.000Z",
          "wordCount": 2969,
          "title": "Review: The Forgotten City - Cloud Version - A Skyrim Mod Turned Gripping Narrative Time Loop"
        },
        {
          "id": "https://www.nintendolife.com/#article-121748",
          "author": null,
          "description": "The food fight begins in 2022.\nNippon Ichi Software - known for series like Disgaea - has announced a brand new food-themed \"survival strategy\" dungeon RPG for Switch and PS4. It's launching exclusively in Japan next year on 27th January.\nIt's titled Shikabanegurai no Boukenmeshi and requires you to lead a group of adventurers out of a dungeon by fighting monsters, gathering materials, and cooking and eating a lot of food. There's a character creator and jobs (hero classes), which \"bring variety\" to the food on offer.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/disgaeas-dev-cooks-up-a-new-survival-strategy-dungeon-rpg-for-switch",
          "publishedOn": "2021-10-02T16:00:00.000Z",
          "wordCount": 1335,
          "title": "Disgaea's Dev Cooks Up A New \"Survival Strategy\" Dungeon RPG For Switch"
        },
        {
          "id": "https://www.nintendolife.com/#article-121216",
          "author": null,
          "description": "5 theories to solve an armour-plated mystery rolled up in an enigma.\nThe Metroid series is now in its 35th year, and over that lengthy period of time Nintendo has happily elaborated on everything from its star’s childhood to flappy parent-killing nightmare Ridley, Metroids, Chozo, and even creepy Phazon-created evil clone. In short, virtually every avenue of lore you can think of has been explained, elaborated upon, over-elaborated on in a sequel, and then given a well-defined slot in the expansive Metroid canon.\nAll except for one. The exact workings of Samus’ Morph Ball ability — a staple of the series from the first few minutes of the first game — remain shrouded in mystery. Official information remains conspicuously absent on the finer details of this ubiquitous skill. “Collect this to give Samus the Morph Ball ability”, “Press this to make her roll into a ball” say the games no matter the format, as if such plain instruction could ever quench our thirst for sci-fi ball-related morphing knowledge.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/features/seriously-what-the-heck-is-going-on-inside-samusr-morph-ball",
          "publishedOn": "2021-10-02T15:00:00.000Z",
          "wordCount": 3803,
          "title": "Feature: Seriously, What The Heck Is Going On Inside Samus’ Morph Ball?"
        },
        {
          "id": "https://www.nintendolife.com/#article-121384",
          "author": null,
          "description": "\"Wow, peachboy, you went all out!!!\".\nNearly three years on from the release of Deltarune Chapter 1, the long-awaited release of Chapter 2 is finally here. Available as a combined download on the eShop with the previous chapter, it’s far from a conclusive follow-up, and it introduces more questions than answers, but this generally feels like a worthwhile continuation of an intriguing release. Plus, it’s also free, so you really don’t have any excuse to pass up giving it a try.\nThe story picks up right after that cliffhanger ending, though it amusingly treats that event in a rather anticlimactic fashion. From there, it isn’t long before Kris and Susie find themselves back in the Dark World and caught up in another adventure with Ralsei. This time, your party has to explore a city inspired by the early internet and you primarily fight against a goofy, wine-drunk antagonist named Queen. And while choices made in the previous chapter may have affected the story leading up to the ending — but not the ending itself — there is a notable second route you can take here that leads to a fittingly cold and substantially different result.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/reviews/switch-eshop/deltarune-chapter-2",
          "publishedOn": "2021-10-02T13:00:00.000Z",
          "wordCount": 2217,
          "title": "Mini Review: DELTARUNE Chapter 2 - Undertale's Successor Continues In Thrilling Style"
        },
        {
          "id": "https://www.nintendolife.com/#article-105267",
          "author": null,
          "description": "Updated with Castlevania Advance Collection.\nSwitch has become many a gamer's go-to console for revisiting retro classics, at home on the TV or wherever you happen to take the handheld hybrid. Squeezing in nostalgia trips between the big new releases has never been easier, and there have been a host of exceptional collections and compilation packages on Nintendo's system that bring together bundles of retro games, often with new features, bells and whistles.\nWe've put together the following list of the best compilations on Switch. We've stuck to bundles which include a minimum of three games (many of them contain a lot more than three). While most of the collections below feature retro gaming delights from yesteryear, you'll also find trilogy collections of more recent games. Plenty of good-value variety for everyone!\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/guides/best-nintendo-switch-collections-and-compilation-games",
          "publishedOn": "2021-10-02T11:00:00.000Z",
          "wordCount": 6797,
          "title": "Guide: Best Nintendo Switch Collections And Compilation Games"
        },
        {
          "id": "https://www.nintendolife.com/#article-121741",
          "author": null,
          "description": "*insert fighter here* confirmed.\n\nThe final Super Smash Bros. Ultimate DLC fighter broadcast airs next week on October 5th. So, how is the game's director Masahiro Sakurai killing time until then? With the PlayStation 5, of course!\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/random-sakurai-seems-to-be-finally-taking-a-break-from-smash-bros-development-with-the-ps5",
          "publishedOn": "2021-10-02T10:00:00.000Z",
          "wordCount": 2647,
          "title": "Random: Sakurai Seems To Be Finally Taking A Break From Smash Bros. Development, With The PS5"
        },
        {
          "id": "https://www.nintendolife.com/#article-120781",
          "author": null,
          "description": "Got gaming plans?\nAnother busy week in the world of Nintendo comes to a close. This week saw a bunch of Switch OLED videos popping up on the interwebs as the consoles find their way into the wild ahead of next week's launch, a new Pokémon was unveiled, the rebooted GamesMaster got its presenter, and the N64 turned 25. Again. In North America.\nAfter all that it's time to chill out and discuss our weekend gaming plans. A few members of the Nintendo Life team have done just that below, so feel free to give our entries a read and then join in with your own via our comment section. Enjoy!\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/features/talking-point-what-are-you-playing-this-weekend-october-2nd",
          "publishedOn": "2021-10-02T09:00:00.000Z",
          "wordCount": 6118,
          "title": "Talking Point: What Are You Playing This Weekend? (October 2nd)"
        },
        {
          "id": "https://www.nintendolife.com/#article-121739",
          "author": null,
          "description": "Tanooki Rosalina, too.\nAlthough Mario Kart Tour is now over two years old, it seems the iOS and Android game isn't slowing down any time soon.\nNintendo has just announced the Autumn Tour for the game, which will follow on from September's anniversary celebrations. It will include two new characters - Tanooki Mario and Tanooki Rosalina, along with the Super Leaf item.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/mario-kart-tour-adds-tanooki-mario-and-the-super-leaf-in-its-next-update",
          "publishedOn": "2021-10-02T08:00:00.000Z",
          "wordCount": 1263,
          "title": "Mario Kart Tour Adds Tanooki Mario And The Super Leaf In Its Next Update"
        },
        {
          "id": "https://www.nintendolife.com/#article-121738",
          "author": null,
          "description": "Here's your first look.\nThe cult hit Game Boy Advance titles Advance Wars titles are returning this holiday season on the Nintendo Switch.\nIf the announcement wasn't already a big enough dose of nostalgia for you, we've now got our first look at the box art of this upcoming release. For most parts, it's an accurate recreation of the first game's GBA cover. Ah, the memories...\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/advance-wars-switch-box-art-recreates-the-original-gba-cover",
          "publishedOn": "2021-10-02T06:30:00.000Z",
          "wordCount": 2680,
          "title": "Advance Wars' Switch Box Art Recreates The Original GBA Cover"
        },
        {
          "id": "https://www.nintendolife.com/#article-121683",
          "author": null,
          "description": "Also reassures newcomers.\n\nMetroid Dread is close, so close, and Nintendo is presumably approaching the end of its 'Report' series on the game. Pleasingly this week's entry is pretty much spoiler free as it focuses on controls, the map and features designed to help players enjoy the game.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/metroid-dread-report-volume-9-outlines-some-tweaks-to-key-features",
          "publishedOn": "2021-10-01T21:00:00.000Z",
          "wordCount": 2826,
          "title": "Metroid Dread Report Volume 9 Outlines Some Tweaks To Key Features"
        },
        {
          "id": "https://www.nintendolife.com/#article-121329",
          "author": null,
          "description": "UnFunny, but UnExpectedly good regardless.\nComedy video games. This writer's blood runs cold just to think of them. In a medium that sees you define your own pace, how can comedy possibly work without fundamentally transforming the medium from interactive to inert? The comedy and the gameplay are necessarily completely separate and so few games have managed to integrate the two in any truly impressive way just yet. Undertale, perhaps, but there's still a lot of sitting around reading dialogue in that.\nUnMetal is... a comedy video game. A parody, if you will, and unfortunately not the Parodius kind. What we've got here is an affectionate ribbing of gaming in general, presented in the guise of a stealth game akin to the original MSX Metal Gear, being a quasi-top-down sorta-stealth game. We say \"sorta\" because the enemies in UnMetal are dumber than a box of particularly uneducated rocks, but that isn't really the point. In fact, playing this thing barely seems to be the point — it's so fragmented in its style that it almost feels like a minigame collection. You jump from cutscene to marginal exploration to adventure game-style item-combinations to more cutscenes to a shoot-out to... well, you get the idea.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/reviews/switch-eshop/unmetal",
          "publishedOn": "2021-10-01T20:00:00.000Z",
          "wordCount": 2189,
          "title": "Review: UnMetal - A Surprisingly Robust Metal Gear Parody Brimming With Ideas"
        },
        {
          "id": "https://www.nintendolife.com/#article-121730",
          "author": null,
          "description": "Peak Sam Lake behaviour, tbh.\nOn the video game developer chart of weird to normal, and serious to goofy, where Hideo Kojima is weird/serious and Rare is normal/goofy, you'll find Remedy creative director Sam Lake firmly in the weird/goofy category.\nHis latest publicity stunt for the release of Alan Wake Remastered is proof of this, as the madman not only jumped into a freezing cold Scandinavian lake (\"Cauldron Lake\", he says) fully clothed, but also drank coffee in it. Sam, why?\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/random-sam-lake-jumped-in-a-lake-to-promote-alan-wake-remastered",
          "publishedOn": "2021-10-01T19:30:00.000Z",
          "wordCount": 1005,
          "title": "Random: Sam Lake Jumped In A Lake To Promote Alan Wake: Remastered"
        },
        {
          "id": "https://www.nintendolife.com/#article-121724",
          "author": null,
          "description": "Hello there again, lovely people!\nYou may remember that back in September 2020 we ran the first Nintendo Life Indie Spotlight, a showcase that highlighted dozens of indie games coming to Switch. Well, it's been a little over a year and we're excited to announce that the second Nintendo Life Indie Spotlight is almost here. Hurrah!\nThe Nintendo Life Indie Spotlight (Oct 2021 Edition) kicks off on Monday 4th October at 12pm PST / 3pm EST / 8pm BST / 9pm CEST / 5am AEST (Tue 5th) and will be streamed via the Nintendo Life YouTube channel. We'll have a blog up on the site too, of course.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/join-us-for-the-nintendo-life-indie-spotlight-returning-on-4th-october",
          "publishedOn": "2021-10-01T19:00:00.000Z",
          "wordCount": 1036,
          "title": "Join Us For The Nintendo Life Indie Spotlight, Returning On 4th October"
        },
        {
          "id": "https://www.nintendolife.com/#article-121728",
          "author": null,
          "description": "Pumpkins galore!\nOctober: it's the best month. It's Halloween, it's the start of Autumn proper, it's the month where we get a new Animal Crossing: New Horizons Direct, and it's my birthday the start of Scorpio season, which is objectively the best star sign.\nAnimal Crossing: New Horizons is a great place to celebrate the season, because it has growable pumpkins, plenty of spooky-themed decor items, and a general cottagecore vibe that players just can't get enough of. Plus, there are new Halloweeny items available today!\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/its-officially-spooky-season-in-animal-crossing-new-horizons",
          "publishedOn": "2021-10-01T18:00:00.000Z",
          "wordCount": 1959,
          "title": "It's Officially Spooky Season In Animal Crossing: New Horizons"
        },
        {
          "id": "https://www.nintendolife.com/#article-121722",
          "author": null,
          "description": "From the team who brought Aviary Attorney to the Switch.\nAlex Young is trapped in a mysterious mansion, with no idea how she got there, or how to get out — and also, everything looks like a PS1 game. If you miss the old-school style of horror games, you'll likely be intrigued by this one, which is filled with puzzles, traps, and secrets to discover as you try to escape the mansion.\n\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/ps1-style-horror-tartarus-key-coming-to-switch-in-2022",
          "publishedOn": "2021-10-01T17:30:00.000Z",
          "wordCount": 1044,
          "title": "PS1-Style Horror Tartarus Key Coming To Switch In 2022"
        },
        {
          "id": "https://www.nintendolife.com/#article-121456",
          "author": null,
          "description": "MetrOLED!\nHang on — where did September go? Yep, that's right, another month has flown by and it's time to get stuck into the really juicy months of the year. Early in October we've got the heavy hitters of a new Metroid game and new Switch hardware, which would be more than enough to keep us occupied in the summer months, but there's a whole lot more to look forward to over the next few months, including new-old Pokémon.\n\nWhere To Pre-Order Nintendo Switch OLED Model\n\nBelow we've listed some of the upcoming highlights of big Switch games scheduled for October and November. Beneath those physical launches you'll also find a selection of other games releasing from September — usually physical versions of previously digital-only Switch eShop games — plus a selection of Switch accessories and related peripherals available in the coming months.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/guides/upcoming-nintendo-switch-games-and-accessories-for-october-and-november-2021",
          "publishedOn": "2021-10-01T17:00:00.000Z",
          "wordCount": 3614,
          "title": "Guide: Upcoming Nintendo Switch Games And Accessories For October And November 2021"
        },
        {
          "id": "https://www.nintendolife.com/#article-121721",
          "author": null,
          "description": "Bag a Super Mushroom Surprise.\n\nToday sees the launch of the latest addition to the LEGO Super Mario set collection in the form of the LEGO Super Mario 64 Question Mark Block.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/deals-get-a-free-gift-from-my-nintendo-store-uk-with-your-lego-super-mario-64-question-block",
          "publishedOn": "2021-10-01T16:30:00.000Z",
          "wordCount": 1002,
          "title": "Deals: Get A Free Gift From My Nintendo Store UK With Your LEGO Super Mario 64 Question Block"
        },
        {
          "id": "https://www.nintendolife.com/#article-121212",
          "author": null,
          "description": "Update: Sale ends this weekend.\nUpdate (Fri 1st October, 2021): As a friendly reminder, Nintendo's 'Blockbuster' sale is coming to an end this weekend. The deals will remain live on the eShop until Sunday 3rd October at 23:59 your local time in Europe, or 23:59 PT in the US. Consider this your final warning, and happy shopping!\n\nOriginal Article: Nintendo has announced a mighty Blockbuster Sale for Nintendo Switch, discounting lots of popular games by as much as 75%.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/nintendo-blockbuster-sale-discounts-hundreds-of-switch-games",
          "publishedOn": "2021-10-01T16:00:00.000Z",
          "wordCount": 4536,
          "title": "Nintendo 'Blockbuster' Sale Discounts Hundreds Of Switch Games"
        },
        {
          "id": "https://www.nintendolife.com/#article-121718",
          "author": null,
          "description": "Now it's a HD blob.\nA Boy and His Blob was a lovely game on Wii, with developer WayForward producing a smart and substantially improved offering on its NES source of inspiration; the game would go on to have HD iterations on other systems.\nNintendo players will finally get to sample the game while it's looking at its high-def best, it seems, with publisher Ziggurat confirming that it's coming to Switch this Fall / Autumn. You can see some PR blurb below.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/a-boy-and-his-blob-is-heading-to-switch-soon",
          "publishedOn": "2021-10-01T15:30:00.000Z",
          "wordCount": 1695,
          "title": "A Boy and His Blob Is Heading To Switch Soon"
        }
      ]
    },
    {
      "title": "Rock Paper Shotgun Latest Articles Feed",
      "feedUrl": "https://www.rockpapershotgun.com/feed",
      "siteUrl": "https://www.rockpapershotgun.com/feed",
      "articles": [
        {
          "id": "https://www.rockpapershotgun.com/the-sunday-papers-613",
          "author": "Ed Thorn",
          "description": "Sundays are for sinking into a scorching hot bath. Before you run the tap, let's read this week's best writing about games.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-sunday-papers-613",
          "publishedOn": "2021-10-03T10:00:00.000Z",
          "wordCount": 1130,
          "title": "The Sunday Papers"
        },
        {
          "id": "https://www.rockpapershotgun.com/madness-project-nexus-revives-a-newgrounds-classic",
          "author": "Graham Smith",
          "description": "Madness: Project Nexus will stir nostalgia for people who used to play browser games via Newgrounds. It's a fully 3D entry in the Madness Combat series of Flash animations which began in 2002, and named after the Flash game released in 2012.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/madness-project-nexus-revives-a-newgrounds-classic",
          "publishedOn": "2021-10-02T22:44:41.000Z",
          "wordCount": 723,
          "title": "Madness: Project Nexus revives a Newgrounds classic"
        },
        {
          "id": "https://www.rockpapershotgun.com/choo-choo-charles-is-survival-horror-with-a-hungry-spider-legged-train",
          "author": "Graham Smith",
          "description": "People have been adding a seemingly-possessed Thomas The Tank Engine to games via mods for years, from Skyrim back in 2013 to the Resident Evil 2 remake more recently.\r\n\nChoo-Choo Charles turns a pursuing locomotive into an entire open-world horror game. Also the train has spider legs. Find the trailer below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/choo-choo-charles-is-survival-horror-with-a-hungry-spider-legged-train",
          "publishedOn": "2021-10-02T22:01:33.000Z",
          "wordCount": 706,
          "title": "Choo-Choo Charles is survival horror with a hungry spider-legged train"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-will-disable-character-creation-on-full-servers",
          "author": "Graham Smith",
          "description": "New World has implemented a system to stop players from creating characters on \"full\" servers. Announced today via Twitter, the system is part of Amazon's ongoing efforts to deal with overwhelming demand from folks wanting to play the new MMO.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-will-disable-character-creation-on-full-servers",
          "publishedOn": "2021-10-02T21:39:11.000Z",
          "wordCount": 687,
          "title": "New World will disable character creation on full servers"
        },
        {
          "id": "https://www.rockpapershotgun.com/paradox-have-cancelled-several-unannounced-games",
          "author": "Graham Smith",
          "description": "Like a king cutting down lesser heirs, Paradox Interactive have cancelled \"several unannounced games\". The company say they want to focus on \"proven game niches and projects that better meet the company's requirements on return and risk.\" By which they mean they'll be focusing on strategy and management games.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/paradox-have-cancelled-several-unannounced-games",
          "publishedOn": "2021-10-02T21:02:04.000Z",
          "wordCount": 754,
          "title": "Paradox have cancelled several unannounced games"
        },
        {
          "id": "https://www.rockpapershotgun.com/konami-will-revive-metal-gear-solid-and-silent-hill-rumours-say",
          "author": "Graham Smith",
          "description": "New reports citing anonymous sources say that Konami are going to return to development of major games, with both new instalments and remakes planned for Metal Gear Solid, Castlevania, and Silent Hill. As first reported by VGC, many of these games would be developed by external studios.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/konami-will-revive-metal-gear-solid-and-silent-hill-rumours-say",
          "publishedOn": "2021-10-02T20:17:13.000Z",
          "wordCount": 753,
          "title": "Konami will revive Metal Gear Solid and Silent Hill, rumours say"
        },
        {
          "id": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-164",
          "author": "Alice Bell",
          "description": "Happy Bandcamp Friday, a thing I didn't know existed until two weeks ago when Alice0 mentioned it. But it sounds good! Celebrate by buying music from small artists, even if that music isn't anything to do with video games. Am I allowed to promote non-game things? Hmm. Not sure. We'll see if a gaming sniper (no-scope, natch) has taken me out by the end of this post or not. In the meantime, here are the games we're playing this weekend!\nRead more",
          "link": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-164",
          "publishedOn": "2021-10-02T08:00:00.000Z",
          "wordCount": 1097,
          "title": "What are we all playing this weekend?"
        },
        {
          "id": "https://www.rockpapershotgun.com/capcom-want-pc-to-be-their-main-platform-and-make-up-50-of-sales",
          "author": "Lauren Morton",
          "description": "There's no shortage of developers reafirming a love for PC as a platform lately. Sega want to do more PC ports. Atari have restructured and shifted focus to consoles and PC. Capcom too, are now saying that they want PC to be their main platform with an equal share of their game sales within the next two years. Hey, maybe the next Monster Hunter game could get a simultaneous launch. That'd be a dream.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/capcom-want-pc-to-be-their-main-platform-and-make-up-50-of-sales",
          "publishedOn": "2021-10-01T23:15:38.000Z",
          "wordCount": 740,
          "title": "Capcom want PC to be their main platform and make up 50% of sales"
        },
        {
          "id": "https://www.rockpapershotgun.com/ridiculously-bloody-gungrave-gore-has-called-in-ikumi-nakamura",
          "author": "Lauren Morton",
          "description": "A bloody new Gungrave game is on the way, including a launch on PC, and that's not all that developers Studio Iggymob are adding to the series with Gungrave G.O.R.E. Yasuhiro Nightow, creator of Gungrave's antihero Grave and the Trigun manga, is joined by former Ghostwire: Tokyo game director Ikumi Nakamura. Along with a new cinematic and gameplay trailer, Studio Iggymob are touting Nakamura's involvement in the game, saying that she's been heavily involved in bringing \"her own unique style\" to the next Gungrave game. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/ridiculously-bloody-gungrave-gore-has-called-in-ikumi-nakamura",
          "publishedOn": "2021-10-01T21:41:33.000Z",
          "wordCount": 822,
          "title": "Ridiculously bloody Gungrave G.O.R.E. has called in Ikumi Nakamura"
        },
        {
          "id": "https://www.rockpapershotgun.com/bloober-team-are-teasing-a-return-to-the-layers-of-fear-series",
          "author": "Lauren Morton",
          "description": "October's here, so it's time to start putting on a few extra layers. Of clothes, sure, but maybe some extra layers of spooks too. Layers Of Fear developers Bloober Team have just released a new trailer teasing a return to their series about creatives types in frightening locales. The next of the series, from the looks of it, might be headed back to the drawing board—or the canvas perhaps—with another story about a painter.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/bloober-team-are-teasing-a-return-to-the-layers-of-fear-series",
          "publishedOn": "2021-10-01T20:12:39.000Z",
          "wordCount": 792,
          "title": "Bloober Team are teasing a return to the Layers Of Fear series"
        },
        {
          "id": "https://www.rockpapershotgun.com/steams-digital-tabletop-fest-is-focusing-on-rpgs-this-month",
          "author": "Lauren Morton",
          "description": "October is shaping up to be a busy month on Steam. Earlier today the latest game demos event kicked off (here are the 13 best Steam Festival Demos) and later this month they'll be running another Digital Tabletop Festival. Like last year, it's a sale and livestream celebration of games inspired by and adapted from board games. This year the event will lean into RPGs, including a chat with the folks behind both Disco Elysium and Baldur's Gate 3 when it kicks off later this month.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/steams-digital-tabletop-fest-is-focusing-on-rpgs-this-month",
          "publishedOn": "2021-10-01T18:48:37.000Z",
          "wordCount": 781,
          "title": "Steam's Digital Tabletop Fest is focusing on RPGs this month"
        },
        {
          "id": "https://www.rockpapershotgun.com/steam-next-fest-october-2021-best-demos",
          "author": "Katharine Castle",
          "description": "Indie extravaganza Steam Next Fest is back for another edition today, showering us with hundreds of upcoming game demos to try over the next week. Running from today, October 1st, until Thursday October 7th, the latest Steam Next Fest is positively packed to the rafters with things to play, and we've picked out some personal highlights to help you get started. \nRead more",
          "link": "https://www.rockpapershotgun.com/steam-next-fest-october-2021-best-demos",
          "publishedOn": "2021-10-01T17:00:00.000Z",
          "wordCount": 2514,
          "title": "The 13 best Steam Next Fest demos you should play this October"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-game-awards-will-be-back-in-person-this-year-on-december-9th",
          "author": "Lauren Morton",
          "description": "Summer's in the bin, which means it's time to stop looking back at those E3 showcases and start thinking about the end of year shows. The Game Awards, the December-ly bonanza of world premieres interspersed with the occasional trophy, is back on again. After going online in December 2020 due to the Covid-19 pandemic, show host Geoff Keighley is getting the band back together on stage this year for an in person show that's been scheduled for December 9th.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-game-awards-will-be-back-in-person-this-year-on-december-9th",
          "publishedOn": "2021-10-01T16:40:21.000Z",
          "wordCount": 759,
          "title": "The Game Awards will be back in person this year on December 9th"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-briar-branches",
          "author": "Rebecca Jones",
          "description": "Where can you find Briar Branches in New World? Harvesting from Briar bushes in New World can yield a number of different resources including Briar Branches, which are needed to complete the Windsward quest A Prickly Request. But with so much greenery around the isle of Aeternum, sticking your face into every shrub to see if it's the one you're looking for is a time-consuming prospect. On this page, we save you (at least some of) the trouble by explaining where you can find Briars in New World.\n Read more",
          "link": "https://www.rockpapershotgun.com/new-world-briar-branches",
          "publishedOn": "2021-10-01T15:44:14.000Z",
          "wordCount": 903,
          "title": "New World Briar Branches locations: how to get Briars in New World"
        },
        {
          "id": "https://www.rockpapershotgun.com/bonfire-peaks-impressions",
          "author": "Alice Bell",
          "description": "Puzzle game Bonfire Peaks is probably a metaphor about emotional baggage and closure. But I know writers who use subtext and they're all cowards. Published by Draknek (wot did the equally puzzly A Monster's Expedition), Corey Martin's new voxel Sokoban-style game features a man slowly making his way up a mountain and totemically burning all of his stuff. Secretly, though, it is a story about a man who has the only superpower people in their 30s actually want: being able to pick up and move any number of boxes at any time.\nRead more",
          "link": "https://www.rockpapershotgun.com/bonfire-peaks-impressions",
          "publishedOn": "2021-10-01T15:31:45.000Z",
          "wordCount": 1142,
          "title": "Bonfire Peaks' puzzle man would be a great (and terrible) presence in a house move"
        },
        {
          "id": "https://www.rockpapershotgun.com/our-video-game-music-recommendations-for-bandcamp-friday",
          "author": "Alice O'Connor",
          "description": "Today is another Bandcamp Friday, when the splendid DRM-free music shop waive their cut of sales to give artists more money. It's a good time to buy music from a good place but a bit overwhelming when the store is so big. Last month, I had some slightly esoteric game music recommendations of my own. This month, I've had everyone in the RPS treehouse recommend a huge spread of video game soundtracks and music on Bandcamp, from Paradise Killer to Skyrim covers. Come, see what we're hearing!\nRead more",
          "link": "https://www.rockpapershotgun.com/our-video-game-music-recommendations-for-bandcamp-friday",
          "publishedOn": "2021-10-01T15:27:36.000Z",
          "wordCount": 2736,
          "title": "Our video game music recommendations for Bandcamp Friday"
        },
        {
          "id": "https://www.rockpapershotgun.com/this-free-unreal-engine-5-tech-demo-has-me-salivating-over-the-future-of-next-gen-food",
          "author": "Katharine Castle",
          "description": "When Epic unveiled their first Unreal Engine 5 tech demo last year, its ultra-realistic geometry systems and dynamic lighting effects looked impressive and all, but the resulting Tomb Raider-esque sequence left me feeling a little cold. To my eyes, Epic's tech demo didn't really look that much different to what games look like now. \nAfter playing a new UE5 tech demo from Japanese studio Historia, however, I am fully converted to the merits of Epic's new game engine. At 20GB-odd, The Market Of Light is a hefty download for its 15-20 run-time, but this freeform exploration game is absolutely worth a look if your PC meets its surprisingly reasonable tech requirements - especially if you're a fan of games that feature cooking. Seriously, Epic's Tomb Raider lady can get stuffed. For me, Unreal Engine 5 is all about delicious-looking next-gen food.  \nRead more",
          "link": "https://www.rockpapershotgun.com/this-free-unreal-engine-5-tech-demo-has-me-salivating-over-the-future-of-next-gen-food",
          "publishedOn": "2021-10-01T15:15:30.000Z",
          "wordCount": 794,
          "title": "This free Unreal Engine 5 tech demo has me salivating over the future of next-gen food"
        },
        {
          "id": "https://www.rockpapershotgun.com/ultimate-audio-bang-15-1-v-1-me-on-trivia",
          "author": "Ed Thorn",
          "description": "This week's episode of the Ultimate Audio Bang is marked by competition. Imogen and I quiz each other on all things shooter trivia, and someone knows more than the other. Anyway, before that, there's plenty of news to catch up on. Call Of Duty: Vanguard has fixed a weird dognado glitch, time-loopy shooter Lemnis Gate is out, Halo: Infinite tech preview number two arrives very soon, and Overwatch 2 announces some reworks. Spoiler alert: Bastion now has a hat.\nRead more",
          "link": "https://www.rockpapershotgun.com/ultimate-audio-bang-15-1-v-1-me-on-trivia",
          "publishedOn": "2021-10-01T15:00:00.000Z",
          "wordCount": 827,
          "title": "UItimate Audio Bang #15: 1v1 me on shooter trivia"
        },
        {
          "id": "https://www.rockpapershotgun.com/forza-horizon-5-pc-specs",
          "author": "James Archer",
          "description": "The Forza Horizon 5 PC system requirements are out in full, and hoo boy, are you gonna need the best graphics cards to max it out. Revealed in a blog post, the new specs both update the previously listed Minimum requirements on Steam, and include an “Ideal” tier on top of the Recommended requirements. This doesn’t specify a particular resolution, but does ask for either an Nvidia GeForce RTX 3080 or AMD Radeon Radeon RX 6800 XT as the GPU – two of the most powerful, expensive, difficult to buy graphics cards on the market.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/forza-horizon-5-pc-specs",
          "publishedOn": "2021-10-01T14:12:53.000Z",
          "wordCount": 1128,
          "title": "The Forza Horizon 5 PC specs are pretty steep, huh"
        },
        {
          "id": "https://www.rockpapershotgun.com/svoboda-1945-liberation-is-all-the-better-for-its-absence-of-drama",
          "author": "Sin Vega",
          "description": "I accepted long ago that If the yoof ever do the right thing, I'll probably be dragged out into the street and shot along with all the other old bastards, despite hating them just as much.\r\n\n\r\nThat's sort of what Svoboda 1945 Colon Liberation is about. Dynamics like that happen, especially as fascists and collaborators lie and deny everything, so there'll always be collateral in the wake of revenge on a large enough scale.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/svoboda-1945-liberation-is-all-the-better-for-its-absence-of-drama",
          "publishedOn": "2021-10-01T14:00:00.000Z",
          "wordCount": 642,
          "title": "Svoboda 1945: Liberation is all the better for its absence of drama"
        },
        {
          "id": "https://www.rockpapershotgun.com/strange-horticulture-preview-running-an-eldritch-plant-shop-is-everything-i-want-in-life",
          "author": "Alice Bell",
          "description": "I immediately fell in love with Strange Horticulture when I played the demo, and now I've had a few hours with a longer, more polished preview build I am even more in loverer. I do not understand why this is not everyone's most anticipated game ever. Imagine if all the horrible shouting griefers playing war games put down their weapons and picked up a strange plant and a taxonomic tome. What a world that would be! Certainly a world with more plant shops, anyway, though probably not (m)any as strange as Strange Horticulture.\nYou inherit this shop, along with its secrets, a folding map of the area to go exploring, and shelves of odd plant specimins. Sometimes it is raining. It is a real October vibe. There is a strange mystery, involving cultist and murder - a stranger in a beautiful jade mask comes to the shop, sometimes, as well as the detective struggling to solve a number of troubling murders in the area. But what care I for that? I am deep role-playing as a horticulturist. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/strange-horticulture-preview-running-an-eldritch-plant-shop-is-everything-i-want-in-life",
          "publishedOn": "2021-10-01T13:30:00.000Z",
          "wordCount": 1364,
          "title": "Running an eldritch plant shop in Strange Horticulture is everything I want in life"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-unstuck",
          "author": "Ollie Toms",
          "description": "Desperate to find out how to get unstuck in New World? It's always a good thing when developers add an \"unstuck\" feature into their game - particularly a sprawling MMORPG like New World where getting your character stuck in bits of landscape is more common than you might think. Fortunately, it is possible to get unstuck in New World, and this quick walkthrough will explain how to do it.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-unstuck",
          "publishedOn": "2021-10-01T12:30:00.000Z",
          "wordCount": 976,
          "title": "How to get unstuck in New World"
        },
        {
          "id": "https://www.rockpapershotgun.com/mystery-steam-reviews-055-video-games-spinoffs",
          "author": "Colm Ahern",
          "description": "Spin-offs are dead handy. You take an established character that's already known, stick them in a new environment full of fresh characters, and you've got yourself a Frasier. Bingo bango, job's a goodun. It's a format that's done the business in television, so no wonder video games have followed suit.\r\n  \nRead more",
          "link": "https://www.rockpapershotgun.com/mystery-steam-reviews-055-video-games-spinoffs",
          "publishedOn": "2021-10-01T12:30:00.000Z",
          "wordCount": 904,
          "title": "This week's Mystery Steam Reviews is a sidequel"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-transfer-character",
          "author": "Ollie Toms",
          "description": "Wondering how to transfer your character to a different server in New World? Amazon's titanic MMORPG New World is full to bursting with players across its various servers and realms, but as with all such games, some servers are going to be more preferable to certain players than others. Whether it's about dodging long wait times and lag, or just joining the same realm as your friends, most players want to know sooner or later about character transfers and how they work.\nRead on to find out how and when you can transfer your character over to another server in New World.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-transfer-character",
          "publishedOn": "2021-10-01T12:05:56.000Z",
          "wordCount": 954,
          "title": "How to transfer your character in New World"
        },
        {
          "id": "https://www.rockpapershotgun.com/square-enix-announce-dungeon-encounters-led-by-ff6-director",
          "author": "Alice O'Connor",
          "description": "Square Enix today announced new game Dungeon Encounters, and surprise, it's launching in only a fortnight.\r\nThe dungeon crawler is directed by Hiroyuki Ito, who directed Final Fantasy VI, IX, and XII, as well as creating the Active Time Battle system. Some other FF veterans are onboard too. But more important than all that is: along with all manner of warriors, possible party members include a giant cat named Sir Cat, a dog holding a sword in its mouth, and a hamster. Yes, thanks.\nRead more",
          "link": "https://www.rockpapershotgun.com/square-enix-announce-dungeon-encounters-led-by-ff6-director",
          "publishedOn": "2021-10-01T12:01:43.000Z",
          "wordCount": 757,
          "title": "Square Enix announce Dungeon Encounters, led by FF6 director"
        },
        {
          "id": "https://www.rockpapershotgun.com/dream-cycle-is-a-strange-blend-of-skyrim-and-dishonored-with-big-potential",
          "author": "Ed Thorn",
          "description": "Action adventure Dream Cycle certainly feels like an early access game. Animations are stiff, the audio mix is a bit funky, and it doesn't really have a save system yet. But look past the jank and I reckon there's a bright future ahead of Cathuria Games' latest. The studio was set up by Toby Gard, one of the folks who helped create Lara Croft, the tomb-raiding OG, so there's adventure pedigree at the helm, even if Dream Cycle bears no real resemblance to Tomb Raider. However, if you're into Skyrim and Dishonored, I'd definitely urge you to keep an eye on its progress.\nRead more",
          "link": "https://www.rockpapershotgun.com/dream-cycle-is-a-strange-blend-of-skyrim-and-dishonored-with-big-potential",
          "publishedOn": "2021-10-01T12:00:00.000Z",
          "wordCount": 1252,
          "title": "Dream Cycle is a strange blend of Skyrim and Dishonored with big potential"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-name-change",
          "author": "Ollie Toms",
          "description": "Want to know if you can change your name in New World? It's a common tale of woe among MMO players: your ideal name is already taken, so you have to settle for an inferior moniker. Then later you realise that it just doesn't sit right and you need a name name to strike fear into the hearts of your enemies. But can it be done? Find out whether you can rename your character in New World below.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-name-change",
          "publishedOn": "2021-10-01T11:41:55.000Z",
          "wordCount": 941,
          "title": "Can you change your name in New World?"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-afk-timer",
          "author": "Rebecca Jones",
          "description": "How long is New World's AFK timer? Amazon's gigantic new MMO New World has had quite a launch week — with players reporting hours-long queue times before they can even set foot on the island of Aeternum — and we've not even had the first weekend yet. Amazon have promised more and bigger servers to handle the demand, which they say will begin rolling out within the next two weeks.\n Read more",
          "link": "https://www.rockpapershotgun.com/new-world-afk-timer",
          "publishedOn": "2021-10-01T11:30:23.000Z",
          "wordCount": 975,
          "title": "New World AFK timer: how long can you remain inactive before getting kicked?"
        },
        {
          "id": "https://www.rockpapershotgun.com/stranger-of-paradise-final-fantasy-origin-is-coming-march-18th",
          "author": "Alice O'Connor",
          "description": "Square Enix today announced a release date of March 18th, 2022 for Stranger Of Paradise Final Fantasy Origin, the curious action-RPG spin-off made by the studio behind Nioh, Team Ninja. A new trailer is here too and I have to say it looks more Final Fantasy-y and less less ha-ha-hilariously edgy than June's announcement trailer. It still looks plenty edgy, mind: watch out for the poor wee cactrot which gets... turned into a blood crystal and exploded?\nRead more",
          "link": "https://www.rockpapershotgun.com/stranger-of-paradise-final-fantasy-origin-is-coming-march-18th",
          "publishedOn": "2021-10-01T11:20:46.000Z",
          "wordCount": 745,
          "title": "Stranger Of Paradise Final Fantasy Origin is coming March 18th"
        },
        {
          "id": "https://www.rockpapershotgun.com/destiny-2-will-add-full-auto-as-an-accessibility-option",
          "author": "Alice O'Connor",
          "description": "To fire some of Destiny 2's guns at their fastest possible rate, you need to click six times per second. This sucks. This especially sucks if you have physical issues which impede rapid clicking. Honestly, with these semi-auto weapon archetypes I've often looked for rolls with the Full Auto Trigger System perk to spare my hands. So it's grand to hear from Bungie's new accessibility initiative that yep, they're planning to add some sort of accessibility option enabling automatic fire. In some way.\nRead more",
          "link": "https://www.rockpapershotgun.com/destiny-2-will-add-full-auto-as-an-accessibility-option",
          "publishedOn": "2021-10-01T10:43:34.000Z",
          "wordCount": 1143,
          "title": "Destiny 2 will add full-auto as an accessibility option"
        },
        {
          "id": "https://www.rockpapershotgun.com/genshin-impact-house-serenitea-pot",
          "author": "Amelia Zollner",
          "description": "Wondering how to get a house in Genshin Impact? Genshin Impact’s Serenitea Pot system grants you the ability to decorate your own realm with characters, furniture, plants, rocks, and even pets. Some players have carefully crafted gardens with elegantly decorated houses. Other players have simply used their teapots to trap Venti in an empty room filled with animals — whatever you want to do with your house, we can’t judge.\nWhether you haven’t unlocked the housing system yet or you’re looking for ways to improve your Serenitea Pot, this guide will show you everything you need, including unlocking housing, placing characters, choosing a layout, getting furniture, and increasing your Trust Rank and Adeptal Energy. \nRead more",
          "link": "https://www.rockpapershotgun.com/genshin-impact-house-serenitea-pot",
          "publishedOn": "2021-10-01T09:57:01.000Z",
          "wordCount": 2440,
          "title": "How to get a house in Genshin Impact: Serenitea Pot system explained"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-10-best-songs-in-pc-games",
          "author": "Brendan Caldwell",
          "description": "Not just the best songs. These are the best songs performed by characters in-game. In other words, if it's not sung by a fictional band, hollered by a karaoke-obsessed protagonist, or purred by a honey-tongued vocalist who also shoots at you with a ridiculous firearm, then it doesn't count. For this reason, in-game radios are also out. It's too easy, video games. Sorry. That means no rock station classics from Grand Theft Auto and no 80s bangers from Metal Gear Solid V. Learn to accept it. The best music is diegetic, baby. \nRead more",
          "link": "https://www.rockpapershotgun.com/the-10-best-songs-in-pc-games",
          "publishedOn": "2021-10-01T09:30:00.000Z",
          "wordCount": 1618,
          "title": "The 10 best songs in PC games"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-save-progress",
          "author": "Hayden Hefford",
          "description": "Want to know how to save in New World? MMOs can be complicated beasts, and you could easily spend hours just mining iron or strolling along the shores of Aeternum in New World. The last thing you’d want is that time to be wasted by failing to save your game.\nThis guide will tell you how to save your game in New World, so that you don’t need to feel unsure about whether all your progress will be waiting for you next time you log on.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-save-progress",
          "publishedOn": "2021-10-01T08:49:45.000Z",
          "wordCount": 860,
          "title": "How to save your progress in New World"
        },
        {
          "id": "https://www.rockpapershotgun.com/impostor-factory-aka-to-the-moon-3-is-out-now",
          "author": "Graham Smith",
          "description": "Impostor Factory has been described repeatedly by developer Kan Gao as \"To The Moon 3(?)\", complete with paranthetical question mark. Whatever the reality in terms of its plot, it definitely forms a trio in terms of theme and tone, closing out the series with another melancholy, pixelated adventure. It's out now.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/impostor-factory-aka-to-the-moon-3-is-out-now",
          "publishedOn": "2021-09-30T22:46:42.000Z",
          "wordCount": 742,
          "title": "Impostor Factory (aka To The Moon 3) is out now"
        },
        {
          "id": "https://www.rockpapershotgun.com/a-lot-of-you-are-petting-the-pets-in-crusader-kings-3",
          "author": "Graham Smith",
          "description": "1240 Pepsi Max cans quaffed. 30 Toffee Crisps swallowed. 600 sneezes sneezed. These are the stats of my past year. Crusader Kings 3's past year offers bigger numbers.\r\n\nTo celebrate the kingdom sim's first year of release, Paradox have put out a set of in-game stats, which includes: 18 million marriages, 334 million children, and \"4 million pets petted.\"\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/a-lot-of-you-are-petting-the-pets-in-crusader-kings-3",
          "publishedOn": "2021-09-30T22:01:17.000Z",
          "wordCount": 747,
          "title": "A lot of you are petting the pets in Crusader Kings 3"
        },
        {
          "id": "https://www.rockpapershotgun.com/monster-hunter-rise-will-launch-on-pc-january-12-with-a-demo-due-next-month",
          "author": "Graham Smith",
          "description": "Monster Hunter Rise is the sixth mainline game in Capcom's series about biffing majestic beasts and turning them into fetching headgear. It released on Switch earlier this year, and we've known all along that it was coming to PC eventually. Now it has a specific release date: January 12th, 2022.\r\n\nBetter yet, it's getting a demo, and it'll be available on October 13th.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/monster-hunter-rise-will-launch-on-pc-january-12-with-a-demo-due-next-month",
          "publishedOn": "2021-09-30T21:28:45.000Z",
          "wordCount": 765,
          "title": "Monster Hunter Rise will launch on PC January 12, with a demo due next month"
        },
        {
          "id": "https://www.rockpapershotgun.com/efootball-2022-is-now-the-worst-rated-game-on-steam",
          "author": "Graham Smith",
          "description": "eFootball 2022 is now the worst rated game on Steam, less than a day after release. Konami's free-to-play 'football platform' was announced earlier this year as the successor to PES, with a barebones launch planned to be expanded in perpetuity with optional DLC. Yet even accepting its relatively thin amount of content, players are sharing screenshots of terrible faces, broken animations, and plenty of bugs.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/efootball-2022-is-now-the-worst-rated-game-on-steam",
          "publishedOn": "2021-09-30T20:52:47.000Z",
          "wordCount": 867,
          "title": "eFootball 2022 is now the worst rated game on Steam"
        },
        {
          "id": "https://www.rockpapershotgun.com/humbles-square-enix-sale-offers-up-to-85-off-nier-final-fantasy-and-more",
          "author": "Will Judd",
          "description": "Square Enix, or Sqix to its close friends, is having a bloody great sale over at the Humble store. The discounts are up to 85% off, and include the likes of Nier, Final Fantasy, Dragon Quest and more. \nRead more",
          "link": "https://www.rockpapershotgun.com/humbles-square-enix-sale-offers-up-to-85-off-nier-final-fantasy-and-more",
          "publishedOn": "2021-09-30T20:49:27.000Z",
          "wordCount": 823,
          "title": "Humble's Square Enix sale offers up to 85% off Nier, Final Fantasy and more"
        },
        {
          "id": "https://www.rockpapershotgun.com/this-1tb-samsung-ssd-is-82-at-ebuyer-with-far-cry-6-free",
          "author": "Will Judd",
          "description": "The Samsung 870 Qvo is our pick for 'the best big SATA SSD for gaming', as it's a reasonably fast SATA SSD that is also much cheaper than its competitors. Today, it's retailing for just £82 at CCL, who are also offering a free copy of Far Cry 6 (a £50 value) with the drive. I reckon that's a strong offer, but let me tell you more about the 870 Qvo!\nRead more",
          "link": "https://www.rockpapershotgun.com/this-1tb-samsung-ssd-is-82-at-ebuyer-with-far-cry-6-free",
          "publishedOn": "2021-09-30T20:27:11.000Z",
          "wordCount": 864,
          "title": "This 1TB Samsung SSD is £82 at Ebuyer with Far Cry 6 free"
        },
        {
          "id": "https://www.rockpapershotgun.com/europa-universalis-iv-is-free-to-keep-on-epic-right-now",
          "author": "Alice O'Connor",
          "description": "Tick tock it's free game o'clock, with Paradox's Europa Universalis IV now becoming the latest freebie on the Epic Games Store for the next week. The historical grand strategy game puts you in charge of a nation from the middle ages through to early modernity, charting a course through countless economic, political, military, and religious crises. EU4 is eight years old but still a good'un, and Paradox are still updating it with expansions and patches.\nRead more",
          "link": "https://www.rockpapershotgun.com/europa-universalis-iv-is-free-to-keep-on-epic-right-now",
          "publishedOn": "2021-09-30T16:04:34.000Z",
          "wordCount": 745,
          "title": "Europa Universalis IV is free to keep on Epic right now"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-twitch-drops",
          "author": "Rebecca Jones",
          "description": "How do you claim Twitch Drops in New World, and can you still claim the Golden Rage armor? Twitch is an Amazon-owned platform and New World is a game developed by Amazon, so it's absolutely unsurprising that there's some crossover in the form of New World Twitch Drops.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-twitch-drops",
          "publishedOn": "2021-09-30T15:47:12.000Z",
          "wordCount": 1405,
          "title": "New World Twitch Drops: can you still claim the Golden Rage armor?"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-electronic-wireless-show-podcast-episode-158-the-best-spaceships-in-games-special",
          "author": "Alice Bell",
          "description": "In honour of the new DLC for Outer Wilds, this week on The Electronic Wireless Show Podcast we're discussing our favourite spaceships in games. In the process, while we do discuss some games, there is quite a lot of chat about the origin of the spaceship as 'space-house' - the hub area where all your pals hang out - both in games and in wider space media. Also, Nate has a great Cavern Of Lies that is Star Wars themed, and does indeed give us a terrible fright.\nDigressions this week are a big discussion on Matthew's tooth situation, and a semi-argument about what planetary circumstances would be enough for me to agree to go into space (e.g. planet covered in really nice soup). Also: is Elon Musk's divorce the origin story for Warhammer 40k?\nRead more",
          "link": "https://www.rockpapershotgun.com/the-electronic-wireless-show-podcast-episode-158-the-best-spaceships-in-games-special",
          "publishedOn": "2021-09-30T15:12:42.000Z",
          "wordCount": 844,
          "title": "EWS podcast episode 158: the best spaceships special"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-iron-fae-iron",
          "author": "Hayden Hefford",
          "description": "Want to know how to get iron ore in New World? Crafting is very important in New World, as it is in most MMOs. If you want to make new weapons or armour for your character, you’ll probably end up needing some iron ore pretty soon.\nThis guide will walk you through everything that you need to know about Iron in New World, including how to get iron ore and what you can use iron ore to make.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-iron-fae-iron",
          "publishedOn": "2021-09-30T15:03:59.000Z",
          "wordCount": 1148,
          "title": "How to get Iron and Fae Iron in New World"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-new-world-armor",
          "author": "Rebecca Jones",
          "description": "What is the best armor in New World, and how do you craft it? New World is a game all about war and conquest, so naturally armor plays a large role and should be one of your first considerations when choosing your character's loadout. Fortunately, armor is abundant on Aeternum. Unfortunately, that can make it very difficult to decide what pieces to equip, especially as the game doesn't waste a lot of time explaining it to you. But luckily, that's what this New World armor guide is for.\nRead more",
          "link": "https://www.rockpapershotgun.com/best-new-world-armor",
          "publishedOn": "2021-09-30T14:40:56.000Z",
          "wordCount": 1322,
          "title": "Best New World armor: New World's armor types explained"
        },
        {
          "id": "https://www.rockpapershotgun.com/twitch-fights-hate-raids-with-options-to-require-phone-verification-for-chat",
          "author": "Alice O'Connor",
          "description": "Twitch yesterday launched new moderation options which let hosts restrict chat to people who have verified their account by tying it to a phone number, hopefully helping fight the plague of 'hate raids'. Frustrations with the livestreaming platform's ineffectual response to harrassment recently came to a head with the #ADayOffTwitch campaign, when many streamers and viewers skipped Twitch for one day. The new (optional) options are fairly nuanced, and should help channels control marauding hordes of bots and dickheads without keeping chat fully locked down.\nRead more",
          "link": "https://www.rockpapershotgun.com/twitch-fights-hate-raids-with-options-to-require-phone-verification-for-chat",
          "publishedOn": "2021-09-30T14:06:09.000Z",
          "wordCount": 1146,
          "title": "Twitch fights 'hate raids' with options to require phone verification for chat"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-eternal-cylinder-review",
          "author": "Jim Rossignol",
          "description": "Deep in the endless sediment of the ancient, fossilised internet, it is possible to find signs of an interview in which I spoke to ACE Team about their weird beat ‘em up sequel, Zeno Clash 2. Company founder Carlos Bordeu finished up that interview by saying: “aesthetic choices have been intentionally made to make our game stand out from the mass of traditional fantasy games that continue to mimic each other”. I feel that it’s probably fair to say that these choices have continued to be made almost a decade later, with Bordeu now the game director of The Eternal Cylinder, a game about a giant cylinder.\r\n\n\r\nBut is it really about a giant cylinder? And what do such esoteric choices add up to in this latest Ace Team venture into the unfamiliar? Let’s find out.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-eternal-cylinder-review",
          "publishedOn": "2021-09-30T14:00:00.000Z",
          "wordCount": 2085,
          "title": "The Eternal Cylinder review: an outlandish, delightful, and surprisingly approachable survival adventure"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-top-10-games-on-pc-in-october-2021",
          "author": "Colm Ahern",
          "description": "After a few lean months over the last year, we’re really in it now. So, I hope you’ve done all your book-reading, TV-watching, and music-listening, because the next four weeks is just wall-to-wall video games. \nRead more",
          "link": "https://www.rockpapershotgun.com/the-top-10-games-on-pc-in-october-2021",
          "publishedOn": "2021-09-30T13:30:00.000Z",
          "wordCount": 2403,
          "title": "The top 10 games on PC in October"
        },
        {
          "id": "https://www.rockpapershotgun.com/here-are-some-tokyo-game-show-schedule-highlights-for-this-week",
          "author": "Imogen Beckhelling",
          "description": "The Tokyo Game Show 2021 has begun, and from today it'll have a bunch of announceathons from the likes of Square Enix, Capcom, Ubisoft and more stretching over the weekend. Like most other games events this year, TGS is a digital affair, streaming good game stuff to your screens via YouTube and Twitch. There's a heck of a lot on too, so I've had a look through the official programs and gathered some highlights right here. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/here-are-some-tokyo-game-show-schedule-highlights-for-this-week",
          "publishedOn": "2021-09-30T13:15:47.000Z",
          "wordCount": 1047,
          "title": "Here are some Tokyo Game Show schedule highlights for this week"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-to-install-a-cpu",
          "author": "James Archer",
          "description": "With Intel’s Alder Lake chips breathing down our necks (or are already here, if you’re reading this in 2022 or whatever), now seems like an opportune time for a refresher on how to install a CPU. And yes, AMD, you can come too.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/how-to-install-a-cpu",
          "publishedOn": "2021-09-30T13:07:05.000Z",
          "wordCount": 1756,
          "title": "How to install a CPU"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-turkeys",
          "author": "Hayden Hefford",
          "description": "Want to find Turkey locations in New World? Turkeys roam the world of Aeternum, gobbling as they trot around various areas. Though they are rather cute to watch, Turkeys are the main way to get feathers, poultry, and eggs in New World, making them quite important.\nThis guide will walk you through everything that you need to find and skin Turkeys in New World, so that you can save time searching for them and get on with completing quests for your faction.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-turkeys",
          "publishedOn": "2021-09-30T11:33:00.000Z",
          "wordCount": 1101,
          "title": "How to find Turkey locations and get Feathers in New World"
        },
        {
          "id": "https://www.rockpapershotgun.com/while-you-queued-new-world-players-were-being-absolute-weirdos",
          "author": "Imogen Beckhelling",
          "description": "New World is out, and that's exciting. It's been ages since we've seen a big new MMORPG, which is possibly why thousands upon thousands of you have sat in endless queues trying to get into overloaded servers. But would you like to know what players have been doing while you waited? They've been wiggling around on the floor like budget Human Centipedes.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/while-you-queued-new-world-players-were-being-absolute-weirdos",
          "publishedOn": "2021-09-30T10:19:05.000Z",
          "wordCount": 918,
          "title": "While you queued, New World players were being absolute weirdos"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-opens-more-servers-planning-to-enlarge-servers-too",
          "author": "Alice O'Connor",
          "description": "Amazon's sandbox MMO New World instantly become one of the most-played games on Steam when it launched this week (briefly the most), and some of those 700,000 'players' even made it through the server queues to actually play. The devs have been scrambling to meet demand ever since and continue to open new servers, in the past 24 hours opening over 100 new New World worlds. They're also exploring the possibility of increasing the capacity of individual servers.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-opens-more-servers-planning-to-enlarge-servers-too",
          "publishedOn": "2021-09-30T09:31:19.000Z",
          "wordCount": 828,
          "title": "New World opens more servers, planning to enlarge servers too"
        },
        {
          "id": "https://www.rockpapershotgun.com/rogue-lords-review-a-compelling-roguelike-where-cheaters-prosper-for-a-while",
          "author": "Matt Cox",
          "description": "Fighting against Satan must be miserable. You think you’ve got one of his minions cornered and then bam, down (up?) comes the hand of evil incarnate. Schwoop, Evil says, as he waves away most of your priest’s health bar. Pffft, he scoffs, as he flicks a shield from your bounty hunter to his succubus. Pop, he mouths, as he recharges Bloody Mary’s stabbing skill and sends her in for the kill. If this sounds unfair, that’s because it is - though fortunately, you’re not actually that side of the pentagram. Rogue Lords is a roguelike where the rules and UI elements are old Nick’s playthings, and you’re the lucky devil in charge of all his toys. \r\n\n\r\nOf course, that doesn’t wind up mattering nearly as much as you think it might.\nRead more",
          "link": "https://www.rockpapershotgun.com/rogue-lords-review-a-compelling-roguelike-where-cheaters-prosper-for-a-while",
          "publishedOn": "2021-09-30T09:00:00.000Z",
          "wordCount": 2016,
          "title": "Rogue Lords review: a compelling roguelike where cheaters prosper - for a while"
        },
        {
          "id": "https://www.rockpapershotgun.com/chess-plus-cards-roguelike-pawnbarian-has-launched-its-shiny-new-version",
          "author": "Lauren Morton",
          "description": "When you double down and then triple down on strategy, Pawnbarian must be pure essence that emerges. This tactical dungeon crawler throws chess on top of a roguelike plus some cards just for fun. Despite the undeniably deep strategic potential, it really is quick and breezy to pick up if you remember how chess pieces move. You can take your turn with it in its demo or pick up the shiny new release that its developer has whipped up to build on its former free browser version.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/chess-plus-cards-roguelike-pawnbarian-has-launched-its-shiny-new-version",
          "publishedOn": "2021-09-29T22:21:00.000Z",
          "wordCount": 842,
          "title": "Chess plus cards roguelike Pawnbarian has launched its shiny new version"
        },
        {
          "id": "https://www.rockpapershotgun.com/rfm-is-a-retro-future-tactical-roguelite-with-a-demo-this-weekend",
          "author": "Lauren Morton",
          "description": "This stylish retro-future strategy game has you diving into real-time tactical battles as an inter-dimensional mercenary. It's quite a looker, with a very chill, retro synth soundtrack to match. Don't let that get you too relaxed though, it looks like these battles may get a bit hectic as you dive deeper. RFM is looking to launch sometime next year, but you'll also be able to take it for a spin in the upcoming Steam Next Fest that kicks off this Friday.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/rfm-is-a-retro-future-tactical-roguelite-with-a-demo-this-weekend",
          "publishedOn": "2021-09-29T20:52:59.000Z",
          "wordCount": 756,
          "title": "RFM is a retro-future tactical roguelite with a demo this weekend"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-an-rps-recommended-razer-gaming-chair-for-155-off",
          "author": "Will Judd",
          "description": "The Razer Iskur is a rather excellent gaming chair if you're a relatively tall person or a normal-sized cat - or at least so says Katharine in her review. This premium chair normally retails for £500, but today Ebuyer have discounted it to £345, and they're also throwing in a pair of Razer peripherals to sweeten the deal. \nRead more",
          "link": "https://www.rockpapershotgun.com/get-an-rps-recommended-razer-gaming-chair-for-155-off",
          "publishedOn": "2021-09-29T20:20:43.000Z",
          "wordCount": 860,
          "title": "Get an RPS-recommended Razer gaming chair for £155 off"
        },
        {
          "id": "https://www.rockpapershotgun.com/this-high-spec-3400mbs-crucial-ssd-is-going-cheap-78-for-1tb",
          "author": "Will Judd",
          "description": "The Crucial P5 is a high-end PCIe 3.0 SSD, capable of read speeds up to 3400MB/s - about four to five times faster than your average SATA SSD. It's normally around £100 for a 1TB model, but today it's been heavily discounted at Ebuyer via Ebay - you can pay just £78 to take this new SSD home. \nRead more",
          "link": "https://www.rockpapershotgun.com/this-high-spec-3400mbs-crucial-ssd-is-going-cheap-78-for-1tb",
          "publishedOn": "2021-09-29T20:02:08.000Z",
          "wordCount": 805,
          "title": "This high-spec 3400MB/s Crucial SSD is going cheap: £78 for 1TB"
        },
        {
          "id": "https://www.rockpapershotgun.com/correction-you-can-be-jeff-bezos-in-new-world-sort-of",
          "author": "Lauren Morton",
          "description": "As is ever the case in starting a new MMO, picking a character name can be tough. Not least because naming things is hard, but also because some words are on the no-no list. In Amazon's MMO New World, that includes most versions of attempting to name your character after Amazon's founder. As Graham found out yesterday, you can't be Jeff Bezos in New World. Well, not exactly, anyway. You can be close to Jeff Bezos, depending on how far you're willing to stretch his name. At least one player—though I suspect there are hundreds more—has successfully bent the rules and landed in Aeternum as a knockoff Jeff.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/correction-you-can-be-jeff-bezos-in-new-world-sort-of",
          "publishedOn": "2021-09-29T19:39:13.000Z",
          "wordCount": 902,
          "title": "Correction: you can be Jeff Bezos in New World, sort of"
        },
        {
          "id": "https://www.rockpapershotgun.com/halo-infinite-is-letting-in-non-insiders-for-this-weekends-big-team-battle-beta",
          "author": "Lauren Morton",
          "description": "This weekend's Halo Infinite beta is bigger than before, both in player invites going out and in the matches you'll tackle. Registered Halo Insiders have been getting their hands on with Halo Infinite's multiplayer in 343's recent beta tests and now this weekend you can too. Well, maybe, provided you can pester a friend invite code out of a pal of yours who's already an Insider. If you find yourself queued up to play, you'll be participating in those chaotic 12v12 spartan matches Friday through Sunday. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/halo-infinite-is-letting-in-non-insiders-for-this-weekends-big-team-battle-beta",
          "publishedOn": "2021-09-29T17:58:59.000Z",
          "wordCount": 1005,
          "title": "Halo Infinite is letting in non-Insiders for this weekend's big team battle beta"
        },
        {
          "id": "https://www.rockpapershotgun.com/this-is-what-peak-dark-souls-fitness-looks-like",
          "author": "Ed Thorn",
          "description": "Lots of people are excited for Elden Ring. You're excited for Elden Ring, I'm excited for Elden Ring, all the old folks down at your local Spoons at 10am? Yes, this is the game they contemplate over a remarkably early cold one.\nThis is nothing, though. This is a terrible level of excitement in comparison to abusaad3, who is more up for Elden Ring than anyone on this planet. To prove it, they're doing a no-hit boss challenge each day in Dark Souls 3 until Elden Ring is released. This is phenomenal levels of dedication and I am very here for it.\nRead more",
          "link": "https://www.rockpapershotgun.com/this-is-what-peak-dark-souls-fitness-looks-like",
          "publishedOn": "2021-09-29T16:14:33.000Z",
          "wordCount": 723,
          "title": "This is what peak Dark Souls fitness looks like"
        },
        {
          "id": "https://www.rockpapershotgun.com/horrific-pikmin-like-adventure-dap-has-you-protect-a-gaggle-of-spooky-pals",
          "author": "Lauren Morton",
          "description": "At last, it's nearly horror games month-eve and so even the concept of friendship must become frightening. Pikmin-like action puzzler game Dap is all about collecting your Dap pals and attempting to lead them home out of a spooky dream world forest without being consumed by Dap infighting. The nightmare has begun today, so you can lead your own Dap pack out of the woods right now if that's your thing.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/horrific-pikmin-like-adventure-dap-has-you-protect-a-gaggle-of-spooky-pals",
          "publishedOn": "2021-09-29T16:01:06.000Z",
          "wordCount": 790,
          "title": "Horrific Pikmin-like adventure Dap has you protect a gaggle of spooky pals"
        },
        {
          "id": "https://www.rockpapershotgun.com/halo-infinites-maps-are-vintage-multiplayer-jungle-gyms",
          "author": "Brendan Caldwell",
          "description": "The multiplayer maps of Halos past had a devotion to footstep fairness, the principle that every step I take toward the giant laser cannon should equal one step you take toward the same brutal death-tube. Halo Infinite abides by that time-honored rule, at least judging by the recent public test.\nThese maps are classic Master Chief party houses, loyal to the supremacy of abstract shapes, with clarity to every corner and a pared-back art style that makes a brief glance of an enemy in a doorway pop out. Pick-ups lounge on exposed podiums like glimmering sirens. Isolated platforms furnish gravity hammers, surrounded by a grinning void. They are arenas that somehow feel both dangerous and fair. But they are something else too. They're playful.\nRead more",
          "link": "https://www.rockpapershotgun.com/halo-infinites-maps-are-vintage-multiplayer-jungle-gyms",
          "publishedOn": "2021-09-29T16:00:00.000Z",
          "wordCount": 1957,
          "title": "Halo Infinite's maps are vintage multiplayer jungle gyms"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-factions-companies",
          "author": "Rebecca Jones",
          "description": "Which Faction should you pick in New World, and how do you start and join Companies? Amazon's new MMO New World features both PvP and PvE gameplay, and even though it is theoretically possible to go it alone and still enjoy some of the features, joining up with other players is a lot more fun. The complex social heirarchies of New World are divided up into Factions and Companies — two separate, but linked, types of player organisation. It can all be a bit confusing, though, so below we've laid out the difference between them, as well as how to join a Faction or Company.\n Read more",
          "link": "https://www.rockpapershotgun.com/new-world-factions-companies",
          "publishedOn": "2021-09-29T15:22:36.000Z",
          "wordCount": 1693,
          "title": "New World Factions & Companies explained: which faction should you pick?"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-new-gamesmasters-host-is-robert-florence",
          "author": "Alice O'Connor",
          "description": "The co-host of the UK's best video games TV show is becoming the host of its most beloved one, as Channel 4 have named Robert Florence lead host of their rebooted GamesMaster. You know, Rab from VideoGaiden and Consolevania, and from BBC Scotland sketch show Burnistoun, and from RPS board games column Cardboard Children. Honestly, he's a great shout. But no, he's not going to be the actual GamesMaster.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-new-gamesmasters-host-is-robert-florence",
          "publishedOn": "2021-09-29T15:22:35.000Z",
          "wordCount": 847,
          "title": "The new GamesMaster's host is Robert Florence"
        },
        {
          "id": "https://www.rockpapershotgun.com/marvels-avengers-hits-xbox-game-pass-tomorrow",
          "author": "Imogen Beckhelling",
          "description": "Ill-fated co-op superhero game Marvel's Avengers comes to Xbox Game Pass tomorrow. The live service action-RPG first launched in September last year to an overwhelmingly \"meh\" reaction from players, but if you were curious about it, at least now you don't need to pay full price to try it out. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/marvels-avengers-hits-xbox-game-pass-tomorrow",
          "publishedOn": "2021-09-29T14:53:26.000Z",
          "wordCount": 756,
          "title": "Marvel's Avengers hits Xbox Game Pass tomorrow"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-best-settings",
          "author": "James Archer",
          "description": "Even though you can’t play as Jeff Bezos, Amazon Game Studios’ MMO New World is proving popular. So popular, in fact, that some players are apparently willing to queue for hours if it means joining their preferred server. If you find yourself waiting to get to the front of the line, why not kill time efficiently by reading this guide to New World’s best settings? Despite some light-looking system requirements, New World can hammer your hardware in certain areas, and even if you own one of the best graphics cards it’s worth knowing which settings to tone down in exchange for those morish frames per second. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-best-settings",
          "publishedOn": "2021-09-29T14:44:18.000Z",
          "wordCount": 1794,
          "title": "New World: the best settings to improve performance"
        },
        {
          "id": "https://www.rockpapershotgun.com/oh-lord-will-wrights-new-game-is-built-on-nfts",
          "author": "Alice O'Connor",
          "description": "Will Wright, the legendary designer behind games from SimCity to The Sims, has opened up about his mysterious new game. It's named Proxi, and it's some sort of world-building AI simulation game inspired by \"how the brain stores memories\". Normally news on a new Will Wright game would be cause for celebration but ah jeez he's fallen for NFTs, oh no.\nRead more",
          "link": "https://www.rockpapershotgun.com/oh-lord-will-wrights-new-game-is-built-on-nfts",
          "publishedOn": "2021-09-29T14:19:30.000Z",
          "wordCount": 1418,
          "title": "Oh lord, Will Wright's new game is built on NFTs"
        },
        {
          "id": "https://www.rockpapershotgun.com/colts-squishy-vulnerability-is-stopping-me-from-enjoying-deathloops-action",
          "author": "Ed Thorn",
          "description": "Let's try action. Let's try action. Let's try action. This is the Deathloop I'm in at the moment, but I'm slowly beginning to think it's worth breaking the cycle and taking the stealthy approach as often as I can. I'm confused, you see. In many of the game's pre-release teasers, we saw Colt bursting into action. Stealth? No no, this is more of an FPS. The music flares, enemies die, it is carnage.\nBut when I actually give action a go in the game, I'm mostly left dead in seconds. Either that, or I meekly duck behind some cover and regret not trying the stealthy approach. And the problem is that sometimes I have no option but to go all guns blazing, and I think, \"Colt isn't built for this. He's only a squishy lad.\" I just think he's a stealth character being forced to break cover when he's clearly uncomfortable doing so.\nRead more",
          "link": "https://www.rockpapershotgun.com/colts-squishy-vulnerability-is-stopping-me-from-enjoying-deathloops-action",
          "publishedOn": "2021-09-29T13:00:00.000Z",
          "wordCount": 1447,
          "title": "Colt's squishy vulnerability is stopping me from enjoying Deathloop's action"
        },
        {
          "id": "https://www.rockpapershotgun.com/tunic-isnt-a-soulslike-says-dev-but-it-wont-go-easy-on-you",
          "author": "Imogen Beckhelling",
          "description": "At first glance, the upcoming action-adventure game Tunic looks remarkably similar to The Legend Of Zelda. Its protagonist is a cute little dude (well, a fox, in this case) with a sword and shield and similar taste in green adventure-wear, and they get to run around all sorts of lush forests, bright temples and more. But upon playing the game, people have already discovered that it's a fair bit tougher than it looks. More Dark Souls, than Zelda, perhaps.\nJust because Tunic isn't dark and gloomy doesn't mean it can't offer its fair share of challenges, so I spoke to Tunic creator Andrew Shouldice to find out how he's managing expectations, as well as tackling difficulty and accessibility. We also talked about the joy of exploring and uncovering secrets, but we'll check behind that waterfall in a bit.\nRead more",
          "link": "https://www.rockpapershotgun.com/tunic-isnt-a-soulslike-says-dev-but-it-wont-go-easy-on-you",
          "publishedOn": "2021-09-29T12:00:00.000Z",
          "wordCount": 1979,
          "title": "Tunic isn't a Soulslike, says dev, but it won't go easy on you"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-azoth",
          "author": "Hayden Hefford",
          "description": "Want to learn about Azoth in New World? Azoth is a very important resource that you will use for some crucial activities in New World, including fast travel and crafting. You'll do those often in an MMO, so Azoth’s pretty darn useful.\nThis guide will explain everything that you need to know about Azoth, including where you can find Azoth and the quickest way to farm Azoth in New World.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-azoth",
          "publishedOn": "2021-09-29T11:32:55.000Z",
          "wordCount": 1231,
          "title": "How to get Azoth in New World"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-epic-games-store-is-coming-to-the-microsoft-store-for-some-reason",
          "author": "Imogen Beckhelling",
          "description": "Microsoft are making a new Microsoft Store, and you'll be able to download even more stores from it. They've announced that they're adding a number of third-party storefront apps, including Amazon and Epic Games. These will arrive sometime in the next few months, after the new Microsoft Store launches alongside Windows 11 next week. Finally, you'll be able to launch a store you don't want from a store you really don't want.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-epic-games-store-is-coming-to-the-microsoft-store-for-some-reason",
          "publishedOn": "2021-09-29T11:22:49.000Z",
          "wordCount": 842,
          "title": "The Epic Games Store is coming to the Microsoft Store, for some reason"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-new-world-character-builds",
          "author": "Rebecca Jones",
          "description": "What are the best character builds in New World? Unlike many MMOs of a similar type, New World doesn't have character classes. Instead, you build your character over time by allocating points into their Attributes and Weapon Masteries. This gives you the opportunity to experiment with gameplay a little before committing to a play style, allowing you to find the build that works best for you.\nRead more",
          "link": "https://www.rockpapershotgun.com/best-new-world-character-builds",
          "publishedOn": "2021-09-29T10:05:09.000Z",
          "wordCount": 2125,
          "title": "Best New World builds: the best character builds for PvP and PvE"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-will-offer-free-server-transfers-over-the-next-two-weeks",
          "author": "Imogen Beckhelling",
          "description": "New World has had quite the start to life, becoming the most popular game on Steam last night. Unfortunately, the MMORPG's popularity has caused an awful lot of queuing, with players having to wait hours to get their preferred servers. Amazon Games have announced a sort of workaround for that, though. Over the next two weeks, if you get your character started on a lower player count server, the devs will let you transfer them for free to the server you want to settle down in.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-will-offer-free-server-transfers-over-the-next-two-weeks",
          "publishedOn": "2021-09-29T09:56:21.000Z",
          "wordCount": 826,
          "title": "New World will offer free server transfers to help with queues"
        },
        {
          "id": "https://www.rockpapershotgun.com/diablo-2-resurrected-respec",
          "author": "Charlie Biggerstaff",
          "description": "Trying to figure out how to respec in Diablo 2? A quick initiation for those who aren’t RPG diehards - respec simply refers to the process of refunding and reallocating things like skill and attribute points that are common to the genre. Respecing in many modern RPGs is a simple, repeatable process, but things aren’t quite so easy in Diablo 2: Resurrected. While you will earn a few easy respec opportunities, once you’ve used them getting another will be a fittingly grindy process. To make sure you don’t waste your chances and cripple your build, we’ll walk you through all the ways to respec your character in Diablo 2: Resurrected.\nRead more",
          "link": "https://www.rockpapershotgun.com/diablo-2-resurrected-respec",
          "publishedOn": "2021-09-29T09:45:04.000Z",
          "wordCount": 1186,
          "title": "How to respec in Diablo 2: Resurrected"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-ray-tracing",
          "author": "Hayden Hefford",
          "description": "Want to learn about RTX ray tracing in Minecraft? When you think of gorgeous graphics, Minecraft might not be the first thing that comes to mind. Sure, it has a charming aesthetic, and texture packs can make your worlds look really unique, but it isn’t very realistic. However, Nvidia have now created ray traced RTX worlds in Minecraft that will completely transform your experience.\nThis guide will explain everything that you need to know to get RTX ray tracing in Minecraft, including the minimum requirements for ray tracing.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-ray-tracing",
          "publishedOn": "2021-09-29T08:33:07.000Z",
          "wordCount": 1288,
          "title": "How to enable RTX ray tracing in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/netflix-have-bought-the-developers-of-oxenfree",
          "author": "Graham Smith",
          "description": "Night School Studio are \"joining the Netflix team.\" The developers of Oxenfree and Afterparty are the first games studio to be bought by Netflix, with founder and creative director Sean Krankel writing in a blog post that they'll continue working on the in-development Oxenfree 2. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/netflix-have-bought-the-developers-of-oxenfree",
          "publishedOn": "2021-09-28T22:35:46.000Z",
          "wordCount": 741,
          "title": "Netflix have bought the developers of Oxenfree"
        },
        {
          "id": "https://www.rockpapershotgun.com/you-cant-be-jeff-bezos-in-new-world",
          "author": "Graham Smith",
          "description": "Picture the scene. You're playing newly released coloniast theme park New World when who should walk over to you but Amazon founder Jeff Bezos. The billionaire says that he's locked out of his bank accounts, but if you buy him several Amazon gift cards, he'll pay you back with \"extra\" once he gets his access back.\r\n\nThis situation probably can't happen, because \"Jeff Bezos\" and almost every variation of it aren't permitted names in Amazon's MMO.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/you-cant-be-jeff-bezos-in-new-world",
          "publishedOn": "2021-09-28T21:41:51.000Z",
          "wordCount": 680,
          "title": "You can't be Jeff Bezos in New World"
        },
        {
          "id": "https://www.rockpapershotgun.com/you-can-now-play-the-demo-for-pony-island-devs-creepy-card-game",
          "author": "Graham Smith",
          "description": "Inscryption is reportedly \"inky black card-based odyssey that blends the deckbuilding roguelike, escape-room style puzzles, and psychological horror into a blood-laced smoothie.\" It's also from Daniel Mullins, the makers of Pony Island and The Hex, which means it's probably a few other, secret genres, too. It's coming October 19th, but there's a demo available now and a new trailer below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/you-can-now-play-the-demo-for-pony-island-devs-creepy-card-game",
          "publishedOn": "2021-09-28T21:11:47.000Z",
          "wordCount": 739,
          "title": "You can now play the demo for Pony Island dev's creepy card game"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-is-currently-the-most-popular-game-on-steam",
          "author": "Graham Smith",
          "description": "Amazon's MMO New World launched earlier today, and it's apparently great if you like queues. \r\n\nTo put the login issues players are experiencing in context however, it's maybe worth noting that New World is currently the most popular game on Steam, knocking CS:GO from its perch within hours of release.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-is-currently-the-most-popular-game-on-steam",
          "publishedOn": "2021-09-28T20:11:33.000Z",
          "wordCount": 749,
          "title": "New World is currently the most popular game on Steam"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-a-500w-seasonic-sfx-l-power-supply-for-35-at-newegg",
          "author": "Will Judd",
          "description": "Seasonic is known the world over for their high-spec, high-reliability power supplies, and today one of their small form factor (SFX-L) PSUs is heavily discounted at Newegg. The fully modular Focus SGX-500 is a 500W PSU that comes with a ten-year warranty and a footprint of less than 5 x 5 inches. Normally you'd expect to pay $120 for it, but a combination of a Newegg discount, a $15 mail in rebate and a code for $10 off (NEOCTOBER) has dropped it to just $35 when all is said and done - pretty impressive! \nRead more",
          "link": "https://www.rockpapershotgun.com/get-a-500w-seasonic-sfx-l-power-supply-for-35-at-newegg",
          "publishedOn": "2021-09-28T19:41:12.000Z",
          "wordCount": 863,
          "title": "Get a 500W Seasonic SFX-L power supply for $35 at Newegg"
        },
        {
          "id": "https://www.rockpapershotgun.com/this-rps-approved-ultrawide-gaming-monitor-is-400-off-today",
          "author": "Will Judd",
          "description": "Yesterday we featured a cut-price 49-in Samsung ultrawide monitor, which was marked down to £1099. That's still stonking expensive, so how about something more reasonable? This is the Samsung CRG9, the Odyssey G9's predecessor, and it offers almost all the same specs for much less - just £699, down from £1099. Here's why it gets the sagely RPS nod of approval. \nRead more",
          "link": "https://www.rockpapershotgun.com/this-rps-approved-ultrawide-gaming-monitor-is-400-off-today",
          "publishedOn": "2021-09-28T19:24:23.000Z",
          "wordCount": 1019,
          "title": "This RPS-approved ultrawide gaming monitor is £400 off today"
        },
        {
          "id": "https://www.rockpapershotgun.com/halo-infinites-multiplayer-reminds-me-of-old-halo-and-i-mean-that-in-the-best-way",
          "author": "Ed Thorn",
          "description": "I adored Halo 3 and Halo Reach's multiplayer. So much so, I never want to play them again. In my mind, I view them through a next-gen lens, coloured by nostalgia and post-homework energy. I know that if I jump into the Halo: The Master Chief Collection, I simply won't be able to recapture those heady times. I'm genuinely afraid of tarnishing those memories.\nHalo 4 didn't do it for me, and I skipped Halo 5 altogether. They just felt off, you know? But having spent some time with Halo Infinite's tech preview this weekend, though, I'm hopeful that this is the Halo that recaptures those former glory days. It's a step backwards in the best possible way.\nRead more",
          "link": "https://www.rockpapershotgun.com/halo-infinites-multiplayer-reminds-me-of-old-halo-and-i-mean-that-in-the-best-way",
          "publishedOn": "2021-09-28T17:00:00.000Z",
          "wordCount": 1444,
          "title": "Halo Infinite's multiplayer reminds me of old Halo, and I mean that in the best way"
        },
        {
          "id": "https://www.rockpapershotgun.com/battlefield-2042-open-beta-dates-confirmed-starts-october-8",
          "author": "Alice O'Connor",
          "description": "Following the recent delay of Battlefield 2042's launch into November, Electronic Arts have now confirmed new timing for the open beta test of Dice's near-future shooter. It'll start on Friday the 8th of October and run until the morning of  Sunday the 10th, inviting everyone to play Conquest mod on the map Orbital.\nRead more",
          "link": "https://www.rockpapershotgun.com/battlefield-2042-open-beta-dates-confirmed-starts-october-8",
          "publishedOn": "2021-09-28T16:22:21.000Z",
          "wordCount": 867,
          "title": "Battlefield 2042 open beta dates confirmed, starts October 8"
        },
        {
          "id": "https://www.rockpapershotgun.com/echoes-of-the-eye-is-sensational-dlc-for-outer-wilds-dont-let-anyone-spoil-it-for-you",
          "author": "Matthew Castle",
          "description": "Echoes Of The Eye, the new expansion for Outer Wilds, is out... now! And I’d like to congratulate Mobius Digital and Annapurna on just how little promoting their promotional campaign did. The reveal trailer did anything but, showing us the familiar solar system of Outer Wilds, only with the beginning of an eclipse followed by shots of murky caves and forests. And take a look at the official screenshots used in this article: obscured to the point of ugliness. Here’s a team so determined to keep their secrets they’d rather present the game in an unflattering light. It was worth it.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/echoes-of-the-eye-is-sensational-dlc-for-outer-wilds-dont-let-anyone-spoil-it-for-you",
          "publishedOn": "2021-09-28T16:00:00.000Z",
          "wordCount": 1920,
          "title": "Echoes Of The Eye is sensational DLC for Outer Wilds - don’t let anyone spoil it for you"
        },
        {
          "id": "https://www.rockpapershotgun.com/pc-gaming-weekspot-podcast-055-outer-wilds-echoes-of-the-eye",
          "author": "Colm Ahern",
          "description": "So, the main point of discussion on this week's podcast is the Outer Wilds: Echoes Of The Eye DLC. Talking about it is tricky, because saying pretty much anything about it feels spoiler-y. Christ, I'm trying to be careful writing this blurb in case I say something that I shouldn't. But, somehow, I think we managed to talk about it, without talking about it. Know what I mean?\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/pc-gaming-weekspot-podcast-055-outer-wilds-echoes-of-the-eye",
          "publishedOn": "2021-09-28T16:00:00.000Z",
          "wordCount": 796,
          "title": "The Weekspot podcast #055: eye and mighty"
        },
        {
          "id": "https://www.rockpapershotgun.com/roblox-players-are-making-loads-of-squid-game-games",
          "author": "Imogen Beckhelling",
          "description": "Squid Game is a South Korean survival drama show that's been taking Netflix by storm recently, and it's inspired a whole bunch of Squid Game games on Roblox. The show pits folks against each other in games like tug-of-war, where the winners earn cash, and the losers earn, well, death. It's a fun (read: somehow even more sinister) twist on the battle royale genre. It reminds me a bit of when the Hunger Games films inspired loads of Minecraft mods.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/roblox-players-are-making-loads-of-squid-game-games",
          "publishedOn": "2021-09-28T15:51:39.000Z",
          "wordCount": 819,
          "title": "Roblox players are making loads of Squid Game games"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-new-world-weapons-tier-list",
          "author": "Rebecca Jones",
          "description": "Looking for the best weapons in New World? The highly-anticipated MMO New World from Amazon Game Studios is now available as a full release, and for most players getting stuck into life on Aeternum Island, putting together a good selection of weapons will be their number one priority. In this tier list, we've ranked each weapon according to our experiences, and also put together some pointers on choosing the best weapons for your play style.\n Read more",
          "link": "https://www.rockpapershotgun.com/best-new-world-weapons-tier-list",
          "publishedOn": "2021-09-28T15:35:14.000Z",
          "wordCount": 1928,
          "title": "New World weapon tier list: best New World weapons for PvP and PvE"
        },
        {
          "id": "https://www.rockpapershotgun.com/time-looping-arena-shooter-lemnis-gate-is-out-now",
          "author": "Imogen Beckhelling",
          "description": "'Tis the season of the time loop. If you have any space left in your brain after Deathloop for more groundhog day-like shenanigans, you might be interested in Lemnis Gate, a strategic first-person shooter that launched today. It pits players against each other in 1v1 and 2v2 matches, letting you plan out moves in 25 second-long rounds. It sounds a little confusing, but seems pretty fun. It also has some excellent-looking sci-fi backgrounds and laser guns, which is truly the most important part.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/time-looping-arena-shooter-lemnis-gate-is-out-now",
          "publishedOn": "2021-09-28T14:30:53.000Z",
          "wordCount": 831,
          "title": "Time looping arena shooter Lemnis Gate is out now"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-dripstone-infinite-lave-source",
          "author": "Hayden Hefford",
          "description": "Want to learn more about Dripstone in Minecraft? Caves are getting a huge revamp in Minecraft 1.18, and Dripstone is going to be an important new block, as you can use it to make an infinite lava source in your base.\nThis guide will explain everything you need to know about Dripstone, including where you will be able to find it and how to use Pointed Dripstone to create a lava farm in Minecraft.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-dripstone-infinite-lave-source",
          "publishedOn": "2021-09-28T14:01:50.000Z",
          "wordCount": 1274,
          "title": "Everything we know about Dripstone in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-neo-the-world-ends-with-you-captures-the-15-year-evolution-of-shibuya-and-is-a-better-game-for-it",
          "author": "Alicia Haddick",
          "description": "NEO: The World Ends With You is out on PC today (via the Epic Games Store), and marks the grand return of a franchise that, despite a rabid fanbase and numerous re-releases, is only receiving its first sequel after 15 years. The original The World Ends With You impressed audiences on Nintendo DS as much for the game’s stylish Tokyo setting as it did for a unique battle system that saw players control multiple characters on multiple screens simultaneously. Yet what made this game really memorable was how it transformed the fashion and pop-cultural power of Shibuya into its own JRPG battle system. Your drip gave you strength, your armor made you a trendsetter, and the music and energy of the city were translated into a story about coming-of-age, self-worth and finding strength in yourself and your friends by embracing the things that make you unique. \nNow, NEO: The World Ends With You has arrived, but this long-awaited sequel is far from a simple retread of what the first game did 15 years ago. Shibuya itself has changed a lot in the intervening years and it's fascinating to see how NEO's setting and its gameplay mechanics have evolved alongside it. \nRead more",
          "link": "https://www.rockpapershotgun.com/how-neo-the-world-ends-with-you-captures-the-15-year-evolution-of-shibuya-and-is-a-better-game-for-it",
          "publishedOn": "2021-09-28T12:00:00.000Z",
          "wordCount": 2106,
          "title": "How NEO: The World Ends With You captures the 15 year evolution of Shibuya, and is a better game for it"
        },
        {
          "id": "https://www.rockpapershotgun.com/gigabyte-g5-review-a-ray-tracing-gaming-laptop-at-a-good-price",
          "author": "James Archer",
          "description": "With graphics card prices being what they are, gaming laptops like the Gigabyte G5 have been making a lot more sense. Believe it or not, this particular model is – at £850 / $969 – one of the cheapest routes possible into a complete PC gaming system with Nvidia’s RTX ray tracing and DLSS powers.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/gigabyte-g5-review-a-ray-tracing-gaming-laptop-at-a-good-price",
          "publishedOn": "2021-09-28T11:35:17.000Z",
          "wordCount": 2157,
          "title": "Gigabyte G5 review: a ray tracing gaming laptop at a good price"
        },
        {
          "id": "https://www.rockpapershotgun.com/uk-advertising-authority-set-guidance-for-in-game-purchases",
          "author": "Alice O'Connor",
          "description": "As various UK agencies and organisations continue to regard microtransactions and loot boxes with escalating curiosity and suspicion, the Advertising Standards Authority have laid out new guidelines for advertising in-game in purchases. Basically, they think games should be clear about what they're selling and how much things cost in real money, and that advertising shouldn't pressure or mislead. The ASA are relatively toothless but fairly prolific, and their interest might lead to more official interest.\nRead more",
          "link": "https://www.rockpapershotgun.com/uk-advertising-authority-set-guidance-for-in-game-purchases",
          "publishedOn": "2021-09-28T10:49:14.000Z",
          "wordCount": 1170,
          "title": "UK advertising authority set guidance for in-game purchases"
        },
        {
          "id": "https://www.rockpapershotgun.com/amazons-mmo-new-world-is-out-now-but-the-servers-are-struggling",
          "author": "Imogen Beckhelling",
          "description": "At long last, Amazon's MMO New World has launched. After multiple delays and two rather popular betas, folks can now jump onto the supernatural island of Aeternum and stay there for as long as they please. The EU servers are already live, with the rest of the world to follow throughout today. Do watch out if you're jumping in this morning though, because some players are reporting long queue times, while others are struggling to get into the queue in the first place.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/amazons-mmo-new-world-is-out-now-but-the-servers-are-struggling",
          "publishedOn": "2021-09-28T10:30:11.000Z",
          "wordCount": 989,
          "title": "Amazon's MMO New World is out now, but the servers are struggling"
        },
        {
          "id": "https://www.rockpapershotgun.com/activision-blizzard-commit-to-18-million-settlement-with-equal-employment-opportunity-commission",
          "author": "Alice O'Connor",
          "description": "Activision Blizzard have agreed to create a claims fund of $18 million (£13m) for employees who experienced harm from \"sexual harassment, pregnancy discrimination and/or related retaliation\". This is part of a settlement with the USA's Equal Employment Opportunity Commission (EEOC), who had taken Actiblizz to court with allegations of those issues. This is only one of Activision Blizzard's current legal battles over alleged workplace problems, and not the big one you're probably thinking of. The company also had to agree to, like, not do any of those bad things—but the settlement is not an admission of guilt.\nRead more",
          "link": "https://www.rockpapershotgun.com/activision-blizzard-commit-to-18-million-settlement-with-equal-employment-opportunity-commission",
          "publishedOn": "2021-09-28T09:59:52.000Z",
          "wordCount": 1012,
          "title": "Activision Blizzard commit to $18 million settlement with Equal Employment Opportunity Commission"
        },
        {
          "id": "https://www.rockpapershotgun.com/league-of-legends-series-arcane-premieres-throughout-november",
          "author": "Lauren Morton",
          "description": "Yet another beefy trailer and launch date exploded out of Netflix's corner this weekend. Their upcoming animated series Arcane, set in the universe of Riot's League Of Legends, has gotten one of each. The new trailer down here digs into the dynamic between protagonist sisters Vi and Jinx. The release date, at least the first of them, is coming up pretty quick too, scheduled for November 6th.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/league-of-legends-series-arcane-premieres-throughout-november",
          "publishedOn": "2021-09-27T22:37:16.000Z",
          "wordCount": 797,
          "title": "League Of Legends series Arcane premieres throughout November"
        },
        {
          "id": "https://www.rockpapershotgun.com/steam-may-be-planning-to-restrict-player-access-to-old-game-builds",
          "author": "Lauren Morton",
          "description": "As they always do, things in Steam are likely to change again. Unlike Valve's Steam Labs experiments for storefront discoverability or downstream effects of the upcoming Steam Deck, this one is a little more under the hood. As spotted by the unaffiliated Steam tracking site SteamDB, the beta version of Steam's client now has a new method that is capable of preventing users from accessing former builds of games they own. The majority of players likely aren't pulling up old game builds often, if ever, but this change could make life a lot tougher for modders, speedrunners, and anyone trying to roll back a buggy game update while they wait for a hotfix.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/steam-may-be-planning-to-restrict-player-access-to-old-game-builds",
          "publishedOn": "2021-09-27T21:55:12.000Z",
          "wordCount": 957,
          "title": "Steam may be planning to restrict player access to old game builds"
        },
        {
          "id": "https://www.rockpapershotgun.com/oculus-announces-resident-evil-4-vr-release-date-for-october",
          "author": "Lauren Morton",
          "description": "October is creeping up on us all and, like a proper jump scare just before I'd expected it, so has Resident Evil 4 VR. Leon Kennedy's spooky cult adventure begins again in the first-person and hands-on version that's arriving on the Oculus Quest 2 next month. Now that you'll be getting all up close and personal with Salazar and Saddler and El Gigante and all, they've gotten some fresh pixels as well, which you can catch a look at once again in a new trailer.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/oculus-announces-resident-evil-4-vr-release-date-for-october",
          "publishedOn": "2021-09-27T20:14:37.000Z",
          "wordCount": 743,
          "title": "Oculus announces Resident Evil 4 VR release date for October"
        },
        {
          "id": "https://www.rockpapershotgun.com/netflixs-lady-assassin-movie-kate-is-getting-an-action-roguelike-tie-in-game",
          "author": "Lauren Morton",
          "description": "I've been positively held hostage by the lady assassin action movie trend—having been in the same room as my partner relentlessly devouring the likes of The Old Guard, Ava, Terminal, and Gunpowder Milkshake. No surprise then that I also got sucked into watching Kate, Netflix's new action movie starring assassin Mary Elizabeth Winstead and her teen hostage slash sidekick Miku Martineau. What is surprising—even though Netflix have shown an increasing interest in games—is that Kate is getting a tie-in action game called Kate: Collateral Damage. It's a fast-paced and arcade-y roguelike with some twin-stick style shooting coming out in October.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/netflixs-lady-assassin-movie-kate-is-getting-an-action-roguelike-tie-in-game",
          "publishedOn": "2021-09-27T18:19:30.000Z",
          "wordCount": 869,
          "title": "Netflix's lady assassin movie Kate is getting an action roguelike tie-in game"
        },
        {
          "id": "https://www.rockpapershotgun.com/this-27-in-240hz-samsung-monitor-is-229-right-now-70-off",
          "author": "Will Judd",
          "description": "For a while, I was super into Counter-Strike: Global Offensive, and I took getting better at the game very seriously. I swapped out my mouse and headset, practiced grenade line-ups for hours and even learned a few Russian phrases to try and get the respect of my match-making teammates. All these steps worked, but the real results came when I swapped my old 144Hz monitor for a 240Hz model, the Samsung CRG5. Hitting such a high frame-rate in Counter-Strike isn't difficult even on old hardware, and the increase in clarity meant hitting shots a lot easier. \nIf you want to follow in my footsteps, then it's good news: this 240Hz screen is going cheap on Amazon today. They're asking £229 for it, £70 off its regular price of £299, and I think that's a great deal. \nRead more",
          "link": "https://www.rockpapershotgun.com/this-27-in-240hz-samsung-monitor-is-229-right-now-70-off",
          "publishedOn": "2021-09-27T17:55:30.000Z",
          "wordCount": 1089,
          "title": "This 27-in 240Hz Samsung monitor is £229 right now (£70 off)"
        },
        {
          "id": "https://www.rockpapershotgun.com/samsungs-2tb-870-evo-ssd-is-down-to-19750-at-amazon",
          "author": "Will Judd",
          "description": "We reckon that Samsung's 870 Evo is the best SATA SSD for gaming, and today the mammoth 2TB model has been reduced on Amazon. It's now retailing for £197.50, the best price we've seen on this drive since the Chia mining craze began and some £45 below RRP. It's even cheaper than the (older and slower) 860 Evo. Here's a link to the deal and a few more words on why we like this particular drive so very much. \nRead more",
          "link": "https://www.rockpapershotgun.com/samsungs-2tb-870-evo-ssd-is-down-to-19750-at-amazon",
          "publishedOn": "2021-09-27T16:55:34.000Z",
          "wordCount": 875,
          "title": "Samsung's 2TB 870 Evo SSD is down to £197.50 at Amazon"
        }
      ]
    },
    {
      "title": "Root.cz - články",
      "feedUrl": "https://www.root.cz/rss/clanky/",
      "siteUrl": "https://www.root.cz/clanky/",
      "articles": [
        {
          "id": "www.root.cz-text-15690",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "LLVM 13.0 přináší binární balíček Flang a vylepšený OpenCL Clang, ARMv9 a GNU GCC, Intel zkoumá možnosti synchronizovaného plánovače CPU+GPU na Linuxu, I/O rozhraní Linuxu umí dokonce 5,1M IOPS/jádro.",
          "link": "https://www.root.cz/clanky/vylepseni-podpory-videa-v-pipewire-novy-ovladac-pro-ati-radeony-9000/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-02T22:00:00.000Z",
          "wordCount": 1514,
          "title": "Vylepšení podpory videa v PipeWire, nový ovladač pro ATI Radeony 9000",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/160/intel-procesor-cpu-chladic-1.jpg",
            "length": "46121",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15686",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Naposledy se dnes podíváme na vybrané novinky z vývoje jádra Linux 5.15. Čeká nás třeba 12. generace Intel Core, přechod na GCC 5.1, rychlejší I/O, podpora Rustu i první náhled na následný Linux 5.16.",
          "link": "https://www.root.cz/clanky/co-se-chysta-pro-linux-5-15-a-primes-novinek-pro-verzi-5-16/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-30T22:00:00.000Z",
          "wordCount": 1778,
          "title": "Co se chystá pro Linux 5.15 a příměs novinek pro verzi 5.16",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/357/tucnak-cisarsky-tux-linux-1.jpg",
            "length": "34098",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15551",
          "author": "redakce@root.cz (Root.cz: Karel Kulhavý)",
          "description": "Dcraw koriguje chromatickou aberaci a G'MIC vinětaci jednoduché soustavy dalekohledu a iPhonu, kterým vyfotíme manuálně v režimu raw a data přeneseme do Linuxu přes Wi-Fi nebo USB.",
          "link": "https://www.root.cz/clanky/fotografovani-dalekohledem-priprava-a-softwarova-optimalizace/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-29T22:00:10.000Z",
          "wordCount": 1954,
          "title": "Fotografování dalekohledem: příprava a softwarová optimalizace",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/426/dalekohled-1.jpg",
            "length": "42720",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15685",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "V deváté části seriálu o křivkách si popíšeme některé křivky, které byly po svém objevu nazývány „matematická monstra“, protože neodpovídaly tehdejším představám o chování „správných“ křivek.",
          "link": "https://www.root.cz/clanky/patologicke-krivky-a-jina-matematicka-monstra/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-29T22:00:05.000Z",
          "wordCount": 7571,
          "title": "Patologické křivky a jiná matematická monstra",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/507/krivka-perex-1.jpg",
            "length": "74201",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15683",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "Představíme si projekt nazvaný ULua, což je distribuce tohoto programovacího jazyka pro všechny tři nejpoužívanější operační systémy, která kromě LuaJITu obsahuje i správce balíčků upkg.",
          "link": "https://www.root.cz/clanky/ulua-univerzalni-distribuce-programovaciho-jazyka-lua/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-28T22:00:10.000Z",
          "wordCount": 5091,
          "title": "ULua: univerzální distribuce programovacího jazyka Lua",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/679/lua-mesic-noc-mesto-1.jpg",
            "length": "69823",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15682",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Sonda do světa otevřeného softwaru. Dnes si představíme nástroj pro práci se snímky obrazovky, vyzkoušíme software pro práci s MPO 3D fotografiemi, přeložíme si texty do jiných jazyků a vytvoříme si nějaké ty vědecké grafy.",
          "link": "https://www.root.cz/clanky/softwarova-sklizen-29-9-2021/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-28T22:00:05.000Z",
          "wordCount": 1070,
          "title": "Softwarová sklizeň (29. 9. 2021)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/root/368/kombajn-sklizen.jpg",
            "length": "394618",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15681",
          "author": "redakce@root.cz (Root.cz: CESNET CERTS)",
          "description": "Tentokrát se podíváme na zranitelnosti WordPressu, Drupalu, Apache OpenOffice a Nagiosu, na malware Capoae a OpenSUpdater. Naopak potěší, že provozovatel DDoSových serverů i mafiáni dojdou zasloužené odplaty.",
          "link": "https://www.root.cz/clanky/postrehy-z-bezpecnosti-velka-uroda-malwaru-i-zranitelnosti/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-26T22:00:10.000Z",
          "wordCount": 1503,
          "title": "Postřehy z bezpečnosti: velká úroda malwaru i zranitelností",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/213/malware-1.jpg",
            "length": "57907",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15677",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Canonical vydal veřejnou betu Ubuntu 21.10 „Impish Indri“. Tým kolem operačního systému FreeBSD plánuje změnit výchozí root shell. Operační systém LineageOS 18.1 rozšířil seznam podporovaných zařízení.",
          "link": "https://www.root.cz/clanky/distribucni-vestnik-ubuntu-21-10-v-bete-lineageos-podporuje-nova-zarizeni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-26T22:00:05.000Z",
          "wordCount": 1141,
          "title": "Distribuční věstník: Ubuntu 21.10 v betě, LineageOS podporuje nová zařízení",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/537/ubuntu-21-10-impish-indri-1.jpg",
            "length": "13671",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15680",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Beta verze Ubuntu 21.10, MidnightBSD 2.1 přechází na LLVM 10, Apple vydal iPhony 13, nabídne i ProRes video, vývojová verze Wine 6.18, Joe Biden jmenoval šéfku AMD do svého poradního týmu, AMD a Mediatek dohromady.",
          "link": "https://www.root.cz/clanky/novy-textovy-editor-pro-gnome-100procentne-evropske-risc-v-procesory-epi-epac10/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-25T22:00:00.000Z",
          "wordCount": 1586,
          "title": "Nový textový editor pro GNOME, 100% evropské RISC-V procesory EPI EPAC1.0",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/252/dr-lisa-su-1.jpg",
            "length": "21252",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15678",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Exekutivě Evropské unie došla trpělivost a chystá nařízení, kterým sjednotí roztříštěný svět nabíječek (nejen) smartphonů. Postihne to všechny, kdo se vymykají standardu USB-C, v čele s Apple.",
          "link": "https://www.root.cz/clanky/evropska-komise-chce-jednotnou-nabijecku-s-usb-c-a-power-delivery/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-23T22:00:10.000Z",
          "wordCount": 2110,
          "title": "Evropská komise chce jednotnou nabíječku s USB-C a Power Delivery",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/485/usb-c-1.jpg",
            "length": "22817",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "Root.cz - zprávičky",
      "feedUrl": "https://www.root.cz/rss/zpravicky/",
      "siteUrl": "https://www.root.cz/zpravicky/",
      "articles": [
        {
          "id": "www.root.cz-actuality-42864",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "USB Implementers Forum se snaží novými obrázky zjednodušit označení USB-C kabelů, které je v současnosti dosti složité. Nově bude logo označovat kabely a nabíječky, které umí přenést 240 W, což umožňuje nově Power Delivery od května letošního roku. Do té doby bylo možné přenášet 65 či 100 W.",
          "link": "https://www.root.cz/zpravicky/nova-loga-pro-usb-c-kabely/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-01T13:31:16.000Z",
          "wordCount": 2943,
          "title": "Nová loga pro USB-C kabely",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/485/usb-c-1.jpg",
            "length": "22817",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42863",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Integrované grafické karty Intel umožňují stejně jako CPU řadit úlohy podle priority. Ale v současnosti ovladač i915 neumožňuje uživateli do priorit zasahovat. Vývojář ovladače Intelu Tvrtko Ursulin poslal velmi ranou verzi, která nastavení priorit pro GPU s ovladačem i915 umožňuje.",
          "link": "https://www.root.cz/zpravicky/intel-pracuje-na-prioritach-pro-integrovane-gpu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-01T13:12:01.000Z",
          "wordCount": 933,
          "title": "Intel pracuje na prioritách pro integrované GPU",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/627/cpu-intel-proceso-1.jpg",
            "length": "87070",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-41285",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "VPN umožňuje bezpečně propojit různá zařízení pomocí šifrovaných tunelů. Umožňuje také zapojit uživatele do vnitřní sítě přes zabezpečený přístupový bod. Na našem školení VPN a bezpečné připojení k síti s OpenVPN si prakticky ukážeme, jak to celé nastavit a zprovoznit.",
          "link": "https://www.root.cz/zpravicky/vytvorte-si-bezpecnou-vpn-pomoci-openvpn-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-01T08:27:14.000Z",
          "wordCount": 778,
          "title": "Vytvořte si bezpečnou VPN pomocí OpenVPN (školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/102/openvpn-logo-1.jpg",
            "length": "18777",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42862",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Výzkumníci z univerzit ve Velké Brtitánii a z DeepMind, který je vlastněný Google, vytvořili umělou inteligenci schopnou přesně krátkodobě předpovídat srážky. Předpověď má platnost do dvou hodin, používá se pro ni anglický termín nowcast na rozdíl od běžné předpovědi na den až tři dopředu forecast. Tyto krátkodobé předpovědi používají jen data ze srážkového radaru.",
          "link": "https://www.root.cz/zpravicky/ai-pro-kratkodobou-predpoved-pocasi/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-01T08:23:12.000Z",
          "wordCount": 6402,
          "title": "AI pro krátkodobou předpověď počasí",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/595/bourka-blesk-mrak-dest-1.jpg",
            "length": "20450",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42861",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Jak už bylo certifikační autoritou Let's Encrypt předem avizováno, 30. září 2021 ve 14:00 UTC došlo k expiraci kořenového certifikátu DST Root CA, který byl používán jako dočasný po několik let. V zásadě by nemělo dojít k potížím, protože Let's Encrypt CA používá ISRG Root X1 pro RSA nebo ISRG Root X2 pro ECDSA již mnoho měsíců.",
          "link": "https://www.root.cz/zpravicky/vyprsel-korenovy-certifikat-dst-root-ca-pouzivany-autoritou-let-s-encrypt/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-30T21:09:10.000Z",
          "wordCount": 2986,
          "title": "Vypršel kořenový certifikát DST Root CA používaný autoritou Let's Encrypt",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/65/let-s-encrypt-logo-1.jpg",
            "length": "26850",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42860",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Zhruba před 11 lety přišel Intel s velmi kontroverzním a negativně vnímaným programem Upgrade Service. V rámci něj bylo možné u vybraných CPU za úplatek odemknout do té doby neaktivní části CPU a zvýšit tak jeho parametry (tu odemknout HyperThreading, tu zvýšit frekvence, tu zvětšit cache). Program by přijat s odporem IT komunity a víceméně během roku 2011 vyšuměl do ztracena.",
          "link": "https://www.root.cz/zpravicky/intel-software-defined-silicon-sdsi-softwarove-upgrady-cpu-se-vraci-na-scenu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-29T14:54:38.000Z",
          "wordCount": 5724,
          "title": "Intel Software Defined Silicon (SDSi), softwarové upgrady CPU se vrací na scénu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/338/pat-gelsinger-intel-s-ponte-vecchio-1.jpg",
            "length": "44408",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42859",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "AMD představila svoji vizi pro příští čtyři roky. Firma věří, že do roku 2025 dosáhnou její procesory 30× vyšší efektivity při běhu AI a HPC úloh. Slovem procesory jsou zde myšleny jak modely řady EPYC, tak GPU typu (Radeon) Instinct.",
          "link": "https://www.root.cz/zpravicky/amd-chce-30-efektivnejsi-ai-na-cpu-i-gpu-do-roku-2025/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-29T14:23:02.000Z",
          "wordCount": 1144,
          "title": "AMD chce 30× efektivnější AI na CPU i GPU do roku 2025",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/607/radeon-instinct.jpg",
            "length": "30510",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42858",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Vydání pětatřicáté Fedory se blíží, máme tu beta verzi a s ní i přijatelně fungující možnost vyzkoušet si nejen čerstvé GNOME 41, ale také další novinky, kterými Fedora posouvá linuxový desktop zase více do budoucnosti (v čele třeba s projektem PipeWire). Ostrá verze bude vydána na konci října, beta je k dispozici mimo jiné v podobě Workstation, Server i IoT, samozřejmě pak též v podobě Spinů (s jinými desktopovými prostředími) a Lab(s)ů (předpřipravená pro specifické potřeby) a také pro platformu ARM.",
          "link": "https://www.root.cz/zpravicky/fedora-linux-35-beta-vyzkousejte-si-gnome-41/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-29T09:49:46.000Z",
          "wordCount": 1059,
          "title": "Fedora Linux 35 Beta, vyzkoušejte si GNOME 41",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/563/gnome-1.jpg",
            "length": "37205",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-39289",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "HTTPS se stává běžným, většina webů už ho nasadila. Jak to ale udělat správně, opravdu bezpečně a hlavně bezbolestně? Na školení HTTPS pro správce serverů si ukážeme si nejnovější trendy, prakticky si vyzkoušíme vygenerování certifikátu a nasazení na web server.",
          "link": "https://www.root.cz/zpravicky/https-pro-spravce-serveru-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-29T08:26:52.000Z",
          "wordCount": 782,
          "title": "HTTPS pro správce serverů (online školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/131/https-1.jpg",
            "length": "50861",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42857",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Před lety varoval tehdejší šéf Intelu Brian Krzanich před tím, aby AMD získalo 15–20% podíl v serverech (resp. že jej získá), na úkor firemních výdělečných Xeonů. Intel ale stále není schopen dodat novou generaci Xeonů v množství dostatečném pro saturování zákazníků, takže ti častěji pokukují po EPYCech od AMD, které ostatně nabízí lepší parametry.",
          "link": "https://www.root.cz/zpravicky/amd-dosahla-16-podilu-v-serverech-xeony-ice-lake-stale-nedostatkove/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-28T10:53:13.000Z",
          "wordCount": 1273,
          "title": "AMD dosáhla 16% podílu v serverech, Xeony Ice Lake stále nedostatkové",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/612/lisa-su-s-64core-amd-epyc-rome-1.jpg",
            "length": "41520",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42856",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Electronic Frontier Foundation se připravuje na postupné ukončení podpory pro rozšíření HTTPS Everywhere, které na webech automaticky přepíná z HTTP na HTTPS. To už podle organizace začíná být zbytečné, protože rozšíření HTTPS zažilo v posledních letech výrazný nárůst a prohlížeče navíc přišly s vlastním řešením automatického přechodu na HTTPS.",
          "link": "https://www.root.cz/zpravicky/rozsireni-https-everywhere-miri-do-duchodu-uz-neni-potreba/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-27T12:15:46.000Z",
          "wordCount": 1340,
          "title": "Rozšíření HTTPS Everywhere míří do důchodu, už není potřeba",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/483/https-1.jpg",
            "length": "37159",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42855",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Vývojáři uvolnili novou verzi balíku OpenSSH s označením 8.8. Hlavní novinkou je vypnutí podpory protokolu ssh-rsa, který staví na slabém hašovacím algoritmu SHA-1. Na změnu upozorňovalo několik předchozích verzí, většina uživatelů si navíc ničeho nevšimne, protože OpenSSH podporuje algoritmy RSA/SHA-256/512 (RFC8332) od verze 7.2 a automaticky je použije.",
          "link": "https://www.root.cz/zpravicky/openssh-8-8-vypina-podporu-protokolu-ssh-rsa/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-27T12:03:01.000Z",
          "wordCount": 2292,
          "title": "OpenSSH 8.8 vypíná podporu protokolu ssh-rsa",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/218/openssh-1.jpg",
            "length": "23624",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42853",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Na Kickstarteru před několika dny začala kampaň na novou verzi kamery OAK-D-Lite. Umožní snadno a rychle vytvořit aplikaci, která bude pracovat s obsahem videa. Může například rozpoznávat SPZ, překládat znakový jazyk, rozpoznávat gesta rukou a podobně.",
          "link": "https://www.root.cz/zpravicky/kampan-na-programovatelnou-kameru-oak-d-lite-na-kickstarteru/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-27T11:22:03.000Z",
          "wordCount": 962,
          "title": "Kampaň na programovatelnou kameru OAK-D-Lite na Kickstarteru",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/372/oak-d-lite-1.jpg",
            "length": "48912",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42854",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Dňa 29. 9. 2021 od 18:00 do 20:00, 23. stretnutie komunity ohľadne technológií Cloud Native – Kubernetes – ONLINE",
          "link": "https://www.root.cz/zpravicky/23-stretnutie-komunity-ohladne-technologii-cloud-native-kubernetes-online/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-27T11:11:58.000Z",
          "wordCount": 817,
          "title": "23. stretnutie komunity ohľadne technológií Cloud Native – Kubernetes - ONLINE",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/122/kubernetes-1.jpg",
            "length": "21058",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-40262",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Většina počítačových programů generuje logy – tedy zprávy a záznamy o své činnosti. ELK Stack – ElasticSearch, Logstash, Kibana – je populární nástroj, který umí logy efektivně zpracovávat, ukládat a zpřístupňovat.",
          "link": "https://www.root.cz/zpravicky/elk-stack-naucte-se-elasticsearch-logstach-a-kibana-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-27T09:53:21.000Z",
          "wordCount": 796,
          "title": "ELK Stack: naučte se Elasticsearch, Logstash a Kibana (školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/244/elk-logo-1.png",
            "length": "100652",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42851",
          "author": "redakce@root.cz (Root.cz: klokan)",
          "description": "Server This Week in Rust přinesl odkaz na zajímavý článek z pera tří vývojářů projektu Chromium. Autoři v něm rozvíjejí myšlenku implementovat v C++ stejná, nebo alespoň podobná pravidla paměťové bezpečnosti na úrovni typového systému, jako má Rust (tzv. Borrow Checking).",
          "link": "https://www.root.cz/zpravicky/uvahy-o-borrow-checkeru-pro-c/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-25T10:43:21.000Z",
          "wordCount": 17454,
          "title": "Úvahy o Borrow Checkeru pro C++",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/116/fustrovany-programator-1.jpg",
            "length": "53261",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42850",
          "author": "redakce@root.cz (Root.cz: spajk)",
          "description": "Společnost Brave, známá především svým internetovým prohlížečem zaměřeným na soukromí představila novou službu na bezpečné videohovory. Jmenuje se Brave Talk, v základu je zdarma, běží na Jitsi as a Service a je open-source. Začít můžete na talk.brave.com.",
          "link": "https://www.root.cz/zpravicky/brave-vydal-brave-talk-sluzbu-pro-bezpecne-videohovory/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-24T13:35:15.000Z",
          "wordCount": 2702,
          "title": "Brave vydal Brave Talk: službu pro bezpečné videohovory",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/28/brave-talk-1.jpg",
            "length": "47485",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42849",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Vývojáři uvolnili konečnou betaverzi připravovaného Ubuntu 21.10 s kódovým označením Impish Indri (rošťácký lemur). Vše jde podle připraveného časového harmonogramu, čeká nás ještě kandidát na vydání a poté přijde 14. října ostrá verze.",
          "link": "https://www.root.cz/zpravicky/vysla-konecna-betaverze-ubuntu-21-10-vydani-je-planovano-na-14-rijna/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-24T10:35:29.000Z",
          "wordCount": 1332,
          "title": "Vyšla konečná betaverze Ubuntu 21.10, vydání je plánováno na 14. října",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/537/ubuntu-21-10-impish-indri-1.jpg",
            "length": "13671",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-40036",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Na internetu píšou, že začít s automatizací správy serverů můžete do půl hodiny. Dokážeme vám, že s Ansible to je pravda. Stačí navštívit naše pražské školení Ansible – úvod do automatizace a pak navazující Ansible – role a AWX.",
          "link": "https://www.root.cz/zpravicky/ansible-uvod-do-automatizace-role-a-awx-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-24T09:51:46.000Z",
          "wordCount": 802,
          "title": "Ansible: úvod do automatizace, role a AWX (školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/330/ansible-1.jpg",
            "length": "20637",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42848",
          "author": "redakce@root.cz (Root.cz: D.A. Tiger)",
          "description": "Sourcetrail je open-source program, který slouží k statické analýze a vizualizaci zdrojových kódů v jazycích C, C++ a Python. Dnes jeho vývojáři na svém blogu oznámili ukončení jeho vývoje.",
          "link": "https://www.root.cz/zpravicky/sourcetrail-konci-vyvoj-je-prilis-narocny/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-24T07:20:16.000Z",
          "wordCount": 1898,
          "title": "Sourcetrail končí, vývoj je příliš náročný",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/343/sourcetrail-1.jpg",
            "length": "23300",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42846",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Na základě článku laboratoře QRATOR labs firma MikroTik na svých stránkách upozorňuje na další vlnu DDoS útoků.",
          "link": "https://www.root.cz/zpravicky/mikrotik-zaziva-dalsi-vlnu-ddos-utoku/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-23T07:13:54.000Z",
          "wordCount": 5121,
          "title": "MikroTik zažívá další vlnu DDoS útoků",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/639/mikrotik-1.jpg",
            "length": "30507",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42847",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Vývojáři uvolnili pravidelnou půlroční aktualizaci desktopového prostředí GNOME, tentokrát s označením 41. Mezi hlavní novinky patří vylepšení správce software, nastavení multitaskingu a vylepšení power managementu. Kromě toho je tu nová aplikace Connections, aktualizovaná aplikace Music a vylepšení výkonu v celé řadě komponent.",
          "link": "https://www.root.cz/zpravicky/gnome-41-prinasi-vylepseni-vykonu-a-novinky-v-podpore-waylandu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-23T07:10:05.000Z",
          "wordCount": 814,
          "title": "GNOME 41 přináší vylepšení výkonu a novinky v podpoře Waylandu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/563/gnome-1.jpg",
            "length": "37205",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42845",
          "author": "redakce@root.cz (Root.cz: LD)",
          "description": "Včera večer byla vydána opravná verze VMware vCenter 6.5, 6.7 a 7.0. Tato nová sada verzí opravuje několik kritických zranitelností, od XSS, přístupu k skrytým endpointům API, neoprávněnou manipulaci s nastavením sítě virtuálních strojů, vzdálené mazání souborů na vCenteru až po asi nejzávažnější vzdálené spuštění kódu.",
          "link": "https://www.root.cz/zpravicky/rada-kritickych-chyb-ve-vmware-vcenter/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T20:42:02.000Z",
          "wordCount": 1164,
          "title": "Řada kritických chyb ve VMware vCenter",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/295/vmware-1.jpg",
            "length": "60135",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42844",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Možná nejvýznačnější novinkou v Chrome/Chromium 94 pro uživatele je to, že element canvas je nyní implicitně kalibrován na barevný prostor sRGB, nicméně stránka může specifikovat jiný, podporován je i DCI-P3. Pete LaPage dále doporučuje na web.dev věnovat pozornost textu Eugena Zemtsova o WebCodecs s příklady využití přímého videa pomocí hardwarově akcelerovaných kodeků, které již prohlížeč má (aneb blíží se konec nutnosti dodávat v kódu vlastní neakcelerovanou WASM verzi kodeků). Podpora kodeků skrze WebCodecs se týká jak přehrávání, tak komprese.",
          "link": "https://www.root.cz/zpravicky/chrome-94-nasazuje-srgb-u-elementu-canvas-a-pridava-webgpu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T15:45:46.000Z",
          "wordCount": 876,
          "title": "Chrome 94 nasazuje sRGB u elementu canvas a přidává WebGPU",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/328/chrome-1.jpg",
            "length": "14231",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42843",
          "author": "redakce@root.cz (Root.cz: spajk)",
          "description": "Test deseti webových prezentací politických stran odhalil v pěti případech kritické zranitelnosti, nejčastěji se jednalo o cross-site scripting, objevily se ale zranitelné zastaralé knihovny a v jednom případě také děravý jedenáct let starý Apache. Více ve zprávě na webu spajk.cz.",
          "link": "https://www.root.cz/zpravicky/webove-stranky-politickych-stran-obsahuji-zranitelnosti/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T08:12:18.000Z",
          "wordCount": 4457,
          "title": "Webové stránky politických stran obsahují zranitelnosti",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/208/xss-notebook-1.jpg",
            "length": "64540",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "abclinuxu - aktuální články",
      "feedUrl": "http://www.abclinuxu.cz/auto/abc.rss",
      "siteUrl": "http://www.abclinuxu.cz/clanky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-elektronika-s-elektrony-se-zapornou-hmotnosti",
          "author": "Redakce",
          "description": "Podivný model chování elektronů, kupodivu v nijak zvlášť exotických polovodičích. Zrcadlo lape vlhkost i ve vedru. Jak vůbec funguje zhroucení hvězdy? Kromě temné hmoty chybí ve vesmíru i ta běžná.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-elektronika-s-elektrony-se-zapornou-hmotnosti",
          "publishedOn": "2021-10-02T22:01:00.000Z",
          "wordCount": 1718,
          "title": "Týden na ScienceMag.cz: Elektronika s elektrony se zápornou hmotností"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/goodoffer24-dozivotni-licence-windows-10-pouze-za-12-super-slevy-az-91-2",
          "author": "Reklama",
          "description": "Stále máte šanci koupit na GoodOffer24.com doživotní licenci na Windows 10 pouze za 12  €. Buď si můžete vybrat z nabízených bundlů, nebo projet celý web GoodOffer24.com. Hlavně nezapomeňte zadat před dokončením nákupu slevový kód AX30.",
          "link": "http://www.abclinuxu.cz/clanky/goodoffer24-dozivotni-licence-windows-10-pouze-za-12-super-slevy-az-91-2",
          "publishedOn": "2021-10-02T10:00:00.000Z",
          "wordCount": 1433,
          "title": "GoodOffer24: Doživotní licence Windows 10 pouze za 12 €, super slevy až 91%!"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-39-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-39-2021",
          "publishedOn": "2021-10-01T22:01:00.000Z",
          "wordCount": 2178,
          "title": "Událo se v týdnu 39/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/distribucni-novinky-36-37-2021",
          "author": "Redakce",
          "description": "Na sklonku léta vyšel nový Whonix, podíváme se na systém pro klientské stanice ThinStation a aktualizovány byly také distribuce Finnix, Lakka, GhostBSD, Tails, Kali, Ubuntu LTS, Sailfish OS nebo Sparky Linux.",
          "link": "http://www.abclinuxu.cz/clanky/distribucni-novinky-36-37-2021",
          "publishedOn": "2021-09-29T00:00:00.000Z",
          "wordCount": 1921,
          "title": "Distribuční novinky 36-37/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/chcete-vedet-kolik-byste-mohli-vydelavat-u-konkurence-na-stejne-pozici",
          "author": "Reklama",
          "description": "Peníze jsou ožehavé téma, obzvlášť jedná-li se o výplaty v zaměstnání. Člověk přemýšlí, zda kolegové nevydělávají víc nebo jestli by si u jiného zaměstnavatele nepolepšil. Jak to ale zjistit? Teď naštěstí jednoduše, protože IT pracovní portál No Fluff Jobs u všech nabídek zveřejňuje nabízené platové ohodnocení.",
          "link": "http://www.abclinuxu.cz/clanky/chcete-vedet-kolik-byste-mohli-vydelavat-u-konkurence-na-stejne-pozici",
          "publishedOn": "2021-09-26T22:01:00.000Z",
          "wordCount": 1393,
          "title": "Chcete vědět kolik byste mohli vydělávat u konkurence na stejné pozici?"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-umela-inteligence-uprostred-jihoamerickych-lesu-pomaha-zachranit-psiho-samotare",
          "author": "Redakce",
          "description": "Video, se kterým konečně pochopíte rozdíl mezi běžným a moderním úložištěm. Digitalizace zákaznické péče: jak vybrat nejlepší řešení kontaktního centra. Jaké novinky přináší Arcserve UDP 8.1? On-line konference VMworld 2021: stovky přednášek a tutoriálů zdarma. Gartner na křivce seřadil klíčové nastupující technologie. Studie Dell Technologies: hrozba ztráty dat po kyberútoku je větší, než kdy jindy. Umělá inteligence uprostřed jihoamerických lesů pomáhá zachránit psího samotáře.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-umela-inteligence-uprostred-jihoamerickych-lesu-pomaha-zachranit-psiho-samotare",
          "publishedOn": "2021-09-25T22:01:00.000Z",
          "wordCount": 1789,
          "title": "Týden na ITBiz: Umělá inteligence uprostřed jihoamerických lesů pomáhá zachránit psího samotáře"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-38-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-38-2021",
          "publishedOn": "2021-09-24T22:01:00.000Z",
          "wordCount": 2692,
          "title": "Událo se v týdnu 38/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-planety-v-centru-mlecne-drahy",
          "author": "Redakce",
          "description": "Moudrost davu. Dokážeme úspěšně předpovědět, kdy k nám dorazí světlo supernovy? Kvasary jako standardní svíčky. Neutron má na povrchu záporný náboj. Proč se zlato vyskytuje vedle arsenu.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-planety-v-centru-mlecne-drahy",
          "publishedOn": "2021-09-23T22:30:00.000Z",
          "wordCount": 1702,
          "title": "Týden na ScienceMag.cz: Planety v centru Mléčné dráhy"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-komunikace-ma-zvysovat-produktivitu-vyvojaru",
          "author": "Redakce",
          "description": "Hlavní trendy umělé inteligence: Malá a rozprostřená data. Nový typ kybernetických útoků – zneužívání proxyware platforem. Roboti, kteří udělají přesnou díru do hlavy, zachraňují životy. O vstupu do nebe rozhoduje sv. Petr, pro síť je tu ClearPass. Kouzla zbavené? Nepravděpodobné řešení hrozící personální krize ve finančních službách. Honeywell u nás investuje do R&D. Komunikace má zvyšovat produktivitu vývojářů.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-komunikace-ma-zvysovat-produktivitu-vyvojaru",
          "publishedOn": "2021-09-19T22:01:00.000Z",
          "wordCount": 1865,
          "title": "Týden na ITBiz: Komunikace má zvyšovat produktivitu vývojářů"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-prepinane-zrcadlo-z-roztaveneho-kovu",
          "author": "Redakce",
          "description": "Černá díra vyžrala hvězdu. Nanotechnologie s černým oxidem titaničitým. Život v atmosféře subneptunů. Maličké hory na neutronových hvězdách.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-prepinane-zrcadlo-z-roztaveneho-kovu",
          "publishedOn": "2021-09-18T22:01:00.000Z",
          "wordCount": 1689,
          "title": "Týden na ScienceMag.cz: Přepínané zrcadlo z roztaveného kovu"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-37-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-37-2021",
          "publishedOn": "2021-09-17T22:01:00.000Z",
          "wordCount": 2688,
          "title": "Událo se v týdnu 37/2021"
        }
      ]
    },
    {
      "title": "abclinuxu - čerstvé zprávičky",
      "feedUrl": "http://www.abclinuxu.cz/auto/zpravicky.rss",
      "siteUrl": "http://www.abclinuxu.cz/zpravicky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/zpravicky/hardwarovy-a-softwarovy-pruzkum-steamu-09-2021",
          "author": "Ladislav Hagara",
          "description": "Společnost Valve aktualizovala přehled o hardwarovém a softwarovém vybavení uživatelů služby Steam. Podíl uživatelů Linuxu aktuálně činí 1,05 %. Nejčastěji používanou linuxovou distribucí je Ubuntu 20.04.3 LTS 64 bit. Přehled her oficiálně podporujících SteamOS a Linux na stránkách Steamu. Přehled her pro Windows běžících na Linuxu díky Protonu na stránkách ProtonDB.",
          "link": "http://www.abclinuxu.cz/zpravicky/hardwarovy-a-softwarovy-pruzkum-steamu-09-2021",
          "publishedOn": "2021-10-02T18:14:54.000Z",
          "wordCount": 990,
          "title": "Hardwarový a softwarový průzkum Steamu - 09/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/problemy-s-vyprsenim-korenoveho-certifikatu-dst-root-ca-x3-certifikacni-autority-let-s-encrypt",
          "author": "Ladislav Hagara",
          "description": "Kořenový certifikát DST Root CA X3 certifikační autority Let's Encrypt ve čtvrtek 30. září vypršel. Většina systémů, webových prohlížečů a služeb s tím neměla problém. Našly se ale i výjimky. Například aktualizace balíčků ve Void Linuxu.",
          "link": "http://www.abclinuxu.cz/zpravicky/problemy-s-vyprsenim-korenoveho-certifikatu-dst-root-ca-x3-certifikacni-autority-let-s-encrypt",
          "publishedOn": "2021-10-02T15:46:20.000Z",
          "wordCount": 952,
          "title": "Problémy s vypršením kořenového certifikátu DST Root CA X3 certifikační autority Let's Encrypt"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/nova-verzia-suboroveho-manazera-vifm",
          "author": "jose17",
          "description": "Po roku vyšla nová verzia Vifm - konzolového manažéra súborov inšpirovaného editorom Vim. Pribudla podpora pre asynchrónne textové náhľady, pluginy v Lua (experimentálne) a 24-bitové farby. Prehľad ďalších noviniek v oznámení, podrobnosti v changelogu.",
          "link": "http://www.abclinuxu.cz/zpravicky/nova-verzia-suboroveho-manazera-vifm",
          "publishedOn": "2021-10-01T18:26:06.000Z",
          "wordCount": 1027,
          "title": "Nová verzia súborového manažéra Vifm"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/fairphone-4",
          "author": "Fluttershy, yay!",
          "description": "Firma Fairphone otevřela objednávky smartphone Fairphone 4 s Androidem 11 a pětiletou zárukou (Fairphone udržuje vydání Androidu i po skončení oficiální podpory). Ačkoliv se výrobce snaží o opravitelnost, použití etičtěji získaných materiálů atd., model Fairphone 4 nemá 3,5mm jack pro sluchátka, a tak je nutné dokoupit buď převodník pro zpětnou kompatibilitu, nebo použít bezdrátová sluchátka.",
          "link": "http://www.abclinuxu.cz/zpravicky/fairphone-4",
          "publishedOn": "2021-09-30T21:33:58.000Z",
          "wordCount": 3588,
          "title": "Fairphone 4"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/magpi-110-hackspace-47-a-wireframe-54",
          "author": "Ladislav Hagara",
          "description": "Nová čísla časopisů od nakladatelství Raspberry Pi: MagPi 110 (pdf), HackSpace 47 (pdf) a  Wireframe 54 (pdf).",
          "link": "http://www.abclinuxu.cz/zpravicky/magpi-110-hackspace-47-a-wireframe-54",
          "publishedOn": "2021-09-30T15:33:36.000Z",
          "wordCount": 910,
          "title": "MagPi 110, HackSpace 47 a Wireframe 54"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/postgresql-14",
          "author": "Ladislav Hagara",
          "description": "Byl vydán PostgreSQL ve verzi 14.0. Přehled novinek v poznámkách k vydání.",
          "link": "http://www.abclinuxu.cz/zpravicky/postgresql-14",
          "publishedOn": "2021-09-30T13:33:47.000Z",
          "wordCount": 891,
          "title": "PostgreSQL 14"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/qt-6.2-lts-qt-6.2-for-android-a-qt-design-studio-2.2",
          "author": "Ladislav Hagara",
          "description": "Byla vydána nová stabilní verze 6.2 multiplatformního frameworku a GUI toolkitu Qt. Více v přehledu novinek. Jedná se o LTS verzi. Dlouhodobá podpora je ale pouze pro držitele komerční licence. Současně bylo vydáno Qt 6.2 for Android a Qt Design Studio 2.2.",
          "link": "http://www.abclinuxu.cz/zpravicky/qt-6.2-lts-qt-6.2-for-android-a-qt-design-studio-2.2",
          "publishedOn": "2021-09-30T11:33:48.000Z",
          "wordCount": 1028,
          "title": "Qt 6.2 LTS, Qt 6.2 for Android a Qt Design Studio 2.2"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/kea-2.0.0",
          "author": "Ladislav Hagara",
          "description": "Vývojáři open source DHCPv4 a DHCPv6 serveru Kea (Wikipedie) oznámili vydání nové stabilní verze 2.0.0. Přehled novinek v příspěvku na blogu.",
          "link": "http://www.abclinuxu.cz/zpravicky/kea-2.0.0",
          "publishedOn": "2021-09-29T21:27:01.000Z",
          "wordCount": 1286,
          "title": "Kea 2.0.0"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/soutez-pro-mlade-programatory-youth-hacking-4-freedom-yh4f",
          "author": "Ladislav Hagara",
          "description": "Free Software Foundation Europe (FSFE) organizuje soutěž pro mladé programátory ve věku 14 až 18 let s názvem Youth Hacking 4 Freedom (YH4F). Zaregistrovat se mohou do 31. října. Na vývoj svého svobodného softwaru budou mít pět měsíců, tj. do konce března. Šest nejlepších získá peněžitou výhru (2 x 4 096 €, 2 x 2 048 €, 2 x 1 024 €) a výlet do Bruselu.",
          "link": "http://www.abclinuxu.cz/zpravicky/soutez-pro-mlade-programatory-youth-hacking-4-freedom-yh4f",
          "publishedOn": "2021-09-28T23:52:15.000Z",
          "wordCount": 1023,
          "title": "Soutěž pro mladé programátory: Youth Hacking 4 Freedom (YH4F)"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/intel-software-defined-silicon-sdsi",
          "author": "Ladislav Hagara",
          "description": "Intel poslal do Linuxu patche přinášející podporu pro Intel Software Defined Silicon (SDSi). Uživatelé procesorů Xeon budou moci získat licence pro další funkce procesoru.",
          "link": "http://www.abclinuxu.cz/zpravicky/intel-software-defined-silicon-sdsi",
          "publishedOn": "2021-09-28T22:55:57.000Z",
          "wordCount": 1377,
          "title": "Intel Software Defined Silicon (SDSi)"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Fairphone-4-Linux-Patches",
          "author": null,
          "description": "Announced this week was the Fairphone 4 as the latest iteration of this smartphone focused on being \"sustainable and ethical\" and now the initial patches have been sent out for providing mainline Linux kernel support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Fairphone-4-Linux-Patches",
          "publishedOn": "2021-10-03T09:48:48.000Z",
          "wordCount": 882,
          "title": "Initial Linux Kernel Patches Posted For The Fairphone 4"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Compute-21.39.21127",
          "author": null,
          "description": "Intel's newest weekly Compute-Runtime update providing open-source OpenCL and oneAPI Level Zero support for their graphics hardware is now reader with broader support for upcoming Alder Lake S processors...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Compute-21.39.21127",
          "publishedOn": "2021-10-03T09:30:40.000Z",
          "wordCount": 776,
          "title": "Intel Compute-Runtime 21.39.21127 Brings Broader Alder Lake S Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=OpenBLAS-0.3.18-Released",
          "author": null,
          "description": "OpenBLAS 0.3.18 is out today as the latest feature update to this widely-used, open-source BLAS implementation...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=OpenBLAS-0.3.18-Released",
          "publishedOn": "2021-10-02T19:02:53.000Z",
          "wordCount": 735,
          "title": "OpenBLAS 0.3.18 Released With LoongArch64 Support, More Optimizations"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-oneAPI-2021.4",
          "author": null,
          "description": "Intel on Friday formally released their oneAPI Toolkits 2021.4 release as the latest collection of their various software components for a multi-vendor, multi-architecture software platform across CPUs and XPUs (GPUs / accelerators)...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-oneAPI-2021.4",
          "publishedOn": "2021-10-02T17:54:16.000Z",
          "wordCount": 853,
          "title": "Intel oneAPI 2021.4 Released With More Optimizations, Continues LLVM Adoption"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=helloSystem-0.6",
          "author": null,
          "description": "Version 0.6 of helloSystem is now available as the FreeBSD-based open-source operating system project taking design cues from Apple's macOS...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=helloSystem-0.6",
          "publishedOn": "2021-10-02T17:34:57.000Z",
          "wordCount": 755,
          "title": "helloSystem 0.6 Released For macOS-Inspired FreeBSD"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Facebook-Compiler-Gym",
          "author": null,
          "description": "Facebook this week announced the open-sourcing of CompilerGym as their effort to improve compiler performance by leveraging machine learning to tackle optimization work...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Facebook-Compiler-Gym",
          "publishedOn": "2021-10-02T09:53:37.000Z",
          "wordCount": 821,
          "title": "Facebook Is Aiming To Make Compilers Faster Using Machine Learning With CompilerGym"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Plasma-5.23-Less-KWin-Crashes",
          "author": null,
          "description": "Plasma 5.23 stable is due to be released in two weeks while until then KDE developers are scurrying to land more fixes in this next desktop update...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Plasma-5.23-Less-KWin-Crashes",
          "publishedOn": "2021-10-02T09:31:11.000Z",
          "wordCount": 801,
          "title": "Plasma 5.23 Lands More Last-Minute Fixes To Avoid Wayland Crashes"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=R300-Friday-Night-2021",
          "author": null,
          "description": "While earlier this year AMD shifted their Radeon Software driver focus to only supporting Polaris / GCN 1.4 and newer, when it comes to the open-source driver support on Linux there still is occasional activity going back to the ATI Radeon R300 days from nearly two decades ago...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=R300-Friday-Night-2021",
          "publishedOn": "2021-10-01T23:30:30.000Z",
          "wordCount": 1010,
          "title": "Nearly Two Decades Later, ATI Radeon R300 Linux Driver Sees Occasional Improvement"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=PipeWire-Better-Video-2021",
          "author": null,
          "description": "PipeWire from the start was designed around handling the needs of both audio and video streams on Linux. While PipeWire is already in use for screencasting/recording under Wayland and working with Flatpak'ed applications, recently much of PipeWire's focus has been on addressing the use-cases of JACK and PulseAudio on the sound side. Now that the audio support is in quite good shape, Red Hat engineers are back to focusing on improvements to the video support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=PipeWire-Better-Video-2021",
          "publishedOn": "2021-10-01T17:51:35.000Z",
          "wordCount": 871,
          "title": "Red Hat / Fedora To Focus On Driving New Linux Video Improvements Around PipeWire"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30571",
          "author": null,
          "description": "Given this week's release of Fedora 35 Beta I have begun my benchmarking to look at how this next installment of Fedora Linux is shaping up given that it tends to be at the forefront of open-source innovations given Red Hat's investments. For our initial F35 benchmarking is looking at the Fedora Server 35 Beta performance compared to Fedora 34 on a dual Intel Xeon Platinum 8380 server.",
          "link": "https://www.phoronix.com/vr.php?view=30571",
          "publishedOn": "2021-10-01T13:23:08.000Z",
          "wordCount": 790,
          "title": "Fedora Server 35 Performance Looking Good - Initial Benchmarks With Intel Xeon Ice Lake"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=LLVM-13.0-Released",
          "author": null,
          "description": "LLVM 13.0 was tagged overnight as the latest half-year update to this widely-used, very powerful open-source compiler stack...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=LLVM-13.0-Released",
          "publishedOn": "2021-10-01T13:02:40.000Z",
          "wordCount": 850,
          "title": "LLVM 13.0 Released With Official Flang Binary Packages, Improved OpenCL Clang Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=POCL-1.8-RC1-Released",
          "author": null,
          "description": "The first release candidate of the forthcoming PoCL 1.8 \"Portable Computing Language\" implementation is now available for testing...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=POCL-1.8-RC1-Released",
          "publishedOn": "2021-10-01T12:29:09.000Z",
          "wordCount": 703,
          "title": "PoCL 1.8 OpenCL Implementation Coming With LLVM 13 Support, Better SPIR-V On CUDA"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Armv9-GNU-Toolchain-Starting",
          "author": null,
          "description": "Arm engineers have begun landing their Armv9 enablement work in the GNU compiler toolchain...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Armv9-GNU-Toolchain-Starting",
          "publishedOn": "2021-10-01T11:22:00.000Z",
          "wordCount": 820,
          "title": "Arm Begins Adding Armv9 Support To The GNU Compiler Toolchain"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Proton-6.3-7-Plus-DLSS-Exp",
          "author": null,
          "description": "Valve published new versions of Proton and Proton Experimental last night...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Proton-6.3-7-Plus-DLSS-Exp",
          "publishedOn": "2021-10-01T09:10:12.000Z",
          "wordCount": 774,
          "title": "Proton Experimental Enables NVIDIA DLSS For D3D12 Games, Proton Now Handles More Games"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=September-2021-Highlights",
          "author": null,
          "description": "That's a wrap for September with 229 original news articles and another 13 featured Linux hardware reviews / multi-page benchmark articles, all written by your's truly. It was another eventful month with Linux 5.15 moving forward, a lot of driver activity by AMD and Intel, and other open-source milestones like the release of GNOME 41 and the shipping of the Ubuntu 21.10 and Fedora 35 beta releases...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=September-2021-Highlights",
          "publishedOn": "2021-10-01T04:00:00.000Z",
          "wordCount": 2730,
          "title": "Linux 5.15, AMD / Radeon Advancements, Intel SDSi Dominated Discussions This Month"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-CPU-GPU-Prio-Nice-Sched",
          "author": null,
          "description": "Intel's open-source Linux graphics driver engineers are evaluating possible improvements to the Linux kernel for accommodating CPU and GPU synchronized priority scheduling...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-CPU-GPU-Prio-Nice-Sched",
          "publishedOn": "2021-09-30T19:34:31.000Z",
          "wordCount": 960,
          "title": "Intel Exploring CPU+GPU Synchronized Priority Scheduling For Linux"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Linux-Audio-Guybrush",
          "author": null,
          "description": "In addition to Linux 5.15 adding a new AMD audio driver for \"Van Gogh\" APUs such as found in the forthcoming Steam Deck, AMD's open-source Linux driver engineers have also been working on other audio improvements -- this time on the Chromebook front...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Linux-Audio-Guybrush",
          "publishedOn": "2021-09-30T18:58:25.000Z",
          "wordCount": 810,
          "title": "New AMD Linux Audio Driver Patches Posted - Aimed For Enhancing Chromebook Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Loihi-2-Lava",
          "author": null,
          "description": "Intel has some new announcements around their neuromorphic computing research...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Loihi-2-Lava",
          "publishedOn": "2021-09-30T15:00:00.000Z",
          "wordCount": 843,
          "title": "Intel Announces Loihi 2, Lava Software Framework For Advancing Neuromorphic Computing"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.1M-IOPS-Per-Core",
          "author": null,
          "description": "Linux kernel developers have been working tirelessly to squeeze more performance out of IO_uring and the block / I/O code in general. IO_uring lead developer Jens Axboe who also serves as the Linux block subsystem's maintainer (among other roles and major contributions over the years) has used his system as a baseline for evaluating such kernel improvements. He's now moved to using AMD Zen 3 while sticking to Intel Optane storage and is seeing a mighty speed boost out of AMD's latest processors...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.1M-IOPS-Per-Core",
          "publishedOn": "2021-09-30T13:53:35.000Z",
          "wordCount": 910,
          "title": "Linux Achieves 5.1M IOPS Per-Core With AMD Zen 3 + Intel Optane"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=PostgreSQL-14",
          "author": null,
          "description": "PostgreSQL 14.0 is now officially available as the latest version of this widely-used, open-source SQL server...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=PostgreSQL-14",
          "publishedOn": "2021-09-30T13:19:19.000Z",
          "wordCount": 773,
          "title": "PostgreSQL 14.0 Released With More Performance Improvements"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=VirtIO-Linux-5.16-Ctx-Type",
          "author": null,
          "description": "Google's work on the VirtIO DRM kernel driver around the notion of \"context types\" and being able to initialize different types of contexts is set to be merged for Linux 5.16 in opening up more use-cases for this driver that is an important part of the open-source virtualization graphics stack for graphics...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=VirtIO-Linux-5.16-Ctx-Type",
          "publishedOn": "2021-09-30T12:29:44.000Z",
          "wordCount": 830,
          "title": "Linux 5.16 To Feature More Extensible VirtIO GPU Driver With \"Context Types\" Addition"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Qt-6.2-LTS-Released",
          "author": null,
          "description": "Qt 6.2 LTS is out today as the first long-term support release in the Qt6 series and also with all of the major modules now ported over from Qt5 in aiming to make this a suitable point to transition from Qt 5.15 LTS...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Qt-6.2-LTS-Released",
          "publishedOn": "2021-09-30T10:38:36.000Z",
          "wordCount": 943,
          "title": "Qt 6.2 LTS Released With Qt6 Now Aiming To Be Ready For Widespread Adoption"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMDVLK-2021.Q3.7",
          "author": null,
          "description": "AMD has pushed out one more code drop of their AMDVLK official open-source Vulkan driver before ending out the quarter...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMDVLK-2021.Q3.7",
          "publishedOn": "2021-09-30T10:09:48.000Z",
          "wordCount": 812,
          "title": "AMDVLK 2021.Q3.7 Driver Released With New Extensions, More Optimizations"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ampere-Altra-Max-Pricing",
          "author": null,
          "description": "From our Ampere Altra Max M128-30 Linux performance preview earlier this week, one of the questions a number of readers were wondering about and a question I also still had open was on the Altra Max pricing... I've now received the current price list and actually comes in much lower than expected for a 128-core CPU in 2021...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ampere-Altra-Max-Pricing",
          "publishedOn": "2021-09-30T09:55:28.000Z",
          "wordCount": 858,
          "title": "Ampere Altra Max 128-Core CPU Is Priced Lower Than Flagship Xeon, EPYC CPUs"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.2.3-Released",
          "author": null,
          "description": "Succeeding Mesa 21.2.2 from earlier this month that was a much delayed and in turn very large release, Mesa 21.2.3 is out today and it's on the quieter side...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.2.3-Released",
          "publishedOn": "2021-09-29T23:27:14.000Z",
          "wordCount": 802,
          "title": "Mesa 21.2.3 Released As A Small Update To This Graphics Driver Stack"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-pkill_on_warn",
          "author": null,
          "description": "A new kernel option was proposed today called \"pkill_on_warn\" that would kill all threads in a process if that process provoked a kernel warning...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-pkill_on_warn",
          "publishedOn": "2021-09-29T19:32:45.000Z",
          "wordCount": 821,
          "title": "\"pkill_on_warn\" Proposed For Killing Linux Processes That Cause A Kernel Warning"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=libcamera-2021",
          "author": null,
          "description": "Libcamera as an open-source camera stack that has been coming together over the past few years has been maturing quite well, broadening its supported hardware and feature set, and more in filling a void in the Linux camera ecosystem...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=libcamera-2021",
          "publishedOn": "2021-09-29T18:30:06.000Z",
          "wordCount": 807,
          "title": "Libcamera Maturing Well As Open-Source Camera Stack"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30568",
          "author": null,
          "description": "Recently I carried out some updated Windows 11 benchmarks against Linux to look at how this forthcoming Microsoft operating system release is competing with Ubuntu. In this article is a fresh look at the Windows Subsystem for Linux (WSL2) performance on the near-final Windows 11 against Ubuntu Linux.",
          "link": "https://www.phoronix.com/vr.php?view=30568",
          "publishedOn": "2021-09-29T13:18:02.000Z",
          "wordCount": 899,
          "title": "Windows 11 WSL2 Performance Is Quite Competitive Against Ubuntu 20.04 LTS / Ubuntu 21.10"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-30x-Energy-Efficiency-2025",
          "author": null,
          "description": "AMD this morning announced a goal of increasing the energy efficiency of EPYC processors running AI training and high performance workloads by 30x... Within the next four years...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-30x-Energy-Efficiency-2025",
          "publishedOn": "2021-09-29T13:09:14.000Z",
          "wordCount": 773,
          "title": "AMD Aims For 30x Energy Efficiency Improvement For AI Training + HPC By 2025"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=LibreOffice-Qt6-VCL",
          "author": null,
          "description": "Merged this morning into the LibreOffice code-base is the initial Qt6 VCL plug-in...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=LibreOffice-Qt6-VCL",
          "publishedOn": "2021-09-29T12:54:22.000Z",
          "wordCount": 727,
          "title": "LibreOffice Lands Initial Code For Qt6 Toolkit Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Zstd-Updated-For-Kernel-Soon",
          "author": null,
          "description": "While the Linux kernel is increasingly supporting the use of Zstd for various compression purposes, the current Zstd code within the kernel is out-of-date and efforts so far to re-base it against the closer to upstream Zstd state have been stalled. Fortunately, a new attempt at getting the Zstd code updated for the Linux kernel will be published soon...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Zstd-Updated-For-Kernel-Soon",
          "publishedOn": "2021-09-29T09:45:31.000Z",
          "wordCount": 834,
          "title": "Updated Zstd Implementation For The Linux Kernel Coming Soon"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-Better-VLK-Pre-Cache",
          "author": null,
          "description": "With the initial Steam Deck release quickly approaching, Valve continues to be quite busy on a variety of improvements to enhance their Steam Linux builds...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-Better-VLK-Pre-Cache",
          "publishedOn": "2021-09-29T00:51:22.000Z",
          "wordCount": 782,
          "title": "Steam Beta Improves Its Vulkan Pre-Caching System, PipeWire Capture Now Opt-In"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/rss.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2523/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2523/",
          "publishedOn": "2021-10-01T04:00:00.000Z",
          "wordCount": 183,
          "title": "Endangered"
        },
        {
          "id": "https://xkcd.com/2522/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2522/",
          "publishedOn": "2021-09-29T04:00:00.000Z",
          "wordCount": 187,
          "title": "Two-Factor Security Key"
        },
        {
          "id": "https://xkcd.com/2521/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2521/",
          "publishedOn": "2021-09-27T04:00:00.000Z",
          "wordCount": 183,
          "title": "Toothpaste"
        },
        {
          "id": "https://xkcd.com/2520/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2520/",
          "publishedOn": "2021-09-24T04:00:00.000Z",
          "wordCount": 183,
          "title": "Symbols"
        }
      ]
    }
  ],
  "cliVersion": "1.11.2"
}