{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": [
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "author": null,
          "description": "Fixed: Unexpected nested element in author field crashes the parser\nThank you @ad-m",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "publishedOn": "2021-09-16T06:39:32.000Z",
          "wordCount": 343,
          "title": "v1.11.1"
        }
      ]
    },
    {
      "title": "Kotaku",
      "feedUrl": "https://kotaku.com/rss",
      "siteUrl": "https://kotaku.com",
      "articles": [
        {
          "id": "1847694183",
          "author": "Brian Ashcraft",
          "description": "Right now, nineteen prefectures in Japan are under a state of emergency until September 30. But one of them, Chiba Prefecture, will host the Supersonic music festival at a baseball stadium this weekend. Zedd, along with Alan Walker and Steve Aoki, are among the international DJs flown in for the event.  \n“Finally made…\nRead more...",
          "link": "https://kotaku.com/zedd-just-showed-how-unfair-japans-travel-ban-is-1847694183",
          "publishedOn": "2021-09-17T10:30:00.000Z",
          "wordCount": 870,
          "title": "Zedd Just Showed The Unfairness Of Japan's Travel Ban"
        },
        {
          "id": "1847694156",
          "author": "John Walker",
          "description": "It’s hard to overstate the importance of Sir Clive Sinclair’s role in the world of computing. His inventing the ZX Spectrum home computer in 1980 radically changed the masses’ perception of, and access to, computers. His work created the path to not only gaming, but also the creation of games, by regular people. He…\nRead more...",
          "link": "https://kotaku.com/sir-clive-sinclair-father-of-home-computing-dies-aged-1847694156",
          "publishedOn": "2021-09-17T10:00:00.000Z",
          "wordCount": 977,
          "title": "Father Of Home Computing Sir Clive Sinclair Dies Aged 81"
        },
        {
          "id": "1847692859",
          "author": "Luke Plunkett",
          "description": "While people have been using Ikea stuff in the gaming space forever—right now I’m sitting on an Ikea office chair and using an Ikea desk—the Swedish company has never gone to the trouble of releasing dedicated gaming furniture before. That’s about to change\n\nRead more...",
          "link": "https://kotaku.com/ikeas-new-gaming-collection-looks-pretty-good-1847692859",
          "publishedOn": "2021-09-17T00:20:00.000Z",
          "wordCount": 480,
          "title": "Ikea's New Gaming Collection Looks Pretty Good"
        },
        {
          "id": "1847692615",
          "author": "Luke Plunkett",
          "description": "WipeOut is, very quietly, one of the most important video game series to have ever lived, thanks to its role in selling the original PlayStation as something genuinely “cool.” But it’s a franchise that has fallen on hard times of late.\n\nRead more...",
          "link": "https://kotaku.com/new-wipeout-game-announced-only-its-not-on-console-1847692615",
          "publishedOn": "2021-09-16T23:35:00.000Z",
          "wordCount": 425,
          "title": "New WipEout Game Announced, Only It's Not On Console"
        },
        {
          "id": "5878852",
          "author": "Kotaku Staff",
          "description": "PC gamers have got a pretty great thing going. Interesting, experimental indie games? Yup. Complex strategy simulations? Totally. The shiniest, prettiest versions of big-budget console games? They get a lot of those, too. Let’s say you’ve recently joined the ranks of the PC elite. Which games should you install? Start…\nRead more...",
          "link": "https://kotaku.com/the-12-best-games-on-pc-5878852",
          "publishedOn": "2021-09-16T22:15:00.000Z",
          "wordCount": 3949,
          "title": "The 15 Best Games on PC"
        },
        {
          "id": "1847691729",
          "author": "Ian Walker",
          "description": "Over the summer, Konami announced its killing of the Pro Evolution Soccer brand (known as Winning Eleven in Japan) by morphing the popular franchise into the free-to-play eFootball.\nRead more...",
          "link": "https://kotaku.com/konami-rolls-out-loot-box-pre-orders-1847691729",
          "publishedOn": "2021-09-16T21:25:00.000Z",
          "wordCount": 440,
          "title": "Konami Rolls Out Loot Box Pre-Orders"
        },
        {
          "id": "1847691005",
          "author": "Jeremy Winslow",
          "description": "Developer Sony Santa Monica has confirmed that God of War Ragnarök will complete the series’ Norse story when it launches next year, wrapping up Kratos’ bout with deities like Freya and Thor in just two games.\nRead more...",
          "link": "https://kotaku.com/god-of-war-ragnarok-will-wrap-story-because-trilogies-t-1847691005",
          "publishedOn": "2021-09-16T20:10:00.000Z",
          "wordCount": 673,
          "title": "God Of War Ragnarök Will Wrap Story Because Trilogies Take Too Long"
        },
        {
          "id": "1847690732",
          "author": "Renata Price",
          "description": "Pathfinder: Wrath of the Righteous, the recently released character RPG developed by Owlcat Games, seems really neat. I like the writing so far and the character work seems solid. But holy shit, it has possibly the most overwhelming character creator I’ve ever touched. If your game asks me to process 25 different…\nRead more...",
          "link": "https://kotaku.com/surprising-no-one-pathfinder-still-incredibly-confusin-1847690732",
          "publishedOn": "2021-09-16T19:45:00.000Z",
          "wordCount": 762,
          "title": "Surprising No One, Pathfinder Still Incredibly Confusing In Video Game Form"
        },
        {
          "id": "1847690358",
          "author": "Sisi Jiang",
          "description": "Genshin Impact got a strong new character in September, Raiden Shogun, and she’s already sending waves through the player community. While most of the reception has been positive, a vocal minority believe that developer miHoYo misled fans expecting Raiden to work well with an existing playable character.\n\nRead more...",
          "link": "https://kotaku.com/genshin-impact-fan-says-theyre-suing-devs-for-changing-1847690358",
          "publishedOn": "2021-09-16T19:30:00.000Z",
          "wordCount": 764,
          "title": "Genshin Impact Fan Says They're Suing Devs For Changing A Character"
        },
        {
          "id": "1847690206",
          "author": "Isaiah Colbert",
          "description": "Like a real-life Tomb Raider run sans picturesque vistas from an ancient civilization, a pair of YouTuber game hunters found themselves in an extremely messy room that had been locked for close to 20 years. But amid the filth, they found a treasure trove of factory-sealed video games, including mainstream hits like …\nRead more...",
          "link": "https://kotaku.com/youtube-duo-find-100-000-of-vintage-games-in-hoarder-s-1847690206",
          "publishedOn": "2021-09-16T19:00:00.000Z",
          "wordCount": 759,
          "title": "YouTube Duo Find $100,000 Of Vintage Games In Hoarder’s Abandoned House"
        },
        {
          "id": "1847689679",
          "author": "Ian Walker",
          "description": "Over the last few weeks, much hay has been made about the PlayStation 5, specifically a new revision of the Sony console that includes a smaller heatsink. Early reports criticized this change for leading to increased temperatures during operation, but fears that this would impact performance have mostly been put to…\nRead more...",
          "link": "https://kotaku.com/the-saga-behind-the-new-ps5s-heatsink-explained-1847689679",
          "publishedOn": "2021-09-16T18:35:00.000Z",
          "wordCount": 739,
          "title": "The Saga Behind The New PS5's Heatsink, Explained"
        },
        {
          "id": "1847689743",
          "author": "Ari Notis",
          "description": "Returnal, the PlayStation 5 time loop game that isn’t the one everyone’s talking about this week, might seem like it’s about escaping a temporally out-of-whack exoplanet. But really, it’s about getting your lunch money repeatedly stolen by malevolent tentacle monsters. Much of the game’s unsettling vibe comes from…\nRead more...",
          "link": "https://kotaku.com/why-returnal-s-tentacle-tech-is-so-real-and-so-scary-1847689743",
          "publishedOn": "2021-09-16T18:15:00.000Z",
          "wordCount": 731,
          "title": "Why Returnal’s ‘Tentacle Tech’ Is So Real—And So Scary"
        },
        {
          "id": "1847688695",
          "author": "Zack Zwiezen",
          "description": "There I was, creeping along a cliff on the outside of a big castle-like structure when I saw a single enemy, completely alone. He was standing on the edge of the cliff with his back to me. This setup ranked high on my “kickable moment meter,” a situation which routinely leads to disappointment. How often have games…\nRead more...",
          "link": "https://kotaku.com/deathloop-players-all-agree-the-dedicated-kick-button-1847688695",
          "publishedOn": "2021-09-16T16:55:00.000Z",
          "wordCount": 677,
          "title": "Deathloop Players All Agree: The Dedicated Kick Button Rules"
        },
        {
          "id": "1847688411",
          "author": "Renata Price",
          "description": "Blackreef is a city built for violence. Every citizen is armed, and every law is overturned. It is a 24 hour party, and sometimes partying involves shooting your friend in the head...I guess. I’ve never been a real party girl.\n\nRead more...",
          "link": "https://kotaku.com/what-deathloop-does-differently-from-dishonored-and-pre-1847688411",
          "publishedOn": "2021-09-16T16:20:00.000Z",
          "wordCount": 1114,
          "title": "What Deathloop Does Differently From Dishonored and Prey"
        },
        {
          "id": "1847687909",
          "author": "Fergus Halliday",
          "description": "Cogito is the NieR game that Square Enix doesn’t want you to know about.\n\nRead more...",
          "link": "https://kotaku.com/nier-fan-game-wins-official-contest-still-becomes-lega-1847687909",
          "publishedOn": "2021-09-16T15:50:00.000Z",
          "wordCount": 1540,
          "title": "Nier Fan Game Wins Official Contest, Still Becomes Legal Headache"
        },
        {
          "id": "1847687772",
          "author": "Ari Notis",
          "description": "The Tales series of RPGs has long been known for starring a compelling cast of main characters. In that regard, the latest entry, last week’s Tales of Arise, doesn’t disappoint. All six party members are deeply fleshed-out, fascinating people. And like those of every previous entry, they’re all also flawed.\n\nRead more...",
          "link": "https://kotaku.com/the-best-tales-of-arise-character-is-this-cat-1847687772",
          "publishedOn": "2021-09-16T15:20:00.000Z",
          "wordCount": 662,
          "title": "The Best Tales Of Arise Character Is This Cat"
        },
        {
          "id": "1847687105",
          "author": "John Walker",
          "description": "Oh my goodness, there is so much going on in Day Repeat Day. I went into it knowing absolutely nothing, and came out having learned an enormous amount and yet having so many questions. To be asinine, this exists on the midpoint between a Papers Please-like, and a lost phone game, with…match-3. But come back! This is…\nRead more...",
          "link": "https://kotaku.com/one-of-2021s-best-games-is-a-match-3-1847687105",
          "publishedOn": "2021-09-16T14:20:00.000Z",
          "wordCount": 1221,
          "title": "One Of 2021's Best Games Is A Match-3"
        },
        {
          "id": "1847685216",
          "author": "Ian Walker",
          "description": "Star Wars: Hunters is an upcoming arena brawler launching on Nintendo Switch as well as iOS and Android devices sometime next year. But more importantly, it’s also the vehicle for my new favorite Star Wars character of all time: two Jawas in a trenchcoat.\nRead more...",
          "link": "https://kotaku.com/two-jawas-in-a-trenchcoat-is-my-new-favorite-star-war-1847685216",
          "publishedOn": "2021-09-16T13:30:00.000Z",
          "wordCount": 414,
          "title": "‘Two Jawas In A Trenchcoat’ Is My New Favorite Star Wars Character"
        },
        {
          "id": "1847686584",
          "author": "Brian Ashcraft",
          "description": "Composer Marty O’Donnell, Bungie’s former audio director, has been found in contempt of court for his continuous use of Destiny assets, including uploading song clips online long after he left the company. According to Eurogamer, such use violated the terms of a previous lawsuit.\nRead more...",
          "link": "https://kotaku.com/destiny-composer-ordered-to-pay-bungie-nearly-100-000-1847686584",
          "publishedOn": "2021-09-16T13:00:00.000Z",
          "wordCount": 541,
          "title": "Destiny Composer Ordered To Pay Bungie Nearly $100,000"
        },
        {
          "id": "1847686225",
          "author": "Brian Ashcraft",
          "description": "Next spring, yet another one-to-one scale Gundam will go up in Japan. This one will be located at a LaLaport shopping center in Fukuoka. I find this pretty exciting, but it turns out not everyone does. \nThis particular incarnation is a ν (Nu) Gundam, but it’s a revamped version. Dubbed RX-93ff Nu Gundam, Yoshiyuki…\nRead more...",
          "link": "https://kotaku.com/the-latest-life-sized-gundam-is-disappointing-some-fans-1847686225",
          "publishedOn": "2021-09-16T09:30:00.000Z",
          "wordCount": 566,
          "title": "The Latest Life-Sized Gundam Is Disappointing Some Fans"
        },
        {
          "id": "1739309425",
          "author": "Luke Plunkett",
          "description": "Ah, the GameCube. It might be my favourite console of all time. The tiny discs, its cute little handle, the Wavebird...yeah, we had some good times together. But the best times we had were with these games in particular.\nRead more...",
          "link": "https://kotaku.com/the-best-gamecube-games-1739309425",
          "publishedOn": "2021-09-16T04:50:00.000Z",
          "wordCount": 1167,
          "title": "The Best GameCube Games"
        },
        {
          "id": "1847685560",
          "author": "Luke Plunkett",
          "description": "After fans waited three years for news, Undertale’s Toby Fox just announced that Deltarune Chapter 2 will be out...this week\n\nRead more...",
          "link": "https://kotaku.com/deltarune-chapter-2-is-coming-out-this-week-1847685560",
          "publishedOn": "2021-09-16T03:08:00.000Z",
          "wordCount": 473,
          "title": "Deltarune Chapter 2 Is Coming Out This Week"
        },
        {
          "id": "1847685471",
          "author": "Luke Plunkett",
          "description": "Twenty years on from the release of the first film in the trilogy, New Zealand’s Weta Workshop have dropped a bunch of concept art from the whole Lord of the Rings series.\nRead more...",
          "link": "https://kotaku.com/the-art-of-the-lord-of-the-rings-movies-1847685471",
          "publishedOn": "2021-09-16T02:45:00.000Z",
          "wordCount": 339,
          "title": "The Art Of The Lord Of The Rings Movies"
        },
        {
          "id": "1847684851",
          "author": "Luke Plunkett",
          "description": "A few days ago Eurogamer closed their forums, bringing to an end over 20 years of community discussion. The site explained the move like sites and companies always do (only a few are still using them), and it made sense the way it always does (that’s a lot of money for not much gain), but that doesn’t mean the process…\nRead more...",
          "link": "https://kotaku.com/please-stop-closing-forums-and-moving-people-to-discord-1847684851",
          "publishedOn": "2021-09-16T00:15:00.000Z",
          "wordCount": 751,
          "title": "Please Stop Closing Forums And Moving People To Discord"
        },
        {
          "id": "1847684447",
          "author": "Luke Plunkett",
          "description": "Congratulations are in order for CakeAssault, who over the weekend won a huge Rivals of Aether tournament, overcoming not just the competing field, but also the limitations and fragilities of the human body.\n\nRead more...",
          "link": "https://kotaku.com/gamer-dislocates-shoulder-while-celebrating-tournament-1847684447",
          "publishedOn": "2021-09-15T23:00:00.000Z",
          "wordCount": 460,
          "title": "Gamer Dislocates Shoulder While Celebrating Tournament Victory"
        }
      ]
    },
    {
      "title": "Nintendo Life | Latest Updates",
      "feedUrl": "https://www.nintendolife.com/feeds/latest",
      "siteUrl": "https://www.nintendolife.com/feeds/latest",
      "articles": [
        {
          "id": "https://www.nintendolife.com/#article-121061",
          "author": null,
          "description": "\"I  know deep down inside me it’s not okay for me to make a Zelda game\".\nAs you may have already seen, we've recently shared a video interview (and the full transcript if you prefer) with the one and only SUDA51, a hugely influential developer that recently brought us No More Heroes III on the Switch. We delve into the series, in terms of its history and future, and also ask the question plenty of fans have had for a while - how about Travis in Smash?\nWe also asked what Nintendo franchise, given the numerous choices, SUDA51 would like to work on. He shows some notable self awareness before identifying an IP that could actually be a rather good fit.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/suda51_would_love_to_revive_a_lesser-known_nintendo_classic",
          "publishedOn": "2021-09-17T14:05:00.000Z",
          "wordCount": 975,
          "title": "SUDA51 Would Love To Revive A Lesser-Known Nintendo Classic"
        },
        {
          "id": "https://www.nintendolife.com/#article-120873",
          "author": null,
          "description": "Grasshopper has bigger plans.\nThe recent launch of No More Heroes III completed the journey of series protagonist Travis Touchdown, capping off a trilogy of games (plus a spin-off) that began back on the Wii. Fans of iconic game director SUDA51 had waited a while for this one, and apparently this game will be his final outing with Travis.\nWith the entire Travis 'saga' now available on Switch, we recently sat down with the director to discuss the future of Mr Touchdown, saying goodbye to the series, and the Nintendo IP he'd enjoy remaking given the chance. We recommend you watch the video of our interview with SUDA above, but if you prefer the written word, we can accommodate you there, too. We're generous like that. Enjoy!\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/video_suda51_on_no_more_heroes_and_the_future_of_travis_touchdown",
          "publishedOn": "2021-09-17T14:00:00.000Z",
          "wordCount": 2981,
          "title": "Video: SUDA51 On No More Heroes And The Future Of Travis Touchdown"
        },
        {
          "id": "https://www.nintendolife.com/#article-121071",
          "author": null,
          "description": "Demo out now on the eShop.\nBack in the Spring we highlighted The Lightbringer, which has been developed by Rock Square Thunder and will be released by Zordix Publishing. It's an adventure puzzle-platformer that looks rather promising, and an interesting touch is that story narration comes from the protagonist's sister and is fully voiced in verse.\nThe Lightbringer pitches itself as featuring an old-school adventure, a heartfelt story, and a mix of combat and puzzles to solve. The poem from the trailer has also been transcribed and shared.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/poetic_adventure_the_lightbringer_arrives_soon_on_switch",
          "publishedOn": "2021-09-17T13:30:00.000Z",
          "wordCount": 822,
          "title": "Poetic Adventure The Lightbringer Arrives Soon On Switch"
        },
        {
          "id": "https://www.nintendolife.com/#article-120829",
          "author": null,
          "description": "East? I thought you said Weast.\nThe line between an homage and a copycat can often be a blurry one, and it feels like all too often that new games borrowing ideas from old games fall on the wrong side of it. Instead of offering creative new takes on favored concepts, these games are more content to prod you with a sharp elbow as they say “’member?” over and over. Eastward is not one of those games. The inaugural release from Shanghai-based Pixpil smartly integrates gameplay and story ideas from beloved classics while still managing to feel like an original and well-executed adventure.\nEastward follows the story of John, a gruff man of action not words, and his companion, Sam, an energetic and white-haired little girl who he found underground. The two live happily together in a small subterranean village and enjoy a quasi father/daughter relationship, but things quickly take a turn when certain events lead to them arriving at the surface that they were told is such a dangerous and awful place. It turns out that things aren’t quite as bad up there as they were led to believe, although there’s a mysterious force called miasma that’s slowly rolling over the land and destroying everything in its path.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/reviews/switch-eshop/eastward",
          "publishedOn": "2021-09-17T13:00:00.000Z",
          "wordCount": 2473,
          "title": "Review: Eastward - A Creative Zelda-Like Adventure With Absolutely Killer Art"
        },
        {
          "id": "https://www.nintendolife.com/#article-121068",
          "author": null,
          "description": "Batman-chic.\n\nWhile the term 'gamer' is becoming increasingly vague, which is a positive sign that everyone from small children to retirees can love video games as a perfectly normal part of life, the conventional use of the phrase is still a segment of the market relentlessly targeted by companies. IKEA is another joining in, creating a range of gaming furniture that seems to be focused on competitive PC-centric gaming, and of course streamers.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/random_ikeas_gaming_range_has_the_essentials_like_a_mug_holder_and_neck_pillow",
          "publishedOn": "2021-09-17T12:30:00.000Z",
          "wordCount": 1259,
          "title": "Random: IKEA's Gaming Range Has The Essentials, Like A Mug Holder And Neck Pillow"
        },
        {
          "id": "https://www.nintendolife.com/#article-121058",
          "author": null,
          "description": "New Aspects feature adds \"incredibly strong powers\".\nMotion Twin and Evil Empire have released the 25th – yes, twenty-fifth – update for Dead Cells. Called 'Practice Makes Perfect', the update intends to make things a little easier for new players or those who want to have a gentler time exploring everything the game has to offer.\nOne new addition is the training room, a space where players can practice their gameplay by taking on all the mobs and bosses you've encountered in-game. There are presets available which can artificially reflect the bestiary of each biome, and you can also practice against all of the bosses in their own environments.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/dead_cells_practice_makes_perfect_update_makes_the_game_easier_but_only_if_you_want_that",
          "publishedOn": "2021-09-17T11:00:00.000Z",
          "wordCount": 1476,
          "title": "Dead Cells 'Practice Makes Perfect' Update Makes The Game Easier, But Only If You Want That"
        },
        {
          "id": "https://www.nintendolife.com/#article-121055",
          "author": null,
          "description": "We need it.\nFor the 500th time this year, we're here to express our excruciating jealousy over the amazing things Nintendo fans in Japan get treated to. This time, it's a stunning Legend of Zelda: Skyward Sword soundtrack collection.\nFrom Nippon Columbia, the new soundtrack will be available to Japanese fans in either a Regular or First Press Limited edition. Both come with five discs of music from the game, with 187 songs featured in total, but the Limited edition also includes a \"luxury\" outer box and a truly beautiful music box which plays 'Ballad of the Goddess'.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/japans_getting_a_stunning_zelda_skyward_sword_soundtrack_with_an_adorable_music_box",
          "publishedOn": "2021-09-17T10:00:00.000Z",
          "wordCount": 1220,
          "title": "Japan's Getting A Stunning Zelda: Skyward Sword Soundtrack With An Adorable Music Box"
        },
        {
          "id": "https://www.nintendolife.com/#article-121054",
          "author": null,
          "description": "Here's hoping for a worldwide release.\nSouth Korean fans who pre-order the upcoming Pokémon Brilliant Diamond and Shining Pearl games for Nintendo Switch will receive a shiny version of either Zacian or Zamazenta, it's been announced.\nAs reported by Serebii, the shiny Pokémon will be distributed via a code given to any players who pre-order either of the two new games or the Brilliant Diamond & Shining Pearl Double Pack. The codes are valid for use with Pokémon Sword and Shield and will be sent to qualifying buyers from 19th November through to 31st December.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/pokemon_diamond_and_pearl_remake_pre-orders_include_shiny_zacianzamazenta_bonus_in_south_korea",
          "publishedOn": "2021-09-17T09:00:00.000Z",
          "wordCount": 1151,
          "title": "Pokémon Diamond And Pearl Remake Pre-Orders Include ﻿Shiny Zacian/Zamazenta Bonus In South ﻿Korea"
        },
        {
          "id": "https://www.nintendolife.com/#article-121051",
          "author": null,
          "description": "And you don't have long to wait.\nCapcom has announced that Monster Hunter Rise is about to be treated to an exciting collaboration, teaming up with none other than Mega Man.\nFrom 24th September, you'll find that Mega Man's faithful robotic sidekick Rush arrives in-game as a Palamute layered armour set. As you can see from the trailer above, Rush comes with all sorts of tricks that Mega Man players will already be familiar with, including the ability to throw you up into the air to reach higher ground.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/monster_hunter_rise_adds_mega_mans_rush_in_new_collab",
          "publishedOn": "2021-09-17T08:30:00.000Z",
          "wordCount": 1574,
          "title": "Monster Hunter Rise Adds Mega Man's Rush In New Collab"
        },
        {
          "id": "https://www.nintendolife.com/#article-121048",
          "author": null,
          "description": "Not to be confused with the updated version.\n\nFollowing on from the release of Pop Flamer last week, Hamster's now made another Jaleco arcade classic available.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/jalecos_original_fairy_puzzle_game_soldam_joins_the_arcade_archives",
          "publishedOn": "2021-09-17T05:45:00.000Z",
          "wordCount": 945,
          "title": "Jaleco's Original Fairy Puzzle Game Soldam Joins The Arcade Archives"
        },
        {
          "id": "https://www.nintendolife.com/#article-121047",
          "author": null,
          "description": "Now make it official, Konami.\nIn June, it was discovered how a \"Castlevania Advance Collection\" had been rated by the Australian Classification Board.\nThe publisher was listed as Konami and the author was 'M2' - best known in recent years for re-releasing various retro classics on the Switch. This followed with a PC version of the game being classified in South Korea.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/the_castlevania_advance_collection_has_been_rated_for_switch_in_taiwan",
          "publishedOn": "2021-09-17T03:15:00.000Z",
          "wordCount": 2870,
          "title": "The 'Castlevania Advance Collection' Has Been Rated For Switch In Taiwan"
        },
        {
          "id": "https://www.nintendolife.com/#article-121044",
          "author": null,
          "description": "What could it be?\nThe Tokyo Game Show kicks off later this month and it seems Sega could potentially have something very big to reveal during the Sega Atlus Channel Presentation.\nAccording to the TGS2021 official website, Sega is planning to announce a brand new RPG. It's described as being \"Sega's new RPG\" and the reveal will take place on 1st October. The presentation will run for roughly one hour and it's believed this won't be an Atlus RPG.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/sega_to_announce_new_rpg_at_this_years_tokyo_game_show",
          "publishedOn": "2021-09-17T01:45:00.000Z",
          "wordCount": 2576,
          "title": "Sega To Announce \"New RPG\" At This Year's Tokyo Game Show"
        },
        {
          "id": "https://www.nintendolife.com/#article-121043",
          "author": null,
          "description": "Will be based on the Japanese company's famous franchises.\nFrench video game publisher and developer Microids has signed what it's calling a \"historic\" agreement with Taitos to produce two new games based on the Japanese company's famous franchises.\nBoth games are \"already in production\" and are scheduled to launch sometime next year in 2022. Microids says both of the games are being developed by \"experienced studios\" and promises the titles will be a great addition to the studios' portfolios.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/microids_signs_historic_agreement_with_taito_to_produce_two_new_games",
          "publishedOn": "2021-09-17T00:55:00.000Z",
          "wordCount": 1336,
          "title": "Microids Signs \"Historic\" Agreement With Taito To Produce Two New Games"
        },
        {
          "id": "https://www.nintendolife.com/#article-121041",
          "author": null,
          "description": "A gift will be sent out to trainers later this month.\n\nThe Pokémon Company has revealed the new MOBA Pokémon Unite has now exceeded 9 million downloads on Nintendo Switch. The free-to-download game is developed in partnership with TiMi Studios - a subsidiary of the Chinese video game giant Tencent.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/tencents_new_moba_pokemon_unite_has_surpassed_9_million_downloads_on_switch",
          "publishedOn": "2021-09-16T23:55:00.000Z",
          "wordCount": 1754,
          "title": "Tencent's New MOBA Pokémon Unite Has Surpassed 9 Million Downloads On Switch"
        },
        {
          "id": "https://www.nintendolife.com/#article-121039",
          "author": null,
          "description": "We're green with envy, but not transparent.\nWe've been begging, b e g g i n g Nintendo for transparent consoles pretty much since they stopped making them, and though they briefly listened to us in 2014, we only got red and blue 2DS models to tie in with the release of Pokémon Omega Ruby and Alpha Sapphire, and later in 2016, a Yellow 2DS to tie in with Pokémon Red, Blue, and Yellow.\nBut did you know that there was a secret-ish fourth colour, represented by Venusaur, that was only available in Japan? Well, if you've been reading the site since 2015, you might have actually already seen it — but now Elliot Coll of The Retro Future has done an unboxing of the verdant video game console, so we can appreciate it in better detail.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/random_watch_this_unboxing_of_a_rare_transparent_green_2ds",
          "publishedOn": "2021-09-16T21:30:00.000Z",
          "wordCount": 1574,
          "title": "Random: Watch This Unboxing Of A Rare Transparent Green 2DS"
        },
        {
          "id": "https://www.nintendolife.com/#article-120934",
          "author": null,
          "description": "Video games, but make it fashion.\nOn the Venn diagram of video games and fashion, the overlap is probably smaller than the number of people who actually owned a Virtual Boy, but that's alright. I'm here at the centre of the two circles, and if this article only entertains me, so be it!\nThe Met Gala, which took place earlier this week, is a parade of wealth and fancy clothing, and whether you're down with celeb culture or not, you can't deny that the outfits are absolute fire. But the twist that the Met Gala offers is that it's themed, unlike most events like the Oscars and Emmys and so on, so we usually get to see some weird and wild takes from Hollywood's in-vogue.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/back_page_the_video_game_characters_that_snuck_into_the_2021_met_gala",
          "publishedOn": "2021-09-16T20:00:00.000Z",
          "wordCount": 3374,
          "title": "Back Page: The Video Game Characters That Snuck Into The 2021 Met Gala"
        },
        {
          "id": "https://www.nintendolife.com/#article-121035",
          "author": null,
          "description": "Don't give them ideas...\nWales Interactive has established itself as the name in FMV games of the modern era, blending TV and film-style production with player choice and gameplay. On Switch it's released a number of titles including Maid of Sker and Five Dates, and has confirmed its next release - Bloodshore - for a November arrival on the eShop.\nThe basic concept is Twitch x Hunger Games, it seems to us, and Wales Interactive has teamed up with multiple partners for what is clearly an ambitious project.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/bloodshore_is_an_upcoming_fmv_game_blending_hunger_games_and_twitch",
          "publishedOn": "2021-09-16T19:00:00.000Z",
          "wordCount": 942,
          "title": "Bloodshore Is An Upcoming FMV Game Blending Hunger Games And Twitch"
        },
        {
          "id": "https://www.nintendolife.com/#article-121038",
          "author": null,
          "description": "Bloody hell.\nThis Autumn, the Nintendo Switch will be getting remastered — sorry, ahem, ReVamped versions of third-person horror action games, Bloodrayne 1 and 2.\nAs Rayne, a half-vampire ass-kicker and Nazi-slayer, you'll get to face supernatural threats and use your vampiric powers to save the day. The ReVamp will add a ton of new features, enhancements, and upgrades, too:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/bloodrayne_1_and_2_are_getting_revamped_on_switch",
          "publishedOn": "2021-09-16T18:30:00.000Z",
          "wordCount": 1813,
          "title": "Bloodrayne 1 And 2 Are Getting \"ReVamped\" On Switch"
        },
        {
          "id": "https://www.nintendolife.com/#article-121037",
          "author": null,
          "description": "It's SEPTEMBER.\nBack in our day, patterned knits were reserved for Christmas and grandmas. These days, every holiday (at least, the ones not in summer) have their own jumpers, and that includes Halloween, a holiday that's literally supposed to be about wearing non-normal clothes.\nHowever, if it's spooky couture you're looking for, then you'll be glad to know that the Pokémon Center is once again trotting out its Ghost-types for the upcoming trick-or-treat season, with purple and pumpkins galore:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/halloweens_coming_early_with_all_this_festive_pokemon_merch",
          "publishedOn": "2021-09-16T18:00:00.000Z",
          "wordCount": 996,
          "title": "Halloween's Coming Early With All This Festive Pokémon Merch"
        },
        {
          "id": "https://www.nintendolife.com/#article-121017",
          "author": null,
          "description": "Go on Nintendo, party like it's 2009.\n\nI can hear the pitchforks sharpening so let me just say it right away — I really like Nintendo. I spend the majority of my day focused on its hardware, games and related fun times. So I tease the company with affection, but good grief it deserves a little bit of gentle mocking from time to time.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/soapbox_4_years_on_and_switch_finally_got_bluetooth_audio_so_voice_chat_next",
          "publishedOn": "2021-09-16T17:00:00.000Z",
          "wordCount": 4054,
          "title": "Soapbox: 4 Years On And Switch Finally Got Bluetooth Audio, So Voice Chat Next?"
        },
        {
          "id": "https://www.nintendolife.com/#article-121034",
          "author": null,
          "description": "But it leads the way for Nintendo.\nFamitsu's Japanese chart figures are now in for the week ending 12th September, revealing that WarioWare: Get It Together! achieved a second-place finish in its opening week at retail.\nThe game sold an estimated 72,277 copies in its debut week, leading the way for Switch but being outperformed by Tales of Arise. Bandai Namco's action RPG managed to sell a mighty 151,316 copies on PS4, with a further 50,482 sales on PS5.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/japanese_charts_warioware_get_it_together_misses_out_on_a_debut_number_one",
          "publishedOn": "2021-09-16T16:30:00.000Z",
          "wordCount": 2068,
          "title": "Japanese Charts: WarioWare: Get It Together! Misses Out On A Debut Number One"
        },
        {
          "id": "https://www.nintendolife.com/#article-121029",
          "author": null,
          "description": "A new single-player treat?\nToday sees the launch of Switch's latest highly-anticipated RPG Eastward, and Nintendo's dropped a handy launch trailer to give us one more look at what it's all about.\nA charming-looking single-player RPG, Eastward has you following protagonists John and Sam in an \"emotional journey across a world falling to ruin.\" As you can see from the trailer, the game's set in a highly detailed pixel art world full of monsters, distant cities, and a quirky cast of characters. Here's the official synopsis:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/charming_rpg_eastward_is_out_today_on_switch_heres_the_launch_trailer",
          "publishedOn": "2021-09-16T15:30:00.000Z",
          "wordCount": 1889,
          "title": "Charming RPG Eastward Is Out Today On Switch, Here's The Launch Trailer"
        },
        {
          "id": "https://www.nintendolife.com/#article-121028",
          "author": null,
          "description": "Update: Yes, it's a pricing error.\nUpdate: It seems that adding the game to your basket now reveals the actual price being charged for the upcoming game, £49.99. Sad faces all round. It remains to be seen if the orders of the people who managed to snag it for just £26.99 will be honoured.\n\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/uk_retailer_currys_had_a_metroid_dread_deal_that_was_too_good_to_be_true",
          "publishedOn": "2021-09-16T14:45:00.000Z",
          "wordCount": 1691,
          "title": "UK Retailer Currys Had A Metroid Dread Deal That Was Too Good To Be True"
        },
        {
          "id": "https://www.nintendolife.com/#article-121026",
          "author": null,
          "description": "So long, Switch click (sometimes, results are varied!).\nNintendo's firmware update 13.0.0 had the headline feature of adding support for Bluetooth devices, which was overdue but nonetheless welcome. It did some other work too, however, such as an 'Update Dock' option for the OLED model equivalents, effectively ensuring support of the LAN port that'll be introduced in the new model.\nOne boost that wasn't in the changelog, however, seems to relate to game boot times. Now this isn't a load time for an individual game, but the transition of the Switch to booting the game up - that black screen with the little animated Switch 'click' at the bottom right. As highlighted by @pikuri_ on Twitter, this has sped up for some games to the extent that the click animation can't even fully complete.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/switch_firmware_update_13_0_0_weirdly_speeds_up_some_game_boot_times",
          "publishedOn": "2021-09-16T14:40:00.000Z",
          "wordCount": 2308,
          "title": "Switch Firmware Update 13.0.0 Weirdly Speeds Up Some Game Boot Times"
        },
        {
          "id": "https://www.nintendolife.com/#article-120848",
          "author": null,
          "description": "Ding Dong Delightful.\nLevel-5's Ni No Kuni II: Revenant Kingdom originally released on PS4 back in March 2018 to pretty much unanimous critical praise, and playing it now in this latest Switch iteration, it's really not too hard to see why. This is a wonderfully well-crafted adventure that hits the ground running, nails pretty much every single gameplay mechanic it introduces across its 50-hour core campaign and, we're happy to report, lands on Nintendo's hybrid console in truly excellent condition.\nSet some 100 years after the events of Wrath of the White Witch, this sequel kicks off with an explosion in an unnamed, US-like city that knocks President Roland Crane unconscious, during which time he's magically transported to the colourful kingdom of Ding Dong Dell. Struggling to understand what's just occurred, Roland is dragged immediately into an ongoing coup, taking up arms alongside House of Tildrum's teenage king (and walking hair disaster) Evan Pettiwhisker Tildrum as he attempts to escape the clutches of the evil Mausinger and his armed thugs.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/reviews/nintendo-switch/ni_no_kuni_ii_revenant_kingdom",
          "publishedOn": "2021-09-16T14:00:00.000Z",
          "wordCount": 5088,
          "title": "Review: Ni No Kuni II: Revenant Kingdom - A Sublime Port Of An Awesome Adventure"
        }
      ]
    },
    {
      "title": "Rock Paper Shotgun Latest Articles Feed",
      "feedUrl": "https://www.rockpapershotgun.com/feed",
      "siteUrl": "https://www.rockpapershotgun.com/feed",
      "articles": [
        {
          "id": "https://www.rockpapershotgun.com/steam-deck-dev-kit-screenshots-show-a-likely-big-picture-replacement-steamos-3-allegedly-leaks",
          "author": "James Archer",
          "description": "Whelp, that didn’t take long. Steam Deck dev kits were only sent out to game developers this week, and it looks like Valve’s handheld PC is already getting picked apart. That’s according to SteamDB creator Pavel Djundik, who tweeted screenshots of the Steam Deck UI before claiming the entire SteamOS 3 operating system has been leaked.\nRead more",
          "link": "https://www.rockpapershotgun.com/steam-deck-dev-kit-screenshots-show-a-likely-big-picture-replacement-steamos-3-allegedly-leaks",
          "publishedOn": "2021-09-17T13:03:49.000Z",
          "wordCount": 1031,
          "title": "Steam Deck dev kit screenshots show a likely Big Picture replacement, SteamOS 3 allegedly leaks"
        },
        {
          "id": "https://www.rockpapershotgun.com/clive-sinclair-who-brought-us-the-zx-spectrum-has-died",
          "author": "Alice O'Connor",
          "description": "Clive Sinclair, the founder of the company which brought us the ZX Spectrum computer, has died. The first encounter with PC gaming for many of a certain age in the UK wasn't through any beige box MS-DOS or Windows, it was on that futuristic wee black keyboard with rubbery keys and a colourful stripe, which loaded software from cassette tapes. I'm too young to have seen its glory days but I think the first PC game I played was a Speccy shoot 'em up, a magical experience I didn't believe would actually work when I first saw my pal plug a tape deck into a keyboard.\nRead more",
          "link": "https://www.rockpapershotgun.com/clive-sinclair-who-brought-us-the-zx-spectrum-has-died",
          "publishedOn": "2021-09-17T12:09:04.000Z",
          "wordCount": 1020,
          "title": "Clive Sinclair, who brought us the ZX Spectrum, has died"
        },
        {
          "id": "https://www.rockpapershotgun.com/tails-of-iron-review",
          "author": "Alice Bell",
          "description": "As enquiring minds already know, rats are very cute. I've not had pet rats myself, but a bunch of my friends have. Rats have lovely little pin-prick hands and feet, and they will give you wiffly-nose kisses while they assess whether your hair is worth exploring or not.\nThe rats in Tails Of Iron are cute. Little 2D inhabitants of a feudal rat kingdom, where they get milk from insects that look like cows, and royal succession is determined in trial by combat - which you, Prince Redgi, win, and shortly thereafter become King Redgi when your dad is murdered by frogs right in front of you. Let the amphibian bodies hit the floor. Time to kick this RPG into a side-on soulslike experience. Slice open a frog belly and see the guts spill out. These rats are cute, but also u wot? U wot? Say that again m8. Say that to my face. I'll 'ave you.\nRead more",
          "link": "https://www.rockpapershotgun.com/tails-of-iron-review",
          "publishedOn": "2021-09-17T12:04:39.000Z",
          "wordCount": 1797,
          "title": "Tails Of Iron review: a fun 2D Soulslike with a bit too much padding"
        },
        {
          "id": "https://www.rockpapershotgun.com/tales-of-arise-is-the-fastest-selling-game-in-the-series",
          "author": "Graham Smith",
          "description": "The Tales games stretch back to 1995's Tales Of Phantasia, but the latest entry, Tales Of Arise, is now the fastest selling in the series. In less than a week, it has sold a million copies, Bandai Namco say.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/tales-of-arise-is-the-fastest-selling-game-in-the-series",
          "publishedOn": "2021-09-16T22:36:13.000Z",
          "wordCount": 766,
          "title": "Tales Of Arise is the fastest selling game in the series"
        },
        {
          "id": "https://www.rockpapershotgun.com/titan-quest-and-jagged-alliance-are-free-to-keep-right-now",
          "author": "Graham Smith",
          "description": "THQ Nordic are celebrating their 10th anniversary by giving away free games via Steam. Surprisingly enduring action RPG Titan Quest is currently free-to-keep, and so is the ancient turn-based tactics of Jagged Alliance. \r\n\nThen, if you want something a little more modern, the real-time tactical stealth of Desperados 3 is free-to-try for the next three days.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/titan-quest-and-jagged-alliance-are-free-to-keep-right-now",
          "publishedOn": "2021-09-16T21:41:48.000Z",
          "wordCount": 845,
          "title": "Titan Quest and Jagged Alliance are free to keep right now"
        },
        {
          "id": "https://www.rockpapershotgun.com/please-ikea-make-me-some-grownup-gaming-furniture",
          "author": "Graham Smith",
          "description": "Ikea, makers of large, boring Lego projects for adults, are launching a range of gaming furniture. The set, created in collaboration with Republic Of Gamers, includes desks, chairs, streaming accessories and what The Guardian describes as a \"multi-functional cushion/blanket.\"\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/please-ikea-make-me-some-grownup-gaming-furniture",
          "publishedOn": "2021-09-16T21:01:31.000Z",
          "wordCount": 840,
          "title": "Please Ikea, make me some grownup gaming furniture"
        },
        {
          "id": "https://www.rockpapershotgun.com/call-of-duty-vanguards-beta-opens-to-all-this-weekend",
          "author": "Graham Smith",
          "description": "Call Of Duty: Vanguard has already had a beta on PlayStation, and if you've pre-ordered the game you can play it right now on PC. On Saturday however, the beta will open up to everyone with a Battle.net account. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/call-of-duty-vanguards-beta-opens-to-all-this-weekend",
          "publishedOn": "2021-09-16T20:07:11.000Z",
          "wordCount": 881,
          "title": "Call Of Duty: Vanguard's beta opens to all this weekend"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-to-overclock-gpu",
          "author": "James Archer",
          "description": "Learning how to overclock your GPU sounds like it should be one of gaming PC ownership’s essential skills, like knowing how to clean your PC or how to check CPU temperature. And why not? Coaxing extra performance out of a component will get you more frames-per-second at no additional charge, and you can do it with just about every gaming card under the sun. Even the best graphics cards that come with factory overclocks will leave headroom for additional gains to unlock yourself.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/how-to-overclock-gpu",
          "publishedOn": "2021-09-16T16:26:44.000Z",
          "wordCount": 2293,
          "title": "How to overclock your GPU"
        },
        {
          "id": "https://www.rockpapershotgun.com/valheim-has-added-a-hot-tub-for-vikings-to-unwind",
          "author": "Alice O'Connor",
          "description": "Trying to survive in purgatory isn't easy, having to hunt and build and craft everything you need to slay mighty mythical beasts. Thankfully, the Vikings of Valheim can now relax with their pals in a hot tub, one of many fancy household items added in the 'Home & Hearth' early access update today. Sure sure it brings new weapons and new creatures and balance changes and things too, but: hot tub!\nRead more",
          "link": "https://www.rockpapershotgun.com/valheim-has-added-a-hot-tub-for-vikings-to-unwind",
          "publishedOn": "2021-09-16T16:22:16.000Z",
          "wordCount": 817,
          "title": "Valheim has added a hot tub for Vikings to unwind"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-how-to-beat-yervha",
          "author": "Rebecca Jones",
          "description": "What are the correct answers to the Yervha's questions in Deathloop? The Yervha, a.k.a. Queen of Riddles, is a trivia machine in Deathloop. If you can answer all 10 of its questions correctly you'll win a prize! A very modest prize, but a prize nonetheless. And who doesn't love a good trivia challenge? You certainly seem to, since you're here!\nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-how-to-beat-yervha",
          "publishedOn": "2021-09-16T15:02:46.000Z",
          "wordCount": 1467,
          "title": "The Yervha: how to beat Deathloop's fiendish trivia machine"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-electronic-wireless-show-podcast-episode-156-the-best-doctors-in-games-special",
          "author": "Alice Bell",
          "description": "The recording of this episode of The Electronic Wireless Show podcast turned out to be unfortunately cursed with technical issues, which means I am (probably noticeably) tired and grumpy, and don't let Matthew and Nate reproduce their witty banter from the first time we tried to record. No cold open! Still, nothing to cheer me up like some good bedside manner from a doctor. Oh no, it turns out all game doctors are awful!\nWe discuss our favourite game medical types, and also discuss why doctors in games are so often evil baddies. The saga of Matthew and his teeth continues, as well as envisioning Matthew as a clown who just turns up to your kids birthday party smeared in his wife's lipstick, drinks all your Fanta, and leaves again. Now that's malpractice.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-electronic-wireless-show-podcast-episode-156-the-best-doctors-in-games-special",
          "publishedOn": "2021-09-16T15:00:00.000Z",
          "wordCount": 803,
          "title": "EWS podcast episode 156: the best doctors special"
        },
        {
          "id": "https://www.rockpapershotgun.com/gamedec-review",
          "author": "Khee Hoon Chan",
          "description": "From the stealth-oriented Foreclosed to the twin-sticky The Ascent, there has been a bumper crop of cyberpunk shooters this year, their endless gun fests typically set amidst a gaudy onslaught of neon-tinged billboards, metallic skyscrapers and indiscriminately-placed Asian motifs.\nIn spite of its roots, Gamedec initially seems like a reprieve from this recent blitz of cyberpunk games. It sticks steadfastly to its self-imposed, zero-combat rule, instead leaning heavily towards the genre’s crime fiction elements. That’s because in Gamedec, you’re a detective actually carrying out proper investigative work, rather than simply pointing the smokey end of a gun towards your problems. You’ll sleuth around for clues, make deductions based on your discoveries, and draw conclusions that will shape the outcome of your cases.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/gamedec-review",
          "publishedOn": "2021-09-16T14:00:00.000Z",
          "wordCount": 1798,
          "title": "Gamedec review: a great cyberpunk concept undone by a bloated script"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-trinkets",
          "author": "Rebecca Jones",
          "description": "What are the best trinkets in Deathloop? Trinkets might sound frivolous, but they are in fact Deathloop's answer to mods: applying them provides potentially very powerful combat buffs, and therefore they're actually very important. Deathloop's Trinkets come in two varieties: Character Trinkets (personal mods applied to your player character) and Weapon Trinkets (mods which can be applied individually to every gun in your possession).\n Read more",
          "link": "https://www.rockpapershotgun.com/deathloop-trinkets",
          "publishedOn": "2021-09-16T13:00:51.000Z",
          "wordCount": 2045,
          "title": "Best Deathloop trinkets: what every trinket does and which are best for your loadout"
        },
        {
          "id": "https://www.rockpapershotgun.com/mechwarrior-5-mercenaries-gets-marriage-melee-and-mech-switching-with-its-next-dlc",
          "author": "Imogen Beckhelling",
          "description": "Don't you just hate it when you're getting married to secure an alliance with a certain faction, but another faction insists on existing in-between your borders? Don't worry, it's a simple fix: send in an army of mechs to conquer them, then you and your betrothed get even more space to share! \r\n\n\r\nThis is pretty much the plot of the next MechWarrior 5: Mercenaries DLC, Legend Of The Kestrel Lancers. It's arriving on September 23rd alongside a free update that will finally let players punch other mechs in the face. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/mechwarrior-5-mercenaries-gets-marriage-melee-and-mech-switching-with-its-next-dlc",
          "publishedOn": "2021-09-16T13:00:00.000Z",
          "wordCount": 1358,
          "title": "MechWarrior 5: Mercenaries gets marriage, melee and mech-switching with its next DLC"
        },
        {
          "id": "https://www.rockpapershotgun.com/deltarune-chapter-2-continues-the-undertale-follow-up-tomorrow",
          "author": "Alice O'Connor",
          "description": "This week we'll get to play the second chapter of Deltarune, the neither-sequel-nor-prequel-but-maybe-related follow-up to Undertale, creator Toby Fox has announced. Surprise!\nRead more",
          "link": "https://www.rockpapershotgun.com/deltarune-chapter-2-continues-the-undertale-follow-up-tomorrow",
          "publishedOn": "2021-09-16T11:54:24.000Z",
          "wordCount": 894,
          "title": "Deltarune Chapter 2 continues the Undertale follow-up tomorrow"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-best-battle-royale-games",
          "author": "Ed Thorn",
          "description": "Outlast the rest of the competition and emerge the last person standing, that's the motto for the best battle royale games out there. Often there's a big circle of poison gas pushing people closer together, or like, everyone parachutes in for some reason. Some don't feature any of these things, and opt for obstacle courses, or zany community creations instead. You may have thought battle royale games were quite one-note, but they're actually quite varied. So below I've rounded up some of the best ways to prove you're the fittest survivor of them all.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-best-battle-royale-games",
          "publishedOn": "2021-09-16T11:06:09.000Z",
          "wordCount": 2800,
          "title": "The 10 best battle royale games"
        },
        {
          "id": "https://www.rockpapershotgun.com/skatebird-review",
          "author": "Brendan Caldwell",
          "description": "Skatebird is simultaneously a homage to the Tony Hawk games of old and a celebration of just how stupid birds can be. It's the arcadey kind of kickflipper, handling more like THUG than a Skate game. But don't expect the truly smooth flow of the Hawkster's outings. There's plenty of wobbly physics on show here, much of it intentional and jokey (as you'd expect from a game that seems to have resulted entirely from a single pun). But some of it perhaps not. Still, it's hard to hate on these feathery ones when they squawk so pure, and when their taste in music is im-peck-able.\nRead more",
          "link": "https://www.rockpapershotgun.com/skatebird-review",
          "publishedOn": "2021-09-16T11:02:28.000Z",
          "wordCount": 1849,
          "title": "Skatebird review: tiny hawks win the day in this wonky skating game"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-amazing-american-circus-review",
          "author": "Matt Cox",
          "description": "By the time Henry Ford rolled up to see my show, I was ready to pack my trunk and say goodbye to the circus. I’d been ready a long time ago, truth be told, some time between inciting industrial action amongst JP Morgan’s workers and nabbing an automaton from Tesla. My troupe spread delight wherever we roamed, but the crowds weren’t to know we’d been plying the same tricks for hour after hour - nor that it had hardly taken one to hone my act to the point where failure was inconceivable. Every meagre juggling trick brought whoops from the crowd and impatience to my heart. With every high-wire act, my spirit sank lower still. \r\n\n\r\nThere’s no turn around coming, I’m afraid. The Amazing American Circus is a deckbuilder with some nice ideas, but it’s far more clown than strongman. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-amazing-american-circus-review",
          "publishedOn": "2021-09-16T08:00:00.000Z",
          "wordCount": 1728,
          "title": "The Amazing American Circus review: I hate to say it, but there are better shows in town"
        },
        {
          "id": "https://www.rockpapershotgun.com/corsairs-pretty-240mm-aio-cooler-is-going-cheap-on-amazon-uk",
          "author": "Will Judd",
          "description": "Liquid CPU coolers are all the rage these days, as they look neat and provide the sort of excellent cooling performance you'd normally only get out of an oversized air cooler. Corsair make some of the best AiOs in the business, and today their (draws breath) iCue H100i Pro XT RGB 240mm CPU cooler (phew) is going cheap. It debuted at £115 and normally costs £90, but today you can pick it up for the relative bargain price of £72. \nRead more",
          "link": "https://www.rockpapershotgun.com/corsairs-pretty-240mm-aio-cooler-is-going-cheap-on-amazon-uk",
          "publishedOn": "2021-09-15T20:56:09.000Z",
          "wordCount": 927,
          "title": "Corsair's pretty 240mm AiO cooler is going cheap on Amazon UK"
        },
        {
          "id": "https://www.rockpapershotgun.com/a-crucial-mx500-1tb-ssd-for-85-headlines-a-host-of-newegg-deals",
          "author": "Will Judd",
          "description": "Newegg in the US is discounting a host of PC peripherals and components today, so we thought we'd highlight our favourite three deals especially for you. They include a full-size hot-swappable mechanical keyboard for $50, 16 gigabytes of 3600MHz RAM for $73 and a 1TB SSD for just $85. Here are all the details!\nRead more",
          "link": "https://www.rockpapershotgun.com/a-crucial-mx500-1tb-ssd-for-85-headlines-a-host-of-newegg-deals",
          "publishedOn": "2021-09-15T20:35:40.000Z",
          "wordCount": 1097,
          "title": "A Crucial MX500 1TB SSD for $85 headlines a host of Newegg deals"
        },
        {
          "id": "https://www.rockpapershotgun.com/battlefield-2042-rumoured-to-be-delayed-by-several-weeks",
          "author": "Graham Smith",
          "description": "Battlefield 2042 has been delayed until November 19th. EA Dice's futuristic shooter was originally due to release on October 11th, but a day of rumours was concluded by official confirmation of the new release date by EA.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/battlefield-2042-rumoured-to-be-delayed-by-several-weeks",
          "publishedOn": "2021-09-15T20:18:20.000Z",
          "wordCount": 792,
          "title": "Battlefield 2042 delayed until November 19th"
        },
        {
          "id": "https://www.rockpapershotgun.com/nidhogg-and-nidhogg-2-free-updates-add-new-levels-and-cats",
          "author": "Graham Smith",
          "description": "Good news! Chaotic multiplayer brawler Nidhogg 2 just received a free update adding new costumes and two new levels, including one set upon a train. Even better news: the original Nidhogg also received a free update, adding a new battleground and some new animated cats.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/nidhogg-and-nidhogg-2-free-updates-add-new-levels-and-cats",
          "publishedOn": "2021-09-15T19:35:57.000Z",
          "wordCount": 777,
          "title": "Nidhogg and Nidhogg 2 free updates add new levels and cats"
        },
        {
          "id": "https://www.rockpapershotgun.com/beaver-city-builder-timberborn-is-out-in-early-access-now",
          "author": "Graham Smith",
          "description": "It feels as if the past couple of years have seen a quiet resurgence of Settlers-style town building games, and often those where you're prepping to survive a terrible winter. Timberborn looks like it would sit in that genre but with a distinct twist: all the humans are long dead, and your town is instead inhabited by beavers.\r\n\nIt's out in early access now.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/beaver-city-builder-timberborn-is-out-in-early-access-now",
          "publishedOn": "2021-09-15T18:47:14.000Z",
          "wordCount": 818,
          "title": "Beaver city-builder Timberborn is out in early access now"
        },
        {
          "id": "https://www.rockpapershotgun.com/kerbal-space-program-developers-balsa-model-flight-simulator-is-out-now",
          "author": "Graham Smith",
          "description": "Building balsa models doesn't have the same immediate appeal as constructing space rockets, and yet Balsa Model Flight Simulator still seems extremely appealing. That's partly because it's from the original developer of Kerbal Space Program, and offers a similar physics construction toolset even if on a more terrestrial scale. It's available now in early access.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/kerbal-space-program-developers-balsa-model-flight-simulator-is-out-now",
          "publishedOn": "2021-09-15T18:08:49.000Z",
          "wordCount": 830,
          "title": "Kerbal Space Program developer's Balsa Model Flight Simulator is out now"
        },
        {
          "id": "https://www.rockpapershotgun.com/solar-ash-has-a-very-different-take-on-marios-mushroom-kingdom",
          "author": "Alice Bell",
          "description": "Hey, remember Hyper Light Drifter, your favourite action-RPG of five years ago? The devs Heart Machine are soon to be back with their new game Solar Ash, which is coming out at the end of next month. It is not like Hyper Light Drifer. For starters, Solar Ash is full 3D. Creative director Alx Preston described the elevator pitch to me as \"Super Mario Galaxy meets Shadow Of The Colossus, and sprinkle in a bit of Jet Set Radio\" during a hands off preview event last week, and on the face of it, it looks fantastic - something that you, too, may have gleaned from one of its recent trailers. \nBut Solar Ash is a game about motion, something that's very difficult to convey during a remote hands-off demo. I cannot tell you how Solar Ash feels, but I'm also a toddler with a marshmallow: put something that looks fuckin' sweet in front of me and I want to consume it, and snatch it up with my grabby little fingers. \nRead more",
          "link": "https://www.rockpapershotgun.com/solar-ash-has-a-very-different-take-on-marios-mushroom-kingdom",
          "publishedOn": "2021-09-15T16:00:00.000Z",
          "wordCount": 1363,
          "title": "Solar Ash has a very different take on Mario's Mushroom Kingdom"
        },
        {
          "id": "https://www.rockpapershotgun.com/aragami-2-review",
          "author": "Nic Reuben",
          "description": "‘Breezy’ seems like an odd word to slap on a stealth game - a measured, sometimes plodding genre - but it fits ninj-em-up Aragami 2 perfectly. Flow like water, it says; stabby water, with wings. Flow, then, like an irresponsibly sharp ice-sculpture of a hummingbird. Flow imperfectly and playfully, for the same tools that allow you to strike masterfully silent also let you mitigate sloppiness with improvisational glee. If Tenchu was an armoury to select from, and Shadow Tactics a map to study, Aragami 2 is a toybox. Let’s play ninjas, shall we?\nRead more",
          "link": "https://www.rockpapershotgun.com/aragami-2-review",
          "publishedOn": "2021-09-15T16:00:00.000Z",
          "wordCount": 1648,
          "title": "Aragami 2 review: a breezy ninja stealth 'em up"
        },
        {
          "id": "https://www.rockpapershotgun.com/bethesda-say-theyre-actively-investigating-deathloop-pc-stuttering",
          "author": "Alice O'Connor",
          "description": "While Arkane's time-looping supernatural shooter Deathloop is a good'un, the PC release has not gone down well, with many players reporting suffering framerates—the worst type of timejank. The problem still stands, a day-and-a-half after launch, but there is some comfort to be found in at least an official acknowledgment from publishers Bethesda that yes, they know it's a problem. Not nearly as much comfort as a fix would be. Maybe you'll find some meagre comfort in the unlikely source for this acknowledgement: a nice picture of some burgers.\nRead more",
          "link": "https://www.rockpapershotgun.com/bethesda-say-theyre-actively-investigating-deathloop-pc-stuttering",
          "publishedOn": "2021-09-15T15:58:49.000Z",
          "wordCount": 915,
          "title": "Bethesda \"actively investigating\" Deathloop PC stuttering"
        },
        {
          "id": "https://www.rockpapershotgun.com/shashingo-helps-you-learn-japanese-through-photography-and-id-like-it-now-please",
          "author": "Ed Thorn",
          "description": "Despite being half Japanese, I know very, very little of the language. It pains me, it really does. Occasionally I get this urge to learn it, and lately it's bubbled up because I'm planning on jetting over there next year [laughs in covid]. Unfortunately, all my efforts at self-study have gone down the pan.\nI've tried learning Japanese using audio courses and textbooks, but my discipline wanes only a couple of months in. There are many reasons why I suck at self-study, but flashcards are one of them. Sorry, but they suck and they are tedious. This is where I hope the upcoming 'edutainment' game Shashingo will change my relationship with them.\nRead more",
          "link": "https://www.rockpapershotgun.com/shashingo-helps-you-learn-japanese-through-photography-and-id-like-it-now-please",
          "publishedOn": "2021-09-15T15:25:02.000Z",
          "wordCount": 764,
          "title": "Shashingo helps you learn Japanese through photography and I'd like it now please"
        },
        {
          "id": "https://www.rockpapershotgun.com/now-a-union-have-filed-charges-against-activision-blizzard-too",
          "author": "Alice O'Connor",
          "description": "A group of Activision Blizzard workers have teamed up with a union to file charges of unfair labour practices, accusing the company of \"intimidation and union busting\". This comes less than two months after a California state agency sued the company for alleged discrimination, harrassment, and retaliation. The new charges filed with the labour board claim that Actiblizzard have attempted to stop employees from discussing working conditions or working together to improve them, in violation of labour law.\nRead more",
          "link": "https://www.rockpapershotgun.com/now-a-union-have-filed-charges-against-activision-blizzard-too",
          "publishedOn": "2021-09-15T15:09:12.000Z",
          "wordCount": 1134,
          "title": "Now a union have filed charges against Activision Blizzard too"
        },
        {
          "id": "https://www.rockpapershotgun.com/watch-the-i-am-dead-devs-explain-the-lovely-real-world-inspirations-behind-the-game",
          "author": "Kaan Serin",
          "description": "Hollow Ponds have released a video detailing the real-world inspirations behind their 2020 puzzle game I Am Dead, a game about a ghost returning to their hometown and view it through new (dead) eyes. The cultural specificity in I Am Dead becomes clear as the two lead developers, Richard Hogg and Ricky Haggett, discuss how the British seaside town of Hastings influenced the creation of the game’s fictional setting Shelmerston. It's 25 minutes long, but it's a lovely watch.\nHogg and Haggett give insights on the various buildings, objects, and jokes from Hastings that infiltrated their way into the game. The video shows off previously unseen concept art, photography, diagrams, maps and mood boards that were used in the development of I Am Dead. You will also learn a lot about the town Hastings.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/watch-the-i-am-dead-devs-explain-the-lovely-real-world-inspirations-behind-the-game",
          "publishedOn": "2021-09-15T15:04:39.000Z",
          "wordCount": 1227,
          "title": "Watch the I Am Dead devs explain the lovely real world inspirations behind the game"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-infusion-residuum",
          "author": "Rebecca Jones",
          "description": "How can you carry over weapons and powers in Deathloop? Deathloop is a darkly comedic action-adventure game which sees assassins Colt and Julianna attempting to kill each other time and time again over the course of a single looping day. The titular loop resets itself if the day ends before Colt can kill all eight Visionaries (including Julianna), or if Colt dies three times in a single mission. When this happens, Colt wakes up at the beginning of the day with everything reset — including any weapons, powers, and trinkets he managed to pick up during his last trip through the loop.\nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-infusion-residuum",
          "publishedOn": "2021-09-15T15:01:42.000Z",
          "wordCount": 1769,
          "title": "Deathloop infusion: how to carry over weapons and powers between loops with Residuum"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-water-resistant-is-this-water-resistant-mouse-a-scientific-investigation",
          "author": "James Archer",
          "description": "There are lots of spill-resistant keyboards, including some in our best gaming keyboard rankings, but you hardly ever see mice with similar protection. Despite the fact that they’re always right next to the keyboard, and thus just at risk from low-flying beverages. There are at least two, though: The SteelSeries Aerox 3 and Aerox 3 Wireless. According to SteelSeries, these were the first gaming mice on the market to receive IP54 certification, effectively guaranteeing protection against dust ingress and water splashes.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/how-water-resistant-is-this-water-resistant-mouse-a-scientific-investigation",
          "publishedOn": "2021-09-15T14:56:38.000Z",
          "wordCount": 1671,
          "title": "How water-resistant is this water-resistant mouse? A scientific investigation"
        },
        {
          "id": "https://www.rockpapershotgun.com/this-new-doom-mod-will-let-you-send-thatcher-back-to-hell",
          "author": "Alice O'Connor",
          "description": "Next week, reviled former British prime minister Margaret Thatcher will rise from her grave to bring Hell back to Earth, and only one space marine can stop her. Announced today, Thatcher's Techbase is an upcoming mod for classic Doom which ventures in the tenth circle of Hell (aka the United Kingdom) to battle the demonic forces of the Iron Lady. Modding politicians into games is a vintage jape but Thatcher's Techbase makes a real effort with custom art, its own campaign, music from Paradise Killer's composer, and apparently even the voice behind Demeter and Persephone in Hades. Watch this trailer.\nRead more",
          "link": "https://www.rockpapershotgun.com/this-new-doom-mod-will-let-you-send-thatcher-back-to-hell",
          "publishedOn": "2021-09-15T13:40:15.000Z",
          "wordCount": 941,
          "title": "This new Doom mod will let you send Thatcher back to Hell"
        },
        {
          "id": "https://www.rockpapershotgun.com/i-am-fish-review",
          "author": "Ed Thorn",
          "description": "Like a splash of cold water to the face, I Am Fish is a wonderfully refreshing physics platformer. This isn't a grim tale wrapped in layers of metaphor, or a walking simulator that guides you slowly through a field of feelings. Here, you are simply a fish. The bowl is your prison. The ocean is your freedom. Now imagine Ian Mckellen with the same gravitas as he had playing Gandalf in Lord Of The Rings, except with a farmer's cap on. He is peering into your googly, goldfish eyes. In a west country accent, he bellows, \"Swim, you fool!\"\nRead more",
          "link": "https://www.rockpapershotgun.com/i-am-fish-review",
          "publishedOn": "2021-09-15T13:00:00.000Z",
          "wordCount": 1660,
          "title": "I Am Fish review: a physics platformer with sole"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-weapons",
          "author": "Rebecca Jones",
          "description": "How many weapons are there in Deathloop and how do you get the best ones? Deathloop is about two assassins locked in a time-looping duel to the death, so naturally, there are weapons aplenty in this game. Thanks to the titular loop, you aren't always going to be able to hang on to every weapon you pick up, so knowing where and how to get your favourite weapons back is going to be important.\n Read more",
          "link": "https://www.rockpapershotgun.com/deathloop-weapons",
          "publishedOn": "2021-09-15T11:27:14.000Z",
          "wordCount": 2229,
          "title": "Best Deathloop weapons: every weapon in Deathloop explained"
        },
        {
          "id": "https://www.rockpapershotgun.com/death-trash-and-others-want-to-know-how-the-sausage-is-made",
          "author": "Andreas Inderwildi",
          "description": "“What’s with all the meat everywhere, anyway?” my Death Trash alter ego Mildred asks. “It’s just there. Grows.” the meat merchant replies. “Maybe we’re living on a planet full of flesh and right now we’re standing on a crust of stone and dirt. So, do you want a piece of meat now?” I really don’t. But Mildred does. After all, this mystery meat is the main healing item in the game. It’s what keeps you and the world around you alive. It’s harvested from the ground like precious stones, the literal blood flowing in this grotesque world’s barebones economy, eaten raw and served in meat bars.\nBut where does the meat come from? Whence the amorphous flesh blobs and pools of blood? From another planet, another dimension? There are no animals in this strange ecosystem apart from Fleshworms. The strange meat seems to be linked to another mystery, the advent of the flesh titans (which are exactly what the name suggests). Soon we discover that we are able to commune with the meat and, through it, speak to a enigmatic being called The Oracle. The meat is a kind of universal consciousness, a flesh and blood information highway, into which those who are attuned to it can plug in. Whether the meat and the flesh titans are good or bad for humanity is up for debate, and there are factions that deify and others that hate them, vying for power. The clot thickens.\nRead more",
          "link": "https://www.rockpapershotgun.com/death-trash-and-others-want-to-know-how-the-sausage-is-made",
          "publishedOn": "2021-09-15T11:00:00.000Z",
          "wordCount": 1627,
          "title": "Death Trash and others want to know how the sausage is made"
        },
        {
          "id": "https://www.rockpapershotgun.com/boyfriend-dungeon-broke-my-heart-and-im-glad-it-did",
          "author": "Kaan Serin",
          "description": "Kitfox’s recently released dating sim Boyfriend Dungeon has a novel premise. In Boyfriend Dungeon you date sword people: humans who transform into weapons that you can take dungeon crawling. And no, not sex dungeons. Classic video game dungeons with loot and monsters. On paper, Boyfriend Dungeon sounds like the best six-ish hours you could have in a game, combining the endorphin rush of monster-slaying with a cast of hotties that’ll make your heart flutter. Sounds like a great time… except one of these hotties slid a sword right through my heart.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/boyfriend-dungeon-broke-my-heart-and-im-glad-it-did",
          "publishedOn": "2021-09-15T10:03:46.000Z",
          "wordCount": 1787,
          "title": "Boyfriend Dungeon broke my heart, and I'm glad it did"
        },
        {
          "id": "https://www.rockpapershotgun.com/valve-posts-steam-deck-dev-kits-on-blog-and-in-mail",
          "author": "James Archer",
          "description": "The Steam Deck, Valve’s attempt at a fully portable handheld PC, has taken another step towards being an actual product. In a Steam blog post, Valve have shown off the Steam Deck dev kits that are leaving the roost to provide game developers with some hands-on time, ahead of the planned launch this December. They grow up so fast, eh?\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/valve-posts-steam-deck-dev-kits-on-blog-and-in-mail",
          "publishedOn": "2021-09-15T09:34:35.000Z",
          "wordCount": 1007,
          "title": "Valve posts Steam Deck dev kits, on blog and in mail"
        },
        {
          "id": "https://www.rockpapershotgun.com/everyones-invited-to-play-age-of-empires-4-this-weekend-in-a-stress-test",
          "author": "Alice O'Connor",
          "description": "After running an Age Of Empires 4 closed beta test for lucky ticketholders, the makers now want absolutely everyone to pile in and click men as hard as you can to see if the game explodes. The historical RTS is holding an open \"technical stress test\" this weekend, from Friday to Monday, to give the multiplayer backend a sound kicking and see if it stays stands. In short, hey, you can play AO4's multiplayer for free this weekend.\nRead more",
          "link": "https://www.rockpapershotgun.com/everyones-invited-to-play-age-of-empires-4-this-weekend-in-a-stress-test",
          "publishedOn": "2021-09-15T09:15:51.000Z",
          "wordCount": 843,
          "title": "Everyone's invited to play Age Of Empires 4 this weekend in a stress test"
        },
        {
          "id": "https://www.rockpapershotgun.com/heres-how-to-remove-deathloops-intro-logos",
          "author": "Graham Smith",
          "description": "If there's one thing I hate in this life, it's having to lift my hand onto the Esc key so I can press it to skip logos. Ideally I only lift my arms to deliver food to my maw, or to express my lack of care. So it's nice that someone has already identified which files to delete to remove the logos at the start of Arkane's new shooter Deathloop.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/heres-how-to-remove-deathloops-intro-logos",
          "publishedOn": "2021-09-14T22:46:10.000Z",
          "wordCount": 760,
          "title": "Here's how to remove Deathloop's intro logos"
        },
        {
          "id": "https://www.rockpapershotgun.com/stellaris-31-is-out-and-adds-new-content-to-old-dlc-alongside-many-balance-tweaks",
          "author": "Graham Smith",
          "description": "Scifi grand strategy Stellaris's free 3.1 update, titled \"Lem\", is out now. This is the first update created by \"The Custodians\", a new team formed within developers PDS Green focused on free, quarterly updates which tweak game balance, add new content to old DLC and fix bugs.\r\n\nThe \"Lem\" update does all three, changing how tradition trees work, adding new features to old species packs such as 2016's Planetoids, and rebalancing some Civics and Origins.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/stellaris-31-is-out-and-adds-new-content-to-old-dlc-alongside-many-balance-tweaks",
          "publishedOn": "2021-09-14T22:01:42.000Z",
          "wordCount": 976,
          "title": "Stellaris 3.1 is out and adds new content to old DLC"
        },
        {
          "id": "https://www.rockpapershotgun.com/wds-sn850-1tb-ssd-is-down-to-145-with-a-free-heatsink",
          "author": "Will Judd",
          "description": "The WD Black SN850 is a tremendously fast PCIe 4.0 SSD, capable of hitting some outrageous speeds - up to 7000MB/s reads and 5300MB/s writes. That makes it a great choice for any PC that can handle it (as well as the PS5, which gets external SSD support tomorrow). It's been discounted on Scan to £145 today, where you'll also get a free Akasa NVMe heatsink in the bargain. \nRead more",
          "link": "https://www.rockpapershotgun.com/wds-sn850-1tb-ssd-is-down-to-145-with-a-free-heatsink",
          "publishedOn": "2021-09-14T21:43:56.000Z",
          "wordCount": 980,
          "title": "WD's SN850 1TB SSD is down to £145 with a free heatsink"
        },
        {
          "id": "https://www.rockpapershotgun.com/deep-rock-galactic-now-has-official-mod-support-and-a-mod-that-gives-spiders-beards",
          "author": "Graham Smith",
          "description": "Mods are amazing and can never get enough love, so I'm glad to see that co-operative cave-diving FPS Deep Rock Galactic now has official mod support. It includes mod.io integration for browsing and installing mods, an in-game mod manager, and clearer communication for players joining modded servers, among a lot of other changes.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/deep-rock-galactic-now-has-official-mod-support-and-a-mod-that-gives-spiders-beards",
          "publishedOn": "2021-09-14T21:14:46.000Z",
          "wordCount": 840,
          "title": "Deep Rock Galactic now has official mod support"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-top-rated-dell-s2721dgfa-fast-ips-monitor-is-20-off-today",
          "author": "Will Judd",
          "description": "Dell's S2721DGFA has had a storied history, starting out as a critically acclaimed 27-in gaming monitor that no one could actually buy, to slowly becoming available over the months and finally now to being a great value option in the wake of several big price cuts. \nToday, the S2721DGFA has hit a historic low thanks to a code at the Dell UK site: using the phrase DAE40S at the checkout will knock the price from its usual £329 to just £265.94, a £63 savings and more than £100 cheaper than the same monitor at Amazon. That's an incredible price for one of the best gaming monitors on the planet. \nRead more",
          "link": "https://www.rockpapershotgun.com/the-top-rated-dell-s2721dgfa-fast-ips-monitor-is-20-off-today",
          "publishedOn": "2021-09-14T21:07:35.000Z",
          "wordCount": 1041,
          "title": "The top-rated Dell S2721DGFA Fast IPS monitor is 20% off today"
        },
        {
          "id": "https://www.rockpapershotgun.com/funcom-acquires-the-conan-and-mutant-year-zero-ip",
          "author": "Graham Smith",
          "description": "Funcom have acquired the Cabinet Group, the company which owns the intellectual properties Conan The Barbarian and Mutant Year Zero. Funcom have already developed several Conan games by licensing the IP, including the MMO Age Of Conan and more recently the survival game Conan Exiles. \r\n\nThe announcement also mentioned that a new game is currently in development which will star Conan and \"many of the characters in the Robert E. Howard universe.\"\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/funcom-acquires-the-conan-and-mutant-year-zero-ip",
          "publishedOn": "2021-09-14T20:46:50.000Z",
          "wordCount": 922,
          "title": "Funcom acquires the Conan and Mutant Year Zero IP"
        },
        {
          "id": "https://www.rockpapershotgun.com/cyberpunk-2077s-131-update-is-small-but-has-substantial-fixes",
          "author": "Graham Smith",
          "description": "The latest Cyberpunk 2077 patch is small, but the bugs it fixes aren't. 1.31 addresses issues that only affected some users, but they include issues that would halt progress on critical quests if they happened. The patch is live now.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/cyberpunk-2077s-131-update-is-small-but-has-substantial-fixes",
          "publishedOn": "2021-09-14T20:01:09.000Z",
          "wordCount": 1067,
          "title": "Cyberpunk 2077's 1.31 update is small but has substantial fixes"
        },
        {
          "id": "https://www.rockpapershotgun.com/hopes-for-god-of-war-on-pc-stoked-by-leaked-nvidia-list",
          "author": "Alice O'Connor",
          "description": "Ever since Sony began releasing PlayStation-exclusive games on PC too, many have been clamouring for more of the big'uns: God Of War, Spider-Man, chuffing Bloodborne for god's sake please Bloodborne. While Sony are still being coy about which games are coming our way, hopes were raised by a recent leaked list of games pulled from the digital guts of GeForce Now, which included a mention of God Of War for Steam. I wouldn't get too excited just yet. While Nvidia have confirmed the list itself was real, they say some games on the list were \"speculative\".\nRead more",
          "link": "https://www.rockpapershotgun.com/hopes-for-god-of-war-on-pc-stoked-by-leaked-nvidia-list",
          "publishedOn": "2021-09-14T17:25:11.000Z",
          "wordCount": 971,
          "title": "Hopes for God Of War on PC stoked by leaked Nvidia list"
        },
        {
          "id": "https://www.rockpapershotgun.com/pc-gaming-weekspot-podcast-053-deathloop",
          "author": "Colm Ahern",
          "description": "Yes, we all know the game has a very cool look, and all of us enjoy playing a good time loop game, but what actually is Deathloop? Thankfully, Matthew's played the first few hours and is here to enlighten both you and I.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/pc-gaming-weekspot-podcast-053-deathloop",
          "publishedOn": "2021-09-14T16:00:00.000Z",
          "wordCount": 834,
          "title": "The Weekspot podcast #053: in the loop"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-to-install-an-ssd",
          "author": "James Archer",
          "description": "Welcome to the RPS guide on how to install an SSD, which you’ll note is not titled “How to install an SSD or hard drive”. Yes yes, old-timey mechanical drives are cheaper, and better if you need terrabytes upon terabytes of space, but when you can buy a good-quality NVMe SSD like the WD Blue SN550 at £70 for 1TB…I mean, you should probably do that instead.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/how-to-install-an-ssd",
          "publishedOn": "2021-09-14T15:52:40.000Z",
          "wordCount": 1770,
          "title": "How to install an SSD"
        },
        {
          "id": "https://www.rockpapershotgun.com/met-gala-2021-outfits-remind-me-of-video-game-heroes-and-villains",
          "author": "Kaan Serin",
          "description": "The annual Met Gala event took place last night as some of the world's most famous people gathered to celebrate fashion. This year's theme was \"In America: A Lexicon of Fashion\", which is wildly inaccurate since most of the attendees decided to dress as video game heroes and villains. Fashion brands like Balenciaga and Versace designed outfits that wouldn't be out of place on a JRPG antagonist or in a Platinum game. Let's look at which celebrities decided to take the Paragon route and dress as a hero and who decided to go full Renegade, dressing as a video game boss.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/met-gala-2021-outfits-remind-me-of-video-game-heroes-and-villains",
          "publishedOn": "2021-09-14T15:21:13.000Z",
          "wordCount": 1289,
          "title": "Met Gala 2021 outfits remind me of video game heroes and villains"
        },
        {
          "id": "https://www.rockpapershotgun.com/total-war-warhammer-3-reveals-grand-cathays-army-created-for-the-game",
          "author": "Alice O'Connor",
          "description": "The mysterious army of Grand Cathay have finally been revealed for Total War: Warhammer 3, wearing their Chinese influences plainly. Grand Cathay have existed in the world of Warhammer (Warlore? Lorehammer?) for almost 30 years but not fielded a full plastic army, so one had to be created for Creative Assembly's fantasy strategy game. Led by dragons in human form, they field forces including Jade Warriors, towering Terracotta Sentinels, and the Celestial Dragon Guard. Come meet 'em in the new trailer below.\nRead more",
          "link": "https://www.rockpapershotgun.com/total-war-warhammer-3-reveals-grand-cathays-army-created-for-the-game",
          "publishedOn": "2021-09-14T14:07:05.000Z",
          "wordCount": 923,
          "title": "Total War: Warhammer 3 reveals Grand Cathay's army, created for the game"
        },
        {
          "id": "https://www.rockpapershotgun.com/dying-light-2-delayed-again-shambling-into-february-2022",
          "author": "Alice O'Connor",
          "description": "Parkour enthusiasts will need to wait two months longer to prance around an open-world city full of zombies (and zombies-to-be), because Dying Light 2 has been delayed again. Previously due December 7th, and spring 2020 before that, Dying Light 2 is now scheduled to launch on February 4th, 2022. The developers, Techland say they need extra time to make it good, yeah?\nRead more",
          "link": "https://www.rockpapershotgun.com/dying-light-2-delayed-again-shambling-into-february-2022",
          "publishedOn": "2021-09-14T13:17:55.000Z",
          "wordCount": 779,
          "title": "Dying Light 2 delayed again, shambling into February 2022"
        },
        {
          "id": "https://www.rockpapershotgun.com/come-and-gawp-at-clash-artifacts-of-chaos-gorgeous-sketchy-planet-in-this-new-dev-diary",
          "author": "Katharine Castle",
          "description": "The first-person brawler Zeno Clash games have been long-time favourites here at RPS, and when Chilean developers ACE Team announced they were making a new game set in their weird and wonderful Clash universe back in July, we were over the moon. Admittedly, Clash: Artifact Of Chaos' reveal trailer left a lot of unanswered questions at the time, but the good news is that we've got an early sneak peak at a new developer diary that tells us all about the game's story and what to expect when it eventually releases next year.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/come-and-gawp-at-clash-artifacts-of-chaos-gorgeous-sketchy-planet-in-this-new-dev-diary",
          "publishedOn": "2021-09-14T13:15:17.000Z",
          "wordCount": 976,
          "title": "Come and gawp at Clash: Artifacts Of Chaos' gorgeous, sketchy planet in this new dev diary"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-slabs-abilities",
          "author": "Rebecca Jones",
          "description": "Wondering how to collect and fully upgrade all the slabs in Deathloop? Slab abilities are the paranormal powers in Deathloop, the game's take on Dishonored's Void Powers and Prey's Neuromods. When playing as Colt or Julianna there are five of these slabs to pick up, as well as several levels of upgrades for each.\nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-slabs-abilities",
          "publishedOn": "2021-09-14T13:14:28.000Z",
          "wordCount": 2543,
          "title": "Deathloop slabs and abilities: how to obtain and fully upgrade all paranormal powers in Deathloop"
        },
        {
          "id": "https://www.rockpapershotgun.com/eastward-review",
          "author": "Katharine Castle",
          "description": "Wrangling flying pigs, saving a nerdy kid from the school bullies, cooking up exquisite dishes to appease a local casino boss whose slot machines you accidentally rinsed with your trusted lucky coin... These are the stories most adventure RPGs would stuff into their ever-growing sidequest menus - distractions meant to provide extra flavour to the world you're meant to be saving, or which hold bountiful supplies of EXP to level up your skills and weapons. Not so in Eastward.\nIn this impressive debut from Shanghai developers Pixpil, these humdrum slices of life are placed front and centre, forming much of the narrative backbone that drives the game forward. This is still a game that's ultimately about saving the world from a mysterious and all-consuming miasma, but it's also one that makes damn sure you know what you're doing it all for - and that's its striking cast of NPCs. As you busy yourself with the minutiae of their everyday lives, Eastward makes every person (and robot) count in this deadly post-apocalypse, and the result is an affecting, detail-rich tale that owes as much to the action of top-down Zelda games as it does to the role-playing intimacy of Earthbound. \nRead more",
          "link": "https://www.rockpapershotgun.com/eastward-review",
          "publishedOn": "2021-09-14T13:00:00.000Z",
          "wordCount": 2097,
          "title": "Eastward review: a stunning, but slow burning post-apocalypse adventure"
        },
        {
          "id": "https://www.rockpapershotgun.com/diablo-2-remaster-cutscenes-look-like-how-i-remember-the-originals",
          "author": "Alice O'Connor",
          "description": "I appreciate when a remaster of an old game looks like my memories of the original, a rose-tinted vision which would crumble if I looked at even one screenshot. Blizzard and Vicarious Visions have managed that with Diablo 2: Resurrected, from what I've seen, and a new trailer focuses on the redone cutscenes. And yeah, this is how I remember D2 cutscenes looking? They were dead fancy and high-tech, yeah? Must have looked like this?\nRead more",
          "link": "https://www.rockpapershotgun.com/diablo-2-remaster-cutscenes-look-like-how-i-remember-the-originals",
          "publishedOn": "2021-09-14T11:19:25.000Z",
          "wordCount": 872,
          "title": "Diablo 2 remaster cutscenes look like how I remember the originals"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-worlds-open-beta-hasnt-convinced-me-to-drop-final-fantasy-xiv",
          "author": "Ed Thorn",
          "description": "The last time I got some brief hands-on time with Amazon's upcoming MMO New World, I emerged from Aeternum feeling pretty positive about this new kid on the massively multiplayer block. Crafting, in particular, had me pretty excited. But having spent a big chunk of time in its open beta, I've come away feeling a bit, I don't know, bleh? If anything, I just wanted to go back to my beloved Final Fantasy XIV.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-worlds-open-beta-hasnt-convinced-me-to-drop-final-fantasy-xiv",
          "publishedOn": "2021-09-14T11:00:00.000Z",
          "wordCount": 1526,
          "title": "New World's open beta hasn't convinced me to drop Final Fantasy XIV"
        },
        {
          "id": "https://www.rockpapershotgun.com/apex-legends-will-keep-tap-strafing-at-least-for-now",
          "author": "Imogen Beckhelling",
          "description": "A couple of weeks ago, Respawn Entertainment said they were going to get rid of tap-strafing in Apex Legends, but now it seems they've changed their minds. Tap-strafing is a movement exploit that allows players to keep their momentum after slide-jumping, letting them make speedier turns than they should. Unfortunately for Respawn, they say getting rid of this tech has some \"unexpected side effects\", so tap-strafing gets to stay in the game, for now.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/apex-legends-will-keep-tap-strafing-at-least-for-now",
          "publishedOn": "2021-09-14T10:11:52.000Z",
          "wordCount": 980,
          "title": "Apex Legends will keep tap-strafing, at least for now"
        },
        {
          "id": "https://www.rockpapershotgun.com/amd-radeon-software-update-simplifies-overclocking-brings-smart-access-memory-to-older-gpus",
          "author": "James Archer",
          "description": "AMD have launched a big update for their Radeon Software app and Adrenalin drivers, unlocking a clutch of potentially frame rate-boosting features for those with recent AMD graphics cards and CPUs. The new version, 21.9.1, also includes a Windows 11 driver that gets Radeon Boost, Radeon Anti-Lag and Radeon Image Sharpening ready for Microsoft’s next big OS launch.\r\n\n\n\r\nIn the meantime, those with both a Ryzen 5000 series CPU and a Radeon RX 6000 series graphics card – those lucky enough to have found one in stock, I should say –  can take advantage of Radeon Software 21.9.1’s updated overclocking feature. In previous versions, it was possible to instantly overclock your graphics card with a single click; now you can do the same with both the GPU and CPU at once. Provided they’re from these specific product lines, mind.\r\n \nRead more",
          "link": "https://www.rockpapershotgun.com/amd-radeon-software-update-simplifies-overclocking-brings-smart-access-memory-to-older-gpus",
          "publishedOn": "2021-09-14T10:05:49.000Z",
          "wordCount": 1059,
          "title": "AMD Radeon Software update simplifies overclocking, brings Smart Access Memory to older GPUs"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-is-out-now-but-some-pc-players-report-stuttering",
          "author": "Alice O'Connor",
          "description": "Dishonored and Prey devs Arkane have released their latest superpowered sneak-o-shooter, the time-looping Deathloop. It's good, everyone tells me. However, one word of warning: a fair number of PC players are complaining about stuttering framerates, enough to bring it down to a 'Mixed' review rating on Steam. That's the sort of wonky time you don't want. If you want your initial loop o' death to be as slick as blood, maybe wait a bit in the hope of a fix?\nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-is-out-now-but-some-pc-players-report-stuttering",
          "publishedOn": "2021-09-14T09:46:23.000Z",
          "wordCount": 973,
          "title": "Deathloop is out now, but some PC players report stuttering"
        },
        {
          "id": "https://www.rockpapershotgun.com/craftopia-the-everything-game-is-on-xbox-game-pass-now",
          "author": "Graham Smith",
          "description": "The description under the latest trailer for Craftopia explains that its developers \"combined many features we find enjoyable, such as hunting, farming, hack-and-slash, building, [and] automation\" in making the game. It does not explain whether catching giraffes in Pokéball-like traps counts as \"hunting\", or whether blasting cows into space with a baseball bat is \"hack-and-slash.\"\r\n\nCraftopia remains every game that has ever existed, from Zelda to Factorio, just as it was last year - only now it's available via Xbox Game Pass.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/craftopia-the-everything-game-is-on-xbox-game-pass-now",
          "publishedOn": "2021-09-13T22:38:11.000Z",
          "wordCount": 801,
          "title": "Craftopia, the everything game, is on Xbox Game Pass now"
        },
        {
          "id": "https://www.rockpapershotgun.com/darkest-dungeon-2-will-launch-in-early-access-on-october-26th",
          "author": "Graham Smith",
          "description": "Darkest Dungeon 2 will launch in early access via the Epic Games Store on October 26th. Developers Red Hook announced the date via Twitter earlier today, after first announcing a 2021 release date in October of last year.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/darkest-dungeon-2-will-launch-in-early-access-on-october-26th",
          "publishedOn": "2021-09-13T21:39:53.000Z",
          "wordCount": 784,
          "title": "Darkest Dungeon 2 will launch in early access on October 26th"
        },
        {
          "id": "https://www.rockpapershotgun.com/twitch-are-suing-two-users-for-leading-hate-raids",
          "author": "Graham Smith",
          "description": "Twitch, the livestreaming platform, are suing two users for allegedly organising \"hate raids\" against streamers. According to the complaint, these users began in August 2021 to \"attack these streamers by flooding their chats with bot-powered Twitch accounts that spew racist, sexist, and homophobic language and content\" in violation of the Twitch terms of service.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/twitch-are-suing-two-users-for-leading-hate-raids",
          "publishedOn": "2021-09-13T21:01:02.000Z",
          "wordCount": 899,
          "title": "Twitch are suing two users for leading \"hate raids\""
        },
        {
          "id": "https://www.rockpapershotgun.com/the-winner-of-the-us-open-did-the-best-fifa-celebration",
          "author": "Graham Smith",
          "description": "The winner of the men's US Open tennis final called me a legend yesterday during post-match interviews. Daniil Medvedev was explaining the strange celebration he did immediately after his victory. \"Only legends will understand what I did after the match is 'L2 + Left'.\"\r\n\nAnd I did understand. L2 + Left is the best celebration from the FIFA series.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-winner-of-the-us-open-did-the-best-fifa-celebration",
          "publishedOn": "2021-09-13T20:16:40.000Z",
          "wordCount": 829,
          "title": "The winner of the US Open did the best FIFA celebration"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-samsung-980-pro-pcie-40-1tb-ssd-is-36-off-today",
          "author": "Will Judd",
          "description": "The Samsung 980 Pro SSD is one of the very fastest drives on the market, thanks to its PCIe 4.0 connection and 7000MB/s flash memory, and today it's been heavily discounted... on Amazon Germany. I know what you're thinking, but with a bare minimum of effort you can get the 1TB drive for £136, way below the current UK price of £172. Here's how it works. \nRead more",
          "link": "https://www.rockpapershotgun.com/the-samsung-980-pro-pcie-40-1tb-ssd-is-36-off-today",
          "publishedOn": "2021-09-13T18:40:53.000Z",
          "wordCount": 969,
          "title": "The Samsung 980 Pro PCIe 4.0 1TB SSD is £36 off today"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-nvidia-rtx-3080-ti-graphics-card-is-shockingly-available-to-purchase-in-the-uk",
          "author": "Will Judd",
          "description": "The Nvidia RTX 3080 Ti is currently available for purchase at its recommended retail price, a headline that would have ludicrous to write a few years ago but now constitutes major news. Scan in the UK have stock of the high-end card at its £1049 RRP, stock that has seemingly persisted for a few hours - one of only a handful of times that an Nvidia RTX graphics card at RRP hasn't sold out immediately. If you're building a high-end rig, I'd say this is a great option - as long as you can't find an RTX 3080, at least. \nRead more",
          "link": "https://www.rockpapershotgun.com/the-nvidia-rtx-3080-ti-graphics-card-is-shockingly-available-to-purchase-in-the-uk",
          "publishedOn": "2021-09-13T18:06:20.000Z",
          "wordCount": 949,
          "title": "The Nvidia RTX 3080 Ti graphics card is shockingly available to purchase in the UK"
        },
        {
          "id": "https://www.rockpapershotgun.com/paradox-ceo-admits-inappropriate-behaviour-towards-employee-in-2018",
          "author": "Alice O'Connor",
          "description": "Fredrik Wester, the CEO of Paradox Interactive, has publicly expressed regret for \"inappropriate behaviour\" towards an employee at a company event in 2018. This comes shortly after someone leaked the results of a union survey which revealed many employees felt they'd been mistreated at the company behind games including Crusader Kings and Hearts Of Iron. \"Accountability starts from the top,\" said Wester.\nRead more",
          "link": "https://www.rockpapershotgun.com/paradox-ceo-admits-inappropriate-behaviour-towards-employee-in-2018",
          "publishedOn": "2021-09-13T17:08:49.000Z",
          "wordCount": 929,
          "title": "Paradox CEO admits \"inappropriate behaviour\" towards employee in 2018"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-pc-performance-best-settings",
          "author": "James Archer",
          "description": "If you’ve read Brendan’s Deathloop review, you’ll know Arkane Lyon’s latest is a frequently hilarious time-loop shooter that’s worth getting trapped in. And if you’ve seen its official PC system requirements, you’ll also know it makes some big asks of your hardware. At least, in theory. After a few hours of testing it appears the minimum requirements aren’t quite so minimum, and it’s possible to get slick frame rates in Deathloop even on older graphics hardware – especially if you make a few choice settings adjustments. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-pc-performance-best-settings",
          "publishedOn": "2021-09-13T15:51:17.000Z",
          "wordCount": 2769,
          "title": "Deathloop: PC performance guide and the best settings to use"
        },
        {
          "id": "https://www.rockpapershotgun.com/total-war-warhammer-3-delayed-into-2022",
          "author": "Alice O'Connor",
          "description": "Alright, someone has to apologise to the neighbours and round up the dogs of war, because Total War: Warhammer 3 has been delayed. Previously expected late this year, the trilogy-concluding strategy game based on Games Workshop's fantasy plastic world is now due in 2022. The developers, Creative Assembly say they want to make sure it's good, yeah?\nRead more",
          "link": "https://www.rockpapershotgun.com/total-war-warhammer-3-delayed-into-2022",
          "publishedOn": "2021-09-13T15:43:11.000Z",
          "wordCount": 821,
          "title": "Total War: Warhammer 3 delayed into 2022"
        },
        {
          "id": "https://www.rockpapershotgun.com/epic-games-appealing-the-apple-app-store-battle-ruling",
          "author": "Alice O'Connor",
          "description": "Though a judge largely ruled against Epic Games on Friday in their App Store legal battle with Apple sparked by Fortnite in-app purchases on iOS, clearly that wouldn't be the end. It isn't. On Sunday, Epic filed a notice that yes, they're appealing the ruling. At this point they haven't said precisely what they object to and why but, y'know, they want it to go their way.\nRead more",
          "link": "https://www.rockpapershotgun.com/epic-games-appealing-the-apple-app-store-battle-ruling",
          "publishedOn": "2021-09-13T15:03:50.000Z",
          "wordCount": 902,
          "title": "Epic Games appealing the Apple app store battle ruling"
        },
        {
          "id": "https://www.rockpapershotgun.com/things-left-on-my-office-desk-after-18-months-of-working-from-home",
          "author": "Alice Bell",
          "description": "Apparently I am one of about six people in the entire world who hates working from home. I can't do it. At home I am lazy, unproductive, and I accidentally do hours of overtime despite this, because I have no place where work ends and home begins. In March 2020, we were all officially sent home for a temporary office closure, the definition of \"temporary\" soon being stretched as far as I allow my credulity to when I watch The Prestige. It's magical! David Bowie makes thousands of hats!\nAnyway, at the tail end of last week I returned to the office, which it turns out is still almost entirely empty. It's like working from home except I have to wear trousers (also Graham is here too so I can kick his chair and throw stuff at him). I spent a few hours on the first day creeping about looking at everything that had been left here for 18 months, and concluded that if our office were a level in a post-apocalyptic game, or a scene in 28 Days later, it would be pretty embarrassing.\nRead more",
          "link": "https://www.rockpapershotgun.com/things-left-on-my-office-desk-after-18-months-of-working-from-home",
          "publishedOn": "2021-09-13T15:00:12.000Z",
          "wordCount": 808,
          "title": "Things left on my office desk after 18 months of working from home"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-among-us-mods",
          "author": "Craig Pearson",
          "description": "Among Us made a hit out of some very basic minigames and complex social interaction. Surviving against the Imposters as they stab and lie their way through a game might rely more on the players than on the game, but you can craft a more complex base game with a few mod additions - the best of which we've rounded up right here. While you can’t mod your friends, you can mod the game, building on the anxiety-ridden camaraderie crusher by adding new roles and new modes to the basic format. Below, you’ll find out how to fall in love or enact the rule of law (by killing) with our guide to the best Among Us mods. \nRead more",
          "link": "https://www.rockpapershotgun.com/best-among-us-mods",
          "publishedOn": "2021-09-13T14:00:00.000Z",
          "wordCount": 2046,
          "title": "Best Among Us mods"
        },
        {
          "id": "https://www.rockpapershotgun.com/toem-review",
          "author": "Alice Bell",
          "description": "Remember that brief period in the 00s where everyone had a mobile phone, but none of them could take decent photos, so at least one girl per friendship group also had to have a small digital camera? Laboriously uploading and tagging. These are the photos that come up on your Facebook Memories, reminding you that for a brief period during your final year of school you started wearing 50s-ish neck scarves, for some reason. \nThe little black-and-white puzzle adventure game Toem, in which all problems are solved with a camera, reminds me of that. Not because you are able to make disasterous or whimisical fashion choices - you very much are, mostly in the hat department - but because you just take photos of everything, for the fun of it, to remember this thing you saw. Wonky-focused snaps of a flower, or a ladybird, or a nice building (poorly framed because you can't get all of it in shot). This isn't really photography for the camera nerds interested in lenses or different exposures. This is photography as a joyful insta-record of your life. I was here, I did this thing, it was good.\nRead more",
          "link": "https://www.rockpapershotgun.com/toem-review",
          "publishedOn": "2021-09-13T13:00:00.000Z",
          "wordCount": 1412,
          "title": "Toem review: a modern, yet nostalgic photography adventure"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-review",
          "author": "Brendan Caldwell",
          "description": "William Blake once wrote: \"Hold Infinity in the palm of your hand, and Eternity in an hour.\" Shut up, Blake. This is Deathloop. It is a full-blown action-comedy with a double jump. You get a sideways dash and a gun that splits to become two, smaller guns. If I see anyone trying to be too smart about this game, in which a time-looping assassin tries to break free of hilarious eternity by murdering many people who deserve it, I will look at them with hollow eyes and say: \"In Deathloop you regularly snap necks by 270 degrees.\" Turn away, poets and stealth likers. This is not your daddy's Dishonored.\nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-review",
          "publishedOn": "2021-09-13T12:01:00.000Z",
          "wordCount": 2476,
          "title": "Deathloop review: this is not your daddy's Dishonored"
        },
        {
          "id": "https://www.rockpapershotgun.com/destiny-2s-revamped-trials-of-osiris-is-great-and-hugely-popular",
          "author": "Alice O'Connor",
          "description": "When Bungie announced last year that they were reviving Destiny 2's serious PvP weekend event mode, Trials, they said \"It's important that this doesn't go out half-baked.\" Reader dear, it went out half-baked. But! Seventeen months and one revamp later, Trials Of Osiris is good now. Really good. With generous new reward systems, the option to queue solo, and a few anti-cheater measures, the return of Trials this weekend has seen a huge surge in player numbers and been, like, actually fun.\nRead more",
          "link": "https://www.rockpapershotgun.com/destiny-2s-revamped-trials-of-osiris-is-great-and-hugely-popular",
          "publishedOn": "2021-09-13T11:37:13.000Z",
          "wordCount": 1417,
          "title": "Destiny 2's revamped Trials Of Osiris is great, and hugely popular"
        },
        {
          "id": "https://www.rockpapershotgun.com/oxenfree-2s-villains-are-sending-spooky-signals-to-the-original-game",
          "author": "Imogen Beckhelling",
          "description": "The makers of Oxenfree have started teasing the upcoming sequel via audio transmissions in the original game. Oxenfree 2: Lost Signals is set to arrive sometime next year, and it'll feature villains who're causing mysterious radio signals that mess with electronics. But it seems they're already up to no good, because an update to the original Oxenfree has introduced these spooky transmissions, which you can hear in several different areas in the supernatural thriller. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/oxenfree-2s-villains-are-sending-spooky-signals-to-the-original-game",
          "publishedOn": "2021-09-13T11:31:03.000Z",
          "wordCount": 952,
          "title": "Oxenfree 2's villains are sending spooky signals to the original game"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-to-fish-in-genshin-impact",
          "author": "Amelia Zollner",
          "description": "Looking to learn how to fish in Genshin Impact? Genshin Impact’s 2.1 update is finally here, and it introduces an entirely new mechanic that will gives you something else to procrastinate searching for your missing sibling with: fishing! Before you can become Teyvat’s most accomplished angler, though, you’ll need to complete a short quest and become familiar with the fishing mechanic. Here’s everything you’ll need to know about fishing in Genshin Impact.\nRead more",
          "link": "https://www.rockpapershotgun.com/how-to-fish-in-genshin-impact",
          "publishedOn": "2021-09-13T11:00:55.000Z",
          "wordCount": 2417,
          "title": "How to fish in Genshin Impact"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-sunday-papers-610",
          "author": "Ed Thorn",
          "description": "Sundays are for staring at Mr Muscle, debating for a second whether you could take him, then coming to the conclusion that you absolutely couldn't. Before you consider things, let's read this week's best writing about games.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-sunday-papers-610",
          "publishedOn": "2021-09-12T10:00:00.000Z",
          "wordCount": 1390,
          "title": "The Sunday Papers"
        },
        {
          "id": "https://www.rockpapershotgun.com/star-dynasties-aka-crusader-kings-in-space-is-out-now",
          "author": "Graham Smith",
          "description": "It's always been a surprise that more games haven't followed in the footsteps of Crusader Kings, but Star Dynasties looks to give it a go. It's a space strategy game about growing your space empire, getting space married, and having space affairs. It left early access at the beginning of the month.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/star-dynasties-aka-crusader-kings-in-space-is-out-now",
          "publishedOn": "2021-09-11T20:47:36.000Z",
          "wordCount": 799,
          "title": "Star Dynasties aka 'Crusader Kings in space' is out now"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-eternal-cylinder-will-roll-onto-hard-drives-on-september-30th",
          "author": "Graham Smith",
          "description": "The Eternal Cylinder was first shown as a prototype six years ago. Back then, Adam described it as \"Billy Hatcher and the Giant Egg by way of Philip José Farmer, Icepick Lodge and Hieronymus Bosch, all set in the shadow of a hungry horizon.\" The prototype was a personal project of ACE Team co-founder Carlos Bordeu, who said that he wasn't yet sure what you would do in the game moment to moment.\r\n\nNow the game is reaching the end of its journey. ACE Team have announced you'll be able to flee the planetary rolling pin on September 30th.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-eternal-cylinder-will-roll-onto-hard-drives-on-september-30th",
          "publishedOn": "2021-09-11T19:02:31.000Z",
          "wordCount": 790,
          "title": "The Eternal Cylinder will roll onto hard drives on September 30th"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-epic-vs-apple-court-has-a-great-definition-of-video-games",
          "author": "Graham Smith",
          "description": "Epic's court case against Apple reached a conclusion yesterday, at least temporarily, but the judge's ruling didn't only address the big issues of app stores and payment systems. Judge Yvonne Gonzalez also offered an answer to a question raised during the trial: what is a game? Most surprisingly, Gonzalez's definition is pretty great.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-epic-vs-apple-court-has-a-great-definition-of-video-games",
          "publishedOn": "2021-09-11T18:34:34.000Z",
          "wordCount": 1019,
          "title": "The Epic vs. Apple court has a great definition of video games"
        },
        {
          "id": "https://www.rockpapershotgun.com/epic-vs-apple-us-court-rules-apple-must-allow-third-party-payment-systems",
          "author": "Graham Smith",
          "description": "iOS app developers must be allowed to direct users towards payment options other than those provided by Apple, a US judge has ruled in the Epic v. Apple case. Apple have 90 days, until December 9th, to comply. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/epic-vs-apple-us-court-rules-apple-must-allow-third-party-payment-systems",
          "publishedOn": "2021-09-11T17:27:40.000Z",
          "wordCount": 1192,
          "title": "Epic vs. Apple: US court rules Apple must allow third-party payment systems"
        },
        {
          "id": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-161",
          "author": "Alice Bell",
          "description": "I thought the air would be cleared by the tremendous thunderstorm that rattled my windows this week, but no. We are still all muggy. This is the worst of between times, where it is not quite warm enough to go without a hoody or a light cardigan, but definitely not cool enough that your t-shirt doesn't get stuck to both your back and your rucksack because of the sweat. Even though the rucksack said it had a special 'moisture wicking' bit of material on it to avoid this situation. WELL! I shall just cast my rucksack down this weekend and play games instead.\nRead more",
          "link": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-161",
          "publishedOn": "2021-09-11T08:00:00.000Z",
          "wordCount": 993,
          "title": "What are we all playing this weekend?"
        },
        {
          "id": "https://www.rockpapershotgun.com/rainbow-six-extractions-latest-trailer-shows-more-gadgets-and-operators",
          "author": "Graham Smith",
          "description": "I loved the wall-busting, door-blocking, remote-camera-ing gadgets that Rainbow Six Siege gave players, but the community quickly outpaced my ability to compete with them. That's why I'm looking forward to Tom Clancy's Rainbow Six Extraction. It broadly gives you the same toys, but you're using them against AI-controlled alien mutants. I'm traditionally alright at competing with those.\r\n\nThere was a new trailer showing the gadgets and operators in action during last night's PlayStation event, and you'll find it below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/rainbow-six-extractions-latest-trailer-shows-more-gadgets-and-operators",
          "publishedOn": "2021-09-10T20:22:55.000Z",
          "wordCount": 744,
          "title": "Rainbow Six Extraction's latest trailer shows more gadgets and operators"
        },
        {
          "id": "https://www.rockpapershotgun.com/what-videogame-would-you-like-to-look-at-outside-your-window",
          "author": "Graham Smith",
          "description": "'Frasier looking at video games' is the latest single-purpose Twitter account spreading across the games industry. Each tweet features the same still from the sitcom Frasier featuring Frasier Crane looking out his apartment windows, but in each the Seattle skyline has been replaced by a different videogame landscape.\r\n\nSo I ask you, if you were Frasier Crane, what videogame would you like to gaze upon from your fabulously expensive apartment?\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/what-videogame-would-you-like-to-look-at-outside-your-window",
          "publishedOn": "2021-09-10T19:27:30.000Z",
          "wordCount": 790,
          "title": "What videogame would you like to look at outside your window?"
        },
        {
          "id": "https://www.rockpapershotgun.com/konami-have-released-some-lofi-remixes-to-chillstudy-to",
          "author": "Graham Smith",
          "description": "It's the 35th anniversary of the Konami code, the string of button presses that first activated cheats in Gradius on the NES in 1986, but which would feature in many later Konami games as well. To celebrate the birthday of up up down down left right left right BA, Konami have produced some lofi hip hop to chill, study and/or relax to.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/konami-have-released-some-lofi-remixes-to-chillstudy-to",
          "publishedOn": "2021-09-10T18:49:09.000Z",
          "wordCount": 752,
          "title": "Konami have released some lofi remixes to chill/study to"
        },
        {
          "id": "https://www.rockpapershotgun.com/forza-horizon-5s-confirmed-car-list-is-enormous",
          "author": "Graham Smith",
          "description": "I don't know my carburetor from my timing belt drive pulley, so much so that I had to Google \"car engine parts\" in order to find a second reference for this sentence. The Forza Horizon series mostly operates on my wavelength, letting me be excited by cars because they're shiny and have smooth lines and go fast, without me needing to know their innards.\r\n\nThe list of cars so far confirmed for Forza Horizon 5 might mean different things to you than it does to me, then. To me it means that the Jaguar XJ220 I had as a toy when I was 8 is in there, but maybe you have opinions about different kinds of Land Rover.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/forza-horizon-5s-confirmed-car-list-is-enormous",
          "publishedOn": "2021-09-10T18:23:10.000Z",
          "wordCount": 810,
          "title": "Forza Horizon 5 sure has a lot of cars"
        },
        {
          "id": "https://www.rockpapershotgun.com/of-all-the-retro-final-fantasy-games-you-should-definitely-make-time-for-ff4",
          "author": "Katharine Castle",
          "description": "I came to Final Fantasy IV (or II, if you're American) pretty late in the day. At the time, back in the mists of 1991, it was never actually released in the UK. I was also just three-years-old then, but that's besides the point. Instead, we had to wait another decade until it got a proper UK release, where it landed on the original PlayStation in 2002. However, because I was young and naive and far too wrapped up playing Final Fantasies VII-IX at that point, it never even occurred to me to look back down the Roman numeral line and pick it up. Heck, I even missed its appearance on the GBA in 2006 - arguably the last 'best' version of this early 90s classic. It wasn't until the 3D Remake arrived on the Nintendo DS in 2008 that I finally sat up and took notice - a whole 17 years after it first came out. \nBut cor, I'm glad I did, because Final Fantasy IV is still arguably one of the best Final Fantasy games ever made, and is easily the best (or second best, depending on who you ask) of the older retro ones. If there's one Final Fantasy game you make time for over the next few months, make it FFIV. \nRead more",
          "link": "https://www.rockpapershotgun.com/of-all-the-retro-final-fantasy-games-you-should-definitely-make-time-for-ff4",
          "publishedOn": "2021-09-10T18:04:25.000Z",
          "wordCount": 904,
          "title": "Of all the retro Final Fantasy games, you should definitely make time for FF4"
        },
        {
          "id": "https://www.rockpapershotgun.com/tfi-friday-3-new-indie-games-for-back-to-school-season",
          "author": "Alice Bell",
          "description": "The past week or so has been Back To School time in the UK, also known as the season of adverts on TV about protractors and pencil cases, and posts on Facebook showing a six-year-old standing by a front door and wearing their new school uniform. A dance as old as time. I remember getting a blue jumper that was two sizes too big for me so I could grow into it. Remember it like it was yesterday.\nBut enough about school itself, a time in my life that I hated to an extraordinary extent and shudder to think of even now. We move to happier things, i.e. games, and in particular the assumption I'm making that now your kids are out of the house for most of the day, you'll have more time to play games. Here are three new indie games that came out in the last month or so, that I feel are apposite for a back-to-school theme.\nRead more",
          "link": "https://www.rockpapershotgun.com/tfi-friday-3-new-indie-games-for-back-to-school-season",
          "publishedOn": "2021-09-10T15:11:55.000Z",
          "wordCount": 1649,
          "title": "TFI Friday: 3 new indie games for back-to-school season"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-baddies-in-ghostwire-tokyos-new-trailer-look-like-buffys-the-gentlemen",
          "author": "Imogen Beckhelling",
          "description": "It must be a typical human fear to not like things with deathly pale faces, shadowy eyes, and suits. I know I'm certainly not a fan, but this specific type of villain has a habit of showing up in spooky games, films and TV series. Last night, paranormal action-RPG Ghostwire: Tokyo got a new trailer as part of the PlayStation showcase stream, and it's chock-full of these baddies that look an awful lot like the Gentlemen from Buffy The Vampire Slayer.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-baddies-in-ghostwire-tokyos-new-trailer-look-like-buffys-the-gentlemen",
          "publishedOn": "2021-09-10T14:43:52.000Z",
          "wordCount": 827,
          "title": "The baddies in Ghostwire Tokyo's new trailer look like Buffy's The Gentlemen"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-to-use-a-ps5-dualsense-controller-on-pc",
          "author": "James Archer",
          "description": "Sony’s DualSense pad is a lovely bit of peripheral design; it’s a shame, then, that figuring out how to use the PS5 controller on PC is a right old pain in the thumbstick. Without the Microsoft-masterminded, plug-and-play sensibilities of Xbox controllers, the PS5 controller often needs some help to get working on a Windows machine. It’s all doable, though, and this here guide will walk you through the setup process as well as how to get the most out of different games.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/how-to-use-a-ps5-dualsense-controller-on-pc",
          "publishedOn": "2021-09-10T14:40:08.000Z",
          "wordCount": 2194,
          "title": "How to use a PS5 DualSense controller on PC"
        },
        {
          "id": "https://www.rockpapershotgun.com/you-should-play-axis-football-2021-in-coach-mode",
          "author": "Sin Vega",
          "description": "The sport of Americaball was about the last thing I was expecting to enjoy in 2019. Since then, I've skipped an entry but come back for Axis Football 2021 and found myself impressed despite having higher standards now.\nIt may have taken a long iterative route, but this is becoming a strong sport series even if you're not a fan of pooting the old dogskin.\nRead more",
          "link": "https://www.rockpapershotgun.com/you-should-play-axis-football-2021-in-coach-mode",
          "publishedOn": "2021-09-10T14:30:00.000Z",
          "wordCount": 666,
          "title": "You should play Axis Football 2021 in coach mode"
        },
        {
          "id": "https://www.rockpapershotgun.com/tchia-had-the-best-trailer-in-the-playstation-showcase",
          "author": "Kaan Serin",
          "description": "Previously announced at The Game Awards 2020, cute adventure game Tchia received a brand-new trailer at last night’s PlayStation livestream and it looked gorgeous.\nTchia is an open world game set in a fictional series of islands, inspired by New Caledonia - a collection of islands that are in the Pacific but remain a French-administered territory. Our latest glimpse at Tchia was light on new details about the game but it still gave us updated looks at the vibrant environments, modes of traversal and cast of characters. Take a look at the trailer below. \nRead more",
          "link": "https://www.rockpapershotgun.com/tchia-had-the-best-trailer-in-the-playstation-showcase",
          "publishedOn": "2021-09-10T14:28:59.000Z",
          "wordCount": 970,
          "title": "Tchia had the best trailer in the PlayStation Showcase"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-looks-as-vibrant-and-murderous-as-ever-in-its-new-story-trailer",
          "author": "Imogen Beckhelling",
          "description": "In just four days Arkane's new time-looping stealth 'em up Deathloop will be part of our lives, and last night the devs treated us to a new trailer telling us a few titbits about the game's story. Of course, like most of the other trailers, it's also full of sneaking, cool powers, lotsa guns, and excellent fashion. It's almost like we're stuck in a timeloop ourselves, watching main character Colt slay his way through semi-familiar areas in new ways. I can't get enough of it.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-looks-as-vibrant-and-murderous-as-ever-in-its-new-story-trailer",
          "publishedOn": "2021-09-10T12:46:21.000Z",
          "wordCount": 933,
          "title": "Deathloop looks as vibrant and murderous as ever in its new story trailer"
        },
        {
          "id": "https://www.rockpapershotgun.com/wartales-is-a-tactical-rpg-that-wont-bog-you-down-with-quests-you-never-wanted-to-do-in-the-first-place",
          "author": "Imogen Beckhelling",
          "description": "I didn't realise how annoying I found main quests in RPGs until I played a game that didn't force one on me. That game is Wartales, an upcoming tactical open world game from the developers of Northgard, Shiro Games. It plonks you into a fairly mundane medieval world - in the sense that there' are no wizards's no magic, elves, or grand drama for you to fix - where you can just exist as mercenary doing as you please. It's coming out in early access at some point in the near future, and after having a go of the demo, I spoke to game director Nicolas Cannasse about why they chose to make a game that sets you free, rather than railroading you into some giant mission.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/wartales-is-a-tactical-rpg-that-wont-bog-you-down-with-quests-you-never-wanted-to-do-in-the-first-place",
          "publishedOn": "2021-09-10T12:00:00.000Z",
          "wordCount": 1610,
          "title": "Wartales is a tactical RPG that won't bog you down with quests you never wanted to do in the first place"
        },
        {
          "id": "https://www.rockpapershotgun.com/say-hello-to-felisha-and-paolo-our-first-official-comments-moderators",
          "author": "Katharine Castle",
          "description": "Reader comments have always been an incredibly important part of RPS, but sifting through them all often fell to the RPS staff. Since we were only looking at them during work hours, we'd often be slow to respond, and sometimes miss out on discussions entirely. The good news is that we've now got proper official comments moderators to help keep the conversation going, both between yourselves and between you and the wider RPS team. So please give a warm welcome to Felisha Dela Cruz and Paolo Balmes.\nRead more",
          "link": "https://www.rockpapershotgun.com/say-hello-to-felisha-and-paolo-our-first-official-comments-moderators",
          "publishedOn": "2021-09-10T11:49:40.000Z",
          "wordCount": 1036,
          "title": "Say hello to Felisha and Paolo, our first official comments moderators"
        },
        {
          "id": "https://www.rockpapershotgun.com/radiohead-team-up-with-epic-games-for-a-virtual-exhibition",
          "author": "Imogen Beckhelling",
          "description": "Radiohead are releasing a digital exhibition to celebrate the 21-year anniversary of their Kid A and Amnesiac albums, and it'll be available on the Epic Games Store this November. It's called the Kid A Mnesia Exhibition, and from the sounds of things we'll be able to explore some sort of interactive environment while we listen to the band's old iconic tunes. This certainly wasn't an Epic exclusive I was expecting, but it sounds pretty cool nonetheless.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/radiohead-team-up-with-epic-games-for-a-virtual-exhibition",
          "publishedOn": "2021-09-10T11:11:14.000Z",
          "wordCount": 816,
          "title": "Radiohead team up with Epic Games for a virtual exhibition"
        },
        {
          "id": "https://www.rockpapershotgun.com/halo-infinites-next-multiplayer-preview-is-targeting-sep-24th",
          "author": "Kaan Serin",
          "description": "Developer 343 have announced that Halo Infinite’s next multiplayer technical preview is “targeted” to arrive on September 24th. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/halo-infinites-next-multiplayer-preview-is-targeting-sep-24th",
          "publishedOn": "2021-09-10T10:57:45.000Z",
          "wordCount": 783,
          "title": "Halo Infinite's next multiplayer preview is targeting Sep 24th"
        },
        {
          "id": "https://www.rockpapershotgun.com/lost-in-random-review",
          "author": "Ed Thorn",
          "description": "Given it's called Lost In Random, you'd expect Zoink Games' new game to be filled with all sorts of oddities and twists and turns and things. Well, it sort of is. And it sort of isn't. I had hoped it would surprise me more, actually. This is a strategy-combat-meets-adventure game that's solid fun and has some great personality, but it gets a little too comfortable to knock you for six.\nRead more",
          "link": "https://www.rockpapershotgun.com/lost-in-random-review",
          "publishedOn": "2021-09-10T09:00:00.000Z",
          "wordCount": 1730,
          "title": "Lost In Random review: a grand adventure with few surprises"
        },
        {
          "id": "https://www.rockpapershotgun.com/forspokens-story-has-a-sassy-cuff-big-writers-and-oddly-stiff-faces",
          "author": "Graham Smith",
          "description": "During tonight's PlayStation livestream, we got a longer look at Square Enix's Forspoken. It's a third-person, open world action game in which you can go free running across a fantasy world, but the new trailer focuses on combat and on protagonist \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/forspokens-story-has-a-sassy-cuff-big-writers-and-oddly-stiff-faces",
          "publishedOn": "2021-09-09T22:30:32.000Z",
          "wordCount": 734,
          "title": "Forspoken's story has a sassy cuff, big writers, and oddly stiff faces"
        }
      ]
    },
    {
      "title": "Root.cz - články",
      "feedUrl": "https://www.root.cz/rss/clanky/",
      "siteUrl": "https://www.root.cz/clanky/",
      "articles": [
        {
          "id": "www.root.cz-text-15653",
          "author": "redakce@root.cz (Root.cz: Petr Škuta)",
          "description": "Se značkou Tuxedo jsme se zde již párkrát setkali. Recenzí prošly dvě generace ultrabooků řady Infinity Book. Nyní ale na redakční stůl zamířil stroj ze zcela opačného spektra, a to herní Tuxedo Stellaris 15. Jak dopadl?",
          "link": "https://www.root.cz/clanky/kanon-na-vrabce-recenze-herniho-notebooku-tuxedo-stellaris-15/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-16T22:00:10.000Z",
          "wordCount": 2461,
          "title": "Kanón na vrabce: recenze herního notebooku Tuxedo Stellaris 15",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/237/tuxedo-stellaris-15-front-1.jpg",
            "length": "47745",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15617",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Kompresní formát ZIP je přes třicet let starý, přesto by mohl být i v současnosti pro někoho zajímavý. Podporuje několik kompresních algoritmů, které si zde postupně rozebereme a na závěr všechny srovnáme.",
          "link": "https://www.root.cz/clanky/kompresni-algoritmy-v-souborech-zip-deflate-implode-a-srovnani/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-15T22:00:10.000Z",
          "wordCount": 2838,
          "title": "Kompresní algoritmy v souborech ZIP: Deflate, Implode a srovnání",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/515/zip-zips-1.jpg",
            "length": "100710",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15665",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "Často se setkáme s požadavkem na umožnění zápisu výrazů do vstupních formulářových polí, pro použití výrazů v konfiguračních souborech atd. Lze to řešit vložením interpretru plnohodnotného jazyka, ale mnohdy stačí doménově specifický jazyk (DSL).",
          "link": "https://www.root.cz/clanky/jazyk-go-a-vyhodnocovani-vyrazu-v-dobe-behu-aplikace/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-15T22:00:05.000Z",
          "wordCount": 4100,
          "title": "Jazyk Go a vyhodnocování výrazů v době běhu aplikace",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/336/golang-1.jpg",
            "length": "23658",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15664",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Největší setkání bastlířů, vynálezců a inovátorů v Česku se konalo v Průmyslovém paláci pražského Výstaviště. Představilo 150 makerských expozic, workshopů a přednášek, včetně zahraničních hostů.",
          "link": "https://www.root.cz/clanky/maker-faire-prague-2021-obrazem-setkani-bastliru-vynalezcu-a-inovatoru/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-14T22:00:10.000Z",
          "wordCount": 241,
          "title": "Maker Faire Prague 2021 obrazem: setkání bastlířů, vynálezců a inovátorů",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/588/maker-faire-prague-2021-1.jpg",
            "length": "70872",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15663",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Sonda do světa otevřeného softwaru. Dnes si řekneme o svobodné alternativě k Discordu, vyzkoušíme si aplikaci pro ovládání ITUSB1 USB Test Switch, dáme si dohromady knihovnu obrázků a stáhneme si do počítače instalační balíčky pro Android.",
          "link": "https://www.root.cz/clanky/softwarova-sklizen-15-9-2021/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-14T22:00:05.000Z",
          "wordCount": 993,
          "title": "Softwarová sklizeň (15. 9. 2021)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/root/368/kombajn-sklizen.jpg",
            "length": "394618",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15641",
          "author": "redakce@root.cz (Root.cz: Michal Tauchman)",
          "description": "Některé z mnou napsaných článků o legendárních počítačích končily zmínkou o nutnosti vrácení jejich původního vzhledu pomocí metody zvané retrobrighting. Výsledky svého letošního snažení bych rád krátce představil.",
          "link": "https://www.root.cz/clanky/projekt-retrobrighting/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-13T22:00:10.000Z",
          "wordCount": 2243,
          "title": "Retrobrighting: vraťte starému počítači původní vzhled",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/304/projekt-retrobrighting-perex-1.jpg",
            "length": "62590",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15659",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "Spirály se v různé podobě objevují na mnoha místech v přírodě, a to jak v malých škálách (ulity, popínavé rostliny), tak i na škálách odpovídajících planetám (víry v atmosféře) či dokonce celým galaxiím (spirální galaxie).",
          "link": "https://www.root.cz/clanky/krivky-v-prirode-i-v-pocitacove-grafice-svet-spiral/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-13T22:00:05.000Z",
          "wordCount": 7558,
          "title": "Křivky v přírodě i v počítačové grafice – svět spirál",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/507/krivka-perex-1.jpg",
            "length": "74201",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15661",
          "author": "redakce@root.cz (Root.cz: CESNET CERTS)",
          "description": "Dnes postřehneme zranitelnou VPN od Fortinetu, návrat starých a příchod nových známých, vykradené OSN i nového člena advisory boardu ProtonMailu. V rychlosti pak nové zranitelnosti Microsoft nástrojů či zamyšlení nad biometrickými údaji.",
          "link": "https://www.root.cz/clanky/postrehy-z-bezpecnosti-fortigate-pod-palbou/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-12T22:00:10.000Z",
          "wordCount": 1340,
          "title": "Postřehy z bezpečnosti: FortiGate pod palbou",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/573/fortinet-1.jpg",
            "length": "42840",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15658",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Projekt Pumpkin má za cíl oživit ukončený systém PalmOS na moderních strojích. Linux Mint se hodlá zaměřit na přepracování témat vzhledu. Na serveru OSNews vyšla obsáhlá recenze KDE Slimbooku. Program unzip na openSUSE poškozuje soubory.",
          "link": "https://www.root.cz/clanky/pumpkin-ozivuje-palmos-linux-mint-pracuje-na-vzhledu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-12T22:00:05.000Z",
          "wordCount": 1156,
          "title": "Pumpkin oživuje PalmOS, Linux Mint pracuje na vzhledu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/619/linux-mint-dark-1.jpg",
            "length": "59621",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15660",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "LG představila River OS, nový operační systém pro TV protkaný reklamou, VESA přidává certifikaci DisplayHDR True Black 600, vychází Wine 6.17 a také GNOME 41 Release Candidate s řadou vylepšení.",
          "link": "https://www.root.cz/clanky/apple-nabira-experty-na-risc-v-ibm-uvedla-prvni-servery-s-power10/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-11T22:00:10.000Z",
          "wordCount": 1592,
          "title": "Apple nabírá experty na RISC-V, IBM uvedla první servery s POWER10",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/485/risc-v-logo-1.png",
            "length": "49146",
            "type": "image/png"
          }
        }
      ]
    },
    {
      "title": "Root.cz - zprávičky",
      "feedUrl": "https://www.root.cz/rss/zpravicky/",
      "siteUrl": "https://www.root.cz/zpravicky/",
      "articles": [
        {
          "id": "www.root.cz-actuality-42826",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Mozilla a Canonical se dohodly, že Firefox bude v příštím vydání Ubuntu 21.10 dostupný jen jako balíček snap a ne jako doposud balíček deb. Výhodou je, že snap bude vytvářet přímo Mozilla a aktualizovaný Firefox bude tedy dostupný hned v den vydání. V současnosti Canonicalu trvá několik dní vyrobit deb balíček. Snap bude dostupný pro architektury amd64, arm64 a armhf.",
          "link": "https://www.root.cz/zpravicky/firefox-bude-v-ubuntu-21-10-jako-snap/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-17T10:50:03.000Z",
          "wordCount": 2241,
          "title": "Firefox bude v Ubuntu 21.10 jako snap",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/203/firefox-se-vzhledem-proton-1.png",
            "length": "134604",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-41285",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "VPN umožňuje bezpečně propojit různá zařízení pomocí šifrovaných tunelů. Umožňuje také zapojit uživatele do vnitřní sítě přes zabezpečený přístupový bod. Na našem školení VPN a bezpečné připojení k síti s OpenVPN si prakticky ukážeme, jak to celé nastavit a zprovoznit.",
          "link": "https://www.root.cz/zpravicky/vytvorte-si-bezpecnou-vpn-pomoci-openvpn-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-17T07:26:02.000Z",
          "wordCount": 765,
          "title": "Vytvořte si bezpečnou VPN pomocí OpenVPN (školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/102/openvpn-logo-1.jpg",
            "length": "18777",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42825",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "AMC Theaters je největším řetězcem kin na světě, má v Evropě 358 kin a v USA 620. Novinka se však týká jen kin v USA. Před měsícem bylo oznámeno, že do konce tohoto roku bude možné online platit lístky a předplatné pomocí Bitcoinu.",
          "link": "https://www.root.cz/zpravicky/v-kinech-amc-bude-mozne-platit-cryptomenami/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-17T06:40:10.000Z",
          "wordCount": 806,
          "title": "V kinech AMC bude možné platit kryptoměnami"
        },
        {
          "id": "www.root.cz-actuality-42824",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "V Londýně včera ve věku 81 let zemřel Sir Clive Sinclair, britský vynálezce a podnikatel. Známý je především jako tvůrce domácích počítačů ZX Spectrum. O jeho odchodu informoval britský deník The Guardian, s odkazem na informace od dcery Belindy. Příčinou jeho smrti byla dlouhodobá nemoc.",
          "link": "https://www.root.cz/zpravicky/zemrel-sir-clive-sinclair-tvurci-zx-spectra-bylo-81-let/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-17T06:04:37.000Z",
          "wordCount": 1390,
          "title": "Zemřel Sir Clive Sinclair, tvůrci ZX Spectra bylo 81 let",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/460/zx-spectrum-1.jpg",
            "length": "91866",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42821",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Útočníci na internetu vytrvale hledají nové způsoby, jak nelegálně vydělat peníze. Poznatky Cisco Talos ukazují, že stále častěji se tak děje na platformách, které umožňují sdílení síťového provozu, zvaných proxyware, jako jsou Honeygain, IPRoyal Pawns, Nanowire, Peer2Profit nebo PacketStream. Ty ve špatných rukou umožňují využívat konektivitu uživatelů bez jejich vědomí, protože běží na pozadí na infikovaném zařízení.",
          "link": "https://www.root.cz/zpravicky/novy-typ-kybernetickeho-utoku-zneuzitim-platforem-proxyware/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-16T12:28:08.000Z",
          "wordCount": 1031,
          "title": "Nový typ kybernetického útoku: zneužitím platforem proxyware",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/165/hacker-call-telefon-podvod-1.jpg",
            "length": "37190",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42820",
          "author": "redakce@root.cz (Root.cz: PeoplePath)",
          "description": "Dne 29. září 2021 od 18:00 společnost PeoplePath pořádá IT workshop s názvem PHP FFI aneb proč (ne)volat C kód z vašich webovek. Akce se koná v salonku v restauraci U Salzmannů v Plzni. Drobné občerstvení a pivo jsou samozřejmostí a vstupné je zdarma.",
          "link": "https://www.root.cz/zpravicky/itworkshop-v-plzni-php-ffi-aneb-proc-ne-volat-c-kod-z-vasich-webovek/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-16T08:31:01.000Z",
          "wordCount": 870,
          "title": "ITWorkshop v Plzni: PHP FFI aneb proč (ne)volat C kód z vašich webovek",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/602/workshop-meeting-konference-setkani-1.jpg",
            "length": "63051",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42819",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Společnost Intel připravuje do Linuxu zajímavou inovaci pro své platformy. První patche už do jádra zamířily a až se vše podaří dotáhnout do konce, bude možné na strojích Intel aktualizovat firmwary (zejména UEFI) bez nutnosti restartu stroje. Vše proběhne v rámci aktuálního běhu operačního systému.",
          "link": "https://www.root.cz/zpravicky/intel-seamless-update-aktualizace-uefi-bez-restartu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-15T07:00:00.000Z",
          "wordCount": 1252,
          "title": "Intel Seamless Update: aktualizace UEFI bez restartu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/640/intel-xeon-ice-lake-1.jpg",
            "length": "45315",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-38836",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Automatizace pomocí continuous integration přímo v Gitlabu. CI vám pomůže automatizovat rutinní procesy a ušetří vám hromadu času. Pomůže vám od automatického testování, buildy po nasazování. Chcete vědět víc? Přijďte na naše školení, které se uskuteční 29. září a proběhne plně online. Školí Ondřej Sika.",
          "link": "https://www.root.cz/zpravicky/gitlab-ci-automatizujte-primo-v-gitlabu-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-15T06:39:09.000Z",
          "wordCount": 767,
          "title": "Gitlab CI: automatizujte přímo v Gitlabu (školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/214/gitlab-ci-1.png",
            "length": "75559",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42818",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Na světě je nová hlavní verze Javy, resp. číselně stejná verze balíku OpenJDK. Sedmnáctka přináší několik novinek, například novou renderovací pipeline pro macOS (používá API Metal, OpenGL končí), podporu portu pro Apple M1, vylepšené pseudo-náhodné generátory čísel, označení Java Applet API za zastralé (naplánováno je odstranění), podpory sealed classes, odstranění experimentální kompilace ahead-of-time (AOT) a just-in-time (JIT), o další krok posunutých prací na Java Vector API či práce na context-specific deserializačních filtrech.",
          "link": "https://www.root.cz/zpravicky/java-17-a-openjdk-17-s-hotovym-maturing-vector-api-a-planovanym-koncem-applet-api/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-15T05:00:00.000Z",
          "wordCount": 9167,
          "title": "Java 17 a OpenJDK 17 s hotovým Vector API a plánovaným koncem Applet API",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/253/java-kava-na-drevu-1.jpg",
            "length": "50247",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42817",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Jedna z posledních změn v rámci vývoje příští verze jádra Linux 5.15 povyšuje minimální verzi GCC pro kompilaci. Až dosud stačilo GCC 4.9, nyní bude pro sestavení jádra potřeba minimálně GCC 5.1. Jde současně o verzi, která je už delší dobu potřebná pro build na architektuře Aarch64 (64bit ARM).",
          "link": "https://www.root.cz/zpravicky/linux-5-15-uz-nezkompilujete-s-gcc-4-9-a-starsim/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-14T22:00:00.000Z",
          "wordCount": 863,
          "title": "Linux 5.15 už nezkompilujete s GCC 4.9 a starším",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/344/tux-linux-1.jpg",
            "length": "22348",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42816",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Nová cenovka telefonu Librem 5 bude od listopadu tohoto roku 1199 dolarů. Telefon přitom v rámci kampaně šlo v roce 2017 předplatit za 599 dolarů, tedy poloviční částku. Dnes ještě stojí 899 dolarů, plus existuje verze vyráběná v USA s cenovkou 1999 dolarů. Hlavním důvodem dalšího výrazného růstu ceny je samozřejmě situace na trhu s komponentami a materiály.",
          "link": "https://www.root.cz/zpravicky/otevreny-telefon-librem-5-zdrazi-na-1199-usd/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-14T14:48:16.000Z",
          "wordCount": 2851,
          "title": "Otevřený telefon Librem 5 zdraží na 1199 USD",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/563/librem-5-1.jpg",
            "length": "28645",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42815",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Ladislav Lhotka, vedoucí Laboratoří CZ.NIC, je spoluautorem nového internetového standardu (RFC 9108), který v září vydala organizace IETF. Toto RFC převádí dva IANA registry do podoby vhodné pro datové modelování v jazyku YANG. Jde o dva důležité parametry služby DNS – třídy a typy zdrojových záznamů (resource records).",
          "link": "https://www.root.cz/zpravicky/organizace-ietf-schvalila-novy-internetovy-standard-spoluautorem-je-ladislav-lhotka-z-cz-nic/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-14T10:43:13.000Z",
          "wordCount": 809,
          "title": "Organizace IETF schválila nový internetový standard, spoluautorem je Ladislav Lhotka z CZ.NIC",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/595/ladislav-lhotka-1.jpg",
            "length": "32317",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42814",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "S dalším vydáním v rámci LTS řady 18.04 se už po loňské verzi 18.04.5 nepočítalo, nicméně revokace klíčů si vyžaduje vydání aktualizovaných instalačních obrazů této stále podporované LTS verze Ubuntu.",
          "link": "https://www.root.cz/zpravicky/neocekavane-vydani-ubuntu-18-04-6-lts-resi-revokaci-klicu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-14T09:59:32.000Z",
          "wordCount": 1144,
          "title": "Neočekávané vydání Ubuntu 18.04.6 LTS řeší revokaci klíčů",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/588/ubuntu-18-04-1.jpg",
            "length": "44398",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42813",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Jonathan Thomas informuje o nové verzi střižny OpenShot. Ta slouží primárně jako vydání opravující nahlášené chyby předchozí verze 2.6.0 z doby před pár týdny. Najdeme zde ale také automatickou migraci klíčových snímků u ořezu z projektů verze 2.5.1. Zpětná kompatibilita je zde 100%. Opraveny jsou také chyby v některých překladech (včetně slovenštiny) a mnoho překladů bylo vylepšeno.",
          "link": "https://www.root.cz/zpravicky/openshot-2-6-1-prinasi-vylepseni-orezu-a-opravy-chyb/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-13T22:00:00.000Z",
          "wordCount": 851,
          "title": "OpenShot 2.6.1 přináší vylepšení ořezu a opravy chyb",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/446/openshot-2-5-1-1.png",
            "length": "63448",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42812",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Střídání času se mělo podle Evropského parlamentu zastavit již letos. Jenže plány překřížila pandemie COVID-19. Dnes naše vláda schválila nařízení, že střídání času bude probíhat dalších pět let.",
          "link": "https://www.root.cz/zpravicky/stridani-casu-jeste-minimalne-pet-let-na-zruseni-neni-shoda/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-13T16:00:10.000Z",
          "wordCount": 17058,
          "title": "Střídání času ještě minimálně pět let, na zrušení není shoda",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/220/posun-casu-1.jpg",
            "length": "50077",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42811",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "V již rok trvajícím sporu Epic vs. Apple kvůli hře Fortnite byl v pátek vynesen 185 stránkový rozsudek kalifornským soudem. Ten dává většinou za pravdu Apple a Epic tak bude muset platit náhradu za platby Fortnite, které šly mimo AppStore. To dělá přes 3,6 milionů dolarů. A k tomu další náhrady.",
          "link": "https://www.root.cz/zpravicky/apple-musi-otevrit-platby-v-appstore/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-13T13:54:41.000Z",
          "wordCount": 3106,
          "title": "Apple musí otevřít platby v AppStore",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/289/apple-logo-1.jpg",
            "length": "11210",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42810",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Všichni jistě znáte GNU Wget, jednoduchý stahovač pro HTTPS, HTTP a FTP do příkazové řádky. Včera vyšel GNU Wget2 ve verzi 2.0.0 Jde o nové přepsání nástroje okolo knihovny libwget. Wget2 by měl být rychlejší než Wget, protože podporuje více vláken, HTTP/2, HTTP kompresi, TCP fast open a hlavičky If-Modified-Since.",
          "link": "https://www.root.cz/zpravicky/vysel-gnu-wget2-rychlejsi-wget/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-13T12:20:56.000Z",
          "wordCount": 787,
          "title": "Vyšel GNU Wget2, rychlejší Wget",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/582/prikazova-radka-termial-1.jpg",
            "length": "79556",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42809",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Vyhledávací stránku Google.com je možné nyní přepnout do tmavého vzhledu. Je potřeba být přihlášen a na stránce s výsledky zmáčknout ozubené kolečko vpravo nahoře. V nastavení vyhledávání se vám možná objeví nová položka vzhled. Tam je možné přepnout na tmavý, světlý a výchozí podle zařízení.",
          "link": "https://www.root.cz/zpravicky/vyhledavac-google-ma-tmavy-vzhled-zatim-ale-ne-pro-vsechny/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-13T08:32:12.000Z",
          "wordCount": 2286,
          "title": "Vyhledávač Google má tmavý vzhled, zatím ale ne pro všechny",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/473/tmavy-google-1.jpg",
            "length": "12818",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42808",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Linuxové jádro mírně „rozvolní“ opatření proti Spectre V2 a  V4 (Speculative Store Bypass) pro uživatelské úlohy. Od jádra 4.20 je výchozím chováním spec_store_bypass_disable=seccomp a spectre_v2_user=seccomp  , tedy jen pro úlohy používající SECCOMP (secure computing mode). Nově by mělo být nastaveno prctl, tedy jen pro procesy, které to mají nastaveno.",
          "link": "https://www.root.cz/zpravicky/linux-mirne-rozvolni-opatreni-proti-spectre/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-13T08:05:00.000Z",
          "wordCount": 838,
          "title": "Linux mírně rozvolní opatření proti Spectre",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/558/spectre-meltdown-1.jpg",
            "length": "35642",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-40574",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Linuxových systémů přibývá, každý den se spouštějí nové servery a někdo se o ně musí starat. To znamená spoustu různých dovedností specifických právě pro linuxové prostředí. Jak to zprovoznit, kudy bezpečně dovnitř, co tam najdeme, jak se o to postaráme a jak to nastavíme nebo rozšíříme.",
          "link": "https://www.root.cz/zpravicky/naucte-se-pouzivat-linux-spravne-a-bezpecne-online-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-13T06:30:35.000Z",
          "wordCount": 819,
          "title": "Naučte se používat Linux správně a bezpečně (online školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/440/skoleni-1.jpg",
            "length": "61676",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42807",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Některé notebooky s novými procesory AMD mají problémy s probuzením ze spánku s2idle. Mezi nimi například HP Envy x360. Po probuzení například nesvítí dioda napájení, nefunguje ovládání jasnosti displeje či dokonce nefunguje ventilátor.",
          "link": "https://www.root.cz/zpravicky/oprava-uspavani-notebooku-s-amd-bude-v-jadre-5-15/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-10T12:26:01.000Z",
          "wordCount": 3104,
          "title": "Oprava uspávání notebooků s AMD bude v jádře 5.15",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/23/hp-envy-x360-1.jpg",
            "length": "32282",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42806",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Procesory AMD Zen 2 a 3 budou mít lepší ovladač frekvencí amd_pstate místo doposud používaného acpi_cpufreq. Nový ovladač bude lépe využívat možností procesoru podobně jako u Intelu intel_pstate. Používat bude rozhraní ACPI CPPC (Collaborative Processor Performance Controls), které umožňuje jemnější řízení než staré ACPI. Z počátku bude podpora pouze pro Zen 3, později bude přidána podpora Zen 2.",
          "link": "https://www.root.cz/zpravicky/amd-bude-mit-ovladac-frekvenci-procesoru-amd-pstate-o-11-lepsi-vykon-na-watt/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-10T11:33:16.000Z",
          "wordCount": 1819,
          "title": "AMD bude mít ovladač frekvencí procesoru amd_pstate, o 11 % lepší výkon na Watt",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/276/ryzen-9-5950x.jpg",
            "length": "24776",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42805",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Švýcarská šifrovaná e-mailová služba ProtonMail dříve prohlašovala, že ve výchozím stavu neloguje IP adresy ani další detaily uživatelů.",
          "link": "https://www.root.cz/zpravicky/protonmail-predal-ip-adresu-francouzskych-aktivistu-policii/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-10T08:27:51.000Z",
          "wordCount": 10551,
          "title": "ProtonMail předal IP adresu francouzských aktivistů policii, doporučuje používat tor",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/root/323/protonmail-1.png",
            "length": "349157",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42804",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Distribuce Manjaro Linux Cinnamon změní výchozí prohlížeč. Původní Firefox bude nahrazen prohlížečem Vivaldi. Vývojáři distribuce vysvětlují, proč ke změně přikročili: Aby měl Vivaldi větší pozornost, kterou si zaslouží, rozhodli jsme se jej zahrnout jako výchozí prohlížeč do naší oblíbené Cinnamon Community Edition. Díky pozoruhodné rychlosti, výjimečné přizpůsobitelnosti a zejména způsobu, jakým hodnotí soukromí uživatelů.",
          "link": "https://www.root.cz/zpravicky/manjaro-linux-cinnamon-meni-vychozi-prohlizec-namisto-firefoxu-nasadi-vivaldi/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-10T07:41:44.000Z",
          "wordCount": 2583,
          "title": "Manjaro Linux Cinnamon mění výchozí prohlížeč, namísto Firefoxu nasadí Vivaldi",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/159/vivaldi-1.jpg",
            "length": "12784",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42803",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Nový botnet nazvaný Mēris, který během léta získával na síle, vytrvale útočí na ruskou společnost Yandex. Ta nyní ohlásila rekordní útok, který ve špičce představoval 21,8 milionů požadavků za sekundu (RPS). V srpnu přitom CloudFlare ohlásil předchozí rekord ve výši 17,2 milionů RPS – za ním stojí úplně stejný botnet.",
          "link": "https://www.root.cz/zpravicky/botnet-m-ris-vytvoril-rekordni-utok-s-21-8-miliony-pozadavku-za-sekundu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-10T07:28:20.000Z",
          "wordCount": 916,
          "title": "Botnet Mēris vytvořil rekordní útok s 21,8 miliony požadavků za sekundu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/545/botnet-1.jpg",
            "length": "80819",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "abclinuxu - aktuální články",
      "feedUrl": "http://www.abclinuxu.cz/auto/abc.rss",
      "siteUrl": "http://www.abclinuxu.cz/clanky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/clanky/distribucni-novinky-34-35-2021",
          "author": "Redakce",
          "description": "Závěr letních prázdnin a začátek školního roku přinesly několik významných vydání, LibreELEC s novým Kodi, příručky Linux From Scratch nebo novou stabilní větev OpenWrt, a také aktualizace Clonezilly, Ubuntu LTS, EndeavourOS či EasyOS.",
          "link": "http://www.abclinuxu.cz/clanky/distribucni-novinky-34-35-2021",
          "publishedOn": "2021-09-13T23:00:00.000Z",
          "wordCount": 1640,
          "title": "Distribuční novinky 34-35/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-sprava-a-analyza-dat-tlaci-podniky-do-cloudu",
          "author": "Redakce",
          "description": "Lenovo představuje hybridní tablety budoucnosti. Canon rozšiřuje nabídku A3 multifunkcí pro hybridní pracovní prostředí. Správa a analýza dat tlačí podniky do cloudu.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-sprava-a-analyza-dat-tlaci-podniky-do-cloudu",
          "publishedOn": "2021-09-12T22:01:00.000Z",
          "wordCount": 1245,
          "title": "Týden na ITBiz: Správa a analýza dat tlačí podniky do cloudu"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-dokazali-prepnout-vodivost-z-2d-na-1d",
          "author": "Redakce",
          "description": "Topologické izolátory. Janusovský grafen a baterie. Zachycen nový typ gravitačních vln. Dvojvrstvý borofen. Hledání mimozemských civilizací. Dysonovy sféry u černých děr. Planeta Devět. Oblečení z umělých svalových vláken.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-dokazali-prepnout-vodivost-z-2d-na-1d",
          "publishedOn": "2021-09-11T22:01:00.000Z",
          "wordCount": 1594,
          "title": "Týden na ScienceMag.cz: Dokázali přepnout vodivost z 2D na 1D"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-36-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-36-2021",
          "publishedOn": "2021-09-10T22:01:00.000Z",
          "wordCount": 2248,
          "title": "Událo se v týdnu 36/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/originalni-dozivotni-aktivacni-klic-windows-10-pro-za-pouhych-12-52-eur-odgoodoffer24.com",
          "author": "Reklama",
          "description": "Získejte doživotní aktivační klíč k Windows 10 za 12,52 EUR na prodejním portálu GoodOffer24.com. Kromě toho zde můžete získat mnohem více, od dalších nástrojů produktivity od Microsoftu, až po hry. Nezapomeňte zadat před dokončením nákupu slevový kód  AX30.",
          "link": "http://www.abclinuxu.cz/clanky/originalni-dozivotni-aktivacni-klic-windows-10-pro-za-pouhych-12-52-eur-odgoodoffer24.com",
          "publishedOn": "2021-09-10T20:30:00.000Z",
          "wordCount": 1380,
          "title": "Originální doživotní aktivační klíč Windows 10 Pro za pouhých 12,52 EUR od Goodoffer24.com"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/jaderne-noviny-prehled-za-srpen-2021",
          "author": "Redakce",
          "description": "Přehled srpnových vydání Jaderných novin: stav vydání jádra, citáty týdne a seznam článků týkajících se jádra.",
          "link": "http://www.abclinuxu.cz/clanky/jaderne-noviny-prehled-za-srpen-2021",
          "publishedOn": "2021-09-06T22:01:00.000Z",
          "wordCount": 2042,
          "title": "Jaderné noviny – přehled za srpen 2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-co-prozradi-mys",
          "author": "Redakce",
          "description": "Grafen vrací do hry pevné disky, hustota dat může vzrůst až 10krát. Hlavní chyby digitální transformace. Kontejnery jsou klíčová technologie při vývoji podnikových aplikací. Co prozradí myš.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-co-prozradi-mys",
          "publishedOn": "2021-09-05T22:01:00.000Z",
          "wordCount": 1329,
          "title": "Týden na ITBiz: Co prozradí myš"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-zachytili-rozpad-elektronu-na-chargon-a-spinon",
          "author": "Redakce",
          "description": "Kvantové spinové kapaliny. Delší dolet dronů díky palivovým článkům. Po 12 letech ukončuje provoz český tokamak COMPASS. Odhady hmotností černých děr. Pozornost si zaslouží i měsíce Uranu.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-zachytili-rozpad-elektronu-na-chargon-a-spinon",
          "publishedOn": "2021-09-04T22:01:00.000Z",
          "wordCount": 1630,
          "title": "Týden na ScienceMag.cz: Zachytili rozpad elektronu na chargon a spinon"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-35-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-35-2021",
          "publishedOn": "2021-09-03T22:01:00.000Z",
          "wordCount": 2523,
          "title": "Událo se v týdnu 35/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/cdkdeals-back-to-school-se-softwarem-produktivity-za-cenu-obeda",
          "author": "Reklama",
          "description": "Nový školní rok je tady, tak neváhejte a pořiďte softwarové nástroje produktivity z nabídky CDKDeals za ceny, které byste mohli přirovnat k platbě za oběd nebo večeři v restauraci! Kdybyste pak chtěli více, třeba hry, vyberete si také. Když před dokončením nákupu zadáte slevový kód AX30, máte dalších 30 % z ceny dolů!",
          "link": "http://www.abclinuxu.cz/clanky/cdkdeals-back-to-school-se-softwarem-produktivity-za-cenu-obeda",
          "publishedOn": "2021-09-01T14:00:00.000Z",
          "wordCount": 1264,
          "title": "CDKDeals: Back to School se softwarem produktivity za cenu oběda"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/distribucni-novinky-31-33-2021",
          "author": "Redakce",
          "description": "V srpnu byl vydán nejen stabilní Debian 11 „Bullseye“, ale i nový OSMC, elementary OS, Zorin OS, IPFire nebo Sparky Linux. Aktualizací se dočkaly také Tails, Manjaro či KaOS.",
          "link": "http://www.abclinuxu.cz/clanky/distribucni-novinky-31-33-2021",
          "publishedOn": "2021-08-31T20:00:00.000Z",
          "wordCount": 1852,
          "title": "Distribuční novinky 31-33/2021"
        }
      ]
    },
    {
      "title": "abclinuxu - čerstvé zprávičky",
      "feedUrl": "http://www.abclinuxu.cz/auto/zpravicky.rss",
      "siteUrl": "http://www.abclinuxu.cz/zpravicky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/zpravicky/firefox-ve-formatu-snap-v-ubuntu-desktopu",
          "author": "Ladislav Hagara",
          "description": "Vývojáři Ubuntu oznámili, že v Ubuntu Desktopu bude Firefox ve formátu deb nahrazen Firefoxem ve formátu snap vydávaným přímo Mozillou. Pravděpodobně již ve verzi 21.10.",
          "link": "http://www.abclinuxu.cz/zpravicky/firefox-ve-formatu-snap-v-ubuntu-desktopu",
          "publishedOn": "2021-09-17T07:29:00.000Z",
          "wordCount": 1752,
          "title": "Firefox ve formátu snap v Ubuntu Desktopu"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/linux-mint-ma-nove-webove-stranky",
          "author": "Ladislav Hagara",
          "description": "Linux Mint má nové webové stránky. Pro porovnání stránky z minulého týdne.",
          "link": "http://www.abclinuxu.cz/zpravicky/linux-mint-ma-nove-webove-stranky",
          "publishedOn": "2021-09-16T22:01:26.000Z",
          "wordCount": 801,
          "title": "Linux Mint má nové webové stránky"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/deno-1.14",
          "author": "Ladislav Hagara",
          "description": "Deno (Wikipedie), běhové prostředí (runtime) pro JavaScript a TypeScript, bylo vydáno ve verzi 1.14. Přehled novinek v poznámkách k vydání.",
          "link": "http://www.abclinuxu.cz/zpravicky/deno-1.14",
          "publishedOn": "2021-09-16T21:19:14.000Z",
          "wordCount": 799,
          "title": "Deno 1.14"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/zemrel-clive-sinclair-tvurce-pocitace-zx-spectrum",
          "author": "Ladislav Hagara",
          "description": "Dnes ve věku 81 let zemřel Clive Sinclair, známý především jako tvůrce počítače ZX Spectrum.",
          "link": "http://www.abclinuxu.cz/zpravicky/zemrel-clive-sinclair-tvurce-pocitace-zx-spectrum",
          "publishedOn": "2021-09-16T20:59:01.000Z",
          "wordCount": 1414,
          "title": "Zemřel Clive Sinclair, tvůrce počítače ZX Spectrum"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/apache-http-server-httpd-2.4.49",
          "author": "Ladislav Hagara",
          "description": "Byla vydána nová verze 2.4.49 svobodného multiplatformního webového serveru Apache (httpd). Řešeno je také 5 bezpečnostních chyb (CVE-2021-40438, CVE-2021-39275, CVE-2021-36160, CVE-2021-34798 a CVE-2021-33193). Více o CVE-2021-33193 s CVSS 7.5 v článku HTTP/2: The Sequel is Always Worse.",
          "link": "http://www.abclinuxu.cz/zpravicky/apache-http-server-httpd-2.4.49",
          "publishedOn": "2021-09-16T12:56:00.000Z",
          "wordCount": 826,
          "title": "Apache HTTP Server (httpd) 2.4.49"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/unicode-14.0",
          "author": "Fluttershy, yay!",
          "description": "Standard Unicode 14.0 byl finalizován. Přibylo 838 znaků: podpora několika jazyků, zápis znamenného zpěvu a 37 nových emoji. Doplněny byly také doprovodné specifikace, např. dělení znaků a zalamování řádků.",
          "link": "http://www.abclinuxu.cz/zpravicky/unicode-14.0",
          "publishedOn": "2021-09-16T12:00:38.000Z",
          "wordCount": 1492,
          "title": "Unicode 14.0"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/eclipse-ide-2021-09-aneb-eclipse-4.21",
          "author": "Ladislav Hagara",
          "description": "Bylo vydáno Eclipse IDE 2021-09 aneb Eclipse 4.21. Představení novinek tohoto integrovaného vývojového prostředí také na YouTube.",
          "link": "http://www.abclinuxu.cz/zpravicky/eclipse-ide-2021-09-aneb-eclipse-4.21",
          "publishedOn": "2021-09-16T00:19:22.000Z",
          "wordCount": 808,
          "title": "Eclipse IDE 2021-09 aneb Eclipse 4.21"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/novinky-od-pine64-09-2021",
          "author": "Ladislav Hagara",
          "description": "Společnost PINE64 stojící za telefonem PinePhone, notebooky Pinebook a Pinebook Pro, IP kamerou PineCube, hodinkami PineTime, páječkou (pájecím perem) Pinecil, zdroji PinePower nebo RISC-V vývojovou deskou PineCone publikovala na svém blogu zářijový souhrn novinek (YouTube).",
          "link": "http://www.abclinuxu.cz/zpravicky/novinky-od-pine64-09-2021",
          "publishedOn": "2021-09-15T15:02:02.000Z",
          "wordCount": 829,
          "title": "Novinky od PINE64 - 09/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/omigod-kriticke-bezpecnostni-chyby-v-agentu-omi-v-linuxech-v-microsoft-azure",
          "author": "Ladislav Hagara",
          "description": "Byly publikovány informace o 4 kritických bezpečnostních chybách se společným názvem OMIGOD v agentu OMI (Open Management Infrastructure) instalovaném ve virtuálních počítačích s Linuxech v Microsoft Azure. Zneužít je lze k LPE i RCE. CVSS 9.8",
          "link": "http://www.abclinuxu.cz/zpravicky/omigod-kriticke-bezpecnostni-chyby-v-agentu-omi-v-linuxech-v-microsoft-azure",
          "publishedOn": "2021-09-15T14:23:28.000Z",
          "wordCount": 1055,
          "title": "OMIGOD, kritické bezpečnostní chyby v agentu OMI v Linuxech v Microsoft Azure"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/kontroverzni-firma-kape-technologies-kupuje-expressvpn",
          "author": "Fluttershy, yay!",
          "description": "The Register informuje o koupi populární služby ExpressVPN firmou Kape Technologies, jejíž historii rekapituluje včetně tvorby adware pod jménem Crossrider. Před dvěma lety Kape Technologies převzala také Private Internet Access, rovněž provozovatele VPN a také sponzora řady open-source projektů.",
          "link": "http://www.abclinuxu.cz/zpravicky/kontroverzni-firma-kape-technologies-kupuje-expressvpn",
          "publishedOn": "2021-09-15T12:07:23.000Z",
          "wordCount": 854,
          "title": "Kontroverzní firma Kape Technologies kupuje ExpressVPN"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-DG1-Status-XDC2021",
          "author": null,
          "description": "Along with bringing up DG2/Alchemist graphics card support on Linux, Intel engineers have been working to square away their support for the DG1 developer graphics card. This week thanks to XDC2021 is a fresh status update about what is working with this initial Intel graphics card on their open-source driver and what remains in the works...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-DG1-Status-XDC2021",
          "publishedOn": "2021-09-17T13:25:11.000Z",
          "wordCount": 859,
          "title": "The Current State Of Intel Discrete Graphics On Linux: Almost \"Fully Functional\""
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Platform-Profiles-Axboe",
          "author": null,
          "description": "As covered several times going back to the end of last year, ACPI Platform Profile support has materialized in recent versions of the Linux kernel for the core infrastructure and implementations that work with the latest laptops from the likes of Dell, Lenovo, ASUS, and HP. This platform profile support is becoming increasingly important with expressing your power/cooling/performance preference so that your laptop behaves as one would expect...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Platform-Profiles-Axboe",
          "publishedOn": "2021-09-17T12:58:39.000Z",
          "wordCount": 1016,
          "title": "The Increasing Importance Of ACPI Platform Profiles With Today's Throttle-Happy Hardware"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=LVFS-2-Million-Downloads",
          "author": null,
          "description": "The Linux Vendor Firmware Service (LVFS) in conjunction with FWUPD for offering easy-to-deploy firmware updates on Linux continues its meteoric rise...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=LVFS-2-Million-Downloads",
          "publishedOn": "2021-09-17T11:54:45.000Z",
          "wordCount": 814,
          "title": "LVFS Serves Up 2+ Million Firmware Downloads In The Past Month"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=KWinFT-2021-WLROOTS-Continues",
          "author": null,
          "description": "KWinFT as a fork of KDE's KWin X11/Wayland compositor code continues making progress on driving fundamental display improvements and ironing out the Wayland support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=KWinFT-2021-WLROOTS-Continues",
          "publishedOn": "2021-09-17T09:55:47.000Z",
          "wordCount": 810,
          "title": "KWinFT Continues Working On WLROOTS Render, Library Split"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=RADV-Ray-Tracing-Multi-Games",
          "author": null,
          "description": "Not only is Intel progressing with its open-source ray-tracing driver support but the Mesa Radeon Vulkan driver \"RADV\" has been rounding out its RT code too and now has multiple games correctly rendering...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=RADV-Ray-Tracing-Multi-Games",
          "publishedOn": "2021-09-17T09:00:58.000Z",
          "wordCount": 797,
          "title": "Multiple Games Are Now Working With RADV's Ray-Tracing Code"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-PSH-ISHTP-ECLite",
          "author": null,
          "description": "It looks like Intel's ISHTP_ECLITE driver will be ready for mainlining in Linux 5.16 as a driver for newer systems skipping out on a traditional embedded control (EC) and instead using this EC-like IP as part of their Programmable Service Engine subsystem...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-PSH-ISHTP-ECLite",
          "publishedOn": "2021-09-17T04:00:00.000Z",
          "wordCount": 753,
          "title": "Intel's PSH ISHTP Driver Readied On Linux For Systems Wanting To Forego A Traditional EC"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=X.Org-Security-Help-2021",
          "author": null,
          "description": "Those reading Phoronix over the years likely know the X.Org Server has had an increasing number of vulnerabilities come to light in recent times and statements by security researchers like the security being even worse than it looks. Given the age of the X.Org/X11 codebase and many components being rather unmaintained these days, the security situation isn't that great combined with a lack of manpower. The security topic was under the spotlight today at the XDC2021 conference...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=X.Org-Security-Help-2021",
          "publishedOn": "2021-09-16T20:10:14.000Z",
          "wordCount": 878,
          "title": "X.Org Could Use More Help Improving & Addressing Its Security"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=OpenZFS-2.1.1-Released",
          "author": null,
          "description": "Following the big OpenZFS 2.1 release from July that brought Distributed SPARE RAID, a compatibility property for pools, and other new features, OpenZFS 2.1.1 is available today as a follow-up release for this open-source ZFS file-system implementation for Linux and FreeBSD systems...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=OpenZFS-2.1.1-Released",
          "publishedOn": "2021-09-16T18:17:17.000Z",
          "wordCount": 741,
          "title": "OpenZFS 2.1.1 Arrives As A Big Point Release"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Vulkan-RT-XDC2021",
          "author": null,
          "description": "Prominent Intel open-source Vulkan Linux driver developer Jason Ekstrand presented at today's X.Org Developers Conference (XDC2021) about their work on enabling Vulkan ray-tracing support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Vulkan-RT-XDC2021",
          "publishedOn": "2021-09-16T17:42:58.000Z",
          "wordCount": 820,
          "title": "Intel Talks More About Their Open-Source Vulkan Ray-Tracing Bring-Up"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-Plasma-5.23-Beta",
          "author": null,
          "description": "It was in October of 1996 that the KDE desktop environment was founded and as such with marking twenty-five years since its creation, the forthcoming Plasma 5.23 is being advertised as the \"25th Anniversary Edition\" for the desktop...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-Plasma-5.23-Beta",
          "publishedOn": "2021-09-16T13:00:18.000Z",
          "wordCount": 759,
          "title": "KDE Plasma 5.23 Beta Released As The 25th Anniversary Edition"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30531",
          "author": null,
          "description": "As usual when the Linux 5.15 merge window began wrapping up, I set out to dive into its performance to see what is in store for this next version of the kernel and whether there was any regressions or other performance changes worth noting. Linux 5.15 overall has been in good shape for the \"-rc1\" state except noticing that code compilation workloads were taking longer on multiple Linux 5.15-rc1-running systems than Linux 5.14 or prior. Seeing it across multiple systems and a very real-world regression, it was worth bisecting and looking closer so here are the details.",
          "link": "https://www.phoronix.com/vr.php?view=30531",
          "publishedOn": "2021-09-16T11:00:00.000Z",
          "wordCount": 1072,
          "title": "Running Linux 5.15-rc1 Causing A New Slowdown... Here's A Look"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=First-DRM-Misc-Next-For-5.16",
          "author": null,
          "description": "With the Linux 5.15 merge window out of the way, the first drm-misc-next pull request has been sent in to DRM-Next for staging until the Linux 5.16 merge window opens up about two months from now...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=First-DRM-Misc-Next-For-5.16",
          "publishedOn": "2021-09-16T09:22:52.000Z",
          "wordCount": 822,
          "title": "Linux 5.16 To Add Quirk For The Steam Deck, Other DRM-Misc-Next Changes"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=LLVMpipe-Lavapipe-FP16",
          "author": null,
          "description": "The latest work landing for Mesa 21.3 is supporting FP16 within the LLVM-based software driver code namely for the LLVMpipe Gallium3D OpenGL and Lavapipe Vulkan drivers...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=LLVMpipe-Lavapipe-FP16",
          "publishedOn": "2021-09-16T09:00:00.000Z",
          "wordCount": 783,
          "title": "Mesa's LLVMpipe + Lavapipe Land FP16 Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Chromebooks-Mesa-QLCM",
          "author": null,
          "description": "It's been known that Google has been using the open-source \"MSM\" DRM/KMS driver on Qualcomm-powered devices that originally started out as a reverse-engineered driver project separate from the company. Now it's also been confirmed how Google is successfully using the open-source Mesa Freedreno OpenGL and TURNIP Vulkan drivers on Qualcomm-powered Chromebooks too...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Chromebooks-Mesa-QLCM",
          "publishedOn": "2021-09-16T07:00:00.000Z",
          "wordCount": 743,
          "title": "Google Is Successfully Using The Open-Source Qualcomm GL/VLK Drivers On Chromebooks"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-BPF-Scheduler",
          "author": null,
          "description": "The latest area where BPF is looking to expand within the Linux kernel is its CFS scheduler...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-BPF-Scheduler",
          "publishedOn": "2021-09-16T04:00:00.000Z",
          "wordCount": 908,
          "title": "Early Patches Bring BPF To The Linux Scheduler"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Microsoft-Mesa-EGL-Windows",
          "author": null,
          "description": "While Microsoft has long had WGL as an API analogous to EGL for residing between OpenGL and the Windows interfaces, Microsoft has now wired up an EGL implementation for Mesa that works on Windows...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Microsoft-Mesa-EGL-Windows",
          "publishedOn": "2021-09-15T22:14:15.000Z",
          "wordCount": 774,
          "title": "Microsoft Adds An EGL Implementation To Mesa For Windows"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Apple-AGX-XDC2021",
          "author": null,
          "description": "Alyssa Rosenzweig spoke today at the virtual X.Org Developers Conference about the ongoing work for bringing up Linux display and graphics support on the Apple M1 graphics processor...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Apple-AGX-XDC2021",
          "publishedOn": "2021-09-15T18:11:25.000Z",
          "wordCount": 796,
          "title": "Reverse Engineering, Open-Source Driver Writing Continues For Apple's M1 GPU"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Radeon-Pro-Software-21.Q3",
          "author": null,
          "description": "AMD today released their quarterly update to the Radeon Pro Software for Enterprise graphics driver package, which includes an updated Linux build as well...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Radeon-Pro-Software-21.Q3",
          "publishedOn": "2021-09-15T17:32:12.000Z",
          "wordCount": 878,
          "title": "Radeon Pro Software for Enterprise 21.Q3 Released For Linux"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMDGPU-Yellow-Carp-FW",
          "author": null,
          "description": "A small but important step forward is seeing AMD recently publishing their binary firmware files in advance of new GPU/APU launches for rounding out their Linux driver support stack...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMDGPU-Yellow-Carp-FW",
          "publishedOn": "2021-09-15T13:25:49.000Z",
          "wordCount": 930,
          "title": "AMD Publishes Initial Firmware For Yellow Carp APUs"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=V3DV-2021-Status",
          "author": null,
          "description": "Iago Toral of Igalia kicked off the first day of the virtual XDC2021 developer conference today by sharing a status update on V3DV as the open-source Mesa Vulkan driver most notably used for Raspberry Pi 4 and newer...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=V3DV-2021-Status",
          "publishedOn": "2021-09-15T12:07:23.000Z",
          "wordCount": 872,
          "title": "Raspberry Pi V3DV Driver Still Working On Vulkan 1.1 Conformance, More Performance"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Orange-BPF-Memory-Cache-BMC",
          "author": null,
          "description": "French telecommunications giant Orange has published \"BMC\" as the (e)BPF Memory Cache providing a cache focused on memcached usage within the Linux kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Orange-BPF-Memory-Cache-BMC",
          "publishedOn": "2021-09-15T10:28:19.000Z",
          "wordCount": 714,
          "title": "Orange Publishes An In-Kernel eBPF-Powered Cache - Can Speed Up Memcached By ~18x"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=HP-OMEN-Linux-5.16",
          "author": null,
          "description": "HP's higher-end \"OMEN\" laptop series is set to see better support with the next kernel cycle...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=HP-OMEN-Linux-5.16",
          "publishedOn": "2021-09-15T10:08:37.000Z",
          "wordCount": 861,
          "title": "HP OMEN Laptops To Be Better Supported With Linux 5.16"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Tremont-Faster-GCC",
          "author": null,
          "description": "The GNU Compiler Collection has already supported Intel's Tremont cores as used by the low-power Jasper Lake platform. Now though coming to GCC are some optimizations to further enhance the performance when targeting the Tremont micro-architecture...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Tremont-Faster-GCC",
          "publishedOn": "2021-09-15T09:45:07.000Z",
          "wordCount": 723,
          "title": "New Intel Tremont Optimizations Heading To The GCC Compiler"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-RadeonSI-Lower-CPU",
          "author": null,
          "description": "Following portions of the merge request landing, the rest of the RadeonSI CPU-overhead-lowering work was just merged to Mesa 21.3...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-RadeonSI-Lower-CPU",
          "publishedOn": "2021-09-14T20:35:40.000Z",
          "wordCount": 721,
          "title": "RadeonSI Lands Big Batch Of Improvements To Lower CPU Overhead"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=oneAPI-Level-Zero-Loader-1.5",
          "author": null,
          "description": "Intel has released a new version of their loader for oneAPI Level Zero for loading the Level Zero software driver components...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=oneAPI-Level-Zero-Loader-1.5",
          "publishedOn": "2021-09-14T18:22:37.000Z",
          "wordCount": 838,
          "title": "oneAPI Level Zero Loader v1.5 Released With VPU Driver Recognition, Multi-Driver Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=OpenJDK-17-Java-17",
          "author": null,
          "description": "Java 17 has made it to general availability status today with a number of improvements...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=OpenJDK-17-Java-17",
          "publishedOn": "2021-09-14T17:48:18.000Z",
          "wordCount": 957,
          "title": "Java 17 / OpenJDK 17 Hits GA With Maturing Vector API, Removal Planned For Applet API"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30523",
          "author": null,
          "description": "While NVIDIA has been supporting Resizable BAR for a while now with their GeForce RTX 30 series graphics cards, for those exclusively using Linux it remains more of a challenge due to AIB partners generally not releasing any vBIOS updates for ReBAR support that can be easily applied under Linux. But if you do carry out an update -- such as under Windows -- the performance uplift can be worthwhile if using a game that can benefit from the support.",
          "link": "https://www.phoronix.com/vr.php?view=30523",
          "publishedOn": "2021-09-14T13:09:13.000Z",
          "wordCount": 953,
          "title": "NVIDIA RTX 30 Series Resizable BAR Support Continues Helping Performance On Linux"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Seamless-Update",
          "author": null,
          "description": "\"Intel Seamless Update\" is a forthcoming feature for Intel platforms seemingly first being exposed by their new Linux kernel patches working on the functionality... Intel is working on being able to carry out system firmware upates such as UEFI updates but doing so at run-time and being able to avoid the reboot in the process...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Seamless-Update",
          "publishedOn": "2021-09-14T10:05:13.000Z",
          "wordCount": 953,
          "title": "Intel Seamless Update: Intel Preparing For System Firmware Updates Without The Reboot"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=libinput-1.19",
          "author": null,
          "description": "Libinput 1.19 is now available as the newest version of this Linux input handling library commonly used these days by both X.Org and Wayland desktops...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=libinput-1.19",
          "publishedOn": "2021-09-14T09:42:51.000Z",
          "wordCount": 781,
          "title": "Libinput 1.19 Released With Hold Gestures & High Resolution Wheel Scrolling"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Raising-GCC",
          "author": null,
          "description": "While Linux 5.15-rc1 was released on Sunday with its many changes, landing on Monday was a late change to raise the baseline GCC version requirement for building the Linux kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Raising-GCC",
          "publishedOn": "2021-09-14T07:00:00.000Z",
          "wordCount": 870,
          "title": "Linux 5.15 Raises Its GCC Compiler Version Requirement"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-Vulkan-WSI-No-Wait-XWay",
          "author": null,
          "description": "Mesa 21.3 today landed a debug option that can help with the XWayland-based gaming performance around latency and for power management as well...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-Vulkan-WSI-No-Wait-XWay",
          "publishedOn": "2021-09-14T00:48:47.000Z",
          "wordCount": 897,
          "title": "Mesa Lands Option That Can Help XWayland-Based Gaming On The Steam Deck"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-RFC-x86-User-Interrupts",
          "author": null,
          "description": "In addition to the big Advanced Matrix Extensions support still being in flux and the kernel-side AMX code not yet being merged, another feature of next year's Xeon \"Sapphire Rapids\" that we are only now seeing in early published form for the Linux kernel is handling of x86 user interrupts...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-RFC-x86-User-Interrupts",
          "publishedOn": "2021-09-13T20:38:01.000Z",
          "wordCount": 1038,
          "title": "Intel Posts Initial Code For x86 User Interrupts On Linux  - Shows Great Performance Potential"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/rss.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2516/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2516/",
          "publishedOn": "2021-09-15T04:00:00.000Z",
          "wordCount": 185,
          "title": "Hubble Tension"
        },
        {
          "id": "https://xkcd.com/2515/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2515/",
          "publishedOn": "2021-09-13T04:00:00.000Z",
          "wordCount": 185,
          "title": "Vaccine Research"
        },
        {
          "id": "https://xkcd.com/2514/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2514/",
          "publishedOn": "2021-09-10T04:00:00.000Z",
          "wordCount": 185,
          "title": "Lab Equipment"
        },
        {
          "id": "https://xkcd.com/2513/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2513/",
          "publishedOn": "2021-09-08T04:00:00.000Z",
          "wordCount": 185,
          "title": "Saturn Hexagon"
        }
      ]
    }
  ],
  "cliVersion": "1.11.1"
}