{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": [
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.3",
          "author": null,
          "description": "Fixed: broken links in documentation\nChore: Dependency updates\nThank you: @hirdot",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.3",
          "publishedOn": "2021-10-16T00:01:47.000Z",
          "wordCount": 292,
          "title": "v1.11.3"
        }
      ]
    },
    {
      "title": "Kotaku",
      "feedUrl": "https://kotaku.com/rss",
      "siteUrl": "https://kotaku.com",
      "articles": [
        {
          "id": "1847990351",
          "author": "Renata Price",
          "description": "Yesterday, developer Hideki Kamiya hosted an “apology stream” announcing, and subsequently apologizing for, a delay on the company’s upcoming shoot-em-up, Sol Cresta. The stream was, all things considered, kind of a weird vibe.\n\nRead more...",
          "link": "https://kotaku.com/hideki-kamiya-hosts-very-sorry-stream-with-uncomfortabl-1847990351",
          "publishedOn": "2021-11-03T17:55:00.000Z",
          "wordCount": 528,
          "title": "Hideki Kamiya Hosts 'Very Sorry Stream' With Uncomfortable Letter From Alleged Fan"
        },
        {
          "id": "1847990186",
          "author": "Ari Notis",
          "description": "Blizzard is in the eye of a storm. In the wake of a departing studio head and two major delays of anticipated games, the Diablo and Overwatch developer is bleeding players across the board, as it revealed during an Activision Blizzard earnings call last night. Across its portfolio, the studio’s monthly active users…\nRead more...",
          "link": "https://kotaku.com/blizzard-games-aren-t-doing-so-great-lately-1847990186",
          "publishedOn": "2021-11-03T17:20:00.000Z",
          "wordCount": 536,
          "title": "Blizzard Games Aren’t Doing So Great Lately"
        },
        {
          "id": "1847989335",
          "author": "Isaiah Colbert",
          "description": "All over Twitch right now, Crab Game—much like the cephalopodic Netflix show it so gleefully emulates—is a multiplayer battle royale game where players compete in a series of events based on childhood games. One by one, they are eliminated, until the last surviving player is crowned the winner. It’s created by…\nRead more...",
          "link": "https://kotaku.com/a-squid-game-clone-is-taking-over-twitch-1847989335",
          "publishedOn": "2021-11-03T16:00:00.000Z",
          "wordCount": 842,
          "title": "A Squid Game Clone Is Taking Over Twitch"
        },
        {
          "id": "1847989248",
          "author": "Sisi Jiang",
          "description": "Steve Aoki is selling almost $3 million worth of graded Pokémon merchandise on the trading card marketplace TCGplayer. The mystery boxes will also include clothing, records, meet-and-greets, and physical merchandise.\nRead more...",
          "link": "https://kotaku.com/steve-aoki-is-selling-3-million-of-pokemon-cards-othe-1847989248",
          "publishedOn": "2021-11-03T15:45:00.000Z",
          "wordCount": 519,
          "title": "Steve Aoki Is Selling $3 Million Of Pokémon Cards, Other Merch"
        },
        {
          "id": "1847989099",
          "author": "Jeremy Winslow",
          "description": "Far Cry 6 has only been out for a month now and the game is already doling out some downloadable content, but not intentionally. Ubisoft recently admitted it pushed out a free DLC mission with star Danny Trejo before it was slated to arrive in December. Now, with a new update on consoles, the publisher has pulled the…\nRead more...",
          "link": "https://kotaku.com/ubisoft-pulls-far-cry-6-mission-released-early-by-accid-1847989099",
          "publishedOn": "2021-11-03T15:30:00.000Z",
          "wordCount": 616,
          "title": "Ubisoft Pulls Far Cry 6 Mission Released Early By 'Accident'"
        },
        {
          "id": "1847987793",
          "author": "Brian Ashcraft",
          "description": "In the past, Kotaku has informed you of themed rooms at Japanese hotels. Typically, these rooms are for established franchises like Kingdom Hearts. But now, one Kyoto hotel is offering a room plastered in Japanese indie game, Unreal Life. \n\nRead more...",
          "link": "https://kotaku.com/japanese-indie-game-gets-themed-rooms-at-kyoto-hotel-1847987793",
          "publishedOn": "2021-11-03T12:00:00.000Z",
          "wordCount": 462,
          "title": "Japanese Indie Game Gets Themed Rooms At Kyoto Hotel"
        },
        {
          "id": "1847987504",
          "author": "Brian Ashcraft",
          "description": "Hollywood is making a live-action Gantz adaptation with, according to Deadline, Julius Avery of Overlord fame helming the project. Had you heard? Because Hiroya Oku, the manga artist who created Gantz, hadn’t. \nOku’s Gantz manga debuted in 2000 and ran until 2013, in Weekly Young Jump magazine. It spawned an anime, a…\nRead more...",
          "link": "https://kotaku.com/gantz-creator-is-apparently-in-the-dark-about-hollywood-1847987504",
          "publishedOn": "2021-11-03T09:30:00.000Z",
          "wordCount": 599,
          "title": "Gantz Creator Is Apparently In The Dark About Hollywood's Live-Action Adaptation"
        },
        {
          "id": "1847986378",
          "author": "Luke Plunkett",
          "description": "I’ve really been enjoying Foundation so far. As someone who hasn’t read Asimov’s books, and who can find joy in pretty much any movie or TV series so long as it looks great, I’ve been soaking up the spaceships and costume designs in spite of the show’s plodding pace.\nRead more...",
          "link": "https://kotaku.com/the-art-of-foundation-1847986378",
          "publishedOn": "2021-11-03T00:15:00.000Z",
          "wordCount": 457,
          "title": "The Art Of Foundation"
        },
        {
          "id": "1847985997",
          "author": "Luke Plunkett",
          "description": "As fantastic as Crusader Kings III is, and as much as it lets you do as the ruler of a medieval dynasty, the nature of the game has meant that war itself has always been a bit distant. You can raise your armies and tell them where to go, but never directly lead the troops into battle. Until now.\n\nRead more...",
          "link": "https://kotaku.com/incredible-mod-lets-you-fight-crusader-kings-iiis-battl-1847985997",
          "publishedOn": "2021-11-02T23:00:00.000Z",
          "wordCount": 510,
          "title": "Incredible Mod Lets You Fight Crusader Kings III's Battles Yourself"
        },
        {
          "id": "1847985223",
          "author": "John Walker",
          "description": "‘Twas nary a month ago that Crystal Dynamics took leave of their senses, and decided to infest sleepy hero sim, Marvel’s Avengers, with paid-for experience boosts. With one voice the universe cried out, “Er, but you promised you wouldn’t do that.” A mere 25 days’ profit later, the developers have issued a mea culpa,…\nRead more...",
          "link": "https://kotaku.com/marvels-avengers-stupid-paid-experience-boosts-are-remo-1847985223",
          "publishedOn": "2021-11-02T21:29:00.000Z",
          "wordCount": 534,
          "title": "Marvel's Avengers' Stupid Paid Experience Boosts Are Removed Tonight"
        },
        {
          "id": "1847985147",
          "author": "Ari Notis",
          "description": "Jen Oneal, who assumed joint duties of the top position at Blizzard in August, will step down from the company at the end of the year, she wrote in a statement today. In the meantime, she’ll transition to a new but unspecified role at Activision Blizzard. Her co-lead, Mike Ybarra, will take over the rest of her…\nRead more...",
          "link": "https://kotaku.com/blizzard-is-already-losing-its-first-female-studio-co-h-1847985147",
          "publishedOn": "2021-11-02T21:07:00.000Z",
          "wordCount": 592,
          "title": "Blizzard Is Already Losing Its First Female Studio Co-Head"
        },
        {
          "id": "1847985130",
          "author": "Ethan Gach",
          "description": "Activision Blizzard announced during an investor call today that Overwatch 2 and Diablo 4 won’t be arriving as soon as originally planned, but didn’t provide a new timeframe for when the two big sequels will eventually come out. \nRead more...",
          "link": "https://kotaku.com/overwatch-2-and-diablo-4-delayed-into-2023-1847985130",
          "publishedOn": "2021-11-02T20:55:00.000Z",
          "wordCount": 501,
          "title": "Overwatch 2 And Diablo 4 Delayed Into 2023"
        },
        {
          "id": "1847984765",
          "author": "Ian Walker",
          "description": "Do you find yourself constantly punching real-world children while playing Resident Evil 4 for the millionth time on your Oculus virtual reality headset? Well, Facebook—or, excuse me, Meta—has got you covered with Space Sense, a new feature heading to Oculus Quest and Quest 2 devices with the platform’s latest…\nRead more...",
          "link": "https://kotaku.com/oculus-quest-update-helps-you-not-punch-children-1847984765",
          "publishedOn": "2021-11-02T20:30:00.000Z",
          "wordCount": 467,
          "title": "Oculus Quest Update Helps You Not Punch Children"
        },
        {
          "id": "1847984292",
          "author": "Ethan Gach",
          "description": "Just two years after it launched, Niantic is already giving up on its Harry Potter: Wizards Unite augmented reality experiment. What was supposed to be Pokémon Go for the popular fantasy series will instead become just a memory when the game goes offline forever on January 31, 2022.\n\nRead more...",
          "link": "https://kotaku.com/niantic-shutting-down-pokemon-go-inspired-harry-potter-1847984292",
          "publishedOn": "2021-11-02T19:45:00.000Z",
          "wordCount": 578,
          "title": "Niantic Shutting Down Pokémon Go-Inspired Harry Potter Game"
        },
        {
          "id": "1847984039",
          "author": "Jeremy Winslow",
          "description": "Masahiro Sakurai is back in Famitsu with his final column, in which he pontificates about Super Smash Bros. Ultimate as the series’ potential finale. It actually sounds like Ultimate might not be the end, though Sakurai isn’t certain about a sequel just yet.\nRead more...",
          "link": "https://kotaku.com/sakurai-says-smash-bros-ultimate-might-not-end-the-ser-1847984039",
          "publishedOn": "2021-11-02T19:30:00.000Z",
          "wordCount": 686,
          "title": "Sakurai Says Smash Bros. Ultimate Might Not End The Series"
        },
        {
          "id": "1847983977",
          "author": "Sisi Jiang",
          "description": "The publisher behind the Dishonored, Fallout, and The Elder Scrolls tabletop games is planning to release a Skyrim board game in 2022. Skyrim - The Adventure Game will include several story campaigns, including a prequel to the events of The Elder Scrolls V: Skyrim.\nRead more...",
          "link": "https://kotaku.com/skyrims-new-board-game-will-have-a-prequel-campaign-1847983977",
          "publishedOn": "2021-11-02T19:10:00.000Z",
          "wordCount": 474,
          "title": "Skyrim's New Board Game Will Have A Prequel Campaign"
        },
        {
          "id": "1847983538",
          "author": "Ian Walker",
          "description": "Beginning Tuesday, Netflix’s movie and television streaming app adds video games to the mix with a lineup that includes previously released action-adventure spin-offs Stranger Things: 1984 (formerly known as Stranger Things: The Game) and Stranger Things 3: The Game.\nRead more...",
          "link": "https://kotaku.com/netflix-launches-mobile-games-lineup-with-stranger-thin-1847983538",
          "publishedOn": "2021-11-02T18:30:00.000Z",
          "wordCount": 480,
          "title": "Netflix Launches Mobile Games Lineup With Stranger Things And Not Much Else"
        },
        {
          "id": "1847982538",
          "author": "Ari Notis",
          "description": "The ongoing chip shortage, which has affected nearly every electronic device on the planet, has forced Nintendo to grapple with a production reduction. Nikkei Asia reports that the Kyoto-based company will make 20 percent fewer Switch consoles through the end of its fiscal year, which wraps in March. All told, that…\nRead more...",
          "link": "https://kotaku.com/nintendo-slashes-switch-production-in-face-of-chip-shor-1847982538",
          "publishedOn": "2021-11-02T16:45:00.000Z",
          "wordCount": 599,
          "title": "Nintendo Slashes Switch Production In Face Of Chip Shortage"
        },
        {
          "id": "1847982129",
          "author": "Ethan Gach",
          "description": "Blizzard announced yesterday that it will be forming a new player organization called the WoW Community Council. It’s aiming to help the MMORPG’s developers get more detailed feedback on all aspects of the game, from players of different backgrounds and playstyles. The move comes as the game has faced a mountain of…\nRead more...",
          "link": "https://kotaku.com/blizzard-forms-world-of-warcraft-community-council-to-s-1847982129",
          "publishedOn": "2021-11-02T16:20:00.000Z",
          "wordCount": 643,
          "title": "Blizzard Forms World Of Warcraft Community Council To Solicit Player Feedback"
        },
        {
          "id": "1847981959",
          "author": "Jeremy Winslow",
          "description": "Twitch may be a cesspool of toxicity and marginalization, but while it continues to contend with longstanding issues around harassment and recently was the target of a massive hack, it’s OK to remember that sometimes, good and beautiful things can be found on the platform, too. This week, the company introduced a new…\nRead more...",
          "link": "https://kotaku.com/twitch-dedicates-category-just-for-streaming-cute-anima-1847981959",
          "publishedOn": "2021-11-02T16:00:00.000Z",
          "wordCount": 558,
          "title": "Twitch Creates Category Dedicated To Streams Of Cute Animals"
        },
        {
          "id": "1847981616",
          "author": "Ari Notis",
          "description": "If you took a portal to an alternate universe, you might find yourself living in a timeline where The Legend of Zelda, not Portal, popularized the use of live portals in video games. As spotted by VGC, ex-Nintendo dev Giles Goddard recently showed off an early tech demo of The Legend of Zelda: Ocarina of Time on…\nRead more...",
          "link": "https://kotaku.com/the-legend-of-zelda-ocarina-of-time-almost-had-portals-1847981616",
          "publishedOn": "2021-11-02T15:15:00.000Z",
          "wordCount": 750,
          "title": "The Legend Of Zelda: Ocarina Of Time Almost Had Portals Before Portal"
        },
        {
          "id": "1847981552",
          "author": "Renata Price",
          "description": "Chamber, Valorant’s newest defensive agent, looks like a monster. I am terrified of this fancy French man and his very pretty guns.\n\nRead more...",
          "link": "https://kotaku.com/valorant-s-newest-agent-will-be-a-nightmare-to-play-aga-1847981552",
          "publishedOn": "2021-11-02T15:00:00.000Z",
          "wordCount": 888,
          "title": "Valorant’s Newest Agent Will Be A Nightmare To Play Against, And That's Good Actually"
        },
        {
          "id": "1847980199",
          "author": "Brian Ashcraft",
          "description": "Tenkaippin, or Ten’ichi as fans call it, is a ramen restaurant chain in Japan. Ten’ichi has over 230 locations across the country, as well as one in Hawaii. And now, it also has collab sneakers. \n\nRead more...",
          "link": "https://kotaku.com/and-now-some-ramen-collab-sneakers-1847980199",
          "publishedOn": "2021-11-02T10:30:00.000Z",
          "wordCount": 495,
          "title": "And Now Some Ramen Collab Sneakers"
        },
        {
          "id": "1847980155",
          "author": "Brian Ashcraft",
          "description": "If you were hoping to visit Japan’s Gundam Cafés, you better do it soon, because early next year it looks like they’re all going to close. \n\nRead more...",
          "link": "https://kotaku.com/japans-gundam-cafes-will-all-close-down-1847980155",
          "publishedOn": "2021-11-02T10:00:00.000Z",
          "wordCount": 461,
          "title": "Japan's Gundam Cafés Will All Close Down"
        },
        {
          "id": "1847978883",
          "author": "Luke Plunkett",
          "description": "After an exploit was found over the weekend that first let players send images in the chat box,  kick other players unknowingly, and  duplicate gold, Amazon has stepped in and taken some drastic action.\n\nRead more...",
          "link": "https://kotaku.com/new-world-disables-all-forms-of-wealth-transfers-after-1847978883",
          "publishedOn": "2021-11-02T00:40:00.000Z",
          "wordCount": 413,
          "title": "New World Disables 'All Forms Of Wealth Transfers' After Gold Exploit Found"
        }
      ]
    },
    {
      "title": "Nintendo Life | Latest Updates",
      "feedUrl": "https://www.nintendolife.com/feeds/latest",
      "siteUrl": "https://www.nintendolife.com/feeds/latest",
      "articles": [
        {
          "id": "https://www.nintendolife.com/#article-123162",
          "author": null,
          "description": "The golden era of stereoscopic 3D.\nTen years ago on 3rd November 2011, Super Mario 3D Land made its debut on 3DS in Japan. It's not typically held up or remembered as a glorious entry of the Mario series — indeed, at the time of writing it inexplicably doesn't rank on our dynamic reader-rated list of the 50 best 3DS games — but several of us in NL Towers have rather fond memories of this title and feel it deserves a spotlight to highlight what it did for the series and, indeed, its host system.\nFirst of all, be sure to check out the video at the top from our very own Jon Cartwright, who makes a lot of good points that we'll be happily reiterating here. Give it a watch, also, as a reminder of what this joyous 3DS game was all about.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/11/talking-point-super-mario-3d-land-turns-10-was-it-the-best-3d-game-on-3ds",
          "publishedOn": "2021-11-03T18:00:00.000Z",
          "wordCount": 2054,
          "title": "Talking Point: Super Mario 3D Land Turns 10 - Was It The Best '3D' Game On 3DS?"
        },
        {
          "id": "https://www.nintendolife.com/#article-123178",
          "author": null,
          "description": "Developed by Runbow studio, 13AM Games.\nFans of gaming's indie scene will want to keep an eye on Dawn of the Monsters, an upcoming co-op brawler developed by Runbow studio 13AM Games and published by WayForward (Shantae, Contra 4, Advance Wars 1+2: Re-Boot Camp).\nFirst teased back in 2019, Dawn of the Monsters has up to two players fighting giant monsters in \"devastating Kaiju combat,\" wrecking the fictional city of New Toronto. Thanks to IGN, we now have our first proper look at the game in an all-new trailer (above) and screenshots (below).\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/11/wayforwards-co-op-brawler-dawn-of-the-monsters-gets-new-trailer-and-release-window",
          "publishedOn": "2021-11-03T16:30:00.000Z",
          "wordCount": 860,
          "title": "WayForward's Co-Op Brawler 'Dawn Of The Monsters' Gets New Trailer And Release Window"
        },
        {
          "id": "https://www.nintendolife.com/#article-123174",
          "author": null,
          "description": "\"Super Meat Boy challenges with the cuteness of Kirby\".\nLaunching tomorrow on Nintendo Switch is Super Mombo Quest, a precision platformer that blends challenging gameplay with cutesy heroes.\nSet in an interconnected Metroidvania-style world, the game will have you exploring hundreds of different areas, each with challenging enemies to conquer and plenty of platforming to pull off in style. Developer Orube Game Studio tells us that the game \"mixes Super Meat Boy challenges with the cuteness of Kirby, with combat inspired by Shovel Knight and Sonic.\"\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/11/super-mombo-quest-brings-metroidvania-inspired-platforming-to-switch-tomorrow",
          "publishedOn": "2021-11-03T16:00:00.000Z",
          "wordCount": 753,
          "title": "Super Mombo Quest Brings Metroidvania-Inspired Platforming To Switch Tomorrow"
        },
        {
          "id": "https://www.nintendolife.com/#article-123168",
          "author": null,
          "description": "Impressive work.\nThey sure don't make 'em like they used to, right? Well, that's certainly the case when it comes to this poor, unloved NES that was rescued from the side of a freeway in Texas.\nSpotted by Rob Ivy (AKA: The Obsolete Geek), the NES had seemingly been abandoned, and despite Ivy's helpful pinpointing of the location of the console on social media, it remained there until he decided to collect it himself and drop it off with his pal The 8-Bit Guy, who decided he might be able to salvage it.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/11/random-roadkill-nes-found-by-the-side-of-texas-freeway-restored-to-working-condition",
          "publishedOn": "2021-11-03T15:30:00.000Z",
          "wordCount": 1065,
          "title": "Random: \"Roadkill NES\" Found By The Side Of Texas Freeway Restored To Working Condition"
        },
        {
          "id": "https://www.nintendolife.com/#article-123167",
          "author": null,
          "description": "The latest Game Trial announced for Europe.\nNintendo Switch Online subscribers in Europe will soon be able to check out Story of Seasons: Pioneers of Olive Town for free for a limited time.\nMarvelous' farming sim is the latest title to be offered up as a Game Trial (events that let Switch Online subscribers download and play a full game for a set amount of time). The game was actually offered as a free trial in North America back in September, so it's nice to see that fans in Europe can also jump in to check it out.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/11/switch-online-subscribers-can-soon-play-story-of-seasons-pioneers-of-olive-town-for-free-europe",
          "publishedOn": "2021-11-03T15:00:00.000Z",
          "wordCount": 971,
          "title": "Switch ﻿Online ﻿Subscribers Can Soon Play ﻿Story Of Seasons: Pioneers Of Olive Town For Free (Europe)"
        },
        {
          "id": "https://www.nintendolife.com/#article-123152",
          "author": null,
          "description": "Free update will also add goodies.\nDragon Ball Xenoverse 2 arrived on Switch way back in 2017, and it was another indication at the time that Nintendo gamers were in line for more ports and support than in the Wii U era. It's a big game that's kept growing, and browsing its current DLC list on the eShop is a slightly dizzying experience.\nThe latest major arrival is Legendary DLC Pack 2, which arrives on 5th November; the flashy trailer above shows off its various goodies. There are multiple new characters and varied content included, with the official list below - it's not listed on the eShop yet but there is a 'Legendary Pack Set' that also includes its predecessor, priced at $16.99USD with regional variations.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/11/dragon-ball-xenoverse-2-legendary-dlc-pack-2-is-detailed-more-coming-in-2022",
          "publishedOn": "2021-11-03T14:30:00.000Z",
          "wordCount": 1612,
          "title": "Dragon Ball Xenoverse 2 Legendary DLC Pack 2 Is Detailed, More Coming In 2022"
        },
        {
          "id": "https://www.nintendolife.com/#article-122164",
          "author": null,
          "description": "Off the hook.\nIf there’s one thing gamers constantly crave, it’s a decent 3D platformer. Though the genre has seen its fair share of all-time classics, it’s safe to say its popularity waned as shooters and action-RPGs ascended through the 2000s. Indeed, unless a 3D platformer comes bearing the name ‘Mario’, ‘Crash’, or ‘Spyro’, chances are it will face a fairly steep uphill battle toward success.\nDemon Turf looks to hook old-school platform fans while implementing several modern elements to keep things fresh. Developed by Fabraz and published by Playtonic Friends, it stars Beebz, a 1000-year-old demon who must navigate a series of levels — or ‘turfs’ — in order to reclaim the land from the Demon King and ultimately usurp the ruler from his throne.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/reviews/nintendo-switch/demon-turf",
          "publishedOn": "2021-11-03T14:00:00.000Z",
          "wordCount": 1953,
          "title": "Review: Demon Turf - A Tight, Stylish 3D Platformer With Plenty Of 'Tude"
        },
        {
          "id": "https://www.nintendolife.com/#article-123164",
          "author": null,
          "description": "Featuring an all-new VSTAR mechanic.\nThe latest expansion of the Pokémon Trading Card Game has been revealed, featuring a brand new set of cards to collect as well as a whole new game mechanic.\nThe expansion will be called 'Brilliant Stars' and will launch in the west on 25th February 2022. The set will contain 172 base cards as well as some hidden secret rares, including 20 Pokémon V and 15 full-art Pokémon V cards.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/11/pokemon-brilliant-stars-announced-as-the-series-latest-trading-card-expansion",
          "publishedOn": "2021-11-03T13:30:00.000Z",
          "wordCount": 1018,
          "title": "Pokémon Brilliant Stars Announced As The Series' Latest Trading Card Expansion"
        },
        {
          "id": "https://www.nintendolife.com/#article-123143",
          "author": null,
          "description": "Including an \"incredible\" selection of cards.\n\nOnline trading card store TCGplayer has announced a new partnership with American DJ and music producer Steve Aoki that will see an estimated $3 million worth of Pokémon merch go up for sale.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/11/steve-aokis-selling-off-usd3-million-worth-of-pokemon-merchandise",
          "publishedOn": "2021-11-03T13:00:00.000Z",
          "wordCount": 1688,
          "title": "Steve Aoki's Selling Off $3 Million Worth Of Pokémon Merchandise"
        },
        {
          "id": "https://www.nintendolife.com/#article-123150",
          "author": null,
          "description": "(If you're in the UK, at least).\nMega Drive (or Genesis, if you'd prefer) is finally part of the Nintendo Switch Online lineup, and in the UK, Sega has been giving its 16-bit console a wee push in the form of fetching merchandise.\nWe were fortunate enough to get sent some samples of said merch, including a rather cool hoodie, a Mega Drive-style wireless charging mat and a Mega Drive mug – the latter of which we can solemnly declare is the perfect receptacle for a piping-hot beverage of your choosing.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/11/celebrate-mega-drive-coming-to-nintendo-switch-online-with-this-cool-sega-related-merch",
          "publishedOn": "2021-11-03T12:30:00.000Z",
          "wordCount": 1060,
          "title": "Celebrate Mega Drive Coming To Nintendo Switch Online With This Cool Sega-Related Merch"
        },
        {
          "id": "https://www.nintendolife.com/#article-123147",
          "author": null,
          "description": "Well, it'll sure be interesting.\nIt's fair to say that when the cast for the upcoming Super Mario Movie was revealed it led to a lot of chatter online. For one thing, it'll be strange that a series of characters from a fantastical Nintendo world will have the voices of some of Hollywood's biggest stars; it's sure going to be intriguing when the film lands in the Holiday season of 2022.\nOne of the surprise casting decisions was Seth Rogen as Donkey Kong, which naturally means we can expect DK to have a decent amount to say. The most cinematic the character has been in recent-ish history is some outrage at bananas being stolen, so a talking version of the iconic character will be quite a thing.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/11/rumour-seth-rogen-will-apparently-star-in-a-solo-donkey-kong-movie",
          "publishedOn": "2021-11-03T11:30:00.000Z",
          "wordCount": 2676,
          "title": "Rumour: Seth Rogen Will Apparently Star In A Solo Donkey Kong Movie"
        },
        {
          "id": "https://www.nintendolife.com/#article-123149",
          "author": null,
          "description": "Video game movies that are actually... good?\nGaming has enjoyed a rare spell of genuinely good movie tie-ins just lately, with both Pokémon Detective Pikachu and Sonic The Hedgehog being worth a watch. As such, UK Netflix subscribers will be pleased to hear that both films are headed to the service this month.\nDetective Pikachu, which loosely follows plot points from the 3DS game, will start streaming on 16th November. It features Ryan Reynolds as Pikachu and Justice Smith takes on the lead role of Tim Goodman; you can set a reminder on your Netflix account right here.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/11/pokemon-detective-pikachu-and-last-years-sonic-movie-both-arrive-on-netflix-uk-this-month",
          "publishedOn": "2021-11-03T11:00:00.000Z",
          "wordCount": 1513,
          "title": "Pokémon Detective Pikachu And Last Year's Sonic Movie Both Arrive On Netflix UK This Month"
        },
        {
          "id": "https://www.nintendolife.com/#article-123146",
          "author": null,
          "description": "Complete with mouse controls!\n\nWe're all used to seeing kart racers copying the tried and trusted Mario Kart formula these days, but here's a quick blast to the past that proves game developers were busy mimicking Nintendo's style right from the off.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/11/random-check-out-emora-kart-a-macintosh-exclusive-super-mario-kart-clone-from-1994",
          "publishedOn": "2021-11-03T10:30:00.000Z",
          "wordCount": 1555,
          "title": "Random: Check Out Emora Kart, A Macintosh-Exclusive Super Mario Kart Clone From 1994"
        },
        {
          "id": "https://www.nintendolife.com/#article-123141",
          "author": null,
          "description": "And it's going to be a physical release, too.\nhttps://www.kickstarter.com/projects/573261866/paprium-the-16-bit-beat-them-all-coming-to-the-next-gen/description\nRemember Paprium? We covered the announcement of this Mega Drive / Genesis side-scrolling fighter a few years back. Created by the team behind Pier Solar, it was intended to push the 16-bit console to its absolute limits using special tech built into the cartridge. Plenty of people pledged their cash based on that pitch alone, but that was back in 2017, and at the time of writing, many people who handed over their money are still waiting for their copy (ourselves included).\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/11/mega-drive-brawler-paprium-is-coming-to-switch-following-kickstarter-success",
          "publishedOn": "2021-11-03T10:00:00.000Z",
          "wordCount": 2393,
          "title": "Mega Drive Brawler Paprium Is Coming To Switch Following Kickstarter Success"
        },
        {
          "id": "https://www.nintendolife.com/#article-123140",
          "author": null,
          "description": "Take them down from within.\nSega and Nintendo are best buddies these days, but it wasn't always that way. Once upon a time, the two companies were battling for domination of the living room via their respective range of home systems, and their mascots – Mario and Sonic – were bitter enemies that wouldn't be seen dead in the same game (how things have changed, eh?).\nGiven the rivalry that existed at one point, it's only natural that the developers of these two companies might find ways of secretly poking fun at one another, and one such example is hidden away in the files of the rather average (but very attractive) Sega Saturn 2D platformer Astal, released in 1995.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/11/random-a-rather-angry-mario-is-hiding-in-this-sega-saturn-game-from-1995",
          "publishedOn": "2021-11-03T09:00:00.000Z",
          "wordCount": 1241,
          "title": "Random: A Rather Angry Mario Is Hiding In This Sega Saturn Game From 1995"
        },
        {
          "id": "https://www.nintendolife.com/#article-123138",
          "author": null,
          "description": "Out November 4th.\nFollowing on from the announcement The Binding of Isaac: Repentance would be coming to multiple platforms, it's now been confirmed the game will be released in North America this week on 4th November.\nRepentance is described as the \"ultimate entry\" in the series - taking the Binding of Isaac to new heights with new and updated content such as new items, playable characters, bosses, and new challenges. You can learn more in our previous post.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/11/the-binding-of-isaac-repentance-arrives-on-nintendo-switch-this-week",
          "publishedOn": "2021-11-03T04:30:00.000Z",
          "wordCount": 2500,
          "title": "The Binding Of Isaac: Repentance Arrives On Nintendo Switch This Week"
        },
        {
          "id": "https://www.nintendolife.com/#article-123137",
          "author": null,
          "description": "\"I apologise very sincerely\".\nHideki Kamiya’s \"Very Sorry Stream\" just wrapped up and if you're wondering why it was called that in the first place, it's because PlatinumGames has had to delay its upcoming shoot 'em up, Sol Cresta.\nKamiya broke this news very early on in the stream. While the game was originally locked in for a 9th December release but has now been pushed back. There's no date just yet, but Kamiya says it's \"not possible\" to launch the title by the original date anymore. Here's a rough translation of what he had to say:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/11/platinumgames-delays-sol-cresta-hideki-kamiya-says-a-december-launch-is-not-possible",
          "publishedOn": "2021-11-03T03:45:00.000Z",
          "wordCount": 1592,
          "title": "PlatinumGames Delays Sol Cresta, Hideki Kamiya Says A December Launch Is \"Not Possible\""
        },
        {
          "id": "https://www.nintendolife.com/#article-123136",
          "author": null,
          "description": "If you missed out, you'll just have to wait.\nIf you happen to be located in the North America and were unable to get hold of the wireless Nintendo 64 controller for Switch Online, you'll probably have to wait a while for a restock.\nAn update on the official Nintendo Store page for this region has changed a notice about more controllers being made available in \"late October\" to the following message:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/11/nintendo-wont-have-any-more-switch-online-n64-controllers-until-2022-north-america",
          "publishedOn": "2021-11-03T02:45:00.000Z",
          "wordCount": 2666,
          "title": "Nintendo Won't Have Any More Switch Online N64 Controllers Until 2022 (North America)"
        },
        {
          "id": "https://www.nintendolife.com/#article-123134",
          "author": null,
          "description": "Was active for just over two years.\nNiantic has banked an incredible amount of money with its mobile hit Pokémon GO, but it seems it's been unable to recreate this same level of success with the Harry Potter title, Wizards Unite.\nIn an update on the game's official website yesterday, Niantic announced it would officially shut down the game on 31st January next year. On 6th December 2021, it'll be removing the game from the App Store, Google Play and Galaxy Store. In-game purchases will also end on 6th December.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/11/niantics-pokemon-go-style-harry-potter-mobile-game-is-being-shut-down",
          "publishedOn": "2021-11-03T01:30:00.000Z",
          "wordCount": 2678,
          "title": "Niantic's Pokémon GO-Style Harry Potter Mobile Game Is Being Shut Down"
        },
        {
          "id": "https://www.nintendolife.com/#article-123132",
          "author": null,
          "description": "Diablo IV is also getting a \"later launch\".\nWhen Blizzard announced a sequel to its team-based hero shooter Overwatch in 2019, it made it clear it was still a while away.\nIt's now been delayed again - with the company announcing during a recent investor call that's it's planning a \"later launch\" for Overwatch 2 to ensure the game reaches its \"full potential\" during the development cycle. This follows on from Activision Blizzard confirming earlier this year in February that the game wouldn't arrive this year.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/11/blizzard-has-delayed-overwatch-2-again",
          "publishedOn": "2021-11-03T00:30:00.000Z",
          "wordCount": 1909,
          "title": "Blizzard Has Delayed Overwatch 2 (Again)"
        },
        {
          "id": "https://www.nintendolife.com/#article-123128",
          "author": null,
          "description": "Along with a free 'Conquest' update.\nKingdom Two Crowns is a rather good resource management / strategy game on Switch, and since its release in late 2018 it's had a few enjoyable free updates to keep things fresh. Publisher Raw Fury has now confirmed that its first 'premium DLC' will arrive on 16th November, titled Norse Lands. Though the trailer doesn't actually show the Switch logo, it's been confirmed in the press release and on social media that Switch is included in the update and DLC.\nThis DLC (which isn't yet priced at time of writing) will offer a new campaign and plenty of content, according to the official pitch.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/11/kingdom-two-crowns-norse-lands-premium-dlc-arrives-soon-on-switch",
          "publishedOn": "2021-11-02T21:00:00.000Z",
          "wordCount": 1381,
          "title": "Kingdom Two Crowns: Norse Lands 'Premium DLC' Arrives Soon On Switch"
        },
        {
          "id": "https://www.nintendolife.com/#article-123130",
          "author": null,
          "description": "Kiss kiss fall in love.\nEver since this heckin' pandemic rolled into town, it's been very difficult to get a lot of things done. Sticking out your tongue at people in supermarkets is hard to do with a mask on. Licking objects is frowned upon a little more than usual. And kissing? Kissing is probably the worst thing you can do when there's a deadly disease hanging around.\nAw yeah. Look at all these boys to kiss\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/11/matchmaking-dating-otome-cupid-parasite-is-out-now-in-north-america",
          "publishedOn": "2021-11-02T20:30:00.000Z",
          "wordCount": 1162,
          "title": "Matchmaking Dating Otome 'Cupid Parasite' Is Out Now In North America"
        },
        {
          "id": "https://www.nintendolife.com/#article-123090",
          "author": null,
          "description": "Arrives next March.\nIn the Summer NIS America revealed The Cruel King and the Great Hero, which was good news for fans of Sayaka Oda and his previous release - The Liar Princess and the Blind Prince. It has a similar eye-catching visual approach, and now the new title has a gameplay trailer (above) to build the anticipation.\nIt's due to arrive on 4th March, and below is part of the game's official description.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/11/take-a-good-look-at-charming-rpg-the-cruel-king-and-the-great-hero",
          "publishedOn": "2021-11-02T20:00:00.000Z",
          "wordCount": 983,
          "title": "Take A Good Look At Charming RPG The Cruel King And The Great Hero"
        },
        {
          "id": "https://www.nintendolife.com/#article-123096",
          "author": null,
          "description": "Other modes coming post-launch as a free update.\nWorld War Z, Saber Interactive's zombie shooter that launched on PS4 and Xbox One a couple of years ago, has made its way onto Nintendo Switch today. A launch trailer (which is age-gated and therefore sadly can't be embedded on the site) is viewable here.\nInspired by Paramount Pictures’ film of the same name, the game has players fighting for humanity's survival against the undead either alone or in up-to-four-player co-op. You'll get to play through story campaign episodes set in New York, Moscow, Jerusalem, and Tokyo and take on all the zombies you could ever wish for across multiple game modes. Other modes, like the 'Horde Mode Z', will arrive later as a free DLC update.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/11/zombie-shooter-world-war-z-fires-onto-switch-today",
          "publishedOn": "2021-11-02T19:00:00.000Z",
          "wordCount": 1542,
          "title": "Zombie Shooter 'World War Z' Fires Onto Switch Today"
        },
        {
          "id": "https://www.nintendolife.com/#article-123007",
          "author": null,
          "description": "These blooms were made for walkin'.\nWhile fans of Nintendo's delightful Real-Time Strategy series patiently await the long-rumoured next mainline entry, Niantic has served up a new mobile Pikmin experience to while away the time, an application that looks suspiciously similar to the company's previous project involving Nintendo (or a Nintendo-aligned property, at least). 2016's Pokémon GO became a worldwide phenomenon and a colossal money-spinner for all parties involved, so you'd be forgiven for thinking the makers have similar ambitions this time around. Just looking at screens of this latest collaboration — which similarly uses Google's map tech to build a game from the world around you — it certainly looks like 'another' Pokémon GO. Pikmin Bloom is a very different beast, though; an app that's more 'pedometer with benefits' than all-encompassing time sink, but one that we've enjoyed our time with.\nIt's best to set expectations from the off. Predictably, Bloom isn't going to satisfy fans jonesing for Pikmin 4, and despite the underlying mechanics and systems, it is only superficially similar to GO. Niantic's all-conquering sister title has grown and expanded almost beyond recognition since launch, of course, but although Pikmin Bloom encourages you to get out and sow seeds or cause giant Poké Stop-style flowers to bloom, the interactions and the challenges contained within are far less demanding than catching and training Pocket Monsters, battling at gyms, and trading and raiding with friends. It's a far more sedate experience by design.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/reviews/mobile/pikmin-bloom",
          "publishedOn": "2021-11-02T18:00:00.000Z",
          "wordCount": 4142,
          "title": "Review: Pikmin Bloom - Pokémon GO's Sister Title Is A Glorious, Glorified Pedometer"
        }
      ]
    },
    {
      "title": "Rock Paper Shotgun Latest Articles Feed",
      "feedUrl": "https://www.rockpapershotgun.com/feed",
      "siteUrl": "https://www.rockpapershotgun.com/feed",
      "articles": [
        {
          "id": "https://www.rockpapershotgun.com/the-sims-4-scenarios",
          "author": "Rebecca Jones",
          "description": "How do Scenarios work in The Sims 4? There have been fan-made Sims challenges for as long as there have been Sims games, but now the makers of The Sims 4 have introduced Scenarios into official gameplay.\n Read more",
          "link": "https://www.rockpapershotgun.com/the-sims-4-scenarios",
          "publishedOn": "2021-11-03T15:32:09.000Z",
          "wordCount": 2284,
          "title": "The Sims 4 Scenarios"
        },
        {
          "id": "https://www.rockpapershotgun.com/guardians-of-the-galaxy-disabler",
          "author": "Hayden Hefford",
          "description": "Want to know whether you should buy the Disabler in Guardians Of The Galaxy? Whilst on Knowhere during Chapter 6, you can look around and partake in a bit of shopping. Whilst looking between the various stalls, you will find a merchant who offers to sell you a disabler that will supposedly remove the Nova Corps tracker from your ship. This would mean you don’t need to pay the Nova Corps fine that you incurred earlier in Chapter 2. However, Knowhere is a seedy place, and it’s hard to be certain whether you might get conned.\nThis guide will explain whether you should buy the disabler on Knowhere in Guardians Of The Galaxy, so that you can avoid any scams.\nRead more",
          "link": "https://www.rockpapershotgun.com/guardians-of-the-galaxy-disabler",
          "publishedOn": "2021-11-03T15:25:37.000Z",
          "wordCount": 980,
          "title": "Guardians Of The Galaxy disabler"
        },
        {
          "id": "https://www.rockpapershotgun.com/inscryption-is-the-first-card-game-that-actually-makes-me-feel-like-im-playing-cards",
          "author": "Ed Thorn",
          "description": "Inscryption is good, very good. I mean, we've slapped a Bestest Best badge on it, like one of its in-game sigils. What effect does it have? Play the game and you'll quickly realise it does things games aren't supposed to do. Most notably, for me at least, Inscryption makes me feel like I'm actually playing a proper card game; that feeling of being present at a table, slapping cards down on its hard surface. I hadn't realised how crucial this was to my enjoyment of CCGs, until now.\nRead more",
          "link": "https://www.rockpapershotgun.com/inscryption-is-the-first-card-game-that-actually-makes-me-feel-like-im-playing-cards",
          "publishedOn": "2021-11-03T15:00:00.000Z",
          "wordCount": 746,
          "title": "Inscryption is the first card game that actually makes me feel like I'm playing cards"
        },
        {
          "id": "https://www.rockpapershotgun.com/do-you-get-100-collectables-psychonauts-2-just-made-that-easier",
          "author": "Alice O'Connor",
          "description": "Reader dear, I have to ask: do you try to get 100% collectables in games? Someone must, because games still have them. But I certainly don't, and I don't think I've spoken about the subject with anyone who does. So, seeing as Psychonauts 2 has now released a patch with new features to help players collect every little doodad and tick off achievements, I want to ask: do you do this? Will you? Please tell me about it!\nRead more",
          "link": "https://www.rockpapershotgun.com/do-you-get-100-collectables-psychonauts-2-just-made-that-easier",
          "publishedOn": "2021-11-03T14:56:26.000Z",
          "wordCount": 875,
          "title": "Do you get 100% collectables? Psychonauts 2 just made that easier"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-genshin-impact-thoma-build",
          "author": "Amelia Zollner",
          "description": "Want to learn how to create the best Thoma build in Genshin Impact? As the chief retainer of Inazuma’s Kamisato Clan, Mondstadt native Thoma is always down to lend a helping hand, even aiding the player in their arrival to Inazuma. It makes sense, then, that he’s a support and sub-DPS character similar to Zhongli.\nThis guide will show you how to create the best Thoma build in Genshin Impact. Below we'll cover everything you need to know about Thoma, including wishing, weapons, artifacts, ascension materials, talents, abilities, and constellations.\nRead more",
          "link": "https://www.rockpapershotgun.com/best-genshin-impact-thoma-build",
          "publishedOn": "2021-11-03T14:21:11.000Z",
          "wordCount": 2007,
          "title": "The best Genshin Impact Thoma build"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-genshin-impact-sucrose-build",
          "author": "Amelia Zollner",
          "description": "Want to learn how to create the best Sucrose build in Genshin Impact? Anemo Catalyst user Sucrose is a bio-alchemist and the shy assistant of Albedo. Despite her timid personality, Anemo Catalyst user Sucrose is definitely not afraid to use her alchemical abilities in battle and serves as a 4-star substitute for 5-star Anemo characters like Venti and Kazuha — essentially, she’s a sub-DPS great at crowd control and applying the Swirl reaction.\nThis guide will show you how to create the best Sucrose build in Genshin Impact. Below we'll cover everything you need to know about Sucrose, including wishing, weapons, artifacts, ascension materials, talents, abilities, and constellations.\nRead more",
          "link": "https://www.rockpapershotgun.com/best-genshin-impact-sucrose-build",
          "publishedOn": "2021-11-03T14:14:45.000Z",
          "wordCount": 1820,
          "title": "The best Genshin Impact Sucrose build"
        },
        {
          "id": "https://www.rockpapershotgun.com/demon-turf-review",
          "author": "Henry Stockdale",
          "description": "You'd think being 1000 years old would earn you some respect, but in Demon Turf, that means you're still a child. Admittedly, it makes for an intriguing premise in this tale of conquest and demonic shakedowns, but don't be fooled. While its core systems take inspiration from 3D platformers of the N64 era, Demon Turf isn’t another Banjo Kazooie successor like publisher Playtonic's Yooka-Laylee. You’ll find those familiar cliches, sure, but there’s something great about Fabraz’s latest effort that goes beyond its unique visuals.\nRead more",
          "link": "https://www.rockpapershotgun.com/demon-turf-review",
          "publishedOn": "2021-11-03T14:00:00.000Z",
          "wordCount": 1559,
          "title": "Demon Turf review: new Beebz on the block"
        },
        {
          "id": "https://www.rockpapershotgun.com/overwatch-2-and-diablo-4-are-both-delayed",
          "author": "Alice O'Connor",
          "description": "Blizzard's monster-clicker Diablo IV and face-shooter Overwatch 2 have both been delayed, pushing their uncertain launches even further into the future. Blizzard had never stated a release date for either game anyway, we only had a vague hint that they didn't expect to launch them in 2021. Now, maybe 2023 at earliest? \nRead more",
          "link": "https://www.rockpapershotgun.com/overwatch-2-and-diablo-4-are-both-delayed",
          "publishedOn": "2021-11-03T12:12:24.000Z",
          "wordCount": 868,
          "title": "Overwatch 2 and Diablo 4 are both delayed"
        },
        {
          "id": "https://www.rockpapershotgun.com/blizzard-co-lead-jen-oneal-steps-down",
          "author": "Imogen Beckhelling",
          "description": "Jen Oneal is stepping down as co-lead of Blizzard Entertainment, just three months after she took the position. Since J. Allen Brack left the company in August, Oneal had been in charge of the studio with Mike Ybarra, who'll now take the lead on his own. Oneal claims she's not leaving because she's \"without hope for Blizzard\", but wants to \"do more to have games and diversity intersect, and hopefully make a broader industry impact that will benefit Blizzard (and other studios) as well.\"\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/blizzard-co-lead-jen-oneal-steps-down",
          "publishedOn": "2021-11-03T12:02:05.000Z",
          "wordCount": 1039,
          "title": "Blizzard co-lead Jen Oneal steps down"
        },
        {
          "id": "https://www.rockpapershotgun.com/guardians-of-the-galaxy-collectibles",
          "author": "Hayden Hefford",
          "description": "Want to know how to get all of the Guardians Of The Galaxy game collectibles? On your journey to save the galaxy, you can find lots of trinkets and collectibles which are often hidden slightly off the main path. If you find these collectibles, you can take them back to the Milano and unlock new conversations with the other Guardians, which reveal details about their past, as well as other lore from across the Marvel universe.\nThis guide will cover how to find all Guardians Of The Galaxy game collectibles, so that you can stop worrying about missing something important on your playthrough.\nRead more",
          "link": "https://www.rockpapershotgun.com/guardians-of-the-galaxy-collectibles",
          "publishedOn": "2021-11-03T11:45:25.000Z",
          "wordCount": 1941,
          "title": "Guardians Of The Galaxy game collectibles"
        },
        {
          "id": "https://www.rockpapershotgun.com/guardians-of-the-galaxy-foggy-cave",
          "author": "Hayden Hefford",
          "description": "Want to know how to escape the foggy cave in Guardians Of The Galaxy? In chapter 10, Mantis will join the team to help you save Drax, who has fallen victim to Grand Unifier Raker’s Promise. She will lead you into a mysterious cave that tries to trap any who enter. As you explore, you’ll discover two particular puzzles that require some out of the box thinking to proceed.\nThis guide will cover everything you need to know to escape the foggy cave in Guardians Of The Galaxy.\nRead more",
          "link": "https://www.rockpapershotgun.com/guardians-of-the-galaxy-foggy-cave",
          "publishedOn": "2021-11-03T11:44:28.000Z",
          "wordCount": 999,
          "title": "Guardians Of The Galaxy foggy cave"
        },
        {
          "id": "https://www.rockpapershotgun.com/voice-of-cards-the-isle-dragon-roars-review",
          "author": "Katharine Castle",
          "description": "Card games are all the rage these days, so much so that even Yoko Taro of Nier: Automata fame is getting in on the action. Alas, if you’re expecting a similarly galaxy brain take on tabletop RPGs here, you’re going to be disappointed. Despite the creative minds behind it (Automata’s producer Yosuke Saito and composer Keiichi Okabe are also on board), Voice Of Cards: The Isle Dragon Roars is a decidedly simple role playing affair where its titular cards are nothing more than a fancy visual layer papering over a by-the-book tale of dungeons and, yes, a dragon. Inscryption this ain’t.\nRead more",
          "link": "https://www.rockpapershotgun.com/voice-of-cards-the-isle-dragon-roars-review",
          "publishedOn": "2021-11-03T10:30:00.000Z",
          "wordCount": 1923,
          "title": "Voice Of Cards: The Isle Dragon Roars review: a JRPG in card game cosplay"
        },
        {
          "id": "https://www.rockpapershotgun.com/twitch-has-added-a-category-for-livestreams-of-animals",
          "author": "Graham Smith",
          "description": "There's a segment in a 2003 episode of radio series This American Life from 2003, in which a man named Dan Fitzsimons talks about a cable television channel he tried to launch in the '90s. It was the \"Puppy Channel\". A 24/7 broadcast of nothing but puppies. \r\n\nAt the time, no cable provider liked the idea enough to make it happen, but I think about the story a lot. I think about it on days like today, on which Twitch has just introduced a new \"Animals, Aquariums, and Zoos\" category to the livestreaming platform.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/twitch-has-added-a-category-for-livestreams-of-animals",
          "publishedOn": "2021-11-02T23:44:52.000Z",
          "wordCount": 818,
          "title": "Twitch has added a category for livestreams of animals"
        },
        {
          "id": "https://www.rockpapershotgun.com/apex-legends-escape-update-is-live-now-including-new-hero-ash-and-new-map-storm-point",
          "author": "Graham Smith",
          "description": "\"Storm Point. It's a place where dreams come true,\" says a character at the end of Apex Legends' Escape mode trailer. Given the two preceding minutes, presumably the dreams have to involve being fired into the sky and then stabbing a bunch of dudes.\r\n\nApex Legends' new season, including Storm Point map and new character Ash, are all live now.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/apex-legends-escape-update-is-live-now-including-new-hero-ash-and-new-map-storm-point",
          "publishedOn": "2021-11-02T23:07:32.000Z",
          "wordCount": 761,
          "title": "Apex Legends Escape update is live now, including new hero and map"
        },
        {
          "id": "https://www.rockpapershotgun.com/marvels-avengers-has-removed-the-paid-xp-boosters",
          "author": "Graham Smith",
          "description": "Marvel's Avengers came to Xbox Game Pass at the end of September. A week later, Square Enix added paid, consumable XP boosters to its in-game store, to much predictable uproar from its players.\r\n\nToday, Square Enix announced that they were removing the boosters, while apologising \"for not responding sooner\" to players' concerns.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/marvels-avengers-has-removed-the-paid-xp-boosters",
          "publishedOn": "2021-11-02T22:27:41.000Z",
          "wordCount": 860,
          "title": "Marvel's Avengers has removed the paid XP boosters"
        },
        {
          "id": "https://www.rockpapershotgun.com/shadow-tactics-aikos-choice-expansion-will-emerge-december-6th",
          "author": "Graham Smith",
          "description": "Earlier today, Matthew offered up his thoughts on Aiko's Choice, the standalone expansion for ninja stealth 'em up Shadow Tactics: Blades Of The Shogun. In a synchronised attack, publishers Daedalic also spat out the release date: December 6th.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/shadow-tactics-aikos-choice-expansion-will-emerge-december-6th",
          "publishedOn": "2021-11-02T21:50:15.000Z",
          "wordCount": 700,
          "title": "Shadow Tactics' Aiko's Choice expansion will emerge December 6th"
        },
        {
          "id": "https://www.rockpapershotgun.com/call-of-duty-vanguard-gets-a-pc-trailer-and-final-system-requirements",
          "author": "Graham Smith",
          "description": "Activision have squirted out another Call Of Duty: Vanguard trailer, but the drippings are more specifically relevant to us this time. It's the game's \"PC trailer\", and it appears alongside a blog post offering more detail on download sizes, specs and so on.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/call-of-duty-vanguard-gets-a-pc-trailer-and-final-system-requirements",
          "publishedOn": "2021-11-02T21:27:26.000Z",
          "wordCount": 915,
          "title": "Call Of Duty: Vanguard gets a PC trailer and final system requirements"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-is-now-on-xbox-game-pass-for-pc-in-both-java-and-bedrock-forms",
          "author": "Alice O'Connor",
          "description": "Yeah yeah Xbox Game Pass For PC offers a load of great games at a suspiciously low price, but what about Microsoft's actually big games? Finally, the big'un has arrived: Minecraft. Both the original Java and cross-platform Bedrock versions of Minecraft arrived on Microsoft's subscription service today, packaged into a unified launcher. This comes ahead of plans to give all PC Minecrafters access to both versions next year.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-is-now-on-xbox-game-pass-for-pc-in-both-java-and-bedrock-forms",
          "publishedOn": "2021-11-02T17:12:52.000Z",
          "wordCount": 837,
          "title": "Minecraft is now on Xbox Game Pass For PC in both Java and Bedrock forms"
        },
        {
          "id": "https://www.rockpapershotgun.com/genshin-impact-banners",
          "author": "Rebecca Jones",
          "description": "When does Hu Tao's rerun banner become available in Genshin Impact? Genshin Impact works on a gacha system, where players can spend various in-game and real-world currencies to Wish on a character's banner in the hopes of obtaining a playable version of them.\nRead more",
          "link": "https://www.rockpapershotgun.com/genshin-impact-banners",
          "publishedOn": "2021-11-02T15:01:35.000Z",
          "wordCount": 1208,
          "title": "Next Genshin Impact banner"
        },
        {
          "id": "https://www.rockpapershotgun.com/shadow-tactics-aikos-choice-is-shaping-into-a-small-but-sublime-slice-of-ninja-fun",
          "author": "Matthew Castle",
          "description": "In true Shadow Tactics fashion, here’s an expansion no one saw coming. Aiko’s Choice is a miniature campaign extension to 2016’s real-time tactics wonder. A standalone title, but one that slots into the original game’s main story. It feels like a DLC package that should have been released closer to the original, but I’m not going to drag developers Mimimi for tardiness - after all, this is a game where it takes me upwards of three hours to creep around a single map. Nothing about Shadow Tactics is rushed.\nRead more",
          "link": "https://www.rockpapershotgun.com/shadow-tactics-aikos-choice-is-shaping-into-a-small-but-sublime-slice-of-ninja-fun",
          "publishedOn": "2021-11-02T15:00:00.000Z",
          "wordCount": 1638,
          "title": "Shadow Tactics: Aiko's Choice is shaping into a small, but sublime slice of ninja fun"
        },
        {
          "id": "https://www.rockpapershotgun.com/riders-republic-review",
          "author": "Steve Hogarty",
          "description": "Riders Republic is a multiplayer open world sports game developed by Ubisoft Annecy, in which every single character talks like they’re your mum’s new boyfriend after they find a bong in your sock drawer. And, hey, like, we get it, y’know, we all like to “hang loose” on Tik Tok sometimes, but – at this point Gareth the 43-year-old divorcé grabs a chair, spins it 180 degrees and sits on it in one smooth motion – dope just isn’t on fleek, fam.\nInsufferable cutscenes aside, this is a thrilling downhill racing simulator in which you, a new arrival to a vast landscape of snowy peaks, scorched desert badlands, towering forests and rain-lashed mud flats, must repeatedly hurl yourself down the side of a mountain faster or more stylishly than your opponents. The world is a compressed version of California with all of the San Franciscos taken out, leaving just a bizarre population of baggy jeans wearing Urban Dictionary acolytes, and a vast interconnected series of freely roamable tracks and wilderness littered with activities to complete and landmarks to discover.\nRead more",
          "link": "https://www.rockpapershotgun.com/riders-republic-review",
          "publishedOn": "2021-11-02T14:00:36.000Z",
          "wordCount": 1962,
          "title": "Riders Republic review: a free roaming extreme sports theme park"
        },
        {
          "id": "https://www.rockpapershotgun.com/have-a-chill-time-moving-house-in-unpacking-out-now",
          "author": "Imogen Beckhelling",
          "description": "When I first heard about it, I didn't think Unpacking would appeal to me. Released today, it's a chill game about unpacking moving boxes, unloading all the items from someone's life into their new home. I've never liked unpacking in real life, it feels stressful and annoying trying to find space for all my stuff. But I'm starting to think that Unpacking (the game) might make me feel better about it. Perhaps next time I move house, I should go into it with the energy of this relaxed puzzler. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/have-a-chill-time-moving-house-in-unpacking-out-now",
          "publishedOn": "2021-11-02T12:21:58.000Z",
          "wordCount": 832,
          "title": "Have a chill time moving house in Unpacking, out now"
        },
        {
          "id": "https://www.rockpapershotgun.com/this-mod-lets-you-fight-crusader-kings-3-battles-inside-mount-blade-2",
          "author": "Alice O'Connor",
          "description": "While Crusader Kings 3 is a great simulation of medieval political jostling, when this degenerate into war, it lacks a little pizzaz. Enter Crusader Blade, a new mod which lets you fight CK3 battles inside Mount & Blade II: Bannerlord. When it's time to rumble in CK3, it'll generate a Bannerlord battle based on your armies for you to fight in-person, then transfer the results back into CK3. Immensely impressive.\nRead more",
          "link": "https://www.rockpapershotgun.com/this-mod-lets-you-fight-crusader-kings-3-battles-inside-mount-blade-2",
          "publishedOn": "2021-11-02T11:47:00.000Z",
          "wordCount": 776,
          "title": "This mod lets you fight Crusader Kings 3 battles inside Mount & Blade 2"
        },
        {
          "id": "https://www.rockpapershotgun.com/stardew-valley-devs-next-game-haunted-chocolatier-will-be-more-combat-focused",
          "author": "Imogen Beckhelling",
          "description": "A couple of weeks ago, Stardew Valley creator Eric \"ConcernedApe\" Barone revealed his next game, Haunted Chocolatier. It's about opening a chocolate shop staffed by ghosts, and you'll be able to venture out into fantastical places to collect ingredients. Honestly, it's exactly what I'd want from a Stardew follow-up. Barone says Haunted Chocolatier will have \"a greater focus on combat\" than Stardew, and has provided some detail on how the chocolate game's battles will work. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/stardew-valley-devs-next-game-haunted-chocolatier-will-be-more-combat-focused",
          "publishedOn": "2021-11-02T11:46:02.000Z",
          "wordCount": 989,
          "title": "Stardew Valley dev's next game Haunted Chocolatier will be more combat-focused"
        },
        {
          "id": "https://www.rockpapershotgun.com/echo-generation-review",
          "author": "Kim Armstrong",
          "description": "Like anyone, I went into Echo Generation knowing it would be riding on Stranger Things’ coattails. With its young cast and retro, small town setting, this is a game that definitely falls into that familiar “gang of boys plus maybe someone’s girlfriend going on an occult adventure” vein of 80s nostalgia fests like The Goonies and It. But the question was, would it be an inspired homage to the Upside Down, or a cash grab with a voxel paint job designed to lure in 'the youth'? The answer, sadly, is neither.\nRead more",
          "link": "https://www.rockpapershotgun.com/echo-generation-review",
          "publishedOn": "2021-11-02T11:30:00.000Z",
          "wordCount": 1790,
          "title": "Echo Generation review: a spooky grab bag of familiar retro tropes"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-genshin-impact-razor-build",
          "author": "Amelia Zollner",
          "description": "Want to learn how to create the best Razor build in Genshin Impact? Raised by wolves and possessing a strong will to defend his clan, it’s no surprise that Electro Claymore Razor is a fierce fighter. He’s one of the best 4-stars in the game, and if you’re lucky enough to pull him at a low Adventure Rank, he’ll be able to carry you all the way to AR 55 thanks to the strong Physical DMG that makes him a great main DPS.\nThis guide will show you how to create the best Razor build in Genshin Impact. Below we'll cover everything you need to know about Razor, including wishing, weapons, artifacts, ascension materials, talents, abilities, and constellations.\nRead more",
          "link": "https://www.rockpapershotgun.com/best-genshin-impact-razor-build",
          "publishedOn": "2021-11-02T10:41:27.000Z",
          "wordCount": 1917,
          "title": "The best Genshin Impact Razor build"
        },
        {
          "id": "https://www.rockpapershotgun.com/guardians-of-the-galaxy-outfits",
          "author": "Hayden Hefford",
          "description": "Want to know how to get every outfit in Guardians Of The Galaxy? Star-Lord loves to look stylish, so there are plenty of outfits to collect in Guardians Of The Galaxy. Each Guardian has their own set of outfits, each taken from different Guardians storylines from the comics and movies. They're often hidden in secret passages, just like collectibles, so you might struggle to find them if you're focusing on the main story.\nThis guide will cover where to get every outfit in Guardians Of The Galaxy, so that you can relax and enjoy the story whilst knowing that you won't miss any costumes. You won't find outfits in every chapter, so don't panic when you notice some are missing. Below, we've listed every chapter in which you can find outfits.\nRead more",
          "link": "https://www.rockpapershotgun.com/guardians-of-the-galaxy-outfits",
          "publishedOn": "2021-11-02T10:35:39.000Z",
          "wordCount": 3351,
          "title": "Guardians Of The Galaxy outfits"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-turns-off-all-wealth-transfers-to-stop-gold-duplication-exploit",
          "author": "Graham Smith",
          "description": "New World has temporarily disabled \"all forms of wealth transfers\" due to an exploit that allows players to duplicate gold. In a post on the game's forum, a community manager warned that punishments would be served to players who used the exploit.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-turns-off-all-wealth-transfers-to-stop-gold-duplication-exploit",
          "publishedOn": "2021-11-01T23:29:17.000Z",
          "wordCount": 750,
          "title": "New World turns off all \"wealth transfers\" to stop gold duplication exploit"
        },
        {
          "id": "https://www.rockpapershotgun.com/forza-horizon-5-and-football-manager-2022-head-to-xbox-game-pass-in-november",
          "author": "Graham Smith",
          "description": "Almost all of the games I'm interested in playing this November will launch on Xbox Game Pass. Microsoft's subscription service on PC will see the arrival of Forza Horizon 5, Football Manager 2022 and Unpacking.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/forza-horizon-5-and-football-manager-2022-head-to-xbox-game-pass-in-november",
          "publishedOn": "2021-11-01T22:56:10.000Z",
          "wordCount": 820,
          "title": "Forza Horizon 5 and Football Manager 2022 head to Xbox Game Pass in November"
        },
        {
          "id": "https://www.rockpapershotgun.com/robloxs-three-day-outage-prompted-by-subtle-bug",
          "author": "Graham Smith",
          "description": "Roblox is back online after an extended outage which lasted three days. In a post on the Roblox site, Roblox CEO David Baszucki wrote that the outage was caused by \"a combination of several factors.\"\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/robloxs-three-day-outage-prompted-by-subtle-bug",
          "publishedOn": "2021-11-01T22:30:58.000Z",
          "wordCount": 787,
          "title": "Roblox's three-day outage prompted by \"subtle bug\""
        },
        {
          "id": "https://www.rockpapershotgun.com/ubisoft-want-to-be-key-players-in-blockchain-gaming",
          "author": "Graham Smith",
          "description": "Not content with pivoting to free-to-play games that their audience doesn't want, Ubisoft also want to be one of the \"key players\" in blockchain gaming according to CEO Yves Guillemot. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/ubisoft-want-to-be-key-players-in-blockchain-gaming",
          "publishedOn": "2021-11-01T21:47:47.000Z",
          "wordCount": 906,
          "title": "Ubisoft want to be \"key players\" in blockchain gaming"
        },
        {
          "id": "https://www.rockpapershotgun.com/what-a-fool-ive-only-just-realised-glowing-pc-parts-are-secretly-meant-to-be-christmas-lights",
          "author": "Alice O'Connor",
          "description": "With Halloween behind us, it's time to ask: is the 1st of November too early to put up Christmas lights? Is it a grim sign of ravenous consumerism, or a welcome respite from the watching the year die slowly and painfully in its final months? As I untangled my strings of LED lights this morning, I realised that PC gaming is the most Christmassy of gamings. The colourful LEDs people cram into their PC's every orifice and pore aren't just any decoration, they're Christmas lights. That's their purpose. It always has been. Christmas is year-round for PC gamers. So here it is: merry Christmas.\nRead more",
          "link": "https://www.rockpapershotgun.com/what-a-fool-ive-only-just-realised-glowing-pc-parts-are-secretly-meant-to-be-christmas-lights",
          "publishedOn": "2021-11-01T19:21:15.000Z",
          "wordCount": 1033,
          "title": "What a fool! I've only just realised glowing PC parts are secretly meant to be Christmas lights"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-end-of-dyeus-is-built-on-the-joy-of-discovery",
          "author": "Sin Vega",
          "description": "I almost don't want to tell you what The End Of Dyeus is. Surprise and discovery are among the things I enjoy most in games, and they're too often undermined in the modern age. Damned kids, with your wikis and your hashed tags. It's a first person fighting and exploration game that drops you in a pastoral fantasy world with no instruction beyond \"find Dyeus\" and some straightforward control explainers. The only thing I dislike is that I have no idea how to pronounce it, dramatically limiting my pun options.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-end-of-dyeus-is-built-on-the-joy-of-discovery",
          "publishedOn": "2021-11-01T19:00:00.000Z",
          "wordCount": 700,
          "title": "The End Of Dyeus is built on the joy of discovery"
        },
        {
          "id": "https://www.rockpapershotgun.com/true-horror-is-the-fridge-being-left-open-in-marvels-guardians-of-the-galaxy",
          "author": "Ed Thorn",
          "description": "Spooky season might be behind us now, but man, it’s still pretty scary out there. My inbox sits at 576 unread emails, and in another tab I’m browsing heated clothes airers; things that I now realise are frighteningly expensive. But it’s not just mundane things in real life that give me goosebumps, it now extends to virtual white goods as well.\nRight, so, there’s this fridge in Marvel’s Guardians Of The Galaxy and no matter how many times I close it, it won’t stay shut. At first it was funny, but it’s since morphed from a sly chuckle to a howl of agony. My relationship with the game is like that thing Yoda from Star Wars says, “Fear leads to the Dark Side”. Well, I’m almost there, let me tell you.\nRead more",
          "link": "https://www.rockpapershotgun.com/true-horror-is-the-fridge-being-left-open-in-marvels-guardians-of-the-galaxy",
          "publishedOn": "2021-11-01T18:49:55.000Z",
          "wordCount": 1149,
          "title": "True horror is the fridge being left open in Marvel's Guardians Of The Galaxy"
        },
        {
          "id": "https://www.rockpapershotgun.com/weird-west-is-a-smooth-smooth-ride-through-a-rough-rough-place",
          "author": "Nate Crowley",
          "description": "Even though I’ve been dead excited about Weird West since its announcement last summer, when the time finally came for me to play a preview build last week, I found myself unusually hesitant. Primarily, this was because I loved the game’s concept so much (“What if Dishonored and Desperadoes III had a rooting tooting baby, then let it watch way too many horror movies?”), that I didn’t really want to face the possibility that developers WolfEye Studios might have fallen short on it. But more than that, I was worried I’d have to… well, make an effort.\r\n\n\r\nFor whatever reason, my enthusiasm to start new games has been taking one of its periodic dips over the last month or so, leaving me in the comforting arms of old favourites I can play on autopilot. Time and time again, I’ll get right to the point of hitting play on something, before convincing myself - completely unreasonably - that it’ll probably be a load of hassle for moderate reward. And however promising a sprawling, top-down immersive sim set in a world of haunted stetsons sounded, I was certain it would involve a lot of fiddling about with inventories, reading long screeds of text, and going on sidequests.\r\n\n\r\nI’m delighted to say, however, that I was completely wrong. Because while Weird West does involve all those things (and features even more emergent complexity than the hefty dose I’d anticipated, to boot) I have not had a smoother time getting into a game in a long while. The build I played only featured one of the game’s five character campaigns, admittedly. But unless the other four are all set in a Tesco car park or something, I can heartily recommend it to you.\r\n \nRead more",
          "link": "https://www.rockpapershotgun.com/weird-west-is-a-smooth-smooth-ride-through-a-rough-rough-place",
          "publishedOn": "2021-11-01T15:00:00.000Z",
          "wordCount": 1949,
          "title": "Weird West is a smooth, smooth ride through a rough, rough place"
        },
        {
          "id": "https://www.rockpapershotgun.com/battlefield-2042-pc-trailer-shows-off-dlss-and-ray-tracing",
          "author": "James Archer",
          "description": "Battlefield 2042 has a new trailer ahead of its November 19th release, and this one is aimed directly at us PC folk. While the action itself is more of the near-future mega-bangs you’ve probably seen in previous teasers (or, indeed, the open beta), it’s all in service of demonstrating the PC-exclusive features: chiefly ray tracing, Nvidia DLSS and Nvidia Reflex support.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/battlefield-2042-pc-trailer-shows-off-dlss-and-ray-tracing",
          "publishedOn": "2021-11-01T14:24:06.000Z",
          "wordCount": 854,
          "title": "Battlefield 2042 PC trailer shows off DLSS and ray tracing"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-dark-pictures-anthology-will-end-first-season-in-a-murder-castle",
          "author": "Alice O'Connor",
          "description": "If you've already finished House Of Ashes, you'll have seen a wee trailer revealing that the next part of The Dark Pictures Anthology will be the \"season one finale\", named The Devil In Me. Bandai Namco have since publicly announced the next game in Supermassive's interactive horror story series, explaining a bit more of what's going on with the animatronic corpse. Bad news for would-be survivors: it's set in a replica of the infamous 'Murder Castle', a hotel built with traps and torture chambers by American serial killer H. H. Holmes.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-dark-pictures-anthology-will-end-first-season-in-a-murder-castle",
          "publishedOn": "2021-11-01T13:19:26.000Z",
          "wordCount": 983,
          "title": "The Dark Pictures Anthology will end first season in a Murder Castle"
        },
        {
          "id": "https://www.rockpapershotgun.com/valorants-new-agent-chamber-spawns-snazzy-guns-for-himself",
          "author": "Imogen Beckhelling",
          "description": "The reason I enjoy Riot's FPS Valorant so much is because it has an excellent mixture of fun abilities and tactical gunplay, which is why I'm not sure what to make of its new character. Chamber is a French weapons designer who's set to arrive in the game's next Act on November 16th, and his abilities mostly involve spawning weapons. Not weapons you can buy normally in-game, but special weapons that he's made himself. Somehow, this feels like cheating.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/valorants-new-agent-chamber-spawns-snazzy-guns-for-himself",
          "publishedOn": "2021-11-01T12:38:58.000Z",
          "wordCount": 971,
          "title": "Valorant's new agent Chamber spawns snazzy guns for himself"
        },
        {
          "id": "https://www.rockpapershotgun.com/darkest-dungeon-2-early-access-review",
          "author": "Brendan Caldwell",
          "description": "I hope you like animosity. Darkest Dungeon 2 will eat your eyes and call you selfish for wanting them back. The ferocity with which it treats its players shouldn’t be a surprise to anyone who clawed their way through the crypts of the first Darkest Dungeon, a turn-based homage to Lovecraft and slow-acting poison. It especially won’t surprise anyone who bled their way through the early access version of that game, either. A lot of the difficulty and madness in the sequel comes not from the dangerous creatures along its roguelike turnpike, but from the roughly shorn design of a road trip yet to be completed. This is a faithfully despondent, sometimes frustrating journey of attrition, decay and distrust. A journey you should maybe put off until the wobblesome wagon has all its wheels tightened.\nRead more",
          "link": "https://www.rockpapershotgun.com/darkest-dungeon-2-early-access-review",
          "publishedOn": "2021-11-01T11:45:00.000Z",
          "wordCount": 2097,
          "title": "Darkest Dungeon 2 early access review: a bumpy start"
        },
        {
          "id": "https://www.rockpapershotgun.com/agdq-2022-lineup-includes-blindfolded-sekiro-speedrun",
          "author": "Imogen Beckhelling",
          "description": "The clocks have gone back and the cold is creeping in, so now it's time for me to get too excited too early for the winter speedrunning event Awesome Games Done Quick. While it's too early for the full schedule right now, organisers have revealed the current list of accepted games, and there are already some absolute belters. A race to beat every Dark Souls boss and Deathloop's first GDQ outing are amongst the highlights. But the one I'm most looking forward to is a blindfolded Sekiro run. I couldn't finish that game even using my eyes.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/agdq-2022-lineup-includes-blindfolded-sekiro-speedrun",
          "publishedOn": "2021-11-01T11:27:58.000Z",
          "wordCount": 886,
          "title": "AGDQ 2022 lineup includes blindfolded Sekiro speedrun"
        },
        {
          "id": "https://www.rockpapershotgun.com/uncharted-directors-new-studio-are-making-a-marvel-game",
          "author": "Alice O'Connor",
          "description": "Skydance New Media, the studio led by former Uncharted director Amy Hennig, have announced they're making a game set in the wizarding world of Marvel. They describe the yet-unnamed game as \"a narrative-driven, blockbuster action-adventure game, featuring a completely original story and take on the Marvel Universe\". Mysteries!\nRead more",
          "link": "https://www.rockpapershotgun.com/uncharted-directors-new-studio-are-making-a-marvel-game",
          "publishedOn": "2021-11-01T10:58:44.000Z",
          "wordCount": 918,
          "title": "Uncharted director's new studio are making a Marvel game"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-sunday-papers-616",
          "author": "Ed Thorn",
          "description": "Sundays are for changing into your second Halloween costume and returning to that house who gave out KitKat Chunkys. Before you go to hell, let's read this week's best writing about games.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-sunday-papers-616",
          "publishedOn": "2021-10-31T11:00:00.000Z",
          "wordCount": 1055,
          "title": "The Sunday Papers"
        },
        {
          "id": "https://www.rockpapershotgun.com/netflixs-the-witcher-gets-a-full-season-two-trailer",
          "author": "Graham Smith",
          "description": "Yesterday, Netflix released the trailer for season two of their live action adaptation of The Witcher. And it's fun! You can watch it below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/netflixs-the-witcher-gets-a-full-season-two-trailer",
          "publishedOn": "2021-10-30T22:13:48.000Z",
          "wordCount": 764,
          "title": "Netflix's The Witcher gets a full season two trailer"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-sims-4s-next-free-update-will-add-challenge-scenarios",
          "author": "Graham Smith",
          "description": "A lot of people play The Sims 4 by pursuing community-created challenges, whether they're about building particular types of homes, having a particular number of babies, or many more. Next week a free update for The Sims 4 will add these kinds of challenges to the game itself, beginning with two new scenarios.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-sims-4s-next-free-update-will-add-challenge-scenarios",
          "publishedOn": "2021-10-30T21:26:01.000Z",
          "wordCount": 768,
          "title": "The Sims 4's next free update will add challenge scenarios"
        },
        {
          "id": "https://www.rockpapershotgun.com/crusader-kings-3s-first-dlc-delayed-as-paradox-arent-satisfied-with-its-stability",
          "author": "Graham Smith",
          "description": "Paradox are going to take longer than first thought to finish Crusader Kings 3's first DLC. Royal Court didn't previously have an announced release date, but it's currently aiming for 2022 as Paradox say they are \"not, at the moment, entirely satisfied with Royal Court's progress.\"\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/crusader-kings-3s-first-dlc-delayed-as-paradox-arent-satisfied-with-its-stability",
          "publishedOn": "2021-10-30T20:59:57.000Z",
          "wordCount": 797,
          "title": "Crusader Kings 3's first DLC delayed as Paradox aren't satisfied with its \"stability\""
        },
        {
          "id": "https://www.rockpapershotgun.com/little-devil-insides-world-map-is-just-as-cute-as-its-combat",
          "author": "Graham Smith",
          "description": "At PlayStation's State Of Play earlier this week, we got another glimpse of Little Devil Inside. The action-adventure game has been rattling around for at least six years, but it's beginning to look more and more like an actual game. Watch the new trailer below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/little-devil-insides-world-map-is-just-as-cute-as-its-combat",
          "publishedOn": "2021-10-30T20:24:18.000Z",
          "wordCount": 798,
          "title": "Little Devil Inside's world map is just as cute as its combat"
        },
        {
          "id": "https://www.rockpapershotgun.com/developers-write-open-letter-asking-valve-to-reverse-steams-nft-ban",
          "author": "Graham Smith",
          "description": "A group of developers have written an open letter to Valve asking them to reverse their decision to forbid games containing NFTs and other blockchain technologies on Steam. NFTs are great, they say, arguing that they \"make games more decentralized, democratic, interactive, player focused systems.\" \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/developers-write-open-letter-asking-valve-to-reverse-steams-nft-ban",
          "publishedOn": "2021-10-30T19:58:59.000Z",
          "wordCount": 851,
          "title": "Developers write open letter asking Valve to reverse Steam's NFT ban"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-weird-folk-horror-of-mundaun",
          "author": "Andreas Inderwildi",
          "description": "One of the first things that may strike you about Mundaun, a very unsettling horror game that released earlier this year, is just how comfortable with weirdness it is. There are hay people hunting you in the night, monstrous masks inspired by traditional Swiss carnival costumes, and the decapitated head of the goat Allegria, bleating and chattering from your backpack. \r\n\n\r\nMany horror games either try to establish a sense of mundane familiarity in a recognisable, contemporary world before shattering that familiarity, or else rely on the dusty, done-to-death setting of haunted manors. In most cases, neither approach does much to surprise. Horror often relies on the grotesque, but Mundaun’s weirdness is different. It is an earthy kind of weirdness, a strangeness with roots so deep that it might be confused with familiarity. It’s a horror that smells not of blood, but of hay and dung, snow and soot. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-weird-folk-horror-of-mundaun",
          "publishedOn": "2021-10-30T10:00:00.000Z",
          "wordCount": 1519,
          "title": "The weird folk horror of Mundaun"
        },
        {
          "id": "https://www.rockpapershotgun.com/when-did-horror-games-become-team-sports",
          "author": "Andrew Heaton",
          "description": "By the time you read this I'll be playing Back 4 Blood, gunning down hordes of the undead until viscera and gore cake my player’s clothes, and my eyes become infinite pools of horror that have seen more than enough death for one lifetime. Or perhaps I’ll be creeping around a haunted house in Phasmophobia, my smudge stick in-hand and a cavalcade of petrified friends whimpering down their mics. Maybe I’ll be running from Pyramid Head in Dead By Daylight with my pals in tow. A thought has been brewing in the cold recesses of my mind for a while now, and it is simply this: when did horror become a team game?\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/when-did-horror-games-become-team-sports",
          "publishedOn": "2021-10-30T08:00:00.000Z",
          "wordCount": 1511,
          "title": "When did horror games become team sports?"
        },
        {
          "id": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-167",
          "author": "Alice O'Connor",
          "description": "Happy Halloween weekend, gang! Oh, hang on, I meant to say: BOO! Alright, there we go. But the greatest horror this weekend isn't any ghost or ghoulie, it's UK clocks switching back to GMT this weekend. Sure, your phone and computer will automatically update, but your heating will be irksome until you again dig out the manual to remember how to change it. And a secondary blast of horror comes from the fact that not every country changes their clocks just yet, so if you deal with business across timezones... good luck, pal. But, what are you playing this weekend?\nRead more",
          "link": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-167",
          "publishedOn": "2021-10-30T08:00:00.000Z",
          "wordCount": 1126,
          "title": "What are we all playing this weekend?"
        },
        {
          "id": "https://www.rockpapershotgun.com/220-for-a-27-in-1440p-144hz-viewsonic-monitor-is-an-absolute-steal",
          "author": "Will Judd",
          "description": "It's rare to see a legitimately good 1440p 144Hz monitor for less than $250, but right now ViewSonic's VX2758-2KP-MHD is on sale at Newegg for $220 - a stunning $110 (33%) reduction from its original price of $330. \nThis 'Shell Shocker' sale ends in just a few hours, so do pick this up if you're in the market for a high-end gaming monitor at bargain basement prices!\nRead more",
          "link": "https://www.rockpapershotgun.com/220-for-a-27-in-1440p-144hz-viewsonic-monitor-is-an-absolute-steal",
          "publishedOn": "2021-10-30T01:14:39.000Z",
          "wordCount": 922,
          "title": "$220 for a 27-in 1440p 144Hz ViewSonic monitor is an absolute steal"
        },
        {
          "id": "https://www.rockpapershotgun.com/wds-2tb-sn550-nvme-ssd-is-well-cheap-on-amazon-uk",
          "author": "Will Judd",
          "description": "One of our former best gaming SSD picks, the WD Blue SN550, is down to just £140 on Amazon for a massive 2TB model. That's a historic low price by around £15 and a good £40 what it cost just a few weeks ago, making this a very good time to pick up a high performance NVMe SSD on the cheap. \nRead more",
          "link": "https://www.rockpapershotgun.com/wds-2tb-sn550-nvme-ssd-is-well-cheap-on-amazon-uk",
          "publishedOn": "2021-10-30T00:58:20.000Z",
          "wordCount": 1022,
          "title": "WD's 2TB SN550 NVMe SSD is well cheap on Amazon UK"
        },
        {
          "id": "https://www.rockpapershotgun.com/mushrooms-mould-and-killer-plants-the-best-horror-isnt-animal-its-vegetable",
          "author": "Ewan Wilson",
          "description": "Ever since I witnessed a little red-and-blue plumber-man tumble into the gnashing jaws of a Piranha Plant, I knew vegetables weren’t to be trusted. I see my suspicion of all things green and floral as a natural, even instinctual thing. We ourselves aren’t vegetable, and differences so often motivate our deepest fears. The vegetal realm is entirely inaccessible to us, its behaviour strange and habitats dark. From the carnivorous Venus flytrap to the bleeding tooth fungus, from plants that smell like rotting corpses to one's that trap prey and dissolve them with digestive fluids, it’s an unknown, often dangerous world, and one that overlaps closely with our own. And it makes for a compelling game.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/mushrooms-mould-and-killer-plants-the-best-horror-isnt-animal-its-vegetable",
          "publishedOn": "2021-10-29T16:00:00.000Z",
          "wordCount": 1820,
          "title": "Mushrooms, mould and killer plants: the best horror isn't animal, it's vegetable"
        },
        {
          "id": "https://www.rockpapershotgun.com/guardians-of-the-galaxy-worldmind",
          "author": "Hayden Hefford",
          "description": "Want to know how to convince the Worldmind in Guardians Of The Galaxy? The adventure to save the galaxy doesn’t just involve shooting Chitauri and cracking jokes. Throughout Guardians Of The Galaxy, you engage in conversations with various characters, in which you can make decisions that will alter the course of the game. Most of these have small, fairly insignificant consequences. However, the conversation with the Worldmind in Chapter 9 could help you get some crucial help in a difficult fight later in the game.\nThis guide will show you the correct choices to make to convince the Worldmind that Raker can be defeated in Guardians Of The Galaxy.\nRead more",
          "link": "https://www.rockpapershotgun.com/guardians-of-the-galaxy-worldmind",
          "publishedOn": "2021-10-29T15:59:37.000Z",
          "wordCount": 987,
          "title": "How to convince the Worldmind in Guardians Of The Galaxy"
        },
        {
          "id": "https://www.rockpapershotgun.com/an-ode-to-kain-from-blood-omen-and-his-legacy-including-untitled-goose-game",
          "author": "Nic Reuben",
          "description": "Steam user genre tags can be awful. Cyberpunk 2077 was, for example, tagged ‘masterpiece’ for months before the first gameplay trailer, while the much more reasonable and catchy ‘looks cool sure but too early to say anything definitive if we’re being adults about it’ tag was strangely absent. Happily, they are sometimes wonderful, like the tag alongside ‘comedy’ and ‘indie’ that categorises avian arsehole adventure Untitled Goose Game as having a ‘villain protagonist’. \r\n\n\r\nI’ve been thinking about villain protagonists a fair amount this week because GOG just graced our collective thinking tellies with 1996 Zelda-like Blood Omen: Legacy of Kain, in all its richly overwrought, gothic, inimitably voice-acted splendour. I would estimate this news finds you, reader, in one of two categories: those who give not a fig, and those who give so many figs they are currently scrabbling the world’s few remaining fig-bearing trees, searching vainly for an adequate quantity of figs.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/an-ode-to-kain-from-blood-omen-and-his-legacy-including-untitled-goose-game",
          "publishedOn": "2021-10-29T15:38:38.000Z",
          "wordCount": 1529,
          "title": "An ode to Kain from Blood Omen and his Legacy - including Untitled Goose Game"
        },
        {
          "id": "https://www.rockpapershotgun.com/pubg-company-buying-subnautica-studio-unknown-worlds",
          "author": "Alice O'Connor",
          "description": "Krafton, the South Korean company behind Plunkbat and Tera, today announced that they're buying Unknown Worlds, the studio splendid subaquatic survival sim series Subnautica and the fantastic FPS-RTS hybrid Natural Selection. Huh! The professed plan is for them to keep on as usual, still working on the Subnauticae as well as a mystery game debuting next year.\nRead more",
          "link": "https://www.rockpapershotgun.com/pubg-company-buying-subnautica-studio-unknown-worlds",
          "publishedOn": "2021-10-29T15:10:41.000Z",
          "wordCount": 920,
          "title": "PUBG company buying Subnautica studio Unknown Worlds"
        },
        {
          "id": "https://www.rockpapershotgun.com/ultimate-audio-bang-17-weird-and-wonderful-fps-vocab",
          "author": "Ed Thorn",
          "description": "This time, I've returned from a trip to Devon having spent too much time ignoring my friends and playing Hollow Knight instead. But what about FPSes? Well, I didn't play any of those. Thankfully Imogen has all of us covered on this week's episode of the Ultimate Audio Bang, with a news segment rammed with lots of exciting announcements. Namely, Apex Legends gets a new Legend and map, Halo Infinite sees a new trailer, and Call Of Duty's new anti-cheat Ricochet leaks early.\nRead more",
          "link": "https://www.rockpapershotgun.com/ultimate-audio-bang-17-weird-and-wonderful-fps-vocab",
          "publishedOn": "2021-10-29T15:00:00.000Z",
          "wordCount": 836,
          "title": "Ultimate Audio Bang #17: weird and wonderful FPS vocab"
        },
        {
          "id": "https://www.rockpapershotgun.com/guardians-of-the-galaxy-length",
          "author": "Hayden Hefford",
          "description": "Want to know how many chapters there are in Guardians Of The Galaxy? This planet-hopping adventure takes you on the cosmic ride of your life in an original Guardians Of The Galaxy story, involving plenty of punching, shooting, and generally jumping around with jet boots. Throughout the adventure, you'll come across many classic characters, such as Cosmo the spacedog, Adam Warlock, Mantis, Fin Fang Foom, and Lady Hellbender. However, since it isn't based directly on a certain comic storyline or movie, it can be hard to judge how long you'll actually spend playing Marvel's Guardians Of The Galaxy.\nThis guide will break down how many chapters there are in Guardians Of The Galaxy, and explain how long it will take to beat the game.\nRead more",
          "link": "https://www.rockpapershotgun.com/guardians-of-the-galaxy-length",
          "publishedOn": "2021-10-29T14:47:54.000Z",
          "wordCount": 1082,
          "title": "Guardians of the Galaxy chapters"
        },
        {
          "id": "https://www.rockpapershotgun.com/carve-pumpkins-for-a-virtual-pumpkin-festival-in-this-free-indie-game",
          "author": "Alice O'Connor",
          "description": "Last Halloween, Alice Bee visited Ghost Town's 999th Annual Pumpkin Festival, carving a pumpkin of her own to place amongst the spooky virtual showcase. It was a lovely little indie game from Adam \"Adamgryu\" Robinson-Yu, creator of the much-adored A Short Hike. Well, Halloween is upon us again, and Mayor Bones has returned with another gourd-o-rama, putting servers back online and inviting us to contribute new pumpkins. It's still lovely.\nRead more",
          "link": "https://www.rockpapershotgun.com/carve-pumpkins-for-a-virtual-pumpkin-festival-in-this-free-indie-game",
          "publishedOn": "2021-10-29T13:41:36.000Z",
          "wordCount": 858,
          "title": "Carve pumpkins for a virtual pumpkin festival in this free indie game"
        },
        {
          "id": "https://www.rockpapershotgun.com/hitman-3-and-the-riftbreaker-are-the-first-games-with-intel-xess-support",
          "author": "James Archer",
          "description": "Amidst all the excitement of Intel’s 12th Gen Alder Lake CPUs, let’s not forget that the first Intel dedicated graphics cards are on their way. Codenamed Arc Alchemist, these GPUs will launch alongside XeSS (Xe Super Sampling), an Nvidia DLSS-style upscaling/anti-aliasing piece of tech that promises to boost performance while sharpening up those jagged edges. And we now know the first two games that will support XeSS: Hitman 3 and The Riftbreaker.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/hitman-3-and-the-riftbreaker-are-the-first-games-with-intel-xess-support",
          "publishedOn": "2021-10-29T13:32:41.000Z",
          "wordCount": 1016,
          "title": "Hitman 3 and The Riftbreaker are the first games with Intel XeSS support"
        },
        {
          "id": "https://www.rockpapershotgun.com/where-are-all-the-good-stephen-king-games",
          "author": "Rebecca Jones",
          "description": "Halloweekend is almost upon us and sitting on my coffee table is my battered old paperback copy of Skeleton Crew, a 1985 collection of short horror stories by Stephen King. Back in my wild teenage years I binged King's entire back-catalogue of published fiction, and now that it's been long enough for me to have forgotten most of the details, I'm treating myself to some selective re-reads. Fair to say some of his stuff hasn't aged brilliantly, but despite many rough edges he undeniably remains one of my all-time favourite authors. I am, after all, a self-confessed horror nerd.\n Read more",
          "link": "https://www.rockpapershotgun.com/where-are-all-the-good-stephen-king-games",
          "publishedOn": "2021-10-29T12:30:00.000Z",
          "wordCount": 2007,
          "title": "Where are all the good Stephen King games?"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-rally-point-the-riftbreaker-is-light-on-strategy-but-carries-a-lot-with-it",
          "author": "Sin Vega",
          "description": "I hesitated. Not to play The Riftbreaker, you understand. I'd played its demo last year, which was enough to sell me on playing the full game. But to cover it as a strategy game is another matter.\nIt does games in particular a disservice to get prescriptive with genre, but there's no question that Riftbreaker falls under 'action strategy', with an even greater emphasis on action than, say, Hostile Waters or Sacrifice. But then, it also has detailed base building, tower defence, and a tonne of resource management. I've given up trying to categorise it, and it will always be distinct from most strategy games, but I think its peers could still learn a few things from it.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-rally-point-the-riftbreaker-is-light-on-strategy-but-carries-a-lot-with-it",
          "publishedOn": "2021-10-29T12:00:00.000Z",
          "wordCount": 2206,
          "title": "The Rally Point: The Riftbreaker is light on strategy but carries a lot with it"
        },
        {
          "id": "https://www.rockpapershotgun.com/facebook-parent-company-now-named-meta-unveiling-vision-of-a-metaverse",
          "author": "Alice O'Connor",
          "description": "The company behind Facebook and Oculus, previously known as Facebook, have unveiled a new name: Meta. Oh christ. Yes, it is named after the metaverse, because tech megacorps can't resist the delusion that their platform to sell adverts is elevating humanity to a new plane of existence. Mark Zuckerberg suggests that in the future they're building, you'll experience everything through virtual and augmented reality, and that definitely won't be a horrible world devoid of intimacy, okay, it'll be great.\nRead more",
          "link": "https://www.rockpapershotgun.com/facebook-parent-company-now-named-meta-unveiling-vision-of-a-metaverse",
          "publishedOn": "2021-10-29T11:01:27.000Z",
          "wordCount": 1155,
          "title": "Facebook parent company now named Meta, unveiling vision of a metaverse"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-wd-black-sn750-1tb-nvme-ssd-is-87-for-1tb-good-deal",
          "author": "Will Judd",
          "description": "The WD Black SN750 is a super-fast PCIe 3.0 SSD - and the 1TB model is down to £87 at Amazon UK, a historic low price. That's a fantastic price for what was once among the fastest NVMe SSDs on the planet, with read speeds up to nearly 3500MB/s... before the advent of faster (and more expensive) PCIe 4.0 drives in the last couple of years. \nStill, in terms of value for money, this TLC drive with a DRAM cache is going to be hard to beat - especially as the only real competitors tend to come with QLC NAND or without a DRAM cache, both of which sacrifice performance to hit lower price points!\nRead more",
          "link": "https://www.rockpapershotgun.com/the-wd-black-sn750-1tb-nvme-ssd-is-87-for-1tb-good-deal",
          "publishedOn": "2021-10-28T22:16:02.000Z",
          "wordCount": 978,
          "title": "The WD Black SN750 1TB NVMe SSD is £87 for 1TB: good deal"
        },
        {
          "id": "https://www.rockpapershotgun.com/razers-viper-ultimate-mouse-is-nearly-100-off-at-amazon-uk",
          "author": "Will Judd",
          "description": "As I've mentioned before, the Razer Viper is one of my favourite ultralight gaming mice of all time, and today the Ultimate wireless version is marked it down from £170 all the way to £73 at Amazon UK.\nThat's an incredibly good price considering this is the model that comes with a handy charging dock to ensure your mouse is always topped up without ever fussing with a cable. \nRead more",
          "link": "https://www.rockpapershotgun.com/razers-viper-ultimate-mouse-is-nearly-100-off-at-amazon-uk",
          "publishedOn": "2021-10-28T21:26:33.000Z",
          "wordCount": 1038,
          "title": "Razer's Viper Ultimate mouse is nearly £100 off at Amazon UK"
        },
        {
          "id": "https://www.rockpapershotgun.com/activision-blizzard-ceo-commits-to-waiving-forced-arbitration-and-a-temporary-paycut",
          "author": "Alice O'Connor",
          "description": "Activision Blizzard CEO Bobby Kotick has detailed plans for the company to rebuild itself following numerous legal cases and protests over alleged harrassment, discrimination, and retaliation at the company. Key points include a policy of zero-tolerance for harassment and an end to forced abitration in claims of sexual harrassment and discrimination. An employee group call this \"a huge win\". And Kotick himself has volunteered to take a huge pay cut until they achieve their stated goals.\nRead more",
          "link": "https://www.rockpapershotgun.com/activision-blizzard-ceo-commits-to-waiving-forced-arbitration-and-a-temporary-paycut",
          "publishedOn": "2021-10-28T18:44:09.000Z",
          "wordCount": 1010,
          "title": "Activision Blizzard CEO commits to waiving forced arbitration, and a temporary paycut"
        },
        {
          "id": "https://www.rockpapershotgun.com/apex-legends-new-hero-ash-hunts-squads-with-titanfall-inspired-abilities",
          "author": "Imogen Beckhelling",
          "description": "Apex Legends' next season, Escape, kicks off next week, and it introduces the new playable character Ash. She's a simulacrum (read: human brain in robot body) that you might recognise as the evil pilot from Titanfall 2's Into The Abyss level, or as the overseer of Apex Legends' 3v3 Arenas mode. Now she's descending into the Apex games herself, and having taken her for a spin already, I reckon she has some delightfully aggressive abilities that Wraith players in particular are going to enjoy. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/apex-legends-new-hero-ash-hunts-squads-with-titanfall-inspired-abilities",
          "publishedOn": "2021-10-28T17:05:00.000Z",
          "wordCount": 1173,
          "title": "Apex Legends' new hero Ash hunts squads with Titanfall-inspired abilities"
        },
        {
          "id": "https://www.rockpapershotgun.com/apex-legends-ash-abilities-tips-tricks",
          "author": "Ollie Toms",
          "description": "Want to know about Ash's abilities in Apex Legends? The upcoming addition to the Apex Legends roster will arrive next week, along with a brand new map, the new CAR SMG, and a host of weapon and Legend balance changes. Ash is turning a lot of heads thanks both to her complex and fascinating backstory and to her powerful and versatile array of abilities.\nBelow we'll walk you through how each of Ash's abilities work in detail, so you can get off to a great start with her once Season 11 drops. We'll also detail Ash's backstory for those who need to know every last detail about this dangerous new Legend.\nRead more",
          "link": "https://www.rockpapershotgun.com/apex-legends-ash-abilities-tips-tricks",
          "publishedOn": "2021-10-28T17:00:00.000Z",
          "wordCount": 2662,
          "title": "Apex Legends Ash tips and tricks"
        },
        {
          "id": "https://www.rockpapershotgun.com/apex-legends-car-stats",
          "author": "Ollie Toms",
          "description": "Looking for up-to-date and accurate CAR SMG stats for Apex Legends? The CAR is Season 11's addition to the Apex Legends weapons arsenal, and it's got a very impressive array of stats to show off. But what's truly unique about the CAR is its ability to use both Heavy and Light Ammo, and toggle between them at the touch of a button.\nKeep reading for an in-depth look at the CAR SMG in Apex Legends, along with detailed stats covering everything from damage profiles and shots to kill to reload times and attachment slots.\nRead more",
          "link": "https://www.rockpapershotgun.com/apex-legends-car-stats",
          "publishedOn": "2021-10-28T17:00:00.000Z",
          "wordCount": 1071,
          "title": "Apex Legends CAR SMG stats [Season 11]"
        },
        {
          "id": "https://www.rockpapershotgun.com/apex-legends-new-map-stormpoint-comes-with-vicious-wildlife-and-excellent-cannons",
          "author": "Imogen Beckhelling",
          "description": "Beach map! Beach map! Beach map! Apex Legends' next season, Escape, is right around the corner, and it's bringing a tropical island to fight on. It's also bringing a the new Legend Ash, the CAR SMG and more, but most importantly: beach map! I had a chance to play a little of Respawn's battle royale in this new arena, and it is delightful. Named Stormpoint, it's the FPS's fourth map, and not only is it lovely to look at, but it's full of cool locations to explore and dangerous wildlife to dodge. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/apex-legends-new-map-stormpoint-comes-with-vicious-wildlife-and-excellent-cannons",
          "publishedOn": "2021-10-28T17:00:00.000Z",
          "wordCount": 1222,
          "title": "Apex Legends' new map Stormpoint comes with vicious wildlife and excellent cannons"
        },
        {
          "id": "https://www.rockpapershotgun.com/inscryption-is-horrifying-because-it-does-things-games-arent-supposed-to",
          "author": "Imogen Beckhelling",
          "description": "Daniel Mullins says he's not sure that \"horror\" is the most accurate way to describe his gruesome new card battler Inscryption. He immediately follows this up by telling me a friend of his had nightmares because of the menacing figure you play cards against, so yeah, maybe it's a bit horror-like. But I kind of understand his point. \r\n\n\r\nAt the start, Inscryption is like a hostage situation, where you're forced to play a card-based roguelike against a sinister games master. Then, just as you start getting the hang of things, the game evolves into something way more complex. If you've played Mullins' other games you'll know his work can go to some weird, meta places. I won't say more above the cut, because I'd hate to spoil it. But for those of you who've already played, read on for more detail on how Mullins created an excellently unsettling world.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/inscryption-is-horrifying-because-it-does-things-games-arent-supposed-to",
          "publishedOn": "2021-10-28T16:00:00.000Z",
          "wordCount": 2322,
          "title": "Inscryption is horrifying because it does things games aren't supposed to"
        },
        {
          "id": "https://www.rockpapershotgun.com/square-enix-announce-star-ocean-the-divine-force",
          "author": "Alice O'Connor",
          "description": "Tri-Ace's action-RPG series Star Ocean will return with a new game next year, Square Enix have announced. Though the series started 25 years ago on the SNES, you needn't concern yourself with that history because Squeenix say Star Ocean The Divine Force will tell a new story with new characters. Come meet them and see some of the sci-fantasy world in the trailer below.\nRead more",
          "link": "https://www.rockpapershotgun.com/square-enix-announce-star-ocean-the-divine-force",
          "publishedOn": "2021-10-28T13:55:03.000Z",
          "wordCount": 782,
          "title": "Square Enix announce Star Ocean The Divine Force"
        },
        {
          "id": "https://www.rockpapershotgun.com/forget-far-cry-6-the-bugs-in-hollow-knight-can-send-me-snarky-emails-anytime",
          "author": "Ed Thorn",
          "description": "Recently, I've heard tales of Far Cry 6 players receiving snarky emails from Ubisoft about how much time they've spent in-game. They're supposed to read as if Anton Castillo, the game's evil dictator, is mocking you for not investing enough of it toppling his regime.\nAnd even if you've spent a lot of time clearing Castillo's map markers, he'll still send you emails anyway. They feature stats like time played, checkpoints cleared, that sort of thing. Many people don't seem to like this, which I totally understand. But a part of me wishes these rude marketing emails were more of a thing. Specifically, I'd like it if the bugs from Hollow Knight spun some my way.\nRead more",
          "link": "https://www.rockpapershotgun.com/forget-far-cry-6-the-bugs-in-hollow-knight-can-send-me-snarky-emails-anytime",
          "publishedOn": "2021-10-28T10:00:00.000Z",
          "wordCount": 776,
          "title": "Forget Far Cry 6, the bugs in Hollow Knight can send me snarky emails anytime"
        },
        {
          "id": "https://www.rockpapershotgun.com/guardians-of-the-galaxy-tips",
          "author": "Hayden Hefford",
          "description": "Want to know some tips and tricks for Guardians Of The Galaxy? The adventure will take you across the vast galaxy in search of fortune, fun, and a whole lot of kicking ass, but you won’t make it far without a solid grasp of the mechanics in Guardians Of The Galaxy.\nThis guide will offer some tips and tricks that you’ll need to get familiar with if you want to turn your rag-tag group of misfits into a heroic team to be feared. We'll cover tips for all of the main aspects of the game, including combat, exploring, and all of the chats that you'll have with your teammates during your adventure.\nRead more",
          "link": "https://www.rockpapershotgun.com/guardians-of-the-galaxy-tips",
          "publishedOn": "2021-10-28T09:51:21.000Z",
          "wordCount": 1603,
          "title": "Guardians Of The Galaxy tips"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-the-brand-new-steelseries-arctis-7p-gaming-headset-for-12-off",
          "author": "Will Judd",
          "description": "The SteelSeries Arctis 7P+ is a brand new gaming headset, offering a series of small upgrades over the already-brilliant Arctis 7P. It's rare to see new items discounted right away, but today you can get this new model up for 12% off with code MOUNTAIN12.\nRead more",
          "link": "https://www.rockpapershotgun.com/get-the-brand-new-steelseries-arctis-7p-gaming-headset-for-12-off",
          "publishedOn": "2021-10-28T01:00:35.000Z",
          "wordCount": 836,
          "title": "Get the brand new SteelSeries Arctis 7P+ gaming headset for 12% off"
        },
        {
          "id": "https://www.rockpapershotgun.com/pnys-great-value-ddr4-ram-is-going-cheap-in-the-us",
          "author": "Will Judd",
          "description": "PNY isn't the first name you might think of when it comes to RAM, but they're sometimes a great value - including today, when a series of RAM kits are on sale in stores across the US. Here are the links - and some words about why you should consider them. \nRead more",
          "link": "https://www.rockpapershotgun.com/pnys-great-value-ddr4-ram-is-going-cheap-in-the-us",
          "publishedOn": "2021-10-28T00:45:23.000Z",
          "wordCount": 825,
          "title": "PNY's great value DDR4 RAM is going cheap in the US"
        },
        {
          "id": "https://www.rockpapershotgun.com/can-my-darkest-dungeon-2-party-please-shut-up-for-five-minutes",
          "author": "Alice O'Connor",
          "description": "In time, you will know the tragic extent of my failings, but in Darkest Dungeon 2 goodness me you'll hear about everyone's failings constantly. The horrific dungeon-crawling sequel entered early access yesterday, and my initial impression is that I'm surrounded by squabbling children. Managing the stress of your heroes is more important than ever, because if anyone is even mildly irked they will interrupt every fight to shout about how their squadmate is a kill-stealing dick. I'm this close to turning the stagecoach back around and embracing the impending apocalypse.\nRead more",
          "link": "https://www.rockpapershotgun.com/can-my-darkest-dungeon-2-party-please-shut-up-for-five-minutes",
          "publishedOn": "2021-10-27T17:13:36.000Z",
          "wordCount": 1068,
          "title": "Can my Darkest Dungeon 2 party please shut up for five minutes"
        },
        {
          "id": "https://www.rockpapershotgun.com/all-i-want-for-spook-month-is-more-classic-survival-horror",
          "author": "Nic Reuben",
          "description": "Listen. Outside your window, the chill wind chuckles in raspy glee at autumn’s death rattle. The branches of dying trees rake their gnarled fingers against the glass. You are spooked. You turn to the warm glow of your monitor for comfort. Instead, you find the most terrifying thing imaginable: an unpopular opinion about a videogame. On the internet, no less. You blink and rub your eyes in disbelief. Still, the words remain. Stark. Unforgiving. Undeniably spicy: “Resident Evil Village was disappointing and its success does not bode well for the future of survival horror.” \r\n\n\r\nYou go to type a comment but, uh, your fingers are gone, or something. Just hear me out. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/all-i-want-for-spook-month-is-more-classic-survival-horror",
          "publishedOn": "2021-10-27T16:30:00.000Z",
          "wordCount": 1997,
          "title": "All I want for spook month is more classic survival horror"
        },
        {
          "id": "https://www.rockpapershotgun.com/intel-12th-gen-alder-lake-cpus-specs-price-features",
          "author": "James Archer",
          "description": "After a months-long spin around the rumour mill, the first batch of Intel 12th Gen Alder Lake CPUs is official. Despite the 11th Gen Rocket Lake chips only launching earlier this year, Alder Lake represents the biggest generational jump for Intel in over half a decade, thanks to its completely redesigned “hybrid” architecture and DDR5 memory support. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/intel-12th-gen-alder-lake-cpus-specs-price-features",
          "publishedOn": "2021-10-27T16:00:07.000Z",
          "wordCount": 2230,
          "title": "Intel 12th Gen Alder Lake CPUs announced: everything you need to know"
        },
        {
          "id": "https://www.rockpapershotgun.com/satisfactory-adding-train-signals-train-timetables-and-train-crashes",
          "author": "Alice O'Connor",
          "description": "As factory-building sim Satisfactory continues to assemble itself through early access, the next major update runs a real risk of becoming a train wreck. Now in public testing, Update 5 introduces new features to manage train timetables and routes, and you'll want to pay attention to those because trains can now crash.\nRead more",
          "link": "https://www.rockpapershotgun.com/satisfactory-adding-train-signals-train-timetables-and-train-crashes",
          "publishedOn": "2021-10-27T14:24:04.000Z",
          "wordCount": 919,
          "title": "Satisfactory adding train signals, train timetables, and train crashes"
        },
        {
          "id": "https://www.rockpapershotgun.com/shadow-warrior-3-delayed-into-next-year",
          "author": "Alice O'Connor",
          "description": "The fast-paced, fast-talking violence of Shadow Warrior 3 will not arrive this year after all, now pushed back into \"early 2022.\" Devolver Digital and developers Flying Wild Hog explain it's the usual reason: they want more time to make the FPS good, yeah? A good reason. For now, you can watch the new trailer announcing the delay.\nRead more",
          "link": "https://www.rockpapershotgun.com/shadow-warrior-3-delayed-into-next-year",
          "publishedOn": "2021-10-27T10:46:10.000Z",
          "wordCount": 851,
          "title": "Shadow Warrior 3 delayed into next year"
        },
        {
          "id": "https://www.rockpapershotgun.com/wds-insanely-big-14tb-hdd-is-down-to-222-almost-90-off",
          "author": "Will Judd",
          "description": "Western Digital's 14TB Elements external hard drive is one of the largest you can buy, making it ideal for backing up entire computers, storing massive media libraries and generally being a massive data hoarder. It normally retails for around £300, but today it's dropped down to £222, an £89 discount below RRP. \nRead more",
          "link": "https://www.rockpapershotgun.com/wds-insanely-big-14tb-hdd-is-down-to-222-almost-90-off",
          "publishedOn": "2021-10-26T20:37:44.000Z",
          "wordCount": 854,
          "title": "WD's insanely big 14TB HDD is down to £222, almost £90 off"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-best-pcie-40-ssd-weve-tested-is-going-cheap-at-amazon-uk",
          "author": "Will Judd",
          "description": "WD's SN850 SSD is the fastest SSD we've ever tested, beating out rivals like the Samsung 980 Pro and Crucial P5 Plus in most workloads. If you've got a PCIe 4.0 compatible PC - or a PS5 - then this is the NVMe SSD you want! Today, both the 1TB and 2TB sizes are discounted at Amazon UK, making it a great time to upgrade to the latest and greatest NVMe SSD. \nRead more",
          "link": "https://www.rockpapershotgun.com/the-best-pcie-40-ssd-weve-tested-is-going-cheap-at-amazon-uk",
          "publishedOn": "2021-10-26T20:18:13.000Z",
          "wordCount": 881,
          "title": "The best PCIe 4.0 SSD we've tested is going cheap at Amazon UK"
        },
        {
          "id": "https://www.rockpapershotgun.com/you-can-visit-new-vegas-again-in-a-fallout-4-mod",
          "author": "Alice O'Connor",
          "description": "What happens in New Vegas stays in New Vegas, they say, though New Vegas itself will not stay in Fallout: New Vegas. A new mod named Project Mojave is attempting to recreate a lot of the post-apocalyptic Sin City and surrounding areas as a Fallout 4 mod, and you can play the first slice now. But to manage your expectations: it is not an attempt to recreate Obsidian Entertainment's game Fallout: New Vegas inside Fallout 4.\nRead more",
          "link": "https://www.rockpapershotgun.com/you-can-visit-new-vegas-again-in-a-fallout-4-mod",
          "publishedOn": "2021-10-26T18:07:57.000Z",
          "wordCount": 847,
          "title": "You can visit New Vegas again in a Fallout 4 mod"
        },
        {
          "id": "https://www.rockpapershotgun.com/turbo-overkill-is-the-most-fun-youll-have-with-a-chainsaw-leg-interview",
          "author": "Imogen Beckhelling",
          "description": "Usually, I'd assume that if a chainsaw was near someone's leg, that'd be a problem. But, when the chainsaw is embedded into your own leg and you can flick it out every time you do a butt slide, well then, it's much more of a problem for your enemies' ankles. This is exactly what you're in for with Turbo Overkill, an upcoming shooter which took Apex Legends' excellent sliding mechanics and asked, \"What if we added deadly spinning blades?\" I've had a chat with game director Sam Prebble and even played a little bit myself, and I think you'll like the answer. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/turbo-overkill-is-the-most-fun-youll-have-with-a-chainsaw-leg-interview",
          "publishedOn": "2021-10-26T17:46:59.000Z",
          "wordCount": 1625,
          "title": "Turbo Overkill is the most fun you'll have with a chainsaw leg"
        },
        {
          "id": "https://www.rockpapershotgun.com/darkest-dungeon-2-is-out-now-in-early-access",
          "author": "Imogen Beckhelling",
          "description": "Darkest Dungeon 2 has launched in early access, inviting us all on a delightfully stressful wagon ride. The sequel to Red Hook Studios' dark roguelike moves away from expeditions in the gloomy Hamlet, and instead sends you on a journey through horrific lands to stop an apocalypse. The devs recently told me about why they're taking their gothic tale on the road, and it has something to do with wanting to emulate a rather uncomfortable road trip.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/darkest-dungeon-2-is-out-now-in-early-access",
          "publishedOn": "2021-10-26T16:16:44.000Z",
          "wordCount": 940,
          "title": "Darkest Dungeon 2 is out now in early access"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-to-enable-auto-hdr-in-windows-11",
          "author": "James Archer",
          "description": "Windows 11 may not be an essential upgrade yet, but its Auto HDR feature is mightily impressive: in games that don’t support HDR (high dynamic range) natively, it can apply similar brightness-boosting, colour-emboldening effects. There’s no performance loss, so if you’ve going to upgrade to Windows 11 on your gaming rig, it’s worth giving Auto HDR a try – and this guide will show you how to enable it.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/how-to-enable-auto-hdr-in-windows-11",
          "publishedOn": "2021-10-26T15:32:33.000Z",
          "wordCount": 1254,
          "title": "How to enable Auto HDR in Windows 11"
        },
        {
          "id": "https://www.rockpapershotgun.com/you-can-batter-people-with-fish-in-chivalry-2s-new-tavern-brawl-mode",
          "author": "Alice O'Connor",
          "description": "Swords are cool and all but the medieval fight I find a delight is a tavern brawl, so I'm chuffed to heck to see Chivalry 2 focus on them in a new mode. 'Brawl' mode has players rumble through feasts and halls, fighting with found weapons including chairs, steins, and giant fish. Oh yes, thank you. Also in the field of delightful foolishness is a new headbutt move for armless players to launch one desperate last attack.\nRead more",
          "link": "https://www.rockpapershotgun.com/you-can-batter-people-with-fish-in-chivalry-2s-new-tavern-brawl-mode",
          "publishedOn": "2021-10-26T15:04:03.000Z",
          "wordCount": 866,
          "title": "You can batter people with fish in Chivalry 2's new tavern brawl mode"
        },
        {
          "id": "https://www.rockpapershotgun.com/step-back-from-the-brink-in-precipice",
          "author": "Sin Vega",
          "description": "Brinkmanship doesn't get explored all that much in games. Precipice is almost certainly derived from Balance of Power, a political strategy simulation from 1985 about the Cold War powers and their winner-armageddons-all staring contest. It was impressively original, complex, and completely unplayable. Happily, Precipice has kept most of what made that game interesting to begin with, and dumped the baggage.\nRead more",
          "link": "https://www.rockpapershotgun.com/step-back-from-the-brink-in-precipice",
          "publishedOn": "2021-10-26T14:00:00.000Z",
          "wordCount": 663,
          "title": "Step back from the brink in Precipice"
        },
        {
          "id": "https://www.rockpapershotgun.com/rad-roguelike-caves-of-qud-has-added-friendlier-modes",
          "author": "Alice O'Connor",
          "description": "I've heard a lot about sci-fantasy roguelike Caves Of Qud, split between \"This game is amazing\" and \"This game sounds amazing but what am I doing and why do I keep dying?\" Good news for both types: the latest early access update has added new areas, factions, and items for experienced players to enjoy, while also adding two new friendlier modes. Character creation is overhauled too, complete with some helpful presets.\nRead more",
          "link": "https://www.rockpapershotgun.com/rad-roguelike-caves-of-qud-has-added-friendlier-modes",
          "publishedOn": "2021-10-26T13:52:03.000Z",
          "wordCount": 959,
          "title": "Rad roguelike Caves Of Qud has added friendlier modes"
        },
        {
          "id": "https://www.rockpapershotgun.com/lo-fi-horror-and-the-allure-of-an-uncanny-bitsy",
          "author": "Kat Brewster",
          "description": "A glitched out corner, textures too-smooth in some places and too-rough in others. Play some distorted audio, and add some film grain. That’s lo-fi horror, baby, and the lo-fi games that fit this brief can prey on the valley between the uncanny and the unknown. It’s no secret that the unknown is the scariest part of any horror media. Well, aside from that clown with extremely sharp and pointy teeth - but that’s a kind of unknown. Like... Who’s their dentist? Where’d they get that axe? You know what... I take it back. I don’t want to know that one. Let’s get back to those lo-fi videogames.\nRead more",
          "link": "https://www.rockpapershotgun.com/lo-fi-horror-and-the-allure-of-an-uncanny-bitsy",
          "publishedOn": "2021-10-26T12:00:00.000Z",
          "wordCount": 1570,
          "title": "Lo-fi horror and the allure of an uncanny Bitsy"
        },
        {
          "id": "https://www.rockpapershotgun.com/phasmophobia-has-added-a-haunted-campsite-and-new-ghosts",
          "author": "Alice O'Connor",
          "description": "If Halloween is best spent doing scary things with pals, Phasmophobia is one of the best games to play this Halloween. The cooperative game sends us to investigate haunted places, trying to capture evidence of ghosts without getting murdered by them. And now it's even more Halloween-y (well, technically Friday The 13th-y) thanks to a big new early access update, which has added a new map set in a haunted campground, new types of ghost, and new spooky weather. Great, just what I wanted in a game I'm already too scared to play.\nRead more",
          "link": "https://www.rockpapershotgun.com/phasmophobia-has-added-a-haunted-campsite-and-new-ghosts",
          "publishedOn": "2021-10-26T10:14:10.000Z",
          "wordCount": 944,
          "title": "Phasmophobia has added a haunted campsite map and new ghosts"
        },
        {
          "id": "https://www.rockpapershotgun.com/valve-confirm-steam-autumn-winter-and-halloween-sale-dates",
          "author": "Alice O'Connor",
          "description": "Valve can't keep sales secret. Every year, the big dates leak well in advance, whether whispered by devs or blasted by PayPal newsletters. This year, Valve are apparently content to say them in public where anyone might here. Hey, it's just a sale, why the secrecy? So yup, we now definitely know dates for the Steam Halloween Sale, the Steam Autumn Sale, and the Steam Winter Sale.\nRead more",
          "link": "https://www.rockpapershotgun.com/valve-confirm-steam-autumn-winter-and-halloween-sale-dates",
          "publishedOn": "2021-10-26T09:07:42.000Z",
          "wordCount": 794,
          "title": "Valve confirm Steam autumn, winter, and Halloween sale dates"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-lapa-loadout-warzone",
          "author": "Charlie Biggerstaff",
          "description": "Looking for the best LAPA loadout in Warzone Season 6? Treyarch and Raven Software are sending Cold War out with a bang, adding a series of unusual, interesting weapons in the final seasons. The LAPA SMG is the latest, and one of the most intriguing yet. Several of its barrel attachments alter the LAPA’s damage and fire rate. That variety makes the LAPA a very fun gun to customize and play around with. Of course, there is always a best configuration. Once you’ve had your fun and are ready to sweat, we’re here to help.\r\n\nThe LAPA’s range isn’t great, but up close it has monstrous potential. Its high neck and head multipliers make for a skill-dependant weapon, but in the right hands, with the right build, the LAPA fries. Here’s our build of choice:\r\n\nAs usual, we’re starting off with an Agency Suppressor. Added range and bullet velocity on a suppressor remain nigh-impossible to pass up. As long as you’re using a Cold War weapon, you’ll want this attachment. Things get interesting with the barrel. We’ve gone with the Rifled Barrel, which provides the most consistent damage profile. The LAPA very much relies on chest, neck, and headshots, but the Rifled Barrel helps even out the damage to the stomach and limbs. All of the barrels are frankly pretty close in power though, so try a few and see what feels right.\r\n \nRead more",
          "link": "https://www.rockpapershotgun.com/best-lapa-loadout-warzone",
          "publishedOn": "2021-10-26T08:36:48.000Z",
          "wordCount": 1144,
          "title": "Best LAPA loadout in Warzone Season 6"
        },
        {
          "id": "https://www.rockpapershotgun.com/moonglow-bay-review",
          "author": "Jay Castello",
          "description": "Everything in the seaside town of Moonglow Bay has seen better days. That includes you, a middle-aged accountant who’s moved out of the big city for a fresh start. But things never go quite to plan, do they? The moment-to-moment of Moonglow Bay is a chilled-out experience of getting out onto the waves, exploring various biomes, catching fish, and cooking them up to sell or gift to the townspeople. But within that is an exploration of things going awry, and letting go of old dreams in order to build new ones.\nRead more",
          "link": "https://www.rockpapershotgun.com/moonglow-bay-review",
          "publishedOn": "2021-10-25T17:00:00.000Z",
          "wordCount": 1579,
          "title": "Moonglow Bay review: a relaxing fishing RPG that's all about keeping it reel"
        },
        {
          "id": "https://www.rockpapershotgun.com/please-stop-with-all-the-godawful-emails-about-nft-gaming",
          "author": "Alice Bell",
          "description": "It started a few months ago: we got an email about shoes designed using 'blockchain technology', and had a good laugh about it as a concept. But in retrospect, this email was merely the ripple on a glass of water that go ahead of a T-Rex's mighty tread. Except in this analogy the T-Rex is one of 10,001 unique dinosaurs programatically generated from different traits. And it's wearing wacky sunglasses and smoking a pipe.\nRead more",
          "link": "https://www.rockpapershotgun.com/please-stop-with-all-the-godawful-emails-about-nft-gaming",
          "publishedOn": "2021-10-25T16:21:35.000Z",
          "wordCount": 701,
          "title": "Please, stop with all the godawful emails about NFT gaming"
        },
        {
          "id": "https://www.rockpapershotgun.com/no-more-heroes-developers-grasshopper-bought-by-netease",
          "author": "Alice O'Connor",
          "description": "Chinese publishers NetEase have bought Grasshopper Manufacture, the Japanese studio behind stylish, swaggering games including No More Heroes, The Silver Case, and Killer7. While NetEase have roots in mobile games, they have been investing in fancier things. Grasshopper say that with NetEase's cash, they plan to release \"three even higher-quality 'Grasshopper Manufacture Games'\" over the next decade.\nRead more",
          "link": "https://www.rockpapershotgun.com/no-more-heroes-developers-grasshopper-bought-by-netease",
          "publishedOn": "2021-10-25T14:36:45.000Z",
          "wordCount": 965,
          "title": "No More Heroes developers Grasshopper bought by NetEase"
        },
        {
          "id": "https://www.rockpapershotgun.com/halo-infinite-campaign-trailer-shows-big-levels-with-bases-to-capture",
          "author": "Alice O'Connor",
          "description": "After focusing a lot of attention on Halo Infinite's multiplayer, Microsoft have turned back to showing off the story campaign. Today's new campaign trailer, sadly, did not give us another hot WWE promo from a space-ape but it did kinda have Far Cry-ish vibes. Watch on for Master Chef zooming around big levels in vehicles, causing big explosions, upgrading his abilities, and bantering with his new Tamagotchi girlfriend.\nRead more",
          "link": "https://www.rockpapershotgun.com/halo-infinite-campaign-trailer-shows-big-levels-with-bases-to-capture",
          "publishedOn": "2021-10-25T13:51:14.000Z",
          "wordCount": 816,
          "title": "Halo Infinite campaign trailer shows big levels with bases to capture"
        },
        {
          "id": "https://www.rockpapershotgun.com/marvels-guardians-of-the-galaxy-review",
          "author": "Ed Thorn",
          "description": "In a video game landscape that's pocked with millions of map markers and vast open worlds, Marvel's Guardians Of The Galaxy is a linear action adventure game with a clear beginning, middle and an end. It's an approach that feels refreshingly old-school, in the way it guides you smoothly from one story bit to another. But this doesn't mean it's one big flatline without any peaks, troughs, or surprises.\nIf anything, the game as a whole is a wonderful surprise. Planet-hopping as Star Lord is great fun, made even better by his colourful compatriots and the genuinely funny craic they share. Marvel fan or clueless layman? Doesn't matter, you're in for a good time no matter where you sit on the MCU scale.\nRead more",
          "link": "https://www.rockpapershotgun.com/marvels-guardians-of-the-galaxy-review",
          "publishedOn": "2021-10-25T13:00:00.000Z",
          "wordCount": 1917,
          "title": "Marvel's Guardians Of The Galaxy review: a blast from the past"
        },
        {
          "id": "https://www.rockpapershotgun.com/happy-halloween-on-rps-have-a-load-of-horror-themed-writing-to-celebrate",
          "author": "Alice Bell",
          "description": "Halloween comes but once per year, and it's nearly over already! But here on RPS we celebrated the reason for the season (i.e. horror things; scary stuff; being scared, you know) in style. We had a whole host of spooky themed articles this year, and what a troupe of little devils they are to behold!\nWhether you're staying in for a quiet one, pelting fun-size chocolate bars from your upstairs window at the neighbour children with vicious force, or you're having a heavy weekend and will need to recover come Sunday morning, have a look at the Halloween 2021 for some dark delights. Or read on in this article!\nRead more",
          "link": "https://www.rockpapershotgun.com/happy-halloween-on-rps-have-a-load-of-horror-themed-writing-to-celebrate",
          "publishedOn": "2021-10-25T12:39:23.000Z",
          "wordCount": 1587,
          "title": "Happy Halloween on RPS! Have a load of horror-themed writing to celebrate"
        }
      ]
    },
    {
      "title": "Root.cz - články",
      "feedUrl": "https://www.root.cz/rss/clanky/",
      "siteUrl": "https://www.root.cz/clanky/",
      "articles": [
        {
          "id": "www.root.cz-text-15740",
          "author": "redakce@root.cz (Root.cz: Pavel Herout)",
          "description": "V první části budou vysvětleny základní pojmy včetně výběru knihovny PHPUnit.\nDozvíme se jaké jsou základní části jednotkového testu, jak začlenit testy do prostředí PhpStorm a jak pracovat s výsledky testů.",
          "link": "https://www.root.cz/clanky/jednotkove-testovani-v-php-s-knihovnou-phpunit/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-11-02T23:00:10.000Z",
          "wordCount": 3030,
          "title": "Jednotkové testování v PHP s knihovnou PHPUnit",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/516/php-1.jpg",
            "length": "42482",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15745",
          "author": "redakce@root.cz (Root.cz: Jiří Sluka)",
          "description": "Dnes si představíme databázového klienta pro PostgreSQL, vytvoříme lokální certifikační autoritu, poohlédneme se po dalším git klientovi a nakonec se vypořádáme s příliš aktivní myší.",
          "link": "https://www.root.cz/clanky/softwarova-sklizen-3-11-2021/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-11-02T23:00:05.000Z",
          "wordCount": 980,
          "title": "Softwarová sklizeň (3. 11. 2021)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/root/368/kombajn-sklizen.jpg",
            "length": "394618",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15741",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "Před 55 lety, tedy v listopadu 1966, byla vydána první verze programovacího jazyka APL. Jednalo se o přelomový jazyk, který byl založen na (tehdy) nové notaci zápisu matematických operací vymyšlenou Kennethem E. Iversonem.",
          "link": "https://www.root.cz/clanky/oslava-55-let-od-vzniku-prvni-implementace-programovaciho-jazyka-apl/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-11-01T23:00:15.000Z",
          "wordCount": 10268,
          "title": "Oslava 55 let od vzniku první implementace jazyka APL",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/678/mcm-model-70-microcomputer-1974-apl-keyboard-1.jpg",
            "length": "52786",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15739",
          "author": "redakce@root.cz (Root.cz: Daniel Salzman)",
          "description": "V úvodním dílu jsme si zprovoznili automatickou synchronizaci zóny na sekundárním serveru. Dnes si ukážeme, jaké jsou další možnosti nastavení zónových transferů a co je jejich obsahem.",
          "link": "https://www.root.cz/clanky/knot-dns-zonove-transfery-aneb-prenos-zon-mezi-servery/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-11-01T23:00:10.000Z",
          "wordCount": 2933,
          "title": "Knot DNS: zónové transfery aneb přenos zón mezi servery",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/399/uzel-provaz-spojeni-1.jpg",
            "length": "44034",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15736",
          "author": "redakce@root.cz (Root.cz: CSIRT.CZ)",
          "description": "Dnes se v týdenním souhrnu bezpečnostních novinek podíváme na podvodnou kampaň UltimateSMS, na platební terminály PAX, na krádež reklamy, na mobilní síť nové generace a na dvě nakažené knihovny na oficiálním úložišti.",
          "link": "https://www.root.cz/clanky/postrehy-z-bezpecnosti-jak-si-neobjednat-drahe-predplatne/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-31T23:00:10.000Z",
          "wordCount": 1637,
          "title": "Postřehy z bezpečnosti: jak si neobjednat drahé předplatné",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/95/subscribe-now-1.jpg",
            "length": "36930",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15737",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Začal vývoj Ubuntu 22.04 s dlouhodobou podporou. Distribuce vycházející z Void Linuxu s grafickým prostředím Lumina ukončuje svůj vývoj. AlmaLinux má nový nástroj pro aktualizaci Enterprise Linux systémů.",
          "link": "https://www.root.cz/clanky/zacal-vyvoj-ubuntu-22-04-lts-project-trident-konci/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-31T23:00:05.000Z",
          "wordCount": 1174,
          "title": "Začal vývoj Ubuntu 22.04 LTS, Project Trident končí",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/413/ubuntu-22-04-1.jpg",
            "length": "32441",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15738",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Audacity 3.1 se snadnější editací, X.Org 21.1 s podporou proměnné obnovovací frekvence, Samsung a HDR10+ Gaming, KDE oddělí stavová data aplikací, vlajková loď Nikon Z9, IPTC přidává dva nové prvky.",
          "link": "https://www.root.cz/clanky/project-trident-konci-desktopoveho-nasledovnika-pc-bsd-nema-kdo-vyvijet/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-30T22:00:00.000Z",
          "wordCount": 1638,
          "title": "Project Trident končí, desktopového následovníka PC-BSD nemá kdo vyvíjet",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/578/lumina-desktop-trident-1.jpg",
            "length": "42738",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15735",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Pat Gelsinger má za sebou 8 měsíců ve funkci. Intel nyní stojí v bodě zvratu, čerstvě uvedené procesory 12. generace Core zvané Alder Lake mají firmu vrátit na výsluní. Ale to je jen polovina cesty.",
          "link": "https://www.root.cz/clanky/intel-bude-otevrenejsi-dukazem-je-uvedeni-alder-lake/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-28T22:00:10.000Z",
          "wordCount": 2371,
          "title": "Intel bude otevřenější, důkazem je uvedení Alder Lake",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/516/pat-gelsinger-1.jpg",
            "length": "28409",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15721",
          "author": "redakce@root.cz (Root.cz: Ondřej Filip)",
          "description": "Dotazy zadané do vyhledání obsahují řadu chyb. Vyhledávače umí tyto chyby odstranit a díky tomu nalézt lepší výsledky. V Seznamu jsme nedávno zrychlili a zlepšili opravu dotazů pomocí neuronových sítí.",
          "link": "https://www.root.cz/clanky/rychla-oprava-dotazu-ve-vyhledavaci-pomoci-neuronovych-siti/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-26T22:00:10.000Z",
          "wordCount": 2364,
          "title": "Rychlá oprava dotazů ve vyhledávači pomocí neuronových sítí",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/498/neuronova-sit-1.jpg",
            "length": "42694",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15728",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Sonda do světa otevřeného softwaru. Dnes si představíme nástroj pro automatické klikání, vyzkoušíme sofistikovanou kalkulačku, podíváme se na otevřeného klienta pro OneNote a řekneme si o nástroji pro auditování a obnovu hesel ve Windows.",
          "link": "https://www.root.cz/clanky/softwarova-sklizen-27-10-2021/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-26T22:00:05.000Z",
          "wordCount": 983,
          "title": "Softwarová sklizeň (27. 10. 2021)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/root/368/kombajn-sklizen.jpg",
            "length": "394618",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "Root.cz - zprávičky",
      "feedUrl": "https://www.root.cz/rss/zpravicky/",
      "siteUrl": "https://www.root.cz/zpravicky/",
      "articles": [
        {
          "id": "www.root.cz-actuality-42974",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Podpora čerstvě uvedených procesorů Intel Alder Lake-S, tedy například Core i9–12900K, je pro Linux 5.16 hotova a prohlášena za stabilní. Vedle samotných CPU dostává příští verze jádra též podporu Protected Xe Path (PXP), což umožní běh video dat chráněnou cestou. Mizí potřeba používat parametr force_probe a podpora GPU tak bude v Linuxu 5.16 automaticky zapnutá. V rámci větve DRM-Next tak již proběhl veškerý potřebný vývoj.",
          "link": "https://www.root.cz/zpravicky/linux-5-16-dostane-hotovou-podporu-intel-alder-lake-gpu-vcetne-pxp/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-11-03T15:30:56.000Z",
          "wordCount": 867,
          "title": "Linux 5.16 dostane hotovou podporu Intel Alder Lake GPU včetně PXP",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/448/intel-alder-lake-1.jpg",
            "length": "90592",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-40574",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Linuxových systémů přibývá, každý den se spouštějí nové servery a někdo se o ně musí starat. To znamená spoustu různých dovedností specifických právě pro linuxové prostředí. Jak to zprovoznit, kudy bezpečně dovnitř, co tam najdeme, jak se o to postaráme a jak to nastavíme nebo rozšíříme.",
          "link": "https://www.root.cz/zpravicky/naucte-se-pouzivat-linux-spravne-a-bezpecne-online-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-11-03T11:19:40.000Z",
          "wordCount": 809,
          "title": "Naučte se používat Linux správně a bezpečně (online školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/440/skoleni-1.jpg",
            "length": "61676",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42973",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Nové Macbooky s vyššími verzemi Apple procesorů M1 Pro a M1 Max již mají v rukou vývojáři z Asahi Linuxu. Hector Martin nyní informuje, že se na stroji s M1 Pro již podařilo nastartovat Linux.",
          "link": "https://www.root.cz/zpravicky/linux-uz-bezi-na-stroji-s-apple-m1-pro/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-11-03T07:45:00.000Z",
          "wordCount": 3724,
          "title": "Linux už běží na stroji s Apple M1 Pro",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/535/apple-m1-pro-max-1.png",
            "length": "280919",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42972",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "ANARI je novým aplikačním rozhraním z dílen Khronos Group. Jde o bezplatné API, které by se mohlo stát příštím průmyslovým standardem v oblasti 3D vizualizací dat a jejich analytického renderování.",
          "link": "https://www.root.cz/zpravicky/khronos-group-predstavuje-api-anari-1-0-pro-skalovatelne-3d-vizualizace/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-11-03T07:26:04.000Z",
          "wordCount": 836,
          "title": "Khronos Group představuje API ANARI 1.0 pro škálovatelné 3D vizualizace",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/356/anari-1-0-1.png",
            "length": "326329",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42971",
          "author": "redakce@root.cz (Root.cz: Michal Smrž)",
          "description": "Gary Bowser je údajným členem hackerské skupiny Team-Xecuter, která vyvíjí a prodává nástroje na obcházení ochran herních konzolí, v poslední době hlavně pro Nintendo Switch.",
          "link": "https://www.root.cz/zpravicky/gary-bowser-souhlasi-s-odskodnenim-4-5-milionu-dolaru-pro-nintendo/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-11-02T19:08:17.000Z",
          "wordCount": 2118,
          "title": "Gary Bowser souhlasí s odškodněním 4,5 miliónů dolarů pro Nintendo",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/335/nintendo-switch-1.jpg",
            "length": "30583",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42970",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Devadesát-čtyřka Firefoxu přináší po omezenou dobu dostupných 6 barevných vzhledů (s dodatkem, že na Beta verzi používalo upravená barevná témata celých 32 % uživatelů). Na macOS je podporován režim s nízkou spotřebou při přehrávání videí na YouTube či Twitchi.",
          "link": "https://www.root.cz/zpravicky/firefox-94-prinasi-egl-na-linuxu-vylepsenou-podporu-macos-i-windows-11/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-11-02T14:15:25.000Z",
          "wordCount": 1040,
          "title": "Firefox 94 přináší EGL na Linuxu, vylepšenou podporu macOS i Windows 11",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/274/firefox-loga-1.jpg",
            "length": "28748",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42969",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Po dílčích odkladech vyšla finální Fedora 35, a to jak Fedora Workstation 35, tak Fedora Server 35. Novinek je nemálo, najdeme zde mimo jiné GNOME 41, nejnovější XWaylandu s podporou Nvidia GPU běžících na proprietárním ovladači a mnoho dalších aktualizací.",
          "link": "https://www.root.cz/zpravicky/vydan-fedora-linux-35-s-gnome-41/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-11-02T14:07:41.000Z",
          "wordCount": 1105,
          "title": "Vydán Fedora Linux 35 s GNOME 41",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/436/gnome-41-1.jpg",
            "length": "37046",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42968",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Nová verze desktopového prostředí Trinity Desktop Environment, navazujícího na někdejší slávu KDE 3.x, přináší několik málo novinek. Tvůrci se soustředili napríklad na lepší běh s displeji s vysokou hodnotou dpi. Dále došlo na nové styly TWin (SUSE2 a DeKorator) a nové aplikace.",
          "link": "https://www.root.cz/zpravicky/tde-r14-0-11-vylepsuje-podporu-hidpi/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-11-02T13:42:07.000Z",
          "wordCount": 809,
          "title": "TDE R14.0.11 vylepšuje podporu HiDPI",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/69/tde-r14-0-11-1.png",
            "length": "352657",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42967",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Google zveřejnil speciální tříměsíční akci na lov bezpečnostních chyb v linuxovém jádře. Během této doby také ztrojnásobil odměnu pro případné úspěšné lovce, kteří si tak mohou přijít až na 50 337 dolarů, tedy více než milion českých korun. Samozřejmě jen za určitých a velmi konkrétně definovaných podmínek.",
          "link": "https://www.root.cz/zpravicky/google-docasne-ztrojnasobil-odmenu-za-nalezeni-chyby-v-linuxovem-jadre/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-11-02T12:22:11.000Z",
          "wordCount": 898,
          "title": "Google dočasně ztrojnásobil odměnu za nalezení chyby v linuxovém jádře",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/668/google-1.jpg",
            "length": "63779",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42966",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Na světě je nová verze multimediálního přehrávače MPV, jehož původ sahá až k MPlayeru. Přináší některé nové přepínače pro příkazovou řádku a také vylepšené vlastnosti. Například je přehrávač nyní schopen přepínat za běhu back-end výstupu videa a má vylepšenou podporu Waylandu (dotykové ovládání).",
          "link": "https://www.root.cz/zpravicky/mpv-0-34-umoznuje-prepinani-vystupu-za-behu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-11-01T23:00:00.000Z",
          "wordCount": 824,
          "title": "MPV 0.34 umožňuje přepínání výstupu za běhu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/100/mpv-1.jpg",
            "length": "24169",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42965",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Aplikace ministerstva zdravotnictví pro mobilní zařízení s Androidem a iOS eRouška, která rok pomáhala pomocí Exposure Notification API trasovat kontakty s COVID-19 pozitivními lidmi, ode dneška končí. A to i přes to, že v současnosti počet COVID-19 pozitivních případů opět roste.",
          "link": "https://www.root.cz/zpravicky/aplikace-erouska-konci/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-11-01T19:27:06.000Z",
          "wordCount": 13369,
          "title": "Aplikace eRouška končí",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/476/erouska.jpg",
            "length": "46264",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42964",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Marc Radinovic vytvořil zařízení, které kontroluje řidiče, jestli při zatáčení používá blinkry. Senzorem jsou dva Arduino Nano 33 BLE moduly. Používá se jejich vestavěný akcelerometr ke zjištění polohy volantu a páčky blinkrů. Senzory pomocí BLE komunikují s Arduino UNO WiFi deskou. Ta je sériově pomocí USB propojena s Raspberry Pi 4.",
          "link": "https://www.root.cz/zpravicky/raspberry-pi-a-arduino-kontroluje-pouzivani-blinkru/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-11-01T16:44:52.000Z",
          "wordCount": 3628,
          "title": "Raspberry Pi a Arduino kontroluje používání blinkrů",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/79/blinkr-1.jpg",
            "length": "37245",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42963",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Včera vydané jádro 5.15 bude LTS, tedy bude mít dlouhou podporu, jak dnes rozhodl Greg Kroah-Hartman. Podpora je zatím plánována na dva roky, ale podpora může být prodloužena, pokud dostatek uživatelů a společností projeví zájem a budou ochotni testovat.",
          "link": "https://www.root.cz/zpravicky/prave-vydane-jadro-5-15-bude-lts/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-11-01T13:16:51.000Z",
          "wordCount": 770,
          "title": "Právě vydané jádro 5.15 bude LTS",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/344/tux-linux-1.jpg",
            "length": "22348",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42962",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Prohlížeč Microsoft Edge je od minulého čtvrtka pro Linux v ostré verzi označené jako stable microsoft-edge-stable-95.0.1020.38–1 a není tak již označován jako beta. V pátek se objevila verze končící 40–1. Microsoft zatím nic neoznámil, na oficiálních stránkách Edge je stále napsáno „Není podporován pro Linux“. Změny si všimli pracovníci bezpečnostní firmy Sophos.",
          "link": "https://www.root.cz/zpravicky/microsoft-edge-pro-linux-v-ostre-verzi/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-11-01T09:44:00.000Z",
          "wordCount": 3602,
          "title": "Microsoft Edge pro Linux v ostré verzi",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/604/microsoft-edge-ubuntu-1.jpg",
            "length": "26599",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-41195",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Kubernetes je dnes nejrozšířenější platformou na hostovaní Docker kontejneru a je podporován velkými hráči na trhu (Google, Amazon, Microsoft) skrz Cloud Native Computing Foundation. Kuberneres pro provoz používají všechny velikosti firem, od startupu po korporace. Pojďme se naučit jej používat na dvoudenním kurzu Úvod do Kubernetes, který proběhne v naší pražské školicí místnosti ve dnech 25. a 26. listopadu. Školení proběhne kombinovaně: tedy prezenčně a zároveň je možné se účastnit online.",
          "link": "https://www.root.cz/zpravicky/naucte-se-kubernetes-na-nasem-dvoudennim-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-11-01T09:41:07.000Z",
          "wordCount": 833,
          "title": "Naučte se Kubernetes na našem dvoudenním školení",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/122/kubernetes-1.jpg",
            "length": "21058",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42961",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Linus Torvalds včera vydal jádro 5.15. Mezi novinky patří ovladač NTFS3 od Paragon Software, který má potenciál nahradit FUSE ovladač ntfs-3g. Dále je v jádře implementace Samba serveru KSMBD od Samsungu.",
          "link": "https://www.root.cz/zpravicky/vyslo-jadro-5-15-s-ntfs3-a-ksmbd/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-11-01T06:48:11.000Z",
          "wordCount": 775,
          "title": "Vyšlo jádro 5.15 s NTFS3 a KSMBD",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/344/tux-linux-1.jpg",
            "length": "22348",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42960",
          "author": "redakce@root.cz (Root.cz: bkralik)",
          "description": "Protože zima se blíží a pravděpodobnost znovuzavedení protiepidemických opatření každý den vzrůstá, rozhodli jsme se příští týden zorganizovat rovnou dvě pravidelné akce z repertoáru projektu MacGyver studentského klubu SiliconHill.",
          "link": "https://www.root.cz/zpravicky/virtualni-bastlirna-a-den-otevrenych-spinacu-dveri/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-11-01T06:28:31.000Z",
          "wordCount": 857,
          "title": "Virtuální Bastlírna a Den Otevřených Spínačů (Dveří)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/112/pajeni-bastleni-elektronika-1.jpg",
            "length": "68239",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42959",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Nadcházející Firefox 94 bude v Linuxu používat EGL backend místo dosavadního GLX. Ve výsledku bude lepší výkon WebGL a menší spotřeba díky podpoře částečného překreslení obrazovky.",
          "link": "https://www.root.cz/zpravicky/firefox-94-bude-pouzivat-egl-lepsi-vykon-a-mensi-spotreba/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-30T13:21:44.000Z",
          "wordCount": 3195,
          "title": "Firefox 94 bude používat EGL - lepší výkon a menší spotřeba",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/274/firefox-loga-1.jpg",
            "length": "28748",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42958",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Nový Proton Experimental v beta verzi klienta Steam ze včerejška umí spustit windowsové hry chráněné starým ale rozšířeným DRM Valve CEG (custom executable-generation). Jde zatím jen o předběžnou podoru a může se stát, že některá hra s CEG nepojede. Úspěchy i neúspěchy lze hlásit na GitHubu.",
          "link": "https://www.root.cz/zpravicky/proton-nove-umi-hry-chranene-drm-valve-ceg/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-29T12:24:25.000Z",
          "wordCount": 1804,
          "title": "Proton nově umí hry chráněné DRM Valve CEG",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/677/valve-1.jpg",
            "length": "22542",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42957",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Včera Google vydal mimořádnou bezpečnostní opravu svého prohlížeče Chrome 95.0.4638.69 pro Windows, Linux i macOS, která se týká také Chromium. Opraveno je celkem 8 zranitelností, všechny s vysokou nebezpečností. Obzvlášť nebezpečné jsou chyby CVE-2021–38000 a CVE-2021–38003, protože jsou v současnosti aktivně zneužívány.",
          "link": "https://www.root.cz/zpravicky/chrome-a-chromium-zranitelne-aktualizujte-na-95-0-4638-69/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-29T11:29:16.000Z",
          "wordCount": 1589,
          "title": "Chrome i Chromium zranitelné, aktualizujte na 95.0.4638.69",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/198/chromium-vs-chrome-1.jpg",
            "length": "60818",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42956",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Včera CEO Facebooku Mark Zuckerberg řekl, že se společnost Facebook přejmenovává na Meta. Jména jednotlivých produktů jako Facebook, Whatsapp a Instagram zůstávají stejné. Výjimkou je Oculus s VR brýlemi. Ty budou nově prodávány pod značkou Meta a Oculus už se nebude používat.",
          "link": "https://www.root.cz/zpravicky/spolecnost-facebook-se-prejmenovava-na-meta/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-29T05:47:41.000Z",
          "wordCount": 5333,
          "title": "Společnost Facebook se přejmenovává na Meta",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/452/meta-1.jpg",
            "length": "17934",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42955",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Privátní klíč určený k podpisu digitálních očkovacích certifikátů zřejmě unikl a koluje po nejrůznějších platformách včetně sociálních sítí a webových fór. Internetem se také šíří potvrzení o očkování vystavené pro Adolfa Hitlera narozeného 1. ledna 1900. Kromě toho je možné potkat také certifikáty pro jména Mickey Mouse, Sponge Bob a další známá jména. Mobilní aplikace pro kontrolu očkovacích certifikátů je považují za platné.",
          "link": "https://www.root.cz/zpravicky/unikly-privatni-klice-pro-tvorbu-ockovacich-certifikatu-koluje-certifikat-adolfa-hitlera/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-28T20:11:58.000Z",
          "wordCount": 2032,
          "title": "Unikly privátní klíče pro tvorbu očkovacích certifikátů, koluje certifikát Adolfa Hitlera",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/313/ockovaci-certifikat-covid-1.jpg",
            "length": "54511",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42954",
          "author": "redakce@root.cz (Root.cz: Calculon)",
          "description": "S blížícím se vydáním Go 1.18 dochází k posledním úpravám návrhu generických typů v Go. Tato zatím největší změna od vydání první verze jazyka zahrnuje rozšíření překladače a standardní knihovny. V případě knihovny budou zatím změny provizorní, bez zaručení zpětné kompatibility.",
          "link": "https://www.root.cz/zpravicky/deni-okolo-generickych-typu-v-go/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-28T19:54:19.000Z",
          "wordCount": 5950,
          "title": "Dění okolo generických typů v Go",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/492/go-language-1.jpg",
            "length": "42779",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42953",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Pokrývání pražského metra mobilním signálem zdárně pokračuje, o prázdninách byly pokryty čtyři stanice a teď se k nim přidávají další. Od tohoto týdne je vysokorychlostní sítí LTE i 5G pokryt i poslední úsek linky A, tedy stanice Skalka a Depo Hostivař a oba traťové tunely mezi nimi. Cestující na zelené lince tak mohou telefonovat či datovat v celém úseku od Nemocnice Motol po Depo Hostivař. Jedinou výjimku tvoří samotná stanice Jiřího z Poděbrad, do které se LTE síť dostane po dokončení modernizace a vybudování výtahů, píše v oznámení dopravní podnik.",
          "link": "https://www.root.cz/zpravicky/metro-ma-signalem-pokrytou-celou-linku-a-v-cele-siti-zbyva-uz-jen-pet-stanic/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-28T10:48:02.000Z",
          "wordCount": 927,
          "title": "Metro má signálem pokrytou celou linku A, v celé síti zbývá už jen pět stanic",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/383/metro-praha-mobil-1.jpg",
            "length": "44050",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42952",
          "author": "redakce@root.cz (Root.cz: Petr Šrámek)",
          "description": "Raspberry Pi Foundation zveřejnila novou verzi populárního miniaturního jednodeskového počítače Raspberry Pi Zero W ve verzi 2. Hlavní změnou je výměna procesoru – místo obstarožního BCM2835 byl použit BCM2710A1, který je používán i v jednodeskových počítačích Raspberry Pi 3.",
          "link": "https://www.root.cz/zpravicky/raspberry-pi-zero-2-w-petkrat-vyssi-vykon-na-stejne-desce-za-stejnou-cenu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-28T08:35:17.000Z",
          "wordCount": 2189,
          "title": "Raspberry Pi Zero 2 W: pětkrát vyšší výkon na stejné desce",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/393/raspberry-pi-zero-2-w-1.jpg",
            "length": "46683",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "abclinuxu - aktuální články",
      "feedUrl": "http://www.abclinuxu.cz/auto/abc.rss",
      "siteUrl": "http://www.abclinuxu.cz/clanky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/clanky/goodoffer24-nemate-windows-11-vezmete-si-svuj-licencni-kod-za-12-eur",
          "author": "Reklama",
          "description": "Kupte doživotní licenci Windows 11 nebo Windows 10 a další software na GoodOffer24.com. Můžete si vybrat z nabízených bundlů, nebo projet celý tento prodejní web. Hlavně nezapomeňte zadat před dokončením nákupu slevový kód AX30, na který získáte další slevu 35 %.",
          "link": "http://www.abclinuxu.cz/clanky/goodoffer24-nemate-windows-11-vezmete-si-svuj-licencni-kod-za-12-eur",
          "publishedOn": "2021-11-01T11:00:00.000Z",
          "wordCount": 1346,
          "title": "GoodOffer24: Nemáte Windows 11? Vezměte si svůj licenční kód za 12 eur"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-tiskarny-behem-lockdownu-a-pote-ceny",
          "author": "Redakce",
          "description": "Polovina ajťáků v Praze vydělá 100 a více tisíc měsíčně. Notebooky a PC v uplynulém období. Dell rozšiřuje IT kapacity směrem na periferii. Servery Lenovo nově v portfoliu Entec Solutions. Hrozby na vzestupu: útoky na dodavatelské řetězce a krádeže výpočetních kapacit. Tiskárny během lockdownů a poté (3) Ceny.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-tiskarny-behem-lockdownu-a-pote-ceny",
          "publishedOn": "2021-10-30T22:01:00.000Z",
          "wordCount": 1557,
          "title": "Týden na ITBiz: Tiskárny během lockdownů a poté – ceny"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-43-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-43-2021",
          "publishedOn": "2021-10-29T22:01:00.000Z",
          "wordCount": 2119,
          "title": "Událo se v týdnu 43/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-umela-inteligence-a-rekurzivni-sebezdokonalovani",
          "author": "Redakce",
          "description": "Poločas rozpadu neutronu. Máme se bát, pokud umělá inteligence navrhne jinou umělou inteligenci? Superionický led. Počátky počítačů na Slovensku. Na Venuši žádné oceány být nemusely.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-umela-inteligence-a-rekurzivni-sebezdokonalovani",
          "publishedOn": "2021-10-29T16:30:00.000Z",
          "wordCount": 1713,
          "title": "Týden na ScienceMag.cz: Umělá inteligence a rekurzívní sebezdokonalování"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/distribucni-novinky-41-42-2021",
          "author": "Redakce",
          "description": "V říjnu bylo dosud vydáno Ubuntu 21.10, OpenBSD 7.0 nebo ruská, na Mandrivě založená ROSA Fresh Desktop R12. Na Debian „Bullseye“ přešly jeho deriváty bez systemd Devuan a MX Linux. Také byly aktualizovány distribuce KaOS, GhostBSD, Porteus Kiosk, Redcore Linux či NuTyX.",
          "link": "http://www.abclinuxu.cz/clanky/distribucni-novinky-41-42-2021",
          "publishedOn": "2021-10-26T16:00:00.000Z",
          "wordCount": 2142,
          "title": "Distribuční novinky 41-42/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-organizace-letos-vynalozi-na-technologie-podporujici-budoucnost-prace-656-miliard-dolaru",
          "author": "Redakce",
          "description": "Red Hat novými aktualizacemi podporuje edge computing. Organizace letos vynaloží na technologie podporující budoucnost práce 656 miliard dolarů. HPE GreenLake přináší inovativní architekturu správy dat. Tiskárny během lockdownů a poté (2) Nedostatek dílů.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-organizace-letos-vynalozi-na-technologie-podporujici-budoucnost-prace-656-miliard-dolaru",
          "publishedOn": "2021-10-24T14:00:00.000Z",
          "wordCount": 1437,
          "title": "Týden na ITBiz: Organizace letos vynaloží na technologie podporující budoucnost práce 656 miliard dolarů"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-42-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-42-2021",
          "publishedOn": "2021-10-22T22:01:00.000Z",
          "wordCount": 2311,
          "title": "Událo se v týdnu 42/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-umela-inteligence-a-signaly-odmen",
          "author": "Redakce",
          "description": "Problém zpětnovazebného učení u skutečné umělé inteligence. Primordiální černé díry. Záhadné rádiové vlny. Nejchytřejší psi. Drony jako hasiči.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-umela-inteligence-a-signaly-odmen",
          "publishedOn": "2021-10-21T22:01:00.000Z",
          "wordCount": 1698,
          "title": "Týden na ScienceMag.cz: Umělá inteligence a signály odměn"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-roste-podil-softwaru-ktery-vyuziva-umelou-inteligenci",
          "author": "Redakce",
          "description": "Podzimní smršť novinek od Aceru. SentinelOne v ČR nabere 300 lidí a investuje miliardu. Roste podíl softwaru, který využívá umělou inteligenci. Dodávky a ceny osobních počítačů z pohledu výrobce. VMworld: Zabezpečení na principu nulové důvěry.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-roste-podil-softwaru-ktery-vyuziva-umelou-inteligenci",
          "publishedOn": "2021-10-17T22:01:00.000Z",
          "wordCount": 1445,
          "title": "Týden na ITBiz: Roste podíl softwaru, který využívá umělou inteligenci"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-umela-inteligence-v-kooperativnich-hrach",
          "author": "Redakce",
          "description": "Nový typ magnetismu nezpůsobují spiny. Beethovenovu slavnou 10. symfonii dokončila umělá inteligence  Studium neuronových sítí může pomoci při zkoumání toho, jak se do mozku ukládají konspirační teorie. Minirobot se pohybuje díky gradientům teploty. Splynutí obřích černých děr provázejí nejen gravitační vlny.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-umela-inteligence-v-kooperativnich-hrach",
          "publishedOn": "2021-10-16T22:01:00.000Z",
          "wordCount": 1691,
          "title": "Týden na ScienceMag.cz: Umělá inteligence v kooperativních hrách"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-41-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-41-2021",
          "publishedOn": "2021-10-15T22:01:00.000Z",
          "wordCount": 2549,
          "title": "Událo se v týdnu 41/2021"
        }
      ]
    },
    {
      "title": "abclinuxu - čerstvé zprávičky",
      "feedUrl": "http://www.abclinuxu.cz/auto/zpravicky.rss",
      "siteUrl": "http://www.abclinuxu.cz/zpravicky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/zpravicky/red-hat-enterprise-linux-9-beta",
          "author": "Ladislav Hagara",
          "description": "Byla vydána beta verze Red Hat Enterprise Linuxu 9. Přehled novinek v příspěvku na blogu a v poznámkách k vydání.",
          "link": "http://www.abclinuxu.cz/zpravicky/red-hat-enterprise-linux-9-beta",
          "publishedOn": "2021-11-03T15:27:11.000Z",
          "wordCount": 859,
          "title": "Red Hat Enterprise Linux 9 Beta"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/gnu-octave-6.4.0",
          "author": "Ladislav Hagara",
          "description": "Byla vydána nová stabilní verze 6.4.0 svobodného softwaru a vysokoúrovňového programovacího jazyka pro numerické výpočty GNU Octave (Wikipedie). K dispozici bude také na Flathubu a Snapcraftu.",
          "link": "http://www.abclinuxu.cz/zpravicky/gnu-octave-6.4.0",
          "publishedOn": "2021-11-03T12:55:29.000Z",
          "wordCount": 847,
          "title": "GNU Octave 6.4.0"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/libreelec-matrix-10.0.1",
          "author": "Ladislav Hagara",
          "description": "Byla vydána verze 10.0.1, tj. první opravné vydání verze 10.0.0, minimalistické linuxové distribuce (JeOS, Just enough Operating System) pro Kodi (dříve XBMC) a multimediálního centra LibreELEC (Libre Embedded Linux Entertainment Center). Jedná se o fork linuxové distribuce OpenELEC (Open Embedded Linux Entertainment Center). LibreELEC 10.0.1 přichází s Kodi \"Matrix\" 19.3.",
          "link": "http://www.abclinuxu.cz/zpravicky/libreelec-matrix-10.0.1",
          "publishedOn": "2021-11-03T12:37:27.000Z",
          "wordCount": 877,
          "title": "LibreELEC (Matrix) 10.0.1"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/astricon-2021-a-asterisk-19.0.0",
          "author": "Ladislav Hagara",
          "description": "Dnes a zítra probíhá online konference AstriCon 2021, tj. konference vývojářů a uživatelů svobodné softwarové implementace telefonní ústředny (PBX) Asterisk (Wikipedie). Při této příležitosti byl vydán Asterisk ve verzi 19.0.0.",
          "link": "http://www.abclinuxu.cz/zpravicky/astricon-2021-a-asterisk-19.0.0",
          "publishedOn": "2021-11-03T00:48:41.000Z",
          "wordCount": 859,
          "title": "AstriCon 2021 a Asterisk 19.0.0"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/konference-microsoft-ignite.-edge-pro-linux-prohlasen-za-stabilni",
          "author": "Ladislav Hagara",
          "description": "Do čtvrtka 4. listopadu probíhá konference Microsoft Ignite. Microsoft oficiálně prohlásil webový prohlížeč Edge pro Linux za stabilní.",
          "link": "http://www.abclinuxu.cz/zpravicky/konference-microsoft-ignite.-edge-pro-linux-prohlasen-za-stabilni",
          "publishedOn": "2021-11-02T17:19:06.000Z",
          "wordCount": 1890,
          "title": "Konference Microsoft Ignite. Edge pro Linux prohlášen za stabilní"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/fedora-linux-35",
          "author": "Fluttershy, yay!",
          "description": "Distribuce Fedora Linux 35 byla vydána v odloženém termínu. Edice Workstation přináší mj. GNOME 41. Mezi oficiální edice přibyla Fedora Kinoite založená na Silverblue (libostree pro transakční aktualizace) s desktopovým prostředím KDE Plasma. Součástí vydání jsou i další edice pro servery, IoT aj. a spiny s různými nejen desktopovými prostředími.",
          "link": "http://www.abclinuxu.cz/zpravicky/fedora-linux-35",
          "publishedOn": "2021-11-02T14:27:49.000Z",
          "wordCount": 1138,
          "title": "Fedora Linux 35"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/firefox-94.0",
          "author": "Ladislav Hagara",
          "description": "Byl vydán Mozilla Firefox 94.0. Přehled novinek v poznámkách k vydání, poznámkách k vydání pro firmy a na stránce věnované vývojářům. Zdůraznit lze stránku about:unloads s uvolňováním panelů. Firefox na Linuxu ve výchozím stavu používá EGL místo GLX. Řešeny jsou také bezpečnostní chyby. Nejnovější Firefox je již k dispozici také na Flathubu.",
          "link": "http://www.abclinuxu.cz/zpravicky/firefox-94.0",
          "publishedOn": "2021-11-02T13:50:22.000Z",
          "wordCount": 911,
          "title": "Firefox 94.0"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/wolfssl-5.0.0",
          "author": "Ladislav Hagara",
          "description": "Kryptografická knihovna wolfSSL (Wikipedie) byla vydána v nové verzi 5.0.0. Jedná se o duálně licencovanou knihovnu, GPLv2 a komerční, vhodnou do vestavěných systémů. Používá se například v OpenWrt.",
          "link": "http://www.abclinuxu.cz/zpravicky/wolfssl-5.0.0",
          "publishedOn": "2021-11-02T12:01:28.000Z",
          "wordCount": 847,
          "title": "wolfSSL 5.0.0"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/google-nabizi-az-50-337-dolaru-za-0-day-zranitelnosti-linuxu",
          "author": "Ladislav Hagara",
          "description": "Google následující 3 měsíce (do konce ledna 2022) nabízí 31 337 dolarů za nalezení zranitelnosti a získání roota v jeho laboratorním prostředí kCTF VRP (Kubernetes CTF Vulnerability Reward Program). Pokud k tomu bude využita 0-day zranitelnost Linuxu, a ta bude samozřejmě následně nahlášena vývojářům Linuxu, bude částka navýšena na 50 337 dolarů.",
          "link": "http://www.abclinuxu.cz/zpravicky/google-nabizi-az-50-337-dolaru-za-0-day-zranitelnosti-linuxu",
          "publishedOn": "2021-11-02T00:12:37.000Z",
          "wordCount": 1363,
          "title": "Google nabízí až 50 337 dolarů za 0-day zranitelnosti Linuxu"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/mpv-0.34.0",
          "author": "Fluttershy, yay!",
          "description": "Multimediální přehrávač mpv byl vydán ve verzi 0.34.0. Jde o větší balík změn po bezmála roce. Nově např. implicitně hledá místo youtube-dl jeho aktivněji vyvíjený fork yt-dlp.",
          "link": "http://www.abclinuxu.cz/zpravicky/mpv-0.34.0",
          "publishedOn": "2021-11-02T00:09:56.000Z",
          "wordCount": 1560,
          "title": "mpv 0.34.0"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMDGPU-Ported-DragonFlyBSD",
          "author": null,
          "description": "The \"AMDGPU\" kernel graphics driver has been ported and pulled into the DragonFlyBSD operating system...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMDGPU-Ported-DragonFlyBSD",
          "publishedOn": "2021-11-03T17:35:40.000Z",
          "wordCount": 982,
          "title": "AMD Radeon Graphics Driver \"AMDGPU\" Ported To DragonFlyBSD"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=SELinux-IO_uring-Linux-5.16",
          "author": null,
          "description": "In addition to IO_uring improvements in Linux 5.16 itself, the Security Enhanced Linux \"SELinux\" patches for this new kernel cycle bring controls and auditing around IO_uring...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=SELinux-IO_uring-Linux-5.16",
          "publishedOn": "2021-11-03T16:00:00.000Z",
          "wordCount": 857,
          "title": "SELinux/LSM/Smack Controls + Auditing For IO_uring Comes With Linux 5.16"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Red-Hat-RHEL9-Beta",
          "author": null,
          "description": "Red Hat today announced the first public beta of the upcoming Red Hat Enterprise Linux 9.0...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Red-Hat-RHEL9-Beta",
          "publishedOn": "2021-11-03T15:31:16.000Z",
          "wordCount": 848,
          "title": "Red Hat Enterprise Linux 9.0 Beta Released"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-Firmware-Updater-WIP",
          "author": null,
          "description": "Along with the work-in-progress new Ubuntu desktop installer, another GUI project being pursued by Canonical going into the Ubuntu 22.04 LTS cycle is the \"firmware-updater\" as a firmware updating GUI solution written in the Flutter toolkit and Dart...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-Firmware-Updater-WIP",
          "publishedOn": "2021-11-03T13:00:00.000Z",
          "wordCount": 818,
          "title": "Ubuntu Continues Work On Flutter+Dart Written Firmware-Updater Utility"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.16-Graphics-Drivers",
          "author": null,
          "description": "All of the DRM (Direct Rendering Manager) kernel graphics/display driver updates were submitted and already merged for the very exciting Linux 5.16 kernel cycle. There is a lot of good stuff this round especially when it comes to the open-source Intel and AMD Radeon drivers...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.16-Graphics-Drivers",
          "publishedOn": "2021-11-03T11:00:00.000Z",
          "wordCount": 1042,
          "title": "Linux 5.16 Graphics Drivers: Alder Lake S Is Stable, Initial DG2, AMD DP 2.0 + USB4"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-Beta-VA-API-Remote-Play",
          "author": null,
          "description": "For those enjoying Steam Remote Play in-home streaming functionality, the latest Steam client beta now supports making use of the Video Acceleration API for encoding...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-Beta-VA-API-Remote-Play",
          "publishedOn": "2021-11-03T10:07:48.000Z",
          "wordCount": 866,
          "title": "Steam Beta Adds VA-API Acceleration For Remote Play"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.16-HWMON",
          "author": null,
          "description": "The hardware monitoring \"HWMON\" subsystem updates have landed in the Linux 5.16 kernel and with this comes sensor support for some additional ASRock and ASUS motherboards...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.16-HWMON",
          "publishedOn": "2021-11-03T09:33:06.000Z",
          "wordCount": 922,
          "title": "More ASRock & ASUS Motherboards Will Have Working Sensors With Linux 5.16"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=DG2-Pixel-Perf-Boost-Mesa",
          "author": null,
          "description": "A set of patches were posted this past week by Intel open-source driver engineer Francisco Jerez with pixel pipeline optimizations that help all DG2/Alchemist platforms with double digit percentage improvements...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=DG2-Pixel-Perf-Boost-Mesa",
          "publishedOn": "2021-11-03T08:56:31.000Z",
          "wordCount": 791,
          "title": "Intel DG2/Alchemist Soon To See Big Performance Boost With Mesa Optimizations"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.16-XFS-EROFS",
          "author": null,
          "description": "Along with the Btrfs updates, other Linux file-systems have also been sending in their improvements destined for the Linux 5.16 kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.16-XFS-EROFS",
          "publishedOn": "2021-11-03T08:46:55.000Z",
          "wordCount": 861,
          "title": "EROFS With LZMA/MicroLZMA, XFS Footprint Improvements Sent In For Linux 5.16"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=System76-More-Coreboot-Mainline",
          "author": null,
          "description": "A number of System76 laptops saw their Coreboot open-source firmware ports merged to the mainline code-base today...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=System76-More-Coreboot-Mainline",
          "publishedOn": "2021-11-03T04:00:00.000Z",
          "wordCount": 839,
          "title": "A Number Of System76 Laptop Coreboot Ports Reach Mainline"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Apple-M1-Pro-Boots",
          "author": null,
          "description": "Last month Apple announced the M1 Pro and M1 Max SoCs while already the very latest Linux patches originally written for the Apple M1 that launched last year paired with some small changes is allowing the open-source platform to boot on the M1 Pro MacBook...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Apple-M1-Pro-Boots",
          "publishedOn": "2021-11-02T22:37:06.000Z",
          "wordCount": 954,
          "title": "Linux Can Boot On Apple's M1 Pro But More Work Remains"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Hyper-V-Isolation-VM-Linux-5.16",
          "author": null,
          "description": "Microsoft has submitted their set of Hyper-V hypervisor updates today for the Linux 5.16 merge window. This time around it's noteworthy with the initial enablement work around Hyper-V \"Isolation VM\" support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Hyper-V-Isolation-VM-Linux-5.16",
          "publishedOn": "2021-11-02T19:02:45.000Z",
          "wordCount": 812,
          "title": "Microsoft Begins Landing Hyper-V Isolation VM Support In Linux 5.16"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.16-Sched-Core",
          "author": null,
          "description": "The \"sched/core\" scheduler updates landed on Monday into the Linux 5.16 kernel. Notable this pull request is the cluster-aware scheduling support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.16-Sched-Core",
          "publishedOn": "2021-11-02T18:10:02.000Z",
          "wordCount": 945,
          "title": "Cluster-Aware Scheduling Lands In Linux 5.16"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Fedora-35-Released",
          "author": null,
          "description": "Fedora 35 is now officially available today as the latest major release of this Linux distribution developed by Red Hat and the open-source community. Fedora 35 is another very rich feature update at the forefront of Linux innovations from servers to the desktop...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Fedora-35-Released",
          "publishedOn": "2021-11-02T13:35:00.000Z",
          "wordCount": 893,
          "title": "Fedora Linux 35 Released As Another Exciting, Feature-Packed Update"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-Intel-IoT-Optimized",
          "author": null,
          "description": "Canonical has begun publishing Ubuntu install images that are optimized for use on next-generation Intel IoT platforms...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-Intel-IoT-Optimized",
          "publishedOn": "2021-11-02T13:30:16.000Z",
          "wordCount": 736,
          "title": "Canonical Begins Offering Ubuntu Images Optimized For Intel CPUs"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Firefox-94.0-Released",
          "author": null,
          "description": "Firefox 94.0 is now available and for a change it's quite exciting on the Linux front...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Firefox-94.0-Released",
          "publishedOn": "2021-11-02T13:22:59.000Z",
          "wordCount": 879,
          "title": "Firefox 94.0 Released With Linux Build Using EGL For Better Performance, Power Savings"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Khronos-ANARI-1.0-Provisional",
          "author": null,
          "description": "The Khronos Group this morning is rolling out the provisional specification for ANARI 1.0, its newest royalty-free, industry-standard API...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Khronos-ANARI-1.0-Provisional",
          "publishedOn": "2021-11-02T13:00:00.000Z",
          "wordCount": 823,
          "title": "Khronos Prepares ANARI 1.0 API For Scalable 3D Data Visualization"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Btrfs-Linux-5.16",
          "author": null,
          "description": "The Btrfs file-system continues seeing new performance optimizations and other work, thanks in part to the renewed interest around the file-system with Fedora Workstation continuing to use it by default along with openSUSE and other Linux distributions...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Btrfs-Linux-5.16",
          "publishedOn": "2021-11-02T11:23:39.000Z",
          "wordCount": 816,
          "title": "Btrfs With Linux 5.16 Seeing More Performance Optimizations, NVMe ZNS"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Vulkan-1.2.197-Released",
          "author": null,
          "description": "Vulkan 1.2.197 is out with a variety of documentation updates, clarifications to the specification, and other work. Plus there is one new extension this time around...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Vulkan-1.2.197-Released",
          "publishedOn": "2021-11-02T11:02:34.000Z",
          "wordCount": 768,
          "title": "Vulkan 1.2.197 Released With Dynamic Rendering Extension"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.16-Networking",
          "author": null,
          "description": "Given the wide range of hardware running Linux and especially Linux being dominant in the data center, the networking changes each kernel cycle remain quite vibrant. Linux 5.16 is no exception with the main feature pull sent in on Monday for all the networking updates...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.16-Networking",
          "publishedOn": "2021-11-02T10:00:08.000Z",
          "wordCount": 995,
          "title": "Linux 5.16 Networking Changes Are Quite Busy From New Drivers To Intel 100G Improvements"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GCC-Ampere-1-Target-Patch",
          "author": null,
          "description": "While Ampere Altra and Altra Max processors are achieving great success using Arm Neoverse N1 based cores, as shared earlier this year Ampere has begun designing their own custom Arm server CPU cores for slated introduction in 2022. The first GCC compiler patch for that next-gen Ampere CPU was quietly posted on Monday...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GCC-Ampere-1-Target-Patch",
          "publishedOn": "2021-11-02T07:00:00.000Z",
          "wordCount": 998,
          "title": "\"Ampere-1\" GCC Patch Posted For Ampere's Upcoming AArch64 Core Design"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-AMX-Lands-In-Linux",
          "author": null,
          "description": "After going through a number of rounds of patch revisions over the past year, Intel's kernel-side changes for supporting Advanced Matrix Extensions (AMX) with next-gen Xeon Scalable \"Sapphire Rapids\" processors has landed for Linux 5.16!..",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-AMX-Lands-In-Linux",
          "publishedOn": "2021-11-02T04:00:00.000Z",
          "wordCount": 1097,
          "title": "Intel AMX Support Lands For Linux 5.16"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-Linux-October-2021",
          "author": null,
          "description": "Back in July Steam on Linux re-crossed the 1.0% marketshare threshold following the announcement of the Steam Deck and continued progress around Steam Play / Proton. The Steam on Linux user-base has continued growing month by month and has hit another high with the numbers published today that cover the month of October...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-Linux-October-2021",
          "publishedOn": "2021-11-02T00:17:38.000Z",
          "wordCount": 971,
          "title": "Steam On Linux Marketshare Hits New Multi-Year High, AMD Powering ~40% Of Linux Gaming Systems"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Radeon-ROCm-4.5",
          "author": null,
          "description": "AMD today released Radeon Open eCosystem 4.5 (ROCm 4.5) as the latest version to their open-source GPU compute stack for Linux systems. ROCm 4.5 brings with it a number of new features and improvements but one area on the consumer Radeon side will leave some potential users frustrated...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Radeon-ROCm-4.5",
          "publishedOn": "2021-11-01T23:15:59.000Z",
          "wordCount": 1119,
          "title": "Radeon ROCm 4.5 Released With HIP Runtime Compilation, Unified Memory Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Memory-Folios-Lands-Linux-5.16",
          "author": null,
          "description": "The proposed memory \"folios\" functionality for Linux 5.16 is happening! This low-level change to the Linux memory management code was merged today for this next kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Memory-Folios-Lands-Linux-5.16",
          "publishedOn": "2021-11-01T22:47:42.000Z",
          "wordCount": 965,
          "title": "Memory Folios Merged For Linux 5.16"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GCC-LLVM-Trojan-Source",
          "author": null,
          "description": "Making rounds today are the \"Trojan Source\" attacks by which text displayed to the end-user/developer doesn't match what is actually being executed. The problem stems from Unicode standards and could lead to malicious code being inadvertently introduced into upstream code-bases that could be overlooked during code review processes, etc. GCC and LLVM/Clang are among the early compilers preparing defenses against Trojan Source style attacks...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GCC-LLVM-Trojan-Source",
          "publishedOn": "2021-11-01T22:11:13.000Z",
          "wordCount": 884,
          "title": "GCC & LLVM Patches Pending To Fend Off Trojan Source Attacks"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.16-Block-Changes",
          "author": null,
          "description": "The big set of block changes for Linux 5.16 were merged today with the opening of the new kernel cycle. While the massive I/O optimizations tackled recently has been a main focus, there is also much more to the block subsystem coming with Linux 5.16...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.16-Block-Changes",
          "publishedOn": "2021-11-01T19:40:42.000Z",
          "wordCount": 1141,
          "title": "Many Block Improvements Land In Linux 5.16 - Multi-Actuator Hard Drive Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=MPV-0.34-Released",
          "author": null,
          "description": "MPV 0.34 is now available as the newest version of this popular Linux video player that is powered by FFmpeg and forked originally from MPlayer/mplayer2 code...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=MPV-0.34-Released",
          "publishedOn": "2021-11-01T18:33:11.000Z",
          "wordCount": 749,
          "title": "MPV 0.34 Released For Popular Linux Media Player"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.16-Spectre-SECCOMP-To-P",
          "author": null,
          "description": "Linux 5.16 is adjusting its default Spectre mitigation behavior around Spectre V2 for user-space tasks as well as Speculative Store Bypass Disable (SSBD) for Spectre V4 mitigation...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.16-Spectre-SECCOMP-To-P",
          "publishedOn": "2021-11-01T18:13:07.000Z",
          "wordCount": 981,
          "title": "Linux 5.16 Loosens The Spectre Defaults Around SSBD / STIBP"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=More-Money-For-Linux-Flaws",
          "author": null,
          "description": "Google announced today that now through at least the end of January they will be providing higher payment amounts for security researchers disclosing new vulnerabilities affecting the Linux kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=More-Money-For-Linux-Flaws",
          "publishedOn": "2021-11-01T17:21:31.000Z",
          "wordCount": 764,
          "title": "Google Will Now Pay $31,337 To $50,337 For New Linux Kernel Vulnerabilities"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30647",
          "author": null,
          "description": "As a good sign ahead of the important Ubuntu 22.04 LTS release in the spring, Ubuntu 21.10 further ups the 64-bit ARM (AArch64) performance. Here is a look at some of the gains in going from Ubuntu 21.04 to the recently released Ubuntu 21.10.",
          "link": "https://www.phoronix.com/vr.php?view=30647",
          "publishedOn": "2021-10-28T13:00:00.000Z",
          "wordCount": 867,
          "title": "Ubuntu 21.10 Performance Continues In The Right Direction For AArch64"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30645",
          "author": null,
          "description": "Intel is using their inaugural Intel Innovation virtual event today to formally announce the highly-anticipated 12th Gen Core \"Alder Lake\" processors. These first desktop processors built on their \"Intel 7\" process and employ a hybrid architecture will be available in retail channels next week. Today we can talk more about Alder Lake specifications and features while our Linux performance benchmarks and support analysis will come once the Alder Lake review embargo expires next week.",
          "link": "https://www.phoronix.com/vr.php?view=30645",
          "publishedOn": "2021-10-27T16:00:01.000Z",
          "wordCount": 1173,
          "title": "Intel Announces 12th Gen Core \"Alder Lake\" CPUs, Linux Tests Forthcoming"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/rss.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2536/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2536/",
          "publishedOn": "2021-11-01T04:00:00.000Z",
          "wordCount": 183,
          "title": "Wirecutter"
        },
        {
          "id": "https://xkcd.com/2535/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2535/",
          "publishedOn": "2021-10-29T04:00:00.000Z",
          "wordCount": 187,
          "title": "Common Cold Viruses"
        },
        {
          "id": "https://xkcd.com/2534/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2534/",
          "publishedOn": "2021-10-27T04:00:00.000Z",
          "wordCount": 185,
          "title": "Retractable Rocket"
        },
        {
          "id": "https://xkcd.com/2533/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2533/",
          "publishedOn": "2021-10-25T04:00:00.000Z",
          "wordCount": 187,
          "title": "Slope Hypothesis Testing"
        }
      ]
    }
  ],
  "cliVersion": "1.11.3"
}