{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": [
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.3",
          "author": null,
          "description": "Fixed: broken links in documentation\nChore: Dependency updates\nThank you: @hirdot",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.3",
          "publishedOn": "2021-10-16T00:01:47.000Z",
          "wordCount": 295,
          "title": "v1.11.3"
        },
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.2",
          "author": null,
          "description": "Fixed: unicode characters in URL caused download error\nFixed: project root npm install error\nAdded: unit test library\nChore: Dependency updates\nThank you: @CaptNo1",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.2",
          "publishedOn": "2021-09-26T18:45:39.000Z",
          "wordCount": 326,
          "title": "v1.11.2"
        }
      ]
    },
    {
      "title": "Kotaku",
      "feedUrl": "https://kotaku.com/rss",
      "siteUrl": "https://kotaku.com",
      "articles": [
        {
          "id": "1847920257",
          "author": "Ari Notis and Zack Zwiezen",
          "description": "For the most part, Left 4 Dead 3– wait, no, that’s not what it’s called...for the most part, Back 4 Blood is a first-person shooter about teaming up with your friends to mow down hordes of zombies. But Back 4 Blood flips the script by including a decidedly non-shooting mechanic: a deck-building system.\n\nRead more...",
          "link": "https://kotaku.com/the-16-best-cards-in-back-4-blood-1847920257",
          "publishedOn": "2021-10-22T21:00:00.000Z",
          "wordCount": 1455,
          "title": "The 16 Best Cards In Back 4 Blood"
        },
        {
          "id": "1847919311",
          "author": "Ian Walker",
          "description": "Overwatch’s McCree will now be known as Cole Cassidy, the developers announced today, further distancing the character from former designer Jesse McCree, one of the men who took part in the controversial, recently exposed “Cosby Suite” meet-ups.\n\nRead more...",
          "link": "https://kotaku.com/overwatchs-mccree-is-now-cole-cassidy-1847919311",
          "publishedOn": "2021-10-22T19:25:00.000Z",
          "wordCount": 449,
          "title": "Overwatch's McCree Is Now Cole Cassidy"
        },
        {
          "id": "1847918855",
          "author": "Sisi Jiang",
          "description": "After streamer Valkyrae’s skincare line RFLCT drew criticism for its promises to help offset the negative effects of computer light,” the YouTube has issued a statement. Yesterday, Valkyrae posted a voice note acknowledging the pushback and promised to answer questions in a future stream.\nRead more...",
          "link": "https://kotaku.com/youtuber-valkyrae-under-fire-over-skin-care-line-1847918855",
          "publishedOn": "2021-10-22T19:00:00.000Z",
          "wordCount": 563,
          "title": "YouTuber Valkyrae Under Fire Over Skin Care Line"
        },
        {
          "id": "1847918773",
          "author": "Jeremy Winslow",
          "description": "Maybe you’ve been playing Metroid Dread since it hit Nintendo Switch on October 8, but put it down out of frustration from being stuck in the dang game. Or is that just me? Good news: you’re not actually stuck. It’s just easy to not realize what blocks are destroyable while you’re exploring.\n\nRead more...",
          "link": "https://kotaku.com/you-re-probably-not-actually-stuck-in-metroid-dread-1847918773",
          "publishedOn": "2021-10-22T18:45:00.000Z",
          "wordCount": 693,
          "title": "You’re Probably Not Actually Stuck In Metroid Dread"
        },
        {
          "id": "1847918644",
          "author": "Mike Fahey",
          "description": "The open beta for Battlefield 2042 was chaotic, buggy, and pretty limited given the scope of the latest game in the long-running shooter series. For developer DICE the beta was one more thing: a learning experience. In an article posted yesterday Battlefield 2042 devs introduce five new specialists and a host of…\nRead more...",
          "link": "https://kotaku.com/heres-what-will-improve-after-battlefield-2042s-chaotic-1847918644",
          "publishedOn": "2021-10-22T18:35:00.000Z",
          "wordCount": 788,
          "title": "Here's What Will Improve After Battlefield 2042's Chaotic, Buggy Beta"
        },
        {
          "id": "1847918583",
          "author": "Isaiah Colbert",
          "description": "Square Enix patched the controversial digital rights management and anti-cheat software Denuvo out of Nier Replicant, Rise of the Tomb Raider, and Shadow of the Tomb Raider earlier this week. \nRead more...",
          "link": "https://kotaku.com/square-enix-is-removing-the-hated-denuvo-drm-from-a-bun-1847918583",
          "publishedOn": "2021-10-22T18:25:00.000Z",
          "wordCount": 493,
          "title": "Square Enix Is Removing The Hated Denuvo DRM From A Bunch Of Games"
        },
        {
          "id": "1847918205",
          "author": "Ethan Gach",
          "description": "Epic Games, creator of the massively popular and lucrative battle royale Fortnite, decided to end a popular policy of allowing staff every other Friday off earlier this week. According to a new report by Bloomberg, which a source corroborated for Kotaku, the move angered staff who were caught off guard by the sudden…\nRead more...",
          "link": "https://kotaku.com/epic-games-faces-backlash-after-ending-popular-time-off-1847918205",
          "publishedOn": "2021-10-22T18:01:00.000Z",
          "wordCount": 647,
          "title": "Epic Games Faces Staff Uproar Over Ending Popular Time-Off Policy"
        },
        {
          "id": "1794881447",
          "author": "Kotaku Staff",
          "description": "How’s this for a fun fact? In November 2020, the same month Sony and Microsoft released much-anticipated next-gen consoles, the Switch outsold every other console in the United States. Those who’ve recently hopped on board the Nintendo bandwagon might be faced with a question as old as the universe: “What should I…\nRead more...",
          "link": "https://kotaku.com/the-best-games-for-the-nintendo-switch-1794881447",
          "publishedOn": "2021-10-22T18:00:00.000Z",
          "wordCount": 4499,
          "title": "The 19 Best Games For The Nintendo Switch"
        },
        {
          "id": "1847917323",
          "author": "Ari Notis",
          "description": "“Random rules! Random rules!”\n\nRead more...",
          "link": "https://kotaku.com/what-lost-in-random-2021-s-most-innovative-game-share-1847917323",
          "publishedOn": "2021-10-22T17:00:00.000Z",
          "wordCount": 1591,
          "title": "What Lost In Random, 2021’s Most Innovative Game, Shares With Star Wars"
        },
        {
          "id": "1847917110",
          "author": "Alex Walker",
          "description": "It’s a comment I’ve seen hundreds of times, or variations of throughout my time here at Kotaku: internet complaints about the quality of reviews. “A bot can do better than this,” some would cry. So let’s put that to the test.\nRead more...",
          "link": "https://kotaku.com/what-happens-when-ai-tries-to-review-a-video-game-1847917110",
          "publishedOn": "2021-10-22T15:55:00.000Z",
          "wordCount": 3673,
          "title": "What Happens When AI Tries To Review A Video Game"
        },
        {
          "id": "1847916194",
          "author": "Jeremy Winslow",
          "description": "Alongside news that Grand Theft Auto: The Trilogy—a remastered bundle of the first three 3D GTA games—drops on November 11, Rockstar stealthily revealed that GTA: San Andreas will also hit Xbox Game Pass the same day. Oh, and GTA III is making its way to PlayStation Now soon, too.\nRead more...",
          "link": "https://kotaku.com/remastered-gta-san-andreas-is-coming-to-xbox-game-pass-1847916194",
          "publishedOn": "2021-10-22T14:30:00.000Z",
          "wordCount": 471,
          "title": "Remastered GTA San Andreas Is Coming To Xbox Game Pass"
        },
        {
          "id": "1847915827",
          "author": "Ethan Gach",
          "description": "The hottest Nintendo Switch game of the season is the latest to get hit with a delay. Advance Wars 1+2: Re-Boot Camp won’t be out until spring 2022, Nintendo revealed this morning, completely upending my holiday plans in the process.\n\nRead more...",
          "link": "https://kotaku.com/nintendo-delays-advance-wars-switch-remakes-until-2022-1847915827",
          "publishedOn": "2021-10-22T13:50:00.000Z",
          "wordCount": 458,
          "title": "Nintendo Delays Advance Wars Switch Remakes Until 2022"
        },
        {
          "id": "1847915306",
          "author": "John Walker",
          "description": "After Kotaku was the first to tell you Rockstar was remastering the first three 3D Grand Theft Auto games, all manner of leaks and rumors have flown around until the developer finally officially confirmed their existence two weeks ago. Today, they’ve announced a release date—November 11 for the digital version—and an…\nRead more...",
          "link": "https://kotaku.com/grand-theft-auto-the-trilogy-priced-dated-and-rated-1847915306",
          "publishedOn": "2021-10-22T12:15:00.000Z",
          "wordCount": 787,
          "title": "Grand Theft Auto: The Trilogy Priced, Dated And First Footage Revealed"
        },
        {
          "id": "1847915371",
          "author": "Brian Ashcraft",
          "description": "A 48-year-old man has been arrested on suspicion of stealing four volumes of Tokyo Revengers, a popular manga about hoodlum high school kids. \nIllustrated and written by Ken Wakui, the award-winning Tokyo Revengers is serialized in Kodansha’s Weekly Shonen Magazine. (Full disclosure: My first two books were published…\nRead more...",
          "link": "https://kotaku.com/man-arrested-for-allegedly-stealing-four-copies-of-toky-1847915371",
          "publishedOn": "2021-10-22T11:30:00.000Z",
          "wordCount": 399,
          "title": "Man Arrested For Allegedly Stealing Four Copies Of Tokyo Revengers Manga Worth $18"
        },
        {
          "id": "1847914966",
          "author": "Brian Ashcraft",
          "description": "Founded in 1998 by Goichi Suda, Grasshopper Manufacture is best known for games like Killer 7, Lollipop Chainsaw, and No More Heroes. Today, the studio announced it is being acquired by Chinese conglomerate, NetEase Games. \n\nRead more...",
          "link": "https://kotaku.com/netease-games-acquires-goichi-sudas-grasshopper-manufac-1847914966",
          "publishedOn": "2021-10-22T09:30:00.000Z",
          "wordCount": 542,
          "title": "NetEase Games Acquires Goichi Suda's Grasshopper Manufacture"
        },
        {
          "id": "1847912970",
          "author": "Luke Plunkett",
          "description": "In May, Ubisoft took down some DRM servers that accidentally broke Might & Magic X - Legacy, to the point where the game had to be removed from shopfronts. A few months later, and probably after some folks had long assumed the game was simply dead, it’s back.\n\nRead more...",
          "link": "https://kotaku.com/ubisoft-brings-back-might-and-magic-game-they-shut-down-1847912970",
          "publishedOn": "2021-10-22T00:40:00.000Z",
          "wordCount": 409,
          "title": "Ubisoft Brings Back Might and Magic Game They Shut Down In June"
        },
        {
          "id": "1847906380",
          "author": "Luke Plunkett",
          "description": "Yesterday, a group of respected young adult novelists thought it would be a good idea to launch a new project spearheaded by NFT purchases. Sadly/hilariously, their big plans went from “let’s do this” to “we’re not doing this” in a matter of hours.\n\nRead more...",
          "link": "https://kotaku.com/big-nft-project-cancelled-after-just-five-hours-1847906380",
          "publishedOn": "2021-10-21T22:20:00.000Z",
          "wordCount": 1254,
          "title": "Big NFT Project Cancelled After Just Five Hours"
        },
        {
          "id": "1847912195",
          "author": "Zack Zwiezen",
          "description": "I’m not normally a fan of turn-based RPGs, but Echo Generation’s voxel-based visuals caught my attention, so I decided to give it a shot. I’m very glad I did. While it’s a sometimes frustrating game, it has enough charm and style that I enjoyed it even when I got stuck. It also doesn’t overstay its welcome, offering…\nRead more...",
          "link": "https://kotaku.com/your-next-game-pass-pick-is-an-rpg-that-combines-strang-1847912195",
          "publishedOn": "2021-10-21T21:10:00.000Z",
          "wordCount": 1038,
          "title": "Your Next Game Pass Pick Is An RPG That Combines Stranger Things and EarthBound"
        },
        {
          "id": "1847912361",
          "author": "Jeremy Winslow",
          "description": "Eric “ConcernedApe” Barone, the developer behind the popular farming simulator RPG Stardew Valley, has announced his next game. It’s called ConcernedApe’s Haunted Chocolatier, and though it looks like his previous hit, this action RPG is more concerned with concocting confections than with cultivating the garden.\nRead more...",
          "link": "https://kotaku.com/stardew-valley-dev-returns-with-a-cozy-rpg-about-haunte-1847912361",
          "publishedOn": "2021-10-21T20:55:00.000Z",
          "wordCount": 419,
          "title": "Stardew Valley Dev Returns With A Cozy RPG About Haunted Chocolate"
        },
        {
          "id": "1847912004",
          "author": "Ethan Gach",
          "description": "Better late than never, right? A year after Among Us blew up during the pandemic, and three years after it first released on Steam, Innersloth’s murder spree sim is finally coming to PlayStation and Xbox consoles on December 14.\n\nRead more...",
          "link": "https://kotaku.com/among-us-is-finally-coming-to-playstation-and-game-pass-1847912004",
          "publishedOn": "2021-10-21T20:25:00.000Z",
          "wordCount": 432,
          "title": "Among Us Is Finally Coming To PlayStation And Game Pass"
        },
        {
          "id": "1847910780",
          "author": "Ethan Gach",
          "description": "Almost a decade ago the internet blew up over Mass Effect 3’s controversial ending, resulting in death threats and online harassment of BioWare developers and helping to set a new, terrible tone for the video game fan/developer relationship in the years since. It also reportedly resulted in more crunch.\nRead more...",
          "link": "https://kotaku.com/after-backlash-mass-effect-3-devs-say-team-crunched-to-1847910780",
          "publishedOn": "2021-10-21T18:40:00.000Z",
          "wordCount": 799,
          "title": "After Backlash, Mass Effect 3 Devs Say Team Crunched To Deliver New Ending"
        },
        {
          "id": "1847910370",
          "author": "Ari Notis",
          "description": "This morning, Sony released the first official trailer for the Uncharted movie, starring Tom Holland as the terminally henley-wearing rogue Nathan Drake. Movies based on video games don’t have the best track record, of course, but it nonetheless looks pretty fun..\n\nRead more...",
          "link": "https://kotaku.com/7-uncharted-game-references-you-may-have-missed-in-the-1847910370",
          "publishedOn": "2021-10-21T18:25:00.000Z",
          "wordCount": 920,
          "title": "7 Uncharted Game References You May Have Missed In The Movie Trailer"
        },
        {
          "id": "1847910180",
          "author": "Mike Fahey",
          "description": "During this year’s all-digital CES in January, hardware maker Razer revealed Project Hazel, a futuristic filtration mask meant to keep gamers covid-free while looking like Mad Max extras. That conceptual project is now the Razer Zephyr, a real product you can buy for $100. And while it might not have advanced features…\nRead more...",
          "link": "https://kotaku.com/attn-bane-razer-s-high-tech-rgb-covid-mask-is-finally-1847910180",
          "publishedOn": "2021-10-21T18:00:00.000Z",
          "wordCount": 734,
          "title": "Attn Bane: Razer’s High-Tech RGB Covid Mask Is Finally Out"
        },
        {
          "id": "1847909666",
          "author": "John Walker",
          "description": "Microsoft has just announced two new SSD storage expansion cards, made by its official storage partner, Seagate, to boost space on your Xbox Series S or X. Joining the already released 1TB card will be a 512GB card for $139.99, and a hefty 2TB for $399.99, released in November and December, respectively. The larger…\nRead more...",
          "link": "https://kotaku.com/new-larger-xbox-storage-expansion-costs-more-than-an-xb-1847909666",
          "publishedOn": "2021-10-21T17:00:00.000Z",
          "wordCount": 751,
          "title": "New Larger Xbox Storage Expansion Costs More Than An Xbox Series S"
        },
        {
          "id": "1847909550",
          "author": "Zack Zwiezen",
          "description": "Grand Theft Auto Online is dangerous enough all year round, thanks to assholes and rocket bikes. But now, it’s even more dangerous and spooky, thanks to new Halloween-themed content added to the game via the latest update. If you head into GTA Online, be on the lookout for UFOs, deadly ghost cars, creepy supernatural…\nRead more...",
          "link": "https://kotaku.com/gta-online-is-currently-haunted-by-killer-clowns-and-gh-1847909550",
          "publishedOn": "2021-10-21T16:45:00.000Z",
          "wordCount": 805,
          "title": "GTA Online Is Currently Haunted By Killer Clowns And Ghost Cars"
        }
      ]
    },
    {
      "title": "Nintendo Life | Latest Updates",
      "feedUrl": "https://www.nintendolife.com/feeds/latest",
      "siteUrl": "https://www.nintendolife.com/feeds/latest",
      "articles": [
        {
          "id": "https://www.nintendolife.com/#article-122666",
          "author": null,
          "description": "Inevitable questions pop up over the physical edition.\nGrand Theft Auto: The Trilogy – The Definitive Edition, if you want to use its full name, has made headlines today with the unveiling of its debut trailer and release details. Naturally some questions for big GTA fans and indeed Switch collectors have revolved around the file size and what we can expect from the Switch physical version.\nWell, it's certainly in the top list of sizeable Switch games, with the North American eShop page listing it as 25.4GB. That's pretty small fry if you happen to download a lot of games on systems like PS5 and Xbox Series X, but is relatively high end on Nintendo's hybrid. Only select titles like Doom (2016) and the NBA 2K games come in with larger file sizes.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/grand-theft-auto-the-trilogy-gets-a-meaty-file-size-by-switch-standards",
          "publishedOn": "2021-10-22T19:00:00.000Z",
          "wordCount": 2708,
          "title": "Grand Theft Auto: The Trilogy Gets A Meaty File Size, By Switch Standards"
        },
        {
          "id": "https://www.nintendolife.com/#article-122659",
          "author": null,
          "description": "Manual, sticker and trading cards included, as always.\nDogworld arrived relatively recently (during the Summer) on the eShop, a retro-styled '1-Bit' action platformer in which you \"shoot, jump, and slide your way through a ruined, mysterious, dog-filled world\". It's now the latest download title to get the limited release treatment from Super Rare Games, with details now available on the package and orders.\nYou can take a look below; it's due to go on sale with a 3000 copy run on 28th October at 10am PT / 1pm ET / 6pm BST / 7pm CEST, via the Super Rare Games website.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/super-rare-games-confirms-limited-edition-of-1-bit-action-platformer-dogworld",
          "publishedOn": "2021-10-22T17:00:00.000Z",
          "wordCount": 1665,
          "title": "Super Rare Games Confirms Limited Edition Of '1-Bit' Action Platformer Dogworld"
        },
        {
          "id": "https://www.nintendolife.com/#article-122541",
          "author": null,
          "description": "Gawrsh!\nSPOILER WARNING! In the following article Stuart discusses some rather whopping spoilers as he takes us on an emotional and tearful Kingdom Hearts journey. If you haven't played the games and you're sensitive to spoilers, we recommend coming back in a year or so once you've played the lot. Otherwise, be warned that certain unfortunate events are discussed in detail.\nOf course, if you haven't played the games, none of this will make a lick of sense anyway, but you have been warned!\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/features/soapbox-8-times-i-ugly-cried-at-kingdom-hearts",
          "publishedOn": "2021-10-22T16:00:00.000Z",
          "wordCount": 3152,
          "title": "Soapbox: 8 Times I Ugly Cried At Kingdom Hearts"
        },
        {
          "id": "https://www.nintendolife.com/#article-122663",
          "author": null,
          "description": "Ticks boxes with Nike apparel and in-game items.\nPokémon GO isn't quite the behemoth it once was, in fact recently nearly 20,000 Pokéstops were confirmed to be closing down at 7-Eleven stores in Japan, but it still has some partnerships and activities drawing in players.\nIn the UK and Europe the game is hoping to tempt in fans of sporty apparel after confirming a partnership with retail chain JD. There'll be small number of Gyms but a much larger group of Pokéstops, with some special virtual clothes available alongside actual real-life Nike gear in the stores.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/pokemon-go-and-jd-team-up-for-gyms-and-pokestops-in-uk-and-europe",
          "publishedOn": "2021-10-22T15:00:00.000Z",
          "wordCount": 1059,
          "title": "Pokémon GO And JD Team Up For Gyms And Pokéstops In UK And Europe"
        },
        {
          "id": "https://www.nintendolife.com/#article-122658",
          "author": null,
          "description": "\"Thanks for your patience\".\nSad news, folks. Nintendo has announced that Advance Wars 1+2: Re-Boot Camp has been delayed.\nThe game, which serves as a remake of both Advance Wars and Advance Wars 2: Black Hole Rising, will no longer launch on 3rd December as planned. Instead, you can expect to see it on the eShop in \"spring 2022\".\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/oh-no-advance-wars-1plus2-re-boot-camp-has-been-delayed-on-switch",
          "publishedOn": "2021-10-22T13:05:00.000Z",
          "wordCount": 5520,
          "title": "Oh No, Advance Wars 1+2: Re-Boot Camp Has Been Delayed On Switch"
        },
        {
          "id": "https://www.nintendolife.com/#article-122654",
          "author": null,
          "description": "And there's not long to wait.\nToday, Rockstar has shared more details on Grand Theft Auto: The Trilogy – The Definitive Edition which was recently confirmed to be heading to Nintendo Switch.\nThe collection will let you play Grand Theft Auto III, Grand Theft Auto: Vice City, and Grand Theft Auto: San Andreas with \"across-the-board enhancements\", including new lighting and environmental upgrades, high-resolution textures, increased draw distances, Grand Theft Auto V-style controls and targeting, and \"much more\".\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/grand-theft-auto-the-trilogy-gets-confirmed-release-date-first-trailer-and-screenshots",
          "publishedOn": "2021-10-22T12:45:00.000Z",
          "wordCount": 6606,
          "title": "Grand Theft Auto: The Trilogy Gets Confirmed Release Date, First Trailer And Screenshots"
        },
        {
          "id": "https://www.nintendolife.com/#article-122651",
          "author": null,
          "description": "Cute, but kinda sad.\nThe Pokémon Company has revealed a new line of merchandise that's sure to be a hit with fans, partly because it's all so darn adorable.\nInterestingly enough, the range's theme is 'Pokémon who lost in battle', with each piece depicting a 'mon or two that appears to have fainted. It's a cute idea – just don't think about the fact that the poor things have just fought for you, lost, and have now been transformed into a pencil case.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/everyone-has-fainted-in-pokemons-next-merchandise-range",
          "publishedOn": "2021-10-22T12:30:00.000Z",
          "wordCount": 1106,
          "title": "Everyone Has Fainted In Pokémon's Next Merchandise Range"
        },
        {
          "id": "https://www.nintendolife.com/#article-122647",
          "author": null,
          "description": "Ranging from $30 to $90.\nConsider yourself a huge Among Us fan or looking to get into the game for the first time? Well, these fancy physical Collector's Editions could be just the thing.\nThree different Collector's Editions are now available to pre-order; the cheapest of the bunch will be shipped out this winter (December in Europe, January in North America), while the larger sets arrive in both territories next March.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/three-different-among-us-collectors-editions-are-now-available-for-pre-order",
          "publishedOn": "2021-10-22T11:30:00.000Z",
          "wordCount": 1423,
          "title": "Three Different Among Us Collector's Editions Are Now Available For Pre-Order"
        },
        {
          "id": "https://www.nintendolife.com/#article-122644",
          "author": null,
          "description": "\"﻿Just like being in an episode of the TV show\".\nToday sees the release of the latest game set in the Peppa Pig universe, as My Friend Peppa Pig launches on Nintendo Switch.\nFrom publisher Outright Games, the game is said to be a fun-filled adventure that's \"just like being in an episode of the TV show\". Players get to choose and dress up their own character, before meeting up with fan-favourite characters from the hit show and checking out plenty of familiar locations.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/my-friend-peppa-pig-releases-today-on-switch-heres-the-launch-trailer",
          "publishedOn": "2021-10-22T11:00:00.000Z",
          "wordCount": 1659,
          "title": "My Friend Peppa Pig Releases Today On Switch, Here's The Launch Trailer"
        },
        {
          "id": "https://www.nintendolife.com/#article-122404",
          "author": null,
          "description": "Hands-on with Blaze's latest retro hardware.\nBlaze's Evercade handheld was one of 2020's more pleasant surprises; a new piece of hardware that offered an alternative for retro enthusiasts and offered a wide range of physical cartridges packed with classic titles (many of which were originally found on Nintendo consoles) – all for a very reasonable price. Now, its creator is taking the concept in a new direction with the Evercade VS, a system that retains compatibility with (almost) all of the existing Evercade cartridges but is more focused on offering the best possible experience on your TV – and, as the name suggests, the prospect of good, old-fashioned competitive play.\nThe Evercade VS retains much of the same design language as its handheld counterpart, using white and red as the two main colours. It takes a leaf out of Nintendo's book, too; the cartridge bay (which actually has two slots – more on that shortly) is hidden behind a NES-style flap at the front of the machine. Below this, there are four USB ports for controllers, while the power button is found on the right-hand side of the machine. On the back, there's the HDMI port and Micro USB port (both of which are upside-down, confusingly), as well as a reset button, used in the event of the system crashing (something that mercifully didn't happen during our review period). There's no HDMI cable included in the box, with Blaze claiming that it helps keep down the cost of the unit (most households have at least one spare HDMI cable lying around, so it's no biggie). There's also no power supply unit, but most modern TV sets offer the 5V USB port required to power the Evercade VS.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/features/hardware-review-evercade-vs-a-low-cost-gateway-to-past-nintendo-classics-and-much-more-besides",
          "publishedOn": "2021-10-22T10:00:00.000Z",
          "wordCount": 4635,
          "title": "Hardware Review: Evercade VS - A Low-Cost Gateway To Past Nintendo Classics And Much More Besides"
        },
        {
          "id": "https://www.nintendolife.com/#article-122642",
          "author": null,
          "description": "Here are all the details you need.\nThe Pokémon Sword and Shield distribution allowing fans to pick up Shiny versions of both Zacian and Zamazenta is now live across Europe, the US, Canada, and select parts of Asia.\nWe have all the currently-known details for you below, with thanks to Serebii for compiling parts of the list, and will make sure to update this page if we hear of any more.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/pokemon-sword-and-shield-shiny-zacianzamazenta-distribution-now-live-in-europe-us-and-more",
          "publishedOn": "2021-10-22T09:30:00.000Z",
          "wordCount": 1488,
          "title": "Pokémon Sword And Shield Shiny Zacian/Zamazenta Distribution Now Live In Europe, US And More"
        },
        {
          "id": "https://www.nintendolife.com/#article-122636",
          "author": null,
          "description": "A little less spice.\nIf you happen to have Nintendo's retro handhelds in your collection, there are still multiple interesting releases and projects emerging. The latest to pop up is Elland: The Crystal Wars for Game Boy Advance, a game that publisher The Retro Room Games is reviving minus a famous IP.\nOriginally, way back in 2002, it was a GBA game that was pretty much finished but got cancelled due to the financial issues of its publisher Cryo Interactive, which was no doubt a source of huge disappointment for developer Soft Brigade (hat-tip to Unseen64). At that point it was called Frank Herbert’s Dune: Ornithopter Assault, licensed to use characters and settings from the iconic novel; no doubt you've seen a lot about the latest film version in the media, too. It was a flying / shooter with over 20 stages, and even had some multiplayer modes for use with the portable's link cable.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/the-gbas-unreleased-dune-game-is-being-revived-minus-the-ip-rights",
          "publishedOn": "2021-10-22T09:00:00.000Z",
          "wordCount": 1291,
          "title": "The GBA's Unreleased 'Dune' Game Is Being Revived, Minus The IP Rights"
        },
        {
          "id": "https://www.nintendolife.com/#article-121892",
          "author": null,
          "description": "Update: Offer ends soon!\nUpdate: As a friendly reminder, Nintendo's current promotion in which you can earn double My Nintendo Gold Points when buying any digital Super Smash Bros. Ultimate product is about to come to an end. If you were thinking of grabbing that second DLC pass or perhaps even the game itself, it wouldn't be a bad idea to snap it up by Sunday 24th October.\nFull details can be found in our original article below.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/buy-smash-bros-ultimate-or-any-of-its-dlc-and-earn-double-my-nintendo-gold-points",
          "publishedOn": "2021-10-22T08:30:00.000Z",
          "wordCount": 2967,
          "title": "Buy Smash Bros. Ultimate Or Any Of Its DLC And Earn Double My Nintendo Gold Points"
        },
        {
          "id": "https://www.nintendolife.com/#article-122633",
          "author": null,
          "description": "The madness begins this December.\nWho needs Watch Dogs, Assassin's Creed and Far Cry when you have the all-time classic board game Monopoly.\nUbisoft has announced a new take on Hasbro's property trading game called Monopoly Madness - a title that \"reinvents\" the iconic board game and is launching on the Nintendo Switch and multiple other platforms on 9th December this year. Here's the rundown, courtesy of the PR:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/ubisoft-is-bringing-a-new-monopoly-game-to-the-nintendo-switch",
          "publishedOn": "2021-10-22T04:00:00.000Z",
          "wordCount": 2012,
          "title": "Ubisoft Is Bringing A New Monopoly Game To The Nintendo Switch"
        },
        {
          "id": "https://www.nintendolife.com/#article-122632",
          "author": null,
          "description": "We're ready for an update, Nintendo.\nWhere were you approximately 1,000 days ago? While it might not seem long ago, it actually dates back to 25th January 2019 and you know what that day was, right? Yep, on this particular day in Nintendo history, development on the highly anticipated release Metroid Prime 4 was restarted.\nNintendo's Senior Managing Executive Officer, Shinya Takahashi, delivered the news in an \"open and honest\" video message - admitting development progress at the time had not reached the standard Nintendo expected from the Metroid Prime series.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/random-it-has-now-been-1000-days-since-metroid-prime-4s-development-was-restarted",
          "publishedOn": "2021-10-22T03:00:00.000Z",
          "wordCount": 4444,
          "title": "Random: It Has Now Been 1,000 Days Since Metroid Prime 4's Development Was Restarted"
        },
        {
          "id": "https://www.nintendolife.com/#article-122631",
          "author": null,
          "description": "Suda51 says his company \"is now reborn\".\nJust a day after we heard how the famous video game creator Goichi \"Suda51\" Suda would love to reboot or remake Nintendo's older IP, he's now announced his development studio will be working under the Chinese video game giant NetEase.\nYes, that's right - Grasshopper Manufacturer is ending its partnership with the Japanese publisher and developer GungHo Online Entertainment to join the NetEase Group - one of the biggest internet and video game companies in the world that also partners with western companies like Blizzard.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/grasshopper-manufacture-joins-chinese-video-game-giant-netease",
          "publishedOn": "2021-10-22T01:30:00.000Z",
          "wordCount": 3717,
          "title": "Grasshopper Manufacture Joins Chinese Video Game Giant NetEase"
        },
        {
          "id": "https://www.nintendolife.com/#article-122630",
          "author": null,
          "description": "And it's already \"in development\".\nEric \"ConceredApe\" Barone - the creator for the insanely popular farming and lifestyle sim, Stardew Valley - has just lifted the lid on his brand new game, Haunted Chocolatier. It's more formally known as 'ConcernedApe’s Haunted Chocolatier'.\nAfter dedicating 10 years of his life \"and counting\" to Stardew Valley, Barone has decided it's time to reveal his new game to the world. So, what's with the chocolate theme? It's just an idea that he had, and well - a lot of people like chocolate.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/stardew-valley-creator-reveals-his-next-game-haunted-chocolatier",
          "publishedOn": "2021-10-22T00:30:00.000Z",
          "wordCount": 2358,
          "title": "Stardew Valley Creator Reveals His Next Game, Haunted Chocolatier"
        },
        {
          "id": "https://www.nintendolife.com/#article-122629",
          "author": null,
          "description": "Fixes, fixes and more fixes.\nYou might have played Tetris 99 on the Nintendo Switch, but have you tried out Tetris Effect: Connected yet? We went as far as saying it might just be the best ever iteration of the classic puzzle game, and to add this - the experience is even better if you're playing on a shiny new Switch OLED model.\nIf you have already got your hands on it, you'll be pleased to know the latest patch (and first major one for the Switch since the game's arrival on the system) is now available. Version 1.2.5 fixes a number of issues specific to the Switch release.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/tetris-effect-connected-on-switch-receives-its-first-major-patch-here-are-the-full-details",
          "publishedOn": "2021-10-22T00:00:00.000Z",
          "wordCount": 2206,
          "title": "Tetris Effect: Connected On Switch Receives Its First Major Patch, Here Are The Full Details"
        },
        {
          "id": "https://www.nintendolife.com/#article-122622",
          "author": null,
          "description": "That's... a lot.\nAs we head towards Winter and the busiest shopping season we get to enjoy a few more gaming events that'll showcase a bunch of games, which is always fun. One online event that's earned a decent fanbase over the last couple of years is INDIE Live Expo, and it looks like its next event will be a big 'un.\nAs it's Japan-focused in terms of its audience the broadcast time isn't ideal for viewers in Europe and North America - it'll run on 6th November at midnight Pacific / 3am Eastern / 7am UK / 8am CET, with streams on YouTube, Twitch, Twitter, and Bilibili in English, Japanese, and Chinese languages.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/indie-live-expo-winter-2021-will-show-off-more-than-500-games-apparently",
          "publishedOn": "2021-10-21T19:00:00.000Z",
          "wordCount": 1175,
          "title": "INDIE Live Expo Winter 2021 Will Show Off More Than 500 Games, Apparently"
        },
        {
          "id": "https://www.nintendolife.com/#article-122616",
          "author": null,
          "description": "From the team that made Just Shapes & Beats.\n\nBerzerk Studio earned itself a pretty good reputation among some Switch eShop aficionados with Just Shapes & Beats, a rather cool title with great music and gameplay reminiscent of Super Hexagon. The development team is back soon with another intriguing slice of retro-inspired goodness in the form of Infernax, which is due out Q1 2022.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/infernax-looks-like-a-tasty-and-expanded-take-on-the-8-bit-castlevania-formula",
          "publishedOn": "2021-10-21T18:00:00.000Z",
          "wordCount": 1354,
          "title": "Infernax Looks Like A Tasty And Expanded Take On The 8-Bit Castlevania Formula"
        },
        {
          "id": "https://www.nintendolife.com/#article-100445",
          "author": null,
          "description": "All the Sega Mega Drive games, ranked by you.\nThe library of Sega Mega Drive / Genesis games announced as part of the upcoming 'Expansion Pack' for the Nintendo Switch Online subscription service features some choice entries from the 16-bit system's library. We might have had the opportunity to play many of these games in many other places in recent years, including Switch in some cases, but the easy availability of more classic video games on Switch is always worth celebrating.\nBut which of the Sega Genesis games coming the Nintendo Switch Online are the very best? Well, we can answer that question with the help of Nintendo Life readers who have rated the titles on our Games Database.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/guides/every-nintendo-switch-online-sega-genesis-mega-drive-game-ranked",
          "publishedOn": "2021-10-21T17:00:00.000Z",
          "wordCount": 4759,
          "title": "Guide: Every Nintendo Switch Online Sega Genesis / Mega Drive Game Ranked"
        },
        {
          "id": "https://www.nintendolife.com/#article-122614",
          "author": null,
          "description": "Dread shifts another 22,221 physical copies.\nFamitsu's Japanese chart figures are now in for the week ending 17th October, revealing that Metroid Dread has fallen to second place in its second week on sale.\nThe game sold another 22,221 physical copies in the region this week, but that was no match for the incoming Demon Slayer: Kimetsu no Yaiba – The Hinokami Chronicles which sold more than 100,000 copies across PS4 and PS5. Dread did, however, fend off the threat of several other newcomers, including Bandai Namco's Back 4 Blood.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/japanese-charts-metroid-dread-slips-down-to-second-switch-oled-leads-hardware-listings",
          "publishedOn": "2021-10-21T16:30:00.000Z",
          "wordCount": 2680,
          "title": "Japanese Charts: Metroid Dread Slips Down To Second, Switch OLED Leads Hardware Listings"
        },
        {
          "id": "https://www.nintendolife.com/#article-122620",
          "author": null,
          "description": "Finally!\nCapcom Arcade Stadium is a fun app on the Switch, which is free-to-download and is packed with a lot of very reasonable versions of the company's cabinet classics. Aside from one freebie in 1943: The Battle of Midway and the option to buy the original Ghosts 'n Goblins, we've had to buy packs of games for $14.99USD a pop, or go for the option to pay $39.99USD for all three packs together.\nConsidering the sheer volume of games the pricing isn't too bad, but there are multiple titles we may already own through other collections, so a pick and mix approach has been in demand. Well, Capcom seems to have listened, as you can now pop onto the game's eShop page and buy each game individually.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/capcom-arcade-stadium-now-lets-you-buy-individual-titles-for-a-couple-of-bucks",
          "publishedOn": "2021-10-21T16:15:00.000Z",
          "wordCount": 2982,
          "title": "Capcom Arcade Stadium Now Lets You Buy Individual Titles For A Couple Of Bucks"
        },
        {
          "id": "https://www.nintendolife.com/#article-122577",
          "author": null,
          "description": "We like to TATE, we like, we like to TATE.\nDISCLAIMER: Nintendo Life is not liable for any damage — light or otherwise — caused to your lovely Switch OLED's screen through orientating your shiny new console all vertical-like.\nOld school arcade and shmup fans have been having a wail of a time with Switch over the past few years, with the system becoming an unlikely home to a load of incredible shoot 'em-ups, old and new, plus a range of arcade classics that can be very easily played on Switch in their original portrait orientation — better known as TATE mode. This can be accomplished with the help of an accessory (such as the excellent Flip Grip — sadly not compatible with Switch OLED thanks to the new console's slightly different dimensions) or simply by resting the Joy-Con-less console sideways against a book or something.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/psa-you-can-use-switch-oleds-kickstand-to-play-in-tate-mode-just-be-very-careful",
          "publishedOn": "2021-10-21T16:00:00.000Z",
          "wordCount": 1825,
          "title": "PSA: You Can Use Switch OLED's Kickstand To Play In TATE Mode, Just Be Very Careful"
        },
        {
          "id": "https://www.nintendolife.com/#article-122601",
          "author": null,
          "description": "Ida Hartmann's interactive indie.\nThe Switch is a great system for interactive or visual novels, with a whole bunch of brilliants ones available on the console already — and come 5th November, we'll be getting another award-winner in the form of the \"grim but hopeful\" Stilstand.\nDescribed as \"a haunting and darkly comedic interactive graphic novel\", it chronicles a young woman's summer in Copenhagen as she battles anxiety, loneliness and an existential malaise while trying to navigate urban student life.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/award-winning-dark-comedy-stilstand-opens-up-on-switch-in-november",
          "publishedOn": "2021-10-21T15:30:00.000Z",
          "wordCount": 863,
          "title": "Award-Winning Dark Comedy 'Stilstand' Opens Up On Switch In November"
        }
      ]
    },
    {
      "title": "Rock Paper Shotgun Latest Articles Feed",
      "feedUrl": "https://www.rockpapershotgun.com/feed",
      "siteUrl": "https://www.rockpapershotgun.com/feed",
      "articles": [
        {
          "id": "https://www.rockpapershotgun.com/cd-projekt-have-bought-the-studio-behind-the-flame-in-the-flood",
          "author": "Alice O'Connor",
          "description": "Cyberpunk and Witcher crew CD Projekt have acquired The Molasses Flood, the American studio behind post-apocalyptic raft ride The Flame In The Flood and base-building game Drake Hollow. Huh! The studio will be making a game set in one of CD Projekt's world, which warrants a second: huh! It's all secret for now.\nRead more",
          "link": "https://www.rockpapershotgun.com/cd-projekt-have-bought-the-studio-behind-the-flame-in-the-flood",
          "publishedOn": "2021-10-22T16:35:20.000Z",
          "wordCount": 869,
          "title": "CD Projekt have bought the studio behind The Flame In The Flood"
        },
        {
          "id": "https://www.rockpapershotgun.com/my-hunger-for-games-like-warcraft-2-is-slowly-being-sated",
          "author": "Katharine Castle",
          "description": "When I think back to the ggames of my childhood, nothing puts a warm, fuzzy smile on my face like Warcraft 2. As one of the few PC games I had growing up, I ended up playing the campaign over and over again - or at least starting it over and over again - for what felt like actual years. I loved building up my fort and endlessly poking the peasants and peons until they shouted back at me in annoyance, and man alive, there is nothing sweeter than ordering a tooled-up army across the map and absolutely wrecking the enemy in one fell swoop of doom and destruction. \nIt is something I wish I could play again now with all my heart. I know there's version of it on GOG, but I'd also just quite like, you know, a newer, shinier version with a more up to date UI and all that jazz, and one whose map didn't whizz over to the other side of the screen with a single tap of the arrow key. I'd also like a version that isn't, somehow, made by Activision Blizzard because... *gestures to all their ongoing harassment lawsuits*. Fortunately, I've happened upon a couple of games in recent weeks that have really scratched that old Warcraft 2 itch of mine. I've already written about one of them - Diplomacy Is Not An Option - and the other is Age Of Darkness: Final Stand, a game with the most boring name imaginable, but is secretly very good.\nRead more",
          "link": "https://www.rockpapershotgun.com/my-hunger-for-games-like-warcraft-2-is-slowly-being-sated",
          "publishedOn": "2021-10-22T15:38:02.000Z",
          "wordCount": 956,
          "title": "My hunger for games like Warcraft 2 is slowly being sated"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-to-uninstall-windows-11-and-go-back-to-windows-10",
          "author": "James Archer",
          "description": "Change isn’t for everyone: just ask the 5% of Steam Hardware Survey respondents still using Windows 7. Sadly, even the most eager of early adopters might be looking to find out how to uninstall Windows 11, the very latest of Microsoft’s operating systems. It could be the newly centralised Start menu; it could be the lack of DirectStorage support among games making the best SSDs perform below their full capability; it could just be a single unsquished bug, which remains a risk with the infant OS. Fortunately, if you decide to want to switch back to Windows 10 within 10 days of installing its successor, it’s possible to roll back in just a few, mildly regretful clicks.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/how-to-uninstall-windows-11-and-go-back-to-windows-10",
          "publishedOn": "2021-10-22T15:33:24.000Z",
          "wordCount": 1096,
          "title": "How to uninstall Windows 11 and go back to Windows 10"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-to-upgrade-to-windows-11",
          "author": "James Archer",
          "description": "Alright, fine, here’s how to upgrade to Windows 11 from Windows 10. The current stance of this hardware ed is that Windows 11 has some cool features but is yet to fulfil its potential, largely owing to the missing DirectStorage capability – which, to be fair, could be a very big deal when games start supporting it. For now, then, it’s a free but absolutely not an essential upgrade, and you can think of this post as the RPS equivalent of that video where Valve tore down a Steam Deck: we’re not saying you should do this, just that you can do this. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/how-to-upgrade-to-windows-11",
          "publishedOn": "2021-10-22T15:32:39.000Z",
          "wordCount": 1260,
          "title": "How to upgrade to Windows 11"
        },
        {
          "id": "https://www.rockpapershotgun.com/truck-simulator-now-supports-mods-in-multiplayer",
          "author": "Alice O'Connor",
          "description": "After adding official multiplayer modes to American Truck Simulator and Euro Truck Simulator 2, developers SCS Software have now made both support mods in multiplayer too. They're games many truckers mod with the trucks and decor of their dreams, so it'll be nice to show everyone your true truck self. I'd call this your drivatar but Forza has already claimed that.\nRead more",
          "link": "https://www.rockpapershotgun.com/truck-simulator-now-supports-mods-in-multiplayer",
          "publishedOn": "2021-10-22T14:06:46.000Z",
          "wordCount": 900,
          "title": "Truck Simulator now supports mods in multiplayer"
        },
        {
          "id": "https://www.rockpapershotgun.com/grand-theft-auto-remastered-trilogys-first-trailer-looks-shiny-yet-cartoony",
          "author": "Alice O'Connor",
          "description": "After a stretch of teasing and leaking, Rockstar today revealed how they've renovated the GTA 3 trilogy for the upcoming horribly named collection, Grand Theft Auto: The Trilogy - The Definitive Edition. A new trailer and screenshots reveal that GTA 3, Vice City, and San Andreas still have distinctly cartoon vibes, now paired with fancy reflections and effects. Rockstar also announced a release date of November 11th and a price of... £55? Gosh. See the new look for yourself in the trailer below.\nRead more",
          "link": "https://www.rockpapershotgun.com/grand-theft-auto-remastered-trilogys-first-trailer-looks-shiny-yet-cartoony",
          "publishedOn": "2021-10-22T13:32:49.000Z",
          "wordCount": 1029,
          "title": "Grand Theft Auto remastered trilogy's first trailer looks shiny yet cartoony"
        },
        {
          "id": "https://www.rockpapershotgun.com/doom-eternals-horde-mode-arrives-next-week",
          "author": "Imogen Beckhelling",
          "description": "On Tuesday the 26th of October, Doom Eternal players will be able to rip and tear through the hellish shooter's new horde mode. If you're not quite satisfied with murdering demons in a linear fashion, you'll be able to jump into a match to fight off waves of the beasties instead. It's arriving in the game's 6.66 update, along with two new master levels and Battlemode 2.0.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/doom-eternals-horde-mode-arrives-next-week",
          "publishedOn": "2021-10-22T13:00:27.000Z",
          "wordCount": 862,
          "title": "Doom Eternal's Horde mode arrives next week"
        },
        {
          "id": "https://www.rockpapershotgun.com/halo-infinite-will-let-you-host-a-cross-platform-lan-party-on-a-pc-dedicated-server",
          "author": "Alice O'Connor",
          "description": "After decades of Halo being primarily an Xbox series [settle down, disgruntled elderly Mac fanatics -ed.], Halo Infinite will buck that with a simultaneous launch on PC too. With that December launch drawing near, a new trailer focuses on the PC edition, detailing various graphics settings and multiplayer options and noting the interesting detail that you'll be able to use a PC to host a dedicated server for a cross-platform LAN party. Watch on for lots of shots of scrolling through options menus.\nRead more",
          "link": "https://www.rockpapershotgun.com/halo-infinite-will-let-you-host-a-cross-platform-lan-party-on-a-pc-dedicated-server",
          "publishedOn": "2021-10-22T11:25:27.000Z",
          "wordCount": 886,
          "title": "Halo Infinite will let you host a cross-platform LAN party on a PC dedicated server"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-character-transfers-paused-due-to-gold-duping-glitch",
          "author": "Imogen Beckhelling",
          "description": "New World's long-awaited character transfers have been taken away almost as soon as they arrived, because they've caused a glitch that allows players to duplicate gold. The bug came about after the MMORPG's 1.0.3 update this week. It makes it so characters don't save properly after transferring, letting them trade gold and items to others while magically keeping it in their own pockets. Amazon have paused server transfers for the time being to work on a fix, and have warned players that those caught exploiting the glitch will be banned.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-character-transfers-paused-due-to-gold-duping-glitch",
          "publishedOn": "2021-10-22T10:21:39.000Z",
          "wordCount": 903,
          "title": "New World character transfers paused due to gold duping glitch"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-psychonauts-2-turns-the-mind-inside-out",
          "author": "Andreas Inderwildi",
          "description": "“It’s all in your head.” It’s a response that encapsulates all the condescension and ignorance surrounding mental health issues. And yet, in a way, it’s true. Subjective experience is an objective reality – that just so happens to be located and locked away in your head. \nThese individual realities can only be conveyed through language and other subjective means of communication, and more and more games are grasping this fact, turning inward to explore and map the inland empires of the mind. They have all the tools of the medium at their disposal to turn the invisible workings of the mind into landscapes of audio-visual and mechanical metaphors that can be explored and interacted with. At their best, they convey the dynamic and complex mechanisms of the psyche in a way that only this medium can.\nRead more",
          "link": "https://www.rockpapershotgun.com/how-psychonauts-2-turns-the-mind-inside-out",
          "publishedOn": "2021-10-22T10:00:00.000Z",
          "wordCount": 1746,
          "title": "How Psychonauts 2 turns the mind inside out"
        },
        {
          "id": "https://www.rockpapershotgun.com/football-manager-2022s-early-access-beta-is-available-now",
          "author": "Graham Smith",
          "description": "Football Manager 2022 pre-launch beta is live now. If you buy the kicking sim on Steam or Epic, you can immediately start playing a nearly-finished version of the game. If you're really committed you can probably be sacked at least once before the sun comes up.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/football-manager-2022s-early-access-beta-is-available-now",
          "publishedOn": "2021-10-21T23:22:46.000Z",
          "wordCount": 699,
          "title": "Football Manager 2022's early access beta is available now"
        },
        {
          "id": "https://www.rockpapershotgun.com/no-mans-skys-new-update-lets-you-ride-on-flying-worms",
          "author": "Graham Smith",
          "description": "At this point, it has become a cliché to say that space sim No Man's Sky has come a long way since its initial release. And yet, is there any better example of its long development journey than the sandworms? Initially shown in pre-release trailers only to be cut from the release version, they were finally added in some recent updates. Now the most recent update and seasonal event adds new sandworm varieties, including rideable sandworms. The worm has indeed turned.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/no-mans-skys-new-update-lets-you-ride-on-flying-worms",
          "publishedOn": "2021-10-21T22:07:33.000Z",
          "wordCount": 748,
          "title": "No Man's Sky's new update lets you ride on flying worms"
        },
        {
          "id": "https://www.rockpapershotgun.com/corsairs-flagship-virtuoso-rgb-wireless-xt-headset-is-26-off-in-the-uk",
          "author": "Will Judd",
          "description": "Corsair's Virtuoso RGB Wireless XT is just as fancy as its long-ass name implies, and today it's £65 off as part of Corsair's autumn sale. That drops the price from £250 to £185, considerably less than even the going price on Amazon of £230. I think this is a great deal if you've got a hefty budget for an all-in-one wireless headset, so let me share a little on why I'm so convinced!\nRead more",
          "link": "https://www.rockpapershotgun.com/corsairs-flagship-virtuoso-rgb-wireless-xt-headset-is-26-off-in-the-uk",
          "publishedOn": "2021-10-21T21:54:34.000Z",
          "wordCount": 907,
          "title": "Corsair's flagship Virtuoso RGB Wireless XT headset is 26% off in the UK"
        },
        {
          "id": "https://www.rockpapershotgun.com/haunted-chocolatier-is-the-stardew-valleys-developers-next-rpg",
          "author": "Graham Smith",
          "description": "The developer of Stardew Valley has revealed their next game: Haunted Chocolatier. It's again a game about moving to a new town to \"try your hand at a new way of living\", but instead of a farm, you're opening a chocolate shop staffed by ghosts. There's an adorable trailer below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/haunted-chocolatier-is-the-stardew-valleys-developers-next-rpg",
          "publishedOn": "2021-10-21T21:38:34.000Z",
          "wordCount": 773,
          "title": "Haunted Chocolatier is the Stardew Valley developer's next RPG"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-a-high-spec-1tb-nvme-ssd-for-139-after-a-21-off-voucher",
          "author": "Will Judd",
          "description": "The XPG S70 Blade is one of the few 'second-gen' PCIe 4.0 SSDs on the market, offering incredible speeds on PC and even full compatibility with PS5. Today the 1TB model is heavily discounted at Amazon UK, with the NVMe drive dropping from £176 all the way to £139. To get the reduced price, tick the box where it says 'Apply 21% voucher'; the reduced price will be visible at the checkout. \nRead more",
          "link": "https://www.rockpapershotgun.com/get-a-high-spec-1tb-nvme-ssd-for-139-after-a-21-off-voucher",
          "publishedOn": "2021-10-21T21:34:37.000Z",
          "wordCount": 898,
          "title": "Get a high-spec 1TB NVMe SSD for £139 after a 21% off voucher"
        },
        {
          "id": "https://www.rockpapershotgun.com/battlefield-2042-will-tweak-maps-ui-and-more-in-response-to-beta-feedback",
          "author": "Graham Smith",
          "description": "Battlefield 2042 has been and gone, and now its developers have written about what they learned based on player feedback. There are some straight fixes, some explanations, and lot more in a post on the Battlefield blog. \r\n\nAlso: a look at the five previously unrevealed specialists you'll be able to play as when the game launches.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/battlefield-2042-will-tweak-maps-ui-and-more-in-response-to-beta-feedback",
          "publishedOn": "2021-10-21T21:11:26.000Z",
          "wordCount": 789,
          "title": "Battlefield 2042 will tweak maps, UI and more in response to beta feedback"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-uncharted-movie-finally-has-a-trailer",
          "author": "Graham Smith",
          "description": "The Uncharted series will arrive on PC early next year with Uncharted 4: A Thief's End. That game features a retired Nathan Drake being coaxed into another adventure, but you therefore might want to experience some of the Indylike's earlier treasure hunts first. There is literally only one way I can think of to do that: watching the Uncharted movie, which is also due to release in cinemas early next year.\r\n\nThe first trailer just released, starring Tom Holland and Mark Wahlberg.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-uncharted-movie-finally-has-a-trailer",
          "publishedOn": "2021-10-21T20:52:36.000Z",
          "wordCount": 782,
          "title": "The Uncharted movie finally has a trailer"
        },
        {
          "id": "https://www.rockpapershotgun.com/razer-cap-razercon-announcements-with-first-psu-and-liquid-cooler-components",
          "author": "James Archer",
          "description": "Razer, purveyors of green and black gaming peripherals, have announced they’re having a proper go at PC components as well. The Razer Hanbo AIO liquid CPU cooler series, Razer Katana PSUs, Razer Kunai case fans and Razer Pulse Width Modulator (PWM) Fan Controller all debuted during this year's RazerCon showcase.\nRead more",
          "link": "https://www.rockpapershotgun.com/razer-cap-razercon-announcements-with-first-psu-and-liquid-cooler-components",
          "publishedOn": "2021-10-21T18:01:49.000Z",
          "wordCount": 1160,
          "title": "Razer cap RazerCon announcements with first PSU and liquid cooler components"
        },
        {
          "id": "https://www.rockpapershotgun.com/dwarf-fortress-steam-edition-video-demonstrates-convenience-of-seeing-whats-happening",
          "author": "Alice O'Connor",
          "description": "\"You will not believe what the hell just happened in Dwarf Fortress!\" my pal will tell me, proceeding to share a screenshot which, to me, is indistinguishable from e.g.:\n\r\n██,.,,;lz,zl;L:@gjse,.gm.,,.m.zm,.m,x.zm.amL:m3jp5jkmToiHy*\r\n████()ht23htuhqIJg.......UG.uos\\kjk:███/,,p,c.xz/,c./z,c;\\/.\r\n██'z,c./xz,c./zx,cpaswf/w.qfw.,/f,aa███,g.ew/t,3wq./t,,2..@|\r\n█3/.6t,.esg,f.e/sg,./ewt,./w4t4..,1t6,m42ijpnz\\kuiys8fun/.|█\r\n█|?|..../\\/\\..|@@@%%$|\"(((|..FHzFhLlk@A}||||....*|JGH,.3████\r\nzZ./@Z@@'Z'@@LSXCl;a,sl;FLZL;@'A:@,;'F\":%T@:H^OQHOh8^£$.\\/.█\n\n\"That's wild!\" I will reply, not wanting to hurt their feelings. But how delightful, then, to watch the latest video from the upcoming premium edition, where co-creator Zach Adams demonstrates defending against a goblin attack and you can actually see it's a goblin attack.\nRead more",
          "link": "https://www.rockpapershotgun.com/dwarf-fortress-steam-edition-video-demonstrates-convenience-of-seeing-whats-happening",
          "publishedOn": "2021-10-21T16:45:05.000Z",
          "wordCount": 781,
          "title": "Dwarf Fortress Steam edition video demonstrates convenience of seeing what's happening"
        },
        {
          "id": "https://www.rockpapershotgun.com/amanitas-unhappy-happy-game-is-coming-in-time-for-halloween",
          "author": "Alice O'Connor",
          "description": "Amanita Design are known for their cheery and charming adventure games, wonders like Samorost, Machinarium, Botanicula, and Chuchel. Their next game sounds like it should be their cheeriest yet, given that it's named Happy Game. Reader dear, this is a trick. Happy Game is blood and death and horror. You will see this soon, as Amanita today announced plans to release Happy Game on the 28th of October. Or you can try a demo now!\nRead more",
          "link": "https://www.rockpapershotgun.com/amanitas-unhappy-happy-game-is-coming-in-time-for-halloween",
          "publishedOn": "2021-10-21T16:12:14.000Z",
          "wordCount": 750,
          "title": "Amanita's unhappy Happy Game is coming in time for Halloween"
        },
        {
          "id": "https://www.rockpapershotgun.com/skyrim-will-add-aquariums-in-its-anniversary-edition",
          "author": "Imogen Beckhelling",
          "description": "Skyrim: Anniversary Edition comes out next month, and it's quickly becoming the fishiest version of the RPG yet. Bethesda have announced it will let you add aquariums to your Skyrim homes. We already know this edition will let us go fishing too, so I'm hoping we'll be able to yank those suckers straight out of the sea to put on display in our homes. Can't believe I'm going to buy yet another version of Skyrim just to have pet fish.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/skyrim-will-add-aquariums-in-its-anniversary-edition",
          "publishedOn": "2021-10-21T15:56:39.000Z",
          "wordCount": 905,
          "title": "Skyrim will add aquariums in its Anniversary Edition"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-electronic-wireless-show-podcast-episode-161-the-best-songs-in-games-special",
          "author": "Alice Bell",
          "description": "It occurs to me now that \"best songs\" is probably not a great topic for the podcast, given that we do not perform any of the songs, or put them in the show. But on this week's episode of The Electronic Wireless show, we talk about them songs real good. Plus, we are joined by Randy Newman, who sounds a surprising amount like Matthew Castle.\nMatthew himself has a new awkward food related story to share, Nate has been watching Squid Game, and a listener has sent in a very special musical theme for Sweeten The Deal!\nRead more",
          "link": "https://www.rockpapershotgun.com/the-electronic-wireless-show-podcast-episode-161-the-best-songs-in-games-special",
          "publishedOn": "2021-10-21T15:00:00.000Z",
          "wordCount": 852,
          "title": "EWS podcast episode 161: the best songs special"
        },
        {
          "id": "https://www.rockpapershotgun.com/cant-buy-an-rtx-3080-geforce-now-will-let-you-play-with-one-in-the-cloud",
          "author": "James Archer",
          "description": "Nvidia’s GeForce Now cloud gaming service is getting a new, ultra-premium subscription tier powered by its GeForce RTX 3080 GPU. While one of the best graphics cards around, especially for higher resolutions, the RTX 3080 has remained frustratingly hard to find in stock since it launched last year – for many, this GeForce Now tier could be the best chance of seeing what it’s like to play with one, even if is simply streaming from a server rather than a dedicated gaming PC.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/cant-buy-an-rtx-3080-geforce-now-will-let-you-play-with-one-in-the-cloud",
          "publishedOn": "2021-10-21T14:24:09.000Z",
          "wordCount": 937,
          "title": "Can’t buy an RTX 3080? GeForce Now will let you play with one in the cloud"
        },
        {
          "id": "https://www.rockpapershotgun.com/letter-from-the-editor-03",
          "author": "Katharine Castle",
          "description": "Hello folks. Sorry to be writing this letter so late into October. This time two weeks ago I was walking the halls of London's ExCel on my way to host the first RPS Presents panel at EGX 2021, and all the planning and organising I had to do for it rather cut back on my available writing time. I then took some time off to recuperate a bit, and here we are, three weeks into October and I'm only just getting round to doing my monthly editor's letter. I do apologise. But! We are here now and there's plenty to talk about. A lot of it is EGX-related, but you'll hopefully have noticed some new site features being introduced these last few weeks as well, which I'll explain below. \nRead more",
          "link": "https://www.rockpapershotgun.com/letter-from-the-editor-03",
          "publishedOn": "2021-10-21T14:12:37.000Z",
          "wordCount": 820,
          "title": "Letter From The Editor #03: EGX Rezzed is dead, long live EGX Rezzed"
        },
        {
          "id": "https://www.rockpapershotgun.com/charming-tower-defence-toy-soldiers-has-an-hd-remaster-now",
          "author": "Alice O'Connor",
          "description": "2010 tower defence game Toy Soldiers has two big neat ideas: it looks like a toybox upended onto battlefield dioramas built on bedroom tables; and you can take to the battlefield yourself to control units and vehicles. It's a good'un, and today it relaunched with an 'HD' version. I liked the original enough to buy it on both Xbox 360 and PC, but wasn't interested in getting it again until I heard Toy Soldiers: HD offers more than the usual high-res texture overhaul.\nRead more",
          "link": "https://www.rockpapershotgun.com/charming-tower-defence-toy-soldiers-has-an-hd-remaster-now",
          "publishedOn": "2021-10-21T14:07:29.000Z",
          "wordCount": 924,
          "title": "Charming tower defence Toy Soldiers has an HD remaster now"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-dark-pictures-anthology-house-of-ashes-review",
          "author": "Alice Bell",
          "description": "I have a real soft spot for Supermassive Games. Until Dawn was a knowingly schlocky teen slasher horror film made into an interactive adventure game, and it was great for at least two thirds of its runtime. I've also felt the same about their more recent project, The Dark Pictures Anthology, which began with Man Of Medan in 2019. Every time a new instalment comes out I believe it's in with a shot of being well good - although each one has since made me doubt the \"knowing\" part of my interpretation of Until Dawn. The latest entry, House Of Ashes, comes the closest yet to recapturing the daft thrills of Until Dawn, with a classic survival-horror setup that's half The Descent and half Aliens.\nThe five playable protagonists you flit between are trapped in an ancient Sumerian temple that leads into an even deeper cavern, and then an even deeperer, ancienter ruin. The turducken of potholing. But instead of delicious stuffing, the surprise in these layers is a race of vampiric monsters whose vision is based on sound, and whose spit is LSD. Your job is to get your goons out alive, and the main problem is that the goons in question are - instead of a busload of teens on a field trip gone wrong - a small team of US marines searching for WMDs in 2003 Iraq. Wakka wakka.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-dark-pictures-anthology-house-of-ashes-review",
          "publishedOn": "2021-10-21T14:00:00.000Z",
          "wordCount": 1993,
          "title": "The Dark Pictures Anthology: House Of Ashes review: very nearly a fun horror romp"
        },
        {
          "id": "https://www.rockpapershotgun.com/austin-powers-spliced-into-mass-effect-makes-a-disturbingly-good-shepard",
          "author": "Imogen Beckhelling",
          "description": "The geth have begun launching seemingly random attacks on human colonies. Rumours are circling that ancient machines will soon emerge from darkspace. There is only one man equipped to deal with these threats: Intergalactic Man Of Mystery, Austin Powers. Someone has made a video editing Mike Myers' 60s spy into Mass Effect and I'm astounded at how well it works. I don't know what else to say. This is Mass Effect in its ultimate form. Please watch it, it's the best minute I've spent all week.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/austin-powers-spliced-into-mass-effect-makes-a-disturbingly-good-shepard",
          "publishedOn": "2021-10-21T13:04:21.000Z",
          "wordCount": 800,
          "title": "Austin Powers spliced into Mass Effect makes a disturbingly good Shepard"
        },
        {
          "id": "https://www.rockpapershotgun.com/into-the-pit-was-inspired-by-devil-daggers-and-a-nicolas-cage-film",
          "author": "Imogen Beckhelling",
          "description": "Into The Pit is a fast-paced roguelike shooter with hints of Doom, and excellent hands that shoot magical bullets. It's not the first occult-themed game to turn hands into guns (and I sure hope it won't be the last), but is inspired by one. I spoke to Into The Pit's creator, Tom Betts, who told me about the game's Devil Daggers influences, from weaponry to aesthetics, and why the occult setting works so well for the roguelike genre. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/into-the-pit-was-inspired-by-devil-daggers-and-a-nicolas-cage-film",
          "publishedOn": "2021-10-21T12:00:00.000Z",
          "wordCount": 1679,
          "title": "Into The Pit was inspired by Devil Daggers and a Nicolas Cage film"
        },
        {
          "id": "https://www.rockpapershotgun.com/bethesdas-new-starfield-trailer-introduces-mercenary-and-pirate-factions",
          "author": "Imogen Beckhelling",
          "description": "I'm fighting off a real Bethesda itch right now. I know I'll hate myself if I start yet another Skyrim playthrough, and I'm too fussy to decide on a Fallout to sink another fifty hours into. But now there's a new Starfield trailer, and it's making me pine for those damned RPGs all the more. The developers have dived into Starfield's history, and revealed a handful of factions we'll come across on our space travels. It's mostly concept art, but hey, it's very nice concept art.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/bethesdas-new-starfield-trailer-introduces-mercenary-and-pirate-factions",
          "publishedOn": "2021-10-21T10:08:17.000Z",
          "wordCount": 953,
          "title": "Bethesda's new Starfield trailer introduces mercenary and pirate factions"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-now-lets-you-transfer-your-character-to-another-server",
          "author": "Alice O'Connor",
          "description": "Server transfers opened up in New World overnight, letting players shunt their explorers from one world to another. This is a desirable feature in many MMOs, and particularly in this one because servers were so overloaded at launch that Amazon recommended players join any old server then transfer to their desired home later once things settled. All players get one transfer for free, but only one, with Amazon planning to start selling that service later.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-now-lets-you-transfer-your-character-to-another-server",
          "publishedOn": "2021-10-21T09:46:30.000Z",
          "wordCount": 906,
          "title": "New World now lets you transfer your character to another server"
        },
        {
          "id": "https://www.rockpapershotgun.com/evertried-review",
          "author": "Brendan Caldwell",
          "description": "There is no mouse cursor in Evertried. You control everything with the keyboard, from the hops and scythe attacks of your cute otherworldly hero, to the settings in the pause menu. It's a strange omission but one that is representative of the feeling this roguelike evokes throughout your time climbing its purgatorial tower of baddies. That is to say, a feeling that there's something important missing. In fact, there seems to be a lot missing from this tile-based timewaster, small touches that could have given its solid foundation the polish it needed to excel. \nRead more",
          "link": "https://www.rockpapershotgun.com/evertried-review",
          "publishedOn": "2021-10-21T08:00:00.000Z",
          "wordCount": 1807,
          "title": "Evertried review: a rough-hewn roguelike that fails to stand out"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-the-outstanding-razer-viper-ultralight-mouse-for-50-off",
          "author": "Will Judd",
          "description": "The Razer Viper is one of my favourite mice of all time, whether we're talking about the wireless Ultimate version, the compact Mini model or the vanilla Viper. It's this OG model that is on sale today at Amazon, who have marked it down from £80 to just £40 - an incredible bargain for an ultralight mouse with a high-end optical sensor, optical mouse buttons, flexible cable and low weight of just 69 grams. \nRead more",
          "link": "https://www.rockpapershotgun.com/get-the-outstanding-razer-viper-ultralight-mouse-for-50-off",
          "publishedOn": "2021-10-20T20:30:43.000Z",
          "wordCount": 938,
          "title": "Get the outstanding Razer Viper ultralight mouse for 50% off"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-an-rtx-3070-gaming-laptop-for-1250-after-a-150-discount",
          "author": "Will Judd",
          "description": "The Asus Tuf Gaming A15 is a great value gaming laptop that attracted warm reviews for its design and performance, and today it's also the cheapest RTX 3070 gaming laptop we can find*. The A15 FA506QR-HN006T specification, which includes a Ryzen 7 5800H processor, 16GB of RAM and 512GB SSD, is down to just £1250 at Overclockers after a £150 reduction. \nRead more",
          "link": "https://www.rockpapershotgun.com/get-an-rtx-3070-gaming-laptop-for-1250-after-a-150-discount",
          "publishedOn": "2021-10-20T20:05:43.000Z",
          "wordCount": 844,
          "title": "Get an RTX 3070 gaming laptop for £1250 after a £150 discount"
        },
        {
          "id": "https://www.rockpapershotgun.com/cd-projekt-red-delay-the-witcher-3s-next-gen-update",
          "author": "Alice O'Connor",
          "description": "The update adding raytracing and other mod cons to The Witcher 3 will not launch this year, developers CD Projekt Red announced today. They've been fancying up their fantasy RPG for the latest console generation, and those 'next-gen' additions are headed to PC in a patch too. But not this year. Instead, look to be blinded by the light in spring 2022. They've also delayed the next-gen version of Cyberpunk 2077 for consoles.\nRead more",
          "link": "https://www.rockpapershotgun.com/cd-projekt-red-delay-the-witcher-3s-next-gen-update",
          "publishedOn": "2021-10-20T19:17:05.000Z",
          "wordCount": 870,
          "title": "CD Projekt Red delay The Witcher 3's next-gen update"
        },
        {
          "id": "https://www.rockpapershotgun.com/god-of-war-is-coming-to-pc-in-january-2022",
          "author": "Alice O'Connor",
          "description": "As was rumoured, the dadtastic godstabber God Of War is indeed coming to PC. Sony today announced that the PlayStation-exclusive action-adventure game will launch for PC on the 14th of January, 2022. Good game, that. It'll have support for assorted PC technical fanciness too.\nRead more",
          "link": "https://www.rockpapershotgun.com/god-of-war-is-coming-to-pc-in-january-2022",
          "publishedOn": "2021-10-20T16:32:16.000Z",
          "wordCount": 881,
          "title": "God Of War is coming to PC in January 2022"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-subnautica-mods",
          "author": "Craig Pearson",
          "description": "Subnautica was a game I spent a lot of time just living in. It was a rare combination of survival and relaxation. I loved the base building, crafting what amounted to a reverse aquarium clinging to an underwater sea cliff. It grew from a small bulb of oxygen into a proper little sanctuary. When I picked it up, it was fairly late into its life, and a number of mods were already waiting to be installed. I quickly dialed down the game’s frustrations and made my time under the sea all the more enjoyable, so here are our picks for the best Subnautica mods available today.  \nRead more",
          "link": "https://www.rockpapershotgun.com/best-subnautica-mods",
          "publishedOn": "2021-10-20T15:36:25.000Z",
          "wordCount": 1708,
          "title": "Best Subnautica mods"
        },
        {
          "id": "https://www.rockpapershotgun.com/over-20-people-reported-for-behaviour-now-gone-from-activision-blizzard",
          "author": "Alice O'Connor",
          "description": "Activision Blizzard's initial response to allegations of workplace harrassment and discrimination was disappointing enough that thousands of current and former employees signed an open letter condemning it then hundreds staged a walkout in July. With several legal cases against the Warcraft and Call Of Duty owners underway, they've now admitted they haven't done enough. Yesterday, Along with laying out their next steps, they confirmed that over 20 people have \"exited\" Activision Blizzard in connection with reports against them.\nRead more",
          "link": "https://www.rockpapershotgun.com/over-20-people-reported-for-behaviour-now-gone-from-activision-blizzard",
          "publishedOn": "2021-10-20T15:26:38.000Z",
          "wordCount": 1194,
          "title": "Over 20 people reported for behaviour now gone from Activision Blizzard"
        },
        {
          "id": "https://www.rockpapershotgun.com/wd-blue-sn570-review",
          "author": "James Archer",
          "description": "There was a time, not so long ago, when the WD Blue line exemplified that “good but boring” quality that sees many a budget SSD damned by faint praise. Fast enough yet rarely eye-catchingly rapid, even when the WD Blue SN500 ditched SATA for the much quicker NVMe interface, they’ve always been sensible purchases that nonetheless lived in the shadow of the WD Black lineup. That all changes with the latest WD Blue SN570: it’s not just an excellent M.2 drive for the money, but quite possibly the single most compelling SSD for anyone sticking with PCIe 3.0.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/wd-blue-sn570-review",
          "publishedOn": "2021-10-20T15:23:23.000Z",
          "wordCount": 1248,
          "title": "WD Blue SN570 review: The best cheap SSD grows up"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-zombies-in-back-4-blood-are-more-fashionable-than-me",
          "author": "Ed Thorn",
          "description": "I don't know what I was expecting to take away from co-op FPS Back 4 Blood. A greater sense of comradery between myself and my friends? An appreciation of the weighty guns and how magazines snap into place with each reload? The sheer amount of blood that splashes on your person with each wave of zombies you cut down? Yes, all of these things.\nBut none more so than what the zombies wear. They favour comfortable clothing, but mainly the gilet. They love gilets. And they now have me questioning my fashion choices. Should I also join them as a wearer of gilets?\nRead more",
          "link": "https://www.rockpapershotgun.com/the-zombies-in-back-4-blood-are-more-fashionable-than-me",
          "publishedOn": "2021-10-20T14:41:24.000Z",
          "wordCount": 788,
          "title": "The zombies in Back 4 Blood are more fashionable than me"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-fireflies",
          "author": "Hayden Hefford",
          "description": "Want to know more about Fireflies in Minecraft? Whether you call them Fireflies, glowbugs, or lightning bugs, they’ll all occupy the same two pixels when they come to Minecraft and it’s time to get fired up for their arrival. Fireflies were announced at Minecraft Live 2021, which also shared more details on the upcoming Caves and Cliffs part 2 update.\nThis guide will explain everything that you need to know about Fireflies in Minecraft, including when you can expect Fireflies to come to Minecraft, where Fireflies will appear, and what they do.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-fireflies",
          "publishedOn": "2021-10-20T14:40:03.000Z",
          "wordCount": 964,
          "title": "Everything that we know about Fireflies in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-mangrove-swamp",
          "author": "Hayden Hefford",
          "description": "Want to know more about mangrove swamps in Minecraft? At Minecraft Live 2021, Mojang revealed that mangrove swamps - one of the options in the biome vote way back in 2019 - are finally coming to Minecraft. Many of the ideas mentioned back then, including mangrove trees and frogs, will be key features of the mangrove swamp biome.\nThis guide will explain everything that you need to know about mangrove swamps in Minecraft, including when mangrove swamps will be released, what you will find in the new biome, and how to grow your own mangrove trees with propagules.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-mangrove-swamp",
          "publishedOn": "2021-10-20T11:42:43.000Z",
          "wordCount": 1051,
          "title": "Everything you need to know about mangrove swamps in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/activision-blizzard-want-harassment-lawsuit-paused-over-conflict-of-interest",
          "author": "Imogen Beckhelling",
          "description": "Activision Blizzard have filed an application to halt the harassment and discrimination lawsuit from the California Department of Fair Employment and Housing (DFEH). This follows an update on the suit last week, which revealed that two DFEH lawyers previously worked for the Equal Employment Opportunity Commission (EEOC), who're also going through legal proceedings with Actiblizzard, creating a conflict of interest. Now the Call Of Duty and World Of Warcraft publishers want the DFEH's case to be paused so they can investigate, and decide whether they want to try and get the case disqualified, or find \"other appropriate remedies\". \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/activision-blizzard-want-harassment-lawsuit-paused-over-conflict-of-interest",
          "publishedOn": "2021-10-20T10:58:01.000Z",
          "wordCount": 973,
          "title": "Activision Blizzard want harassment lawsuit paused over conflict of interest"
        },
        {
          "id": "https://www.rockpapershotgun.com/gloomhaven-pc-review",
          "author": "Nic Reuben",
          "description": "Gloomhaven’s scoundrel has a custom animation for her flintlock pistol, and I am still jazzed about it. Releasing today in full after lurking in early access for the last two years, there are 17 classes in this digital adaptation of Cephalofair’s tabletop legacy dungeon crawler, hereafter referred to as ‘Tablehaven’. Each class, from psychic rodent Mindthief to basalt shithouse Cragheart, has around 30 ability cards each. And Flaming Fowl, alongside offering Tablehaven’s entire branching campaign, map editors, and a digi-only ‘Guildmaster’ campaign, have animated this single flintlock shot. It’s almost opulent. \nAll right, so I probably won’t use it much. Five damage at range four is a belter, but that burn hurts for a single target ability. I’ll be smiling when I do, though. Grinning as the scoundrel whips the silver pistol from her hip and deletes a cultist just before he summons a skeleton. Just as I’ve been grinning at these detailed, cel-shaded dungeons and grimy sewers, or the spoken narration before each quest. All Gloomhaven needed to do was not get in Tablehaven’s way too much. Accuracy and usability would have been just fine. But there’s enough passion and pizzaz in this wonderful package that a part of me wishes I was new here, just so I could be surprised all over again.\nRead more",
          "link": "https://www.rockpapershotgun.com/gloomhaven-pc-review",
          "publishedOn": "2021-10-20T10:00:00.000Z",
          "wordCount": 1889,
          "title": "Gloomhaven review: a loving adaptation that nails the ambition and detail of the tabletop original"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-frogs",
          "author": "Hayden Hefford",
          "description": "Want to know more about frogs in Minecraft? If you’ve always looked at lakes and rivers in Minecraft and thought ‘those need some slimy little amphibians that leap on lily pads and whip fireflies out of the sky with their tongues’, then you’re in luck! At Minecraft Live 2021, the team shared that we are getting frogs in Minecraft, and they’ll actually have a lot more depth than you might expect.\nThis guide will explain everything that we currently know about frogs in Minecraft, including how to get the different frog variants and how they act.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-frogs",
          "publishedOn": "2021-10-20T09:54:34.000Z",
          "wordCount": 962,
          "title": "Everything we know about frogs in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-genshin-impact-hu-tao-build",
          "author": "Amelia Zollner",
          "description": "Want to learn how to create the best Hu Tao build in Genshin Impact? As the 77th Director of the Wangsheng Funeral Parlor, Hu Tao has the help of ghosts in battle, where she’ll stir up a fright as she absolutely demolishes enemies. Despite being a bit of a prankster, the Pyro Polearm wielder will make a great DPS addition to your team.\nThis guide will show you how to create the best Hu Tao build in Genshin Impact. Below we'll cover everything you need to know about Hu Tao, including wishing, weapons, artifacts, ascension materials, talents, abilities, and constellations.\nRead more",
          "link": "https://www.rockpapershotgun.com/best-genshin-impact-hu-tao-build",
          "publishedOn": "2021-10-20T09:53:26.000Z",
          "wordCount": 2064,
          "title": "Best Genshin Impact Hu Tao build"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-allay",
          "author": "Hayden Hefford",
          "description": "Want to know more about the Allay in Minecraft? For the past few years, Minecraft Live has included lots of announcements about new updates, as well as a fan vote for a new Minecraft mob. For Minecraft Live 2021, the options were the Glare, the Copper Golem, and the Allay. Ultimately, the Allay came out on top, and will be added to Minecraft in 2022.\nHere’s everything that you need to know about the adorable Allay, including when it will arrive in Minecraft and what the Allay will do.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-allay",
          "publishedOn": "2021-10-20T08:52:58.000Z",
          "wordCount": 916,
          "title": "Everything that we know about the Allay in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/riders-republic-will-offer-a-free-trial-week-before-launch",
          "author": "Graham Smith",
          "description": "I'm exhausted at the mere thought of most Ubisoft games now, but I do want to fall down mountains in Riders Republic. To make that easier for me, Ubisoft are offering a trial week for their bigly multiplayer extreme sports 'em up. From October 21st until the 27th, you'll be able to play four hours of Riders Republic for free, with progress carrying over to the full game should you buy it.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/riders-republic-will-offer-a-free-trial-week-before-launch",
          "publishedOn": "2021-10-19T23:11:21.000Z",
          "wordCount": 759,
          "title": "Riders Republic will offer a free trial week before launch"
        },
        {
          "id": "https://www.rockpapershotgun.com/microsoft-flight-simulator-is-getting-more-free-updates-with-goty-edition",
          "author": "Graham Smith",
          "description": "Microsoft Flight Simulator is getting a 'Game Of The Year' edition. The skybound sim has received regular free updates since launch, each adding new cities and points of interest. The GOTY edition will bring even more, including new potogrammetry cities, 8 new airpirts, and 5 new aircraft. It'll launch on November 18th and be free to all existing players.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/microsoft-flight-simulator-is-getting-more-free-updates-with-goty-edition",
          "publishedOn": "2021-10-19T22:18:02.000Z",
          "wordCount": 761,
          "title": "Microsoft Flight Simulator is getting more free updates with GOTY edition"
        },
        {
          "id": "https://www.rockpapershotgun.com/halo-and-disintegrations-marcus-lehto-founding-new-studio-with-ea",
          "author": "Graham Smith",
          "description": "Marcus Lehto, former creative director at Bungie and the artist responsible for Master Chief, has joined EA to found a new studio that will make first-person games. Lehto's last company was V1 Interactive, who released the short-lived Disintegration last year.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/halo-and-disintegrations-marcus-lehto-founding-new-studio-with-ea",
          "publishedOn": "2021-10-19T21:55:45.000Z",
          "wordCount": 690,
          "title": "Halo and Disintegration's Marcus Lehto founding new studio with EA"
        },
        {
          "id": "https://www.rockpapershotgun.com/dead-by-daylights-hellraiser-models-are-now-an-nft",
          "author": "Graham Smith",
          "description": "Do you enjoy the feeling of having pins hammered into your head? Then allow me to introduce you to: our modern reality. \r\n\nToday's pin to the brow is that you can now buy NFTs based on Dead By Daylight's in-game models of Hellraiser's Pinhead. I can tell the difference between pleasure and pain, and this is pain.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/dead-by-daylights-hellraiser-models-are-now-an-nft",
          "publishedOn": "2021-10-19T21:33:16.000Z",
          "wordCount": 918,
          "title": "Dead By Daylight's Hellraiser models are now an NFT"
        },
        {
          "id": "https://www.rockpapershotgun.com/leaked-do-not-ban-list-reveals-how-twitch-dealt-with-rule-breakers",
          "author": "Graham Smith",
          "description": "Among the many discoveries of this month's Twitch source code and data leak was a file called \"do_not_ban_list.\" While not as black and white as the name suggest, the file sheds light on the otherwise opaque way Twitch has enforced its rules when streamers break them.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/leaked-do-not-ban-list-reveals-how-twitch-dealt-with-rule-breakers",
          "publishedOn": "2021-10-19T20:24:00.000Z",
          "wordCount": 903,
          "title": "Leaked 'do not ban' list reveals how Twitch dealt with rule breakers"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-an-rtx-3060-gaming-laptop-for-850-in-an-early-black-friday-deal",
          "author": "Will Judd",
          "description": "The MSI GF65 Thin is the first Black Friday gaming laptop deal we've spotted, around a month before the shopping holiday traditionally begins. At Best Buy, you can pick up this RTX 3060 equipped machine for $850, a cool $250 below its usual price of $1100. That's a fantastic value for a laptop that's seen strong reviews since its release earlier this year.\nRead more",
          "link": "https://www.rockpapershotgun.com/get-an-rtx-3060-gaming-laptop-for-850-in-an-early-black-friday-deal",
          "publishedOn": "2021-10-19T19:16:48.000Z",
          "wordCount": 984,
          "title": "Get an RTX 3060 gaming laptop for $850 in an early Black Friday deal"
        },
        {
          "id": "https://www.rockpapershotgun.com/upgrade-your-pc-with-two-sticks-of-8gb-3200mhz-ram-for-55",
          "author": "Will Judd",
          "description": "Adata is one of the best brands for budget RAM, and their long-standing Gammix D10 series offers a good balance of low price and high performance. Right now you can pick up two 8GB sticks of DDR4-3200 CL16 memory from Ebuyer for £56, around £10 cheaper than you'd pay for RAM with the same specs on Amazon. \nRead more",
          "link": "https://www.rockpapershotgun.com/upgrade-your-pc-with-two-sticks-of-8gb-3200mhz-ram-for-55",
          "publishedOn": "2021-10-19T18:01:48.000Z",
          "wordCount": 816,
          "title": "Upgrade your PC with two sticks of 8GB 3200MHz RAM for £55"
        },
        {
          "id": "https://www.rockpapershotgun.com/grotto-review",
          "author": "Katharine Castle",
          "description": "It's a hard life, being a soothsayer in Grotto. You live in a dingy little cave, the locals look at you with varying levels of distrust and suspicion, and occasionally your campfire will perk up and talk to you when no one's looking, its yellow flames turning an ominous shade of blue as it whispers dread-filled words about failure and the beating heart of the mountain into your ear. It's unclear how you ended up like this, but day after day you're tasked with consulting the handful of stars visible through a crack in the cave's ceiling to dole out advice to the local tribespeople, a group of anthropomorphic animals known only as The Brutes. \nSaid advice comes in the form of 24 constellations you can discover by looking up and drawing shapes in the sky with your mouse. You'll need to give one of them to each Brute that asks you a question, but when every constellation has its own fortune-cookie-like meaning attached to it, finding the right one to answer their question successfully can be a challenge. As the toad man Ouuch tells you at the start, if you ask three separate people what the word 'blue' means to them, you'll get three separate answers. Sometimes, your intentions will be misinterpreted, while others will willfully ignore you. But one thing Grotto always manages to do is to keep you coming back for more. Once you've set this car crash of consequences in motion, it's very hard to tear your eyes away.\nRead more",
          "link": "https://www.rockpapershotgun.com/grotto-review",
          "publishedOn": "2021-10-19T17:00:00.000Z",
          "wordCount": 1872,
          "title": "Grotto review: a grim, mystical tale about the limitations of language"
        },
        {
          "id": "https://www.rockpapershotgun.com/crysis-remastered-trilogy-new-and-old-versions-compared",
          "author": "James Archer",
          "description": "The Crysis Remastered Trilogy is out, complete with all the angry nanosuit men, angry alien squids, and solitary angry Cockney bloke of the originals – now with 8K support. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/crysis-remastered-trilogy-new-and-old-versions-compared",
          "publishedOn": "2021-10-19T16:11:42.000Z",
          "wordCount": 2123,
          "title": "Crysis Remastered Trilogy: new and old versions compared"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-1-19-the-wild-update",
          "author": "Hayden Hefford",
          "description": "Want to know more about the Minecraft 1.19 update? The Wild Update was revealed at Minecraft Live 2021, where we got details about all of the new additions, including frogs, fireflies, and mangrove swamps. This will be the first Minecraft update in 2022, and will be the next major update after Caves and Cliffs part 2.\nThis guide will explain everything that you can expect with Minecraft 1.19, so that you don’t go wild looking for details all over.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-1-19-the-wild-update",
          "publishedOn": "2021-10-19T15:17:15.000Z",
          "wordCount": 1588,
          "title": "Minecraft 1.19 release date: The Wild Update"
        },
        {
          "id": "https://www.rockpapershotgun.com/total-war-warhammer-3-trailer-shows-grand-cathay-and-tzeentch-rumbling",
          "author": "Alice O'Connor",
          "description": "After a lot of explaining how the factions of Grand Cathay and Tzeentch will work in Total War: Warhammer 3, Creative Assembly today demonstrated with a nine-minute video dramatically recapping a battle between the two. The third game in their fantasy real-time strategy series has needed to invent and fill out a lot of armies not present in the tabletop game, so it's interesting to see them in action. Got some nice colours and weird warmen, at the very least.\nRead more",
          "link": "https://www.rockpapershotgun.com/total-war-warhammer-3-trailer-shows-grand-cathay-and-tzeentch-rumbling",
          "publishedOn": "2021-10-19T14:04:33.000Z",
          "wordCount": 821,
          "title": "Total War: Warhammer 3 trailer shows Grand Cathay and Tzeentch rumbling"
        },
        {
          "id": "https://www.rockpapershotgun.com/amazon-games-investigating-new-world-invulnerability-exploit",
          "author": "Imogen Beckhelling",
          "description": "New World players have found an exploit that lets you turn invincible, which is certainly not the sort of exploit you want in your PvP-focused MMORPG. According to players who've encountered the bug, it's pretty easy to replicate, and folks are calling for wars to be disabled until there's a fix. Amazon Games say they're aware of the problem and are investigating, so hopefully they'll patch the game soon to make sure everyone's staying vincible.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/amazon-games-investigating-new-world-invulnerability-exploit",
          "publishedOn": "2021-10-19T12:43:28.000Z",
          "wordCount": 833,
          "title": "Amazon Games investigating New World invulnerability exploit"
        },
        {
          "id": "https://www.rockpapershotgun.com/assassins-creed-valhallas-educational-discovery-tour-is-out-today",
          "author": "Alice O'Connor",
          "description": "The best part of primary school in the UK is learning about Vikings: getting to make and decorate cardboard swords and jewellery, write stories about legends, and maybe even escape school with a visit to a historical site. Well, Assassin's Creed Valhalla might not offer the same crafting opportunities, but you can learn a lot about the game's history with the new Discovery Tour mode. It hits Valhalla today in a free update, and will also be sold separately for folks who don't want Valhalla.\nRead more",
          "link": "https://www.rockpapershotgun.com/assassins-creed-valhallas-educational-discovery-tour-is-out-today",
          "publishedOn": "2021-10-19T12:31:58.000Z",
          "wordCount": 862,
          "title": "Assassin's Creed Valhalla's educational Discovery Tour is out today"
        },
        {
          "id": "https://www.rockpapershotgun.com/apex-legends-new-character-is-a-familiar-face-from-titanfall-2",
          "author": "Imogen Beckhelling",
          "description": "Apex Legends is adding a second spooky murderbot to its roster, one that both Apex and Titanfall 2 fans might recognise. Ash is a simulacrum (human consciousness in a freaky robot) who was previously a baddie in Titanfall 2. Since May this year, she's been overseeing Apex's new 3v3 Arenas mode - you know, that ominous voice that tells you to crush your enemies. But in the battle royale's next season, Escape, she'll be joining the fight herself.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/apex-legends-new-character-is-a-familiar-face-from-titanfall-2",
          "publishedOn": "2021-10-19T11:17:01.000Z",
          "wordCount": 881,
          "title": "Apex Legends' new character is a familiar face from Titanfall 2"
        },
        {
          "id": "https://www.rockpapershotgun.com/im-sorry-to-say-it-new-world-but-you-need-mounts-mate",
          "author": "Ed Thorn",
          "description": "My heart sinks every time I accept a quest in MMORPG New World, which isn't ideal. These are tickets to adventure, to discovery, to that sweet, sweet EXP. But the more time I spend with the game, the more I'm beginning to loathe them. It's got nothing to do with what you actually do in them, it's the getting there that's the problem. I have to run my little legs ragged and I'm tired. I'm so very tired of it.\nRead more",
          "link": "https://www.rockpapershotgun.com/im-sorry-to-say-it-new-world-but-you-need-mounts-mate",
          "publishedOn": "2021-10-19T10:00:00.000Z",
          "wordCount": 1297,
          "title": "I'm sorry to say it New World, but you need mounts, mate"
        },
        {
          "id": "https://www.rockpapershotgun.com/actraiser-renaissance-review",
          "author": "Nadia Oxford",
          "description": "1990's ActRaiser is special. Most video games released in the late '80s tasked you with saving a princess from a dragon. ActRaiser says, “Hey, would you mind playing God with the people living on the demon-scarred land you just liberated? They're really squishy and helpless. Thanks, you’re a peach.\"\nThe game's developer, Quintet, was pretty special, too. Once a branch of Enix before the latter joined with Squaresoft in 2003, Quintet was behind a lot of SNES-era RPGs that are still fondly remembered today, such Illusion of Gaia and Terranigma. They’re all solid adventures that share a canon, albeit vaguely, and tackle some pretty heavy subject matter, including colonialism, poverty, and the slave trade. Alas, Quintet disbanded when Square Enix was born, and most of its team scattered to the winds. There’s been a Q-shaped hole in my heart ever since, so I hope I can be excused for yelling like a madwoman when ActRaiser Renaissance made a surprise debut at the September 2021 Nintendo Direct presentation.\nRead more",
          "link": "https://www.rockpapershotgun.com/actraiser-renaissance-review",
          "publishedOn": "2021-10-19T10:00:00.000Z",
          "wordCount": 1719,
          "title": "ActRaiser Renaissance review: raise one for a great remake of a 16-bit classic"
        },
        {
          "id": "https://www.rockpapershotgun.com/rps-asks-you-to-please-take-our-2021-readership-survey",
          "author": "Katharine Castle",
          "description": "It's that time of year again where we come to you with a single question: would you fill out our RPS Readership Survey, please? It should only take around 5-10 minutes of your time to complete, and it will be a big help to us going forward - particularly when it comes to shaping the future of the RPS supporter program.\nRead more",
          "link": "https://www.rockpapershotgun.com/rps-asks-you-to-please-take-our-2021-readership-survey",
          "publishedOn": "2021-10-19T09:40:18.000Z",
          "wordCount": 805,
          "title": "RPS Asks: you to please take our 2021 readership survey"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-genshin-impact-childe-build-tartaglia",
          "author": "Amelia Zollner",
          "description": "Want to learn how to create the best Childe build in Genshin Impact? Thanks to his unique ability set that enables both close-range and long-range combat, Hydro Bow user Childe (also known as Tartaglia) is especially powerful in almost any situation and is great as a main or sub DPS. As the 11th Harbinger of the Fatui, he’s an incredibly fierce warrior who also cares deeply for those he loves.\nThis guide will show you how to create the best Childe build in Genshin Impact. Below we'll cover everything you need to know about Childe, including wishing, weapons, artifacts, ascension materials, talents, abilities, and constellations.\nRead more",
          "link": "https://www.rockpapershotgun.com/best-genshin-impact-childe-build-tartaglia",
          "publishedOn": "2021-10-19T09:06:28.000Z",
          "wordCount": 2136,
          "title": "The best Genshin Impact Childe build (Tartaglia)"
        },
        {
          "id": "https://www.rockpapershotgun.com/dells-1440p-240hz-alienware-monitor-is-back-to-550",
          "author": "Will Judd",
          "description": "The Dell Alienware AW2721D is one of our top recommended monitors, sitting right in the emerging 1440p 240Hz sweet spot preferred by players of fast-paced shooters and racing titles. Right now, the monitor has returned to the lowest price we've ever seen for it, £550, down from a nominal RRP of over £800. \nRead more",
          "link": "https://www.rockpapershotgun.com/dells-1440p-240hz-alienware-monitor-is-back-to-550",
          "publishedOn": "2021-10-18T19:58:56.000Z",
          "wordCount": 964,
          "title": "Dell's 1440p 240Hz Alienware monitor is back to £550"
        },
        {
          "id": "https://www.rockpapershotgun.com/steam-deck-compatibility-interview",
          "author": "James Archer",
          "description": "Valve have always maintained that the Steam Deck is closer to a conventional PC than a handheld console, and as such should be able to run your existing library of games on Steam. But while the official Steam Deck Twitter is full of videos showing games performing well on dev kits, the compatibility status of many more games remains up in the air. That could just be through a lack of confirmation, or it could be deep-lying technical issues relating to hardware requirements or anti-cheat services that needed tweaks to work on the Deck’s Proton-based OS. Ahead of the planned December launch, Valve have unveiled their plan to bring clarity on whether specific games will be able to run (and run effectively) on the Steam Deck.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/steam-deck-compatibility-interview",
          "publishedOn": "2021-10-18T18:00:17.000Z",
          "wordCount": 2125,
          "title": "Exclusive: Here's how you'll know which games will run on Valve's Steam Deck"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-a-wd-blue-4tb-ssd-for-just-339-at-newegg-50-off-its-normal-price",
          "author": "Will Judd",
          "description": "The WD Blue SATA SSD is a great choice if you want a lot of fast storage at a cheap price, and today Newegg are offering $50 off the giant 4TB size when you use the code EMC2AAZA827. This knocks the price to $339, the cheapest we've seen a 4TB drive in some time and $40 below the current Amazon price. \nRead more",
          "link": "https://www.rockpapershotgun.com/get-a-wd-blue-4tb-ssd-for-just-339-at-newegg-50-off-its-normal-price",
          "publishedOn": "2021-10-18T17:20:24.000Z",
          "wordCount": 871,
          "title": "Get a WD Blue 4TB SSD for just $339 at Newegg - $50 off its normal price"
        },
        {
          "id": "https://www.rockpapershotgun.com/into-the-pit-review",
          "author": "Matt Cox",
          "description": "You know how some games, like, throb? I mean your Thumpers, your Devil Daggers, your Dooms. Games you disappear into, but not in that namby pamby, prancing around fulfilling all your desires sense. I mean games that will eat you alive unless you stop them. Games set in pulsating, hostile dimensions in which you don’t belong; games that fling their menageries at the battered windows of your soul, where survival teeters on a combo of hair-trigger reflexes and total concentration.\r\n\n\nInto The Pit is one of those, until it isn’t. You know you’re in trouble when the demonic eldritch hell portal starts feeling too comfortable. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/into-the-pit-review",
          "publishedOn": "2021-10-18T16:00:00.000Z",
          "wordCount": 1827,
          "title": "Into The Pit review: a gorgeous roguelike shooter that sadly descends into comfortable familiarity"
        },
        {
          "id": "https://www.rockpapershotgun.com/monster-hunter-rise-pc-vs-switch-how-the-demo-compares",
          "author": "James Archer",
          "description": "The recent launch of the Monster Hunter Rise demo on PC has given us a free look at how this soon-to-be-former Nintendo Switch exclusive will run and play when it releases in full in January 2022. This calls, naturally, for some screenshot comparisons.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/monster-hunter-rise-pc-vs-switch-how-the-demo-compares",
          "publishedOn": "2021-10-18T15:45:11.000Z",
          "wordCount": 1511,
          "title": "Monster Hunter Rise PC vs Switch: how the demo compares"
        },
        {
          "id": "https://www.rockpapershotgun.com/salt-and-sacrifice-preview-a-worthy-successor-to-salt-and-sanctuary",
          "author": "Ed Thorn",
          "description": "If you liked Dark Soulsy side-scroller Salt And Sanctuary, I have some great news. I got hands-on with an early portion of its sequel Salt And Sacrifice, and it seems set to deliver all the things that made its predecessor tick. The punishing enemies, the smooth combat, the vast skill trees, and the interconnected world are all still doing good things, but this time around they've just been joined by a few new additions, or seen some tweaks to keep things fresher, but no less difficult.\nRead more",
          "link": "https://www.rockpapershotgun.com/salt-and-sacrifice-preview-a-worthy-successor-to-salt-and-sanctuary",
          "publishedOn": "2021-10-18T15:35:05.000Z",
          "wordCount": 1673,
          "title": "With mage hunts and talking trees, Salt And Sacrifice is looking like a worthy successor to Salt And Sanctuary"
        },
        {
          "id": "https://www.rockpapershotgun.com/machinarium-is-selling-the-best-merch-a-bronze-statuette-of-its-adorable-star",
          "author": "Alice O'Connor",
          "description": "I don't buy video game merch, and if I did buy video game merch I wouldn't buy statues, and yet... my heart melts looking at Machinarium's hot new merch drop. Amanita are selling a limited run of bronze statuettes of the adventure game's adorable scrap robot star, Josef, and I love him. 405 grams of bronze might sound cold to hold but I know he'd warm my heart.\nRead more",
          "link": "https://www.rockpapershotgun.com/machinarium-is-selling-the-best-merch-a-bronze-statuette-of-its-adorable-star",
          "publishedOn": "2021-10-18T15:29:55.000Z",
          "wordCount": 759,
          "title": "Machinarium is selling the best merch: a bronze statuette of its adorable star"
        },
        {
          "id": "https://www.rockpapershotgun.com/inscryption-review",
          "author": "Brendan Caldwell",
          "description": "Be afraid. Inscryption is both a love letter to card games and a twisted, jocular caricature of their numerical excess. It had me grinning ear to ear, sometimes nervously, sometimes with the joy of someone who simply loves thumbing through new cards, even when a rustic antagonist with big hands is reaching for my throat. This is not your average deckbuilder. It's a card game with an escape room built on top, and other sinister secrets buried beneath. The depth of its rabbit hole isn't apparent at first. It starts off as a familiar card battler, if a little darkly themed. You are in a cabin, playing cards against a face shrouded in darkness. It seems like Slay The Spire or Hand Of Fate. \nThen the cards start talking.\nRead more",
          "link": "https://www.rockpapershotgun.com/inscryption-review",
          "publishedOn": "2021-10-18T15:00:00.000Z",
          "wordCount": 1970,
          "title": "Inscryption review: a sinister and excellently crafted card game with a darkly comic underbelly"
        },
        {
          "id": "https://www.rockpapershotgun.com/elden-ring-delayed-to-february-25th-2022",
          "author": "Alice O'Connor",
          "description": "In game development, the flow of time itself is convoluted, with projects centuries old phasing in and out, so we shouldn't be surprised that Bandai Namco have delayed the launch of Elden Ring. The long-awaited new game from the makers of Dark Souls was expected to launch on January 21st, but now it's due on February 25th. Sounds like the usual reason: they want more time to make it good, yeah? Oh, and supposed leaked gameplay footage is doing the rounds, though I warn you that it's a bad and disappointing clip.\nRead more",
          "link": "https://www.rockpapershotgun.com/elden-ring-delayed-to-february-25th-2022",
          "publishedOn": "2021-10-18T14:51:34.000Z",
          "wordCount": 862,
          "title": "Elden Ring delayed to February 25th, 2022"
        },
        {
          "id": "https://www.rockpapershotgun.com/succubus-censorship-on-by-default",
          "author": "Alice Bell",
          "description": "Sometimes a game is so clearly desperate for attention that you are loathe to give it any. Like that one guy whose entire brand is getting in loud quote-tweet arguments on Twitter every eight to ten weeks, you know both exactly what it wants, and that you shouldn't go there. For months now I have been getting regular emails from the Succubus devs, all of which contain 112% of my daily recommended nipple allowance, and I know - I know - I shouldn't be writing about it. It is an action-adventure-hell-titty game that is, on every level, very bad. But I am breaking my silence now because the censored version of it is, quite possibly, the funniest thing I have encountered in my recent memory, and accidentally better than anything the devs could have made on purpose. You win, Madmind Studio. You win.\nRead more",
          "link": "https://www.rockpapershotgun.com/succubus-censorship-on-by-default",
          "publishedOn": "2021-10-18T14:30:00.000Z",
          "wordCount": 791,
          "title": "Succubus has censorship on by default, and it's unintentionally the most hilarious thing I've ever seen"
        },
        {
          "id": "https://www.rockpapershotgun.com/say-hello-to-rps-new-guides-writers-rebecca-jones-and-hayden-hefford",
          "author": "Katharine Castle",
          "description": "After months of searching, I'm pleased to announce that the RPS guides team has finally added two fresh faces to its ranks. Please say hello to Rebecca Jones and Hayden Hefford.\nRead more",
          "link": "https://www.rockpapershotgun.com/say-hello-to-rps-new-guides-writers-rebecca-jones-and-hayden-hefford",
          "publishedOn": "2021-10-18T14:08:13.000Z",
          "wordCount": 853,
          "title": "Say hello to RPS' new guides writers, Rebecca Jones and Hayden Hefford"
        },
        {
          "id": "https://www.rockpapershotgun.com/oh-nope-microsofts-big-hint-at-fable-news-today-was-nothing",
          "author": "Alice O'Connor",
          "description": "Yesterday, Microsoft's Xbox Game Studios Publishing Twitter account offered what sure sounded like tantalising hints that Monday would bring big news on the mysterious upcoming new Fable game. Like, really sounded like. Like, totally sounded like the sort of obvious hint marketing campaigns drop when they're pretending it's a surprise but want you to know full well what's up. Nope. They've now deleted those tweets and apologised, saying no, no Fable news today. Oh.\nRead more",
          "link": "https://www.rockpapershotgun.com/oh-nope-microsofts-big-hint-at-fable-news-today-was-nothing",
          "publishedOn": "2021-10-18T11:46:09.000Z",
          "wordCount": 830,
          "title": "Oh, nope, Microsoft's big hint at Fable news today was nothing"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-jukebox",
          "author": "Hayden Hefford",
          "description": "Want a list of songs that play on the Back 4 Blood jukebox? A few missions into Act 1, you’ll come across the Bar Room Blitz mission. Sure, there are some story points about distracting zombies and saving people, but this mission is a smash-hit for one reason. There’s a jukebox that plays some very cool tunes in the background whilst you shoot, slash, and slaughter zombies from every angle. If you really like that one scene in Shaun Of The Dead, then this will be your fever dream.\nThis guide will show you all of the songs that you can hear on the Back 4 Blood jukebox, so that you can repeatedly replay Bar Room Blitz whilst waiting for someone to inevitably get Simon Pegg and Nick Frost to play the mission on Youtube.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-jukebox",
          "publishedOn": "2021-10-18T10:55:25.000Z",
          "wordCount": 1111,
          "title": "Back 4 Blood jukebox music list"
        },
        {
          "id": "https://www.rockpapershotgun.com/gotham-knights-trailer-introduces-its-baddies-the-court-of-owls",
          "author": "Alice O'Connor",
          "description": "If your reaction to hearing that the villains of Batman 'em up Gotham Knights are the Court of Owls is \"Hoo?\", 1) wow, good grief 2) you might want to watch these new trailers. Released over the weekend during the DC FanDome pow-o-rama, they introduce the secret society who pull Gotham's strings, as well as giving us a peek at the game's version of Penguin.\nRead more",
          "link": "https://www.rockpapershotgun.com/gotham-knights-trailer-introduces-its-baddies-the-court-of-owls",
          "publishedOn": "2021-10-18T09:46:44.000Z",
          "wordCount": 756,
          "title": "Gotham Knights trailer introduces its baddies, the Court of Owls"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-sunday-papers-614",
          "author": "Ed Thorn",
          "description": "Sundays are for inhaling the smell of a new book. Before you lean in, let's read this week's best writing about games.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-sunday-papers-614",
          "publishedOn": "2021-10-17T10:00:00.000Z",
          "wordCount": 1203,
          "title": "The Sunday Papers"
        },
        {
          "id": "https://www.rockpapershotgun.com/gta-the-trilogy-system-requirements-and-details-allegedly-leak",
          "author": "Graham Smith",
          "description": "Rockstar finally announced their long-rumoured Grand Theft Auto remasters a little over a week ago. Official confirmation that they were on the way hasn't stopped the leaks, however. A user of GTAForums has seemingly leaked a more detailed description of the games and their system requirements.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/gta-the-trilogy-system-requirements-and-details-allegedly-leak",
          "publishedOn": "2021-10-16T23:26:28.000Z",
          "wordCount": 962,
          "title": "GTA: The Trilogy system requirements and details allegedly leak"
        },
        {
          "id": "https://www.rockpapershotgun.com/dota-2s-next-hero-is-marci-from-the-dota-dragons-blood-anime",
          "author": "Graham Smith",
          "description": "Dota 2 is getting a new hero this autumn. It's Marci, the mute bodyguard from Netflix's Dota anime, Dota: Dragon's Blood. She'll join the game in an update \"coming soon.\"\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/dota-2s-next-hero-is-marci-from-the-dota-dragons-blood-anime",
          "publishedOn": "2021-10-16T22:42:10.000Z",
          "wordCount": 678,
          "title": "Dota 2's next hero is Marci from the Dota: Dragon's Blood anime"
        },
        {
          "id": "https://www.rockpapershotgun.com/tweet2doom-lets-you-play-doom-via-twitter",
          "author": "Graham Smith",
          "description": "Doom is now playable on Twitter - sort of. Thanks to Tweet2Doom bot, you can send replies to the account with a list of actions - move, turn, shoot, etc. - and get a video clip of Doom showing the results sent back to you. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/tweet2doom-lets-you-play-doom-via-twitter",
          "publishedOn": "2021-10-16T22:06:44.000Z",
          "wordCount": 812,
          "title": "Tweet2Doom lets you play Doom via Twitter"
        },
        {
          "id": "https://www.rockpapershotgun.com/rocksteadys-suicide-squad-gets-a-new-story-trailer",
          "author": "Graham Smith",
          "description": "Today's DC FanDome event brought another trailer for Rocksteady's Suicide Squad: Kill The Justice League. There's still no gameplay, but the story trailer filled out the world, its cast, and heck, it's good fun. Watch it below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/rocksteadys-suicide-squad-gets-a-new-story-trailer",
          "publishedOn": "2021-10-16T21:27:52.000Z",
          "wordCount": 735,
          "title": "Rocksteady's Suicide Squad gets a new story trailer"
        },
        {
          "id": "https://www.rockpapershotgun.com/epic-games-store-will-welcome-games-that-make-use-of-blockchain-tech",
          "author": "Graham Smith",
          "description": "Yesterday Valve told developers that they wouldn't allow games featuring NFTs or cryptocurrency on their digital storefront, Steam. Since then, Epic have followed up by telling The Verge that the Epic Games Store would be \"open to games that support cryptocurrency or blockchain-based assets.\"\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/epic-games-store-will-welcome-games-that-make-use-of-blockchain-tech",
          "publishedOn": "2021-10-16T20:48:45.000Z",
          "wordCount": 836,
          "title": "Epic Games Store will \"welcome games that make use of blockchain tech\""
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-dungeons-adds-roguelikelike-singleplayer-mode-this-december",
          "author": "Imogen Beckhelling",
          "description": "Minecraft Dungeons has finished telling its story through a number of DLCs that have released over the last year, but Mojang isn't done with the blocky Diablo-like just yet. They're introducing seasonal updates that they're calling Seasonal Adventures, adding progression systems, challenges and more - similar to the new Sea Of Thieves' Seasons. Season 1 will be called The Cloudy Climb, and it's coming this December. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-dungeons-adds-roguelikelike-singleplayer-mode-this-december",
          "publishedOn": "2021-10-16T19:10:00.000Z",
          "wordCount": 856,
          "title": "Minecraft Dungeons adds roguelikelike singleplayer mode this December"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecrafts-the-wild-update-will-add-excellent-frogs-after-caves-cliffs",
          "author": "Imogen Beckhelling",
          "description": "With Minecraft's Caves & Cliffs part 2 nearly upon us, Mojang have revealed the next big update that will follow it. Named The Wild Update, it'll focus on enhancing some of the existing areas we can explore and, importantly, adding colourful frogs! They'll arrive with the new Mangrove Swamp biome, along with tadpoles, fireflies and more. The Wild Update will also introduce the Deep Dark biome, which was supposed to arrive with Caves & Cliffs, but needed a little more time in the oven. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/minecrafts-the-wild-update-will-add-excellent-frogs-after-caves-cliffs",
          "publishedOn": "2021-10-16T19:05:00.000Z",
          "wordCount": 954,
          "title": "Minecraft's The Wild Update will add excellent frogs after Caves & Cliffs"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-will-soon-bundle-java-and-bedrock-editions-together",
          "author": "Imogen Beckhelling",
          "description": "For years and years, Minecraft's Java and Bedrock editions have lived apart, but Mojang finally have plans to unite them. They plan to package the two together next year as the Minecraft PC Bundle, so if you own one you'll get the other too. Ahead of this, both Java and Bedrock are coming to Xbox Game Pass for PC on November 2nd, which is lovely news. I've only ever owned Java, so it'll be nice to have the option to jump into Bedrock too.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-will-soon-bundle-java-and-bedrock-editions-together",
          "publishedOn": "2021-10-16T19:00:00.000Z",
          "wordCount": 788,
          "title": "Minecraft will soon bundle Java and Bedrock editions together"
        },
        {
          "id": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-165",
          "author": "Alice O'Connor",
          "description": "A week of goodbyes. Vid bud Colm waved goodbye on Monday, and Friday was the final shift at the news face for longtime evening freelancer Lauren Morton. She leaves us to join cheery RPS fanzine PC Gamer and they'll be lucky to have her, as we were. Say goodbye, gang.\nRead more",
          "link": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-165",
          "publishedOn": "2021-10-16T08:00:00.000Z",
          "wordCount": 1176,
          "title": "What are we all playing this weekend?"
        },
        {
          "id": "https://www.rockpapershotgun.com/portal-speedrunner-explains-their-wild-tricks-to-valve-developers",
          "author": "Lauren Morton",
          "description": "I'm constantly in awe of the wild tricks that speedrunners discover in just about any game they set their collective minds to. It's always a treat to hear developers being equally astounded though, and Valve's developers are no exception. Three of them recently got to have a chat with Portal speedrunner \"CantEven\" to ask about extremely calculated trick shots, weird save glitches, and all the other things that game developers don't always know about their own games.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/portal-speedrunner-explains-their-wild-tricks-to-valve-developers",
          "publishedOn": "2021-10-15T22:48:02.000Z",
          "wordCount": 894,
          "title": "Portal speedrunner explains their wild tricks to Valve developers"
        },
        {
          "id": "https://www.rockpapershotgun.com/twitch-are-confident-no-passwords-or-credit-cards-were-exposed-in-leak",
          "author": "Lauren Morton",
          "description": "Twitch were hit by a rather big source code and data breach earlier this month, which they say they've since been investigating. They've updated users again today, reiterating that the breach was made possible by a server configuration change and that they're confident no passwords, login credentials, or credit card numbers were exposed.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/twitch-are-confident-no-passwords-or-credit-cards-were-exposed-in-leak",
          "publishedOn": "2021-10-15T22:07:41.000Z",
          "wordCount": 746,
          "title": "Twitch are \"confident\" no passwords or credit cards were exposed in leak"
        },
        {
          "id": "https://www.rockpapershotgun.com/retro-sci-fi-thriller-the-invincible-now-has-a-proper-trailer",
          "author": "Lauren Morton",
          "description": "Retro-future sci-fi romp The Invincible is the upcoming thriller from some folks formerly of The Witcher, Cyberpunk, Dying Light, and others. It's based on the sci-fi novel of the same title from the 60s by Polish author Stanisław Lem. The first we saw of The Invincible last year was mostly a teaser set to some nice tunes, but now there's a full cutscene-style trailer to check out and it sure does look like some classic space stuff.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/retro-sci-fi-thriller-the-invincible-now-has-a-proper-trailer",
          "publishedOn": "2021-10-15T21:05:14.000Z",
          "wordCount": 854,
          "title": "Retro sci-fi thriller The Invincible now has a proper trailer"
        },
        {
          "id": "https://www.rockpapershotgun.com/steam-is-banning-games-with-nfts-and-cryptocurrency",
          "author": "Lauren Morton",
          "description": "Valve appear to be laying down some new rules for games on Steam, specifically games that involve trading or receiving cryptocurrancy and NFTs. The change has been shared by SpacePirate Games, developers of Age Of Rust, who say they were notified this week about the new prohibition. Over in the Steamworks portal, a new type of content that cannot be published on Steam has been added. \"Applications built on blockchain technology that issue or allow exchange of cryptocurrencies or NFTs.\"\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/steam-is-banning-games-with-nfts-and-cryptocurrency",
          "publishedOn": "2021-10-15T20:14:57.000Z",
          "wordCount": 882,
          "title": "Steam is banning games with NFTs and cryptocurrency"
        },
        {
          "id": "https://www.rockpapershotgun.com/lo-fi-adventure-chasing-static-is-now-out-with-some-classic-horror-puzzling",
          "author": "Lauren Morton",
          "description": "Chasing Static is both the name of this lo-fi Welsh horror story and also an accurate description of me attempting to track down a post about it on RPS. Someone's written about it. I just know it. Oh no, we've just mentioned it several times in a roundabout way. Well, I've finally pinned it down—chased the clues and cornered it now that it's launched and I can tell you a thing or two about it. Chasing Static is a swell and spooky story so far with a good chunk of classic horror game puzzling and just a bit of sudden scares. Come on and have a quick look.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/lo-fi-adventure-chasing-static-is-now-out-with-some-classic-horror-puzzling",
          "publishedOn": "2021-10-15T16:56:16.000Z",
          "wordCount": 940,
          "title": "Lo-fi adventure Chasing Static is now out with some classic horror puzzling"
        },
        {
          "id": "https://www.rockpapershotgun.com/ultimate-audio-bang-16-all-things-fps-merch",
          "author": "Ed Thorn",
          "description": "I've returned from my trip to the Lake District, with aching calves and a desire to talk about online shooters with Imogen. On this week's episode of the Ultimate Audio Bang, we don't chat sore muscles, instead, we focus on various Halloween events in games like Apex Legends and Rainbow Six: Siege, our thoughts on the Battlefield 2042 beta, Destiny 2 vaulting yet more stuff, and Call Of Duty: Vanguard finally introducing anti-cheat.\nRead more",
          "link": "https://www.rockpapershotgun.com/ultimate-audio-bang-16-all-things-fps-merch",
          "publishedOn": "2021-10-15T16:24:48.000Z",
          "wordCount": 832,
          "title": "Ultimate Audio Bang #16: all things FPS merch"
        },
        {
          "id": "https://www.rockpapershotgun.com/tfi-friday-three-indie-puzzle-games-with-slightly-melancholy-vibe",
          "author": "Alice Bell",
          "description": "The year has finally turned, reader. I am having discussions at home about putting the heating on. When I leave the office it isn't dark, but it's fuzzy around the edges. My knuckles are cold. It's the time of year, before the Skeleton War memes begin in earnest, to luxuriate in feeling a bit melancholy. It's healthy to feel sad sometimes, you know. Didn't you watch Inside Out? I did, and in my screening at the cinema a child called out \"Where's Bing Bong?\" when the heroic Bing Bong disappeared...\nThis week, I have collected three different puzzle games with very different vibes. I know I'm biased in favour of puzzle games more than the usual reader, but these ones are very good and worth a punt, and at least one should pique the old interest. And they all gave me that happy-sad feeling. Like, I want to wrap up in a blanket and play these games and maybe think about my granny a bit. That sort of feeling.\nRead more",
          "link": "https://www.rockpapershotgun.com/tfi-friday-three-indie-puzzle-games-with-slightly-melancholy-vibe",
          "publishedOn": "2021-10-15T15:45:00.000Z",
          "wordCount": 1515,
          "title": "TFI Friday: three indie puzzle games with slightly melancholy vibe"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-roblox-horror-games",
          "author": "Rebecca Jones",
          "description": "What are the best horror games in Roblox? It's October once again, so naturally our minds are turning to Halloween. There are so, so many horror games in the world to choose from, especially since it's a genre that lends itself so well to short indie offerings. What I'm getting at here is that there are tons of scary games on Roblox, and if you fancy giving some a go this spooky season, we've put together a list of all-time favourites and current big trends.\nYou might have seen \"scary corn game\" trending in Roblox circles recently, and if you're wondering why that is, it's because no-one can spell or pronounce Kalampokiphobia — the technical name for fear of corn. This game, which originally popped up on the platform earlier this year, looks set to be the big Roblox horror trend this Halloween, egged on by TikTok and YouTube jumpscare videos that have been doing the rounds. It's a pretty standard run-and-hide game with a truly ludicrous (but somehow still a bit creepy) stalker character pursuing you through a disorienting corn maze.\nHere's the link.\n Read more",
          "link": "https://www.rockpapershotgun.com/best-roblox-horror-games",
          "publishedOn": "2021-10-15T15:42:10.000Z",
          "wordCount": 1841,
          "title": "Best Roblox horror games: great scary games in Roblox"
        },
        {
          "id": "https://www.rockpapershotgun.com/mon-amour-is-the-most-crazed-loved-up-take-on-flappy-bird-youll-ever-see",
          "author": "Katharine Castle",
          "description": "It's been a banner week for Japanese indie game releases. First we had the delightful puzzle platformer ElecHead, now we have the latest from Onion Games, Mon Amour. It's a one-button score attack game in the same vein as Flappy Bird, only instead of piloting a dumpy chicken through a bunch of green pipes, here you're guiding a spinning, mustachioed man toward dozens of smoochable women. But before you arch that eyebrow at its somewhat questionable premise, yes, this is another entry from Onion Games where kissing saves the day, following in the esteemed footsteps of Chulip and Dandy Dungeon - and yes, it is every bit as mad and baffling (and exquisitely designed) as you'd expect.  \nRead more",
          "link": "https://www.rockpapershotgun.com/mon-amour-is-the-most-crazed-loved-up-take-on-flappy-bird-youll-ever-see",
          "publishedOn": "2021-10-15T15:38:35.000Z",
          "wordCount": 819,
          "title": "Mon Amour is the most crazed, loved up take on Flappy Bird you'll ever see"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-karlee",
          "author": "Hayden Hefford",
          "description": "Want to know the best build for Karlee in Back 4 Blood? Karlee isn’t one of the best characters in Back 4 Blood, but she still has some killer abilities that deserve a spot in your team. Most notably, Karlee can sense nearby hazards and Special Ridden, so you won’t be surprised when a Tallboy smashes around the corner. She also gets an extra quick inventory slot (used for defibrillators and stun guns) and increases the team’s use speed by 50%.\nThis guide will show you how to make the best Karlee build in Back 4 Blood, so you can stop staring at cards and start using them. Of course, you’ll need to unlock all the cleaners in Back 4 Blood before you can play as Karlee.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-karlee",
          "publishedOn": "2021-10-15T14:09:15.000Z",
          "wordCount": 1138,
          "title": "The best Back 4 Blood Karlee build"
        },
        {
          "id": "https://www.rockpapershotgun.com/song-of-farca-is-great-if-you-dont-take-it-personally",
          "author": "Sin Vega",
          "description": "Often a game can feel frustrating because you can't make decisions that you want to. I had this initially with Song Of Farca. It almost kept me from playing it further, until I came back at it with a different attitude instead, thanks to a few conversations I've had lately about player choice versus narrative.\nYou play as Izy Song, a hacking-based private investigator in a fictional, dystopian island in the near future. And she's kind of a fool.\nRead more",
          "link": "https://www.rockpapershotgun.com/song-of-farca-is-great-if-you-dont-take-it-personally",
          "publishedOn": "2021-10-15T14:00:00.000Z",
          "wordCount": 691,
          "title": "Song Of Farca is great if you don't take it personally"
        },
        {
          "id": "https://www.rockpapershotgun.com/far-cry-6-co-op-multiplayer",
          "author": "Ollie Toms",
          "description": "Want to know how to play Far Cry 6 in co-op multiplayer? Ubisoft's bombastic open-world FPS franchise is always best played with company. Double the players, double the devastation, after all. And Far Cry 6 has taken after its predecessors in offering players a couple of different ways to play the game in co-op. Whether you're looking for self-contained co-op missions or you want to play through the entire story with a friend, read on to find out how to set up Far Cry 6 for multiplayer.\nRead more",
          "link": "https://www.rockpapershotgun.com/far-cry-6-co-op-multiplayer",
          "publishedOn": "2021-10-15T13:57:47.000Z",
          "wordCount": 1266,
          "title": "How to play Far Cry 6 in co-op multiplayer mode"
        }
      ]
    },
    {
      "title": "Root.cz - články",
      "feedUrl": "https://www.root.cz/rss/clanky/",
      "siteUrl": "https://www.root.cz/clanky/",
      "articles": [
        {
          "id": "www.root.cz-text-15725",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Nové Ubuntu přináší jednu významnou evoluční změnu, GNOME 40. Jinak jde z velké části o poklidné vody připravující půdu pro příští vydání s dlouhou podporou. Současné novinky napovídají, kam se vývoj ubírá.",
          "link": "https://www.root.cz/clanky/ubuntu-21-10-impish-indri-posledni-verze-pred-velkym-dubnovym-lts/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-21T22:00:10.000Z",
          "wordCount": 1506,
          "title": "Ubuntu 21.10 „Impish Indri“: poslední verze před velkým dubnovým LTS",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/697/ubuntu-21-10-impish-indri-1.jpg",
            "length": "51850",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15722",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "Pro výuku programování se velmi často používají jazyky s grafickým výstupem. Výjimkou není ani Basic-256, který obsahuje grafickou plochu s podporou vykreslení běžných 2D entit, jednotlivých pixelů, ale i zobrazení pohyblivých spritů.",
          "link": "https://www.root.cz/clanky/zaklady-prace-s-grafickou-plochou-v-jazyku-basic-256/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-20T22:00:15.000Z",
          "wordCount": 5201,
          "title": "Základy práce s grafickou plochou v jazyku Basic-256",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/617/basic-256-1.jpg",
            "length": "43682",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15553",
          "author": "redakce@root.cz (Root.cz: Karel Kulhavý)",
          "description": "Softwarově změříme ostrost obrazu, abychom zjistili skutečné zvýšení rozlišení díky jeho použití. Matematiky možná potěší vlastní funkce Fourierovy transformace a centrální limitní věta.",
          "link": "https://www.root.cz/clanky/matematicke-mereni-rozliseni-softwarove-korigovaneho-dalekohledu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-20T22:00:10.000Z",
          "wordCount": 2509,
          "title": "Matematické měření rozlišení softwarově korigovaného dalekohledu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/426/dalekohled-1.jpg",
            "length": "42720",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15674",
          "author": "redakce@root.cz (Root.cz: Pavel Herout)",
          "description": "V poslední třetí části budou popisovány různé možnosti výsledného formátování výstupů, které dokáží výrazně ovlivnit logovanou informaci. Na závěr bude uveden realističtější příklad použití, ze které vyplynou možné kombinace.",
          "link": "https://www.root.cz/clanky/logovani-v-php-ruzne-moznosti-vysledneho-formatovani-vystupu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-19T22:00:10.000Z",
          "wordCount": 2379,
          "title": "Logování v PHP: různé možnosti výsledného formátování výstupů",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/516/php-1.jpg",
            "length": "42482",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15719",
          "author": "redakce@root.cz (Root.cz: Jiří Sluka)",
          "description": "Dnes si představíme platformu pro ladění mobilních aplikací, vyzkoušíme Visual Studio Code bez telemetrie, začneme používat Signal i mimo mobilní zařízení a nakonec navrhneme větrnou turbínu.",
          "link": "https://www.root.cz/clanky/softwarova-sklizen-20-10-2021/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-19T22:00:05.000Z",
          "wordCount": 913,
          "title": "Softwarová sklizeň (20. 10. 2021)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/root/368/kombajn-sklizen.jpg",
            "length": "394618",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15717",
          "author": "redakce@root.cz (Root.cz: Václav Steiner)",
          "description": "CZ.NIC se rozhodl, že obě IPv6 tunelovací technologie na zkoušku vypne 25. října 2021 na dobu 24 hodin. Pokud se nestane nic neočekávaného, budou servery definitivně vypnuty už 1. listopadu 2021. Proč k tomu dojde?",
          "link": "https://www.root.cz/clanky/cz-nic-zkusebne-vypne-tunelovaci-technologie-teredo-a-6to4-pro-ipv6/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-18T22:00:10.000Z",
          "wordCount": 1448,
          "title": "CZ.NIC zkušebně vypne tunelovací technologie Teredo a 6to4 pro IPv6",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/258/cervene-tlacitko-1.jpg",
            "length": "26088",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15718",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "Prozatím poslední moderní reinkarnací programovacího jazyka BASIC, s níž se seznámíme, je Basic-256. Opět se jedná o jazyk (a vývojové prostředí) určené primárně pro výuku programování, které navíc podporuje i práci s grafikou.",
          "link": "https://www.root.cz/clanky/basic-256-dalsi-moderni-reinkarnace-basicu-urcena-pro-vyuku-programovani/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-18T22:00:05.000Z",
          "wordCount": 5570,
          "title": "Basic-256: další moderní reinkarnace BASICu určená pro výuku programování",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/617/basic-256-1.jpg",
            "length": "43682",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15714",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Kódové jméno Ubuntu 22.04 LTS odhaleno. Vyšlo OpenBSD 7.0. Vznikl alternativní klient pro Snap, který umí pracovat i s repozitáři mimo Canonical. Společnost Pine64 zahájila předobjednávky pro svůj telefon PinePhone Pro.",
          "link": "https://www.root.cz/clanky/kodove-jmeno-ubuntu-22-04-lts-odhaleno-vyslo-openbsd-7-0/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-18T10:44:34.000Z",
          "wordCount": 1108,
          "title": "Kódové jméno Ubuntu 22.04 LTS odhaleno, vyšlo OpenBSD 7.0",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/67/jammy-jellyfish-1.jpg",
            "length": "27420",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15715",
          "author": "redakce@root.cz (Root.cz: CSIRT.CZ)",
          "description": "Dnes se podíváme na jemnou hodinářskou práci útočníků při získávání OTP hesel, koukneme se na nové povinnost provozovatelů informačních systémů a také na to, co můžeme čekat v oblasti kybernetické bezpečnosti od nové vlády.",
          "link": "https://www.root.cz/clanky/postrehy-z-bezpecnosti-co-odhalil-phishing-na-coinbase/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-17T22:00:10.000Z",
          "wordCount": 1969,
          "title": "Postřehy z bezpečnosti: co odhalil phishing na CoinBase",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/625/phishing-1.jpg",
            "length": "29162",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15716",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Ubuntu 21.10, nový referenční AV1 kodér, 25 let KDE a Plasma 5.23, nový linuxový smartphone PinePhone Pro, změny v systému aktualizací openSUSE Leap, Strawberry 1.0, fork Clementine běžící na Qt6.",
          "link": "https://www.root.cz/clanky/prvni-xbox-mel-mit-cpu-od-amd-apple-je-sponzorem-blenderu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-16T22:00:10.000Z",
          "wordCount": 1607,
          "title": "První Xbox měl mít CPU od AMD, Apple je sponzorem Blenderu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/219/strawberry-1-0-1.png",
            "length": "221821",
            "type": "image/png"
          }
        }
      ]
    },
    {
      "title": "Root.cz - zprávičky",
      "feedUrl": "https://www.root.cz/rss/zpravicky/",
      "siteUrl": "https://www.root.cz/zpravicky/",
      "articles": [
        {
          "id": "www.root.cz-actuality-42935",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Maxime Chevalier-Boisvertová představila v úterý just-in-time compiler pro Ruby s názvem YJIT, který používá Lazy Basic Block Versioning (LBBV). YJIT je průměrně o 23 % rychlejší než CRuby. Podle plánu by YJIT měl být v Ruby 3.1, jen nebude ve výchozím stavu zapnut.",
          "link": "https://www.root.cz/zpravicky/ruby-bude-mit-just-in-time-compiler-yjit/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-22T15:01:18.000Z",
          "wordCount": 777,
          "title": "Ruby bude mít just-in-time compiler YJIT",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/354/ruby-1.jpg",
            "length": "14828",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42934",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Bývalému prezidentovi USA Donaldu Trumpovi byl na konci volebního období zablokován účet na Twitteru i Facebooku kvůli útoku jeho příznivců na Kapitol. Donald si však vytvořil vlastní sociální síť TRUTH Social, která je v současné době pouze na pozvání a měla by být volně dostupná od příštího roku.",
          "link": "https://www.root.cz/zpravicky/nova-socialni-sit-truth-social-byvaleho-prezidenta-donalda-trumpa-porusuje-agpl/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-22T11:16:53.000Z",
          "wordCount": 2649,
          "title": "Nová sociální síť TRUTH Social bývalého prezidenta Donalda Trumpa porušuje AGPL",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/655/donald-trump-1.jpg",
            "length": "40937",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-40445",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Proxmox je moderní virtualizační platforma, která v mnoha případech může nahradit VMware. Je open-source, zdarma a je postaven na otevřených technologiích jako KVM, LXC, CEPH a dalších. Pokud potřebujete provozovat virtualizaci, Proxmox je pro vás ideální stack a na našem workshopu se dozvíte, jak na něj.",
          "link": "https://www.root.cz/zpravicky/proxmox-moderni-virtualizacni-platforma-schopna-nahradit-vmware-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-22T09:13:54.000Z",
          "wordCount": 767,
          "title": "Proxmox: moderní virtualizační platforma schopná nahradit VMware (online školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/638/proxmox-1.jpg",
            "length": "32887",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42933",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Před dvěma týdny jsme psali, že Windows 11 je až o 15 % pomalejší na procesorech AMD Ryzen. Včera Microsoft vydal opravu problému s časováním vyrovnávací paměti L3 u procesorů AMD Ryzen, která je součástí kumulativní preview opravy KB5006746.",
          "link": "https://www.root.cz/zpravicky/oprava-pomalejsich-procesoru-ryzen-ve-windows-11/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-22T08:26:38.000Z",
          "wordCount": 783,
          "title": "Oprava pomalejších procesorů Ryzen ve Windows 11",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/9/windows-11-1.jpg",
            "length": "41918",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42932",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Program GPSD se používá k obsluze GPS přijímačů v Linuxu a to nejen ke zjištění polohy, ale také k velmi přesné synchronizaci času. GPS formát data však má jen 10 bitů pro kódování týdne. To stačí jen na zhruba 20 let.",
          "link": "https://www.root.cz/zpravicky/chyba-v-gpsd-vas-muze-o-vikendu-prenest-do-brezna-2002/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-22T05:40:06.000Z",
          "wordCount": 1171,
          "title": "Chyba v GPSD vás může o víkendu přenést do března 2002",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/220/posun-casu-1.jpg",
            "length": "50077",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42931",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Dodavatelské řetězce jsou nestabilní a projevuje se to dlouhými lhůtami na dodávku součástek a narůstajícími cenami. Zasáhlo to také výrobce jednodeskových počítačů Raspberry Pi, který musel poprvé v historii zvýšit cenu modelu RPi 4 zpět z 35 na 45 dolarů. Eben Upton zdůrazňuje, že jde o dočasné zdražení.",
          "link": "https://www.root.cz/zpravicky/raspberry-pi-4-s-2-gb-pameti-docasne-zvysuje-cenu-z-35-na-45-dolaru/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-21T10:45:52.000Z",
          "wordCount": 1099,
          "title": "Raspberry Pi 4 s 2 GB paměti dočasně zvyšuje cenu z 35 na 45 dolarů",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/9/raspberry-pi-4-1.jpg",
            "length": "58435",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42930",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Nová verze webového prohlížeče Brave 1.31 je spojena s přechodem na vlastní vyhledávač jako výchozí – v USA, Kanadě a UK nahrazuje Google, ve Francii střídá Qwant, v Německu zase v Brave přecházejí z DuckDuckGo. Další země se budou přidávat postupně. Uživatelé samozřejmě mohou změnit na jakýkoli jiný a stávajícím uživatelům samozřejmě zůstává jejich nastavení. Brave Search má vlastní nezávislý index i engine, nesleduje uživatele ani jejich vyhledávání a kliknutí. V tuto chvíli nezobrazuje reklamy, ale v budoucnu bude reklamami podporován (plus bude možné používat Premium službu bez reklam).",
          "link": "https://www.root.cz/zpravicky/brave-1-31-s-brave-search-jako-vychozim-vyhledavacem/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-20T15:33:12.000Z",
          "wordCount": 1222,
          "title": "Brave 1.31 s Brave Search jako výchozím vyhledávačem",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/693/prohlizec-brave-1.jpg",
            "length": "36009",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42929",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Nový 5nm procesor Google Tensor, displej s 90Hz a HDR10+, sklo Gorilla Glass Victus, nová baterie foťáků s podporou 4k/60p videa či 30W nabíjení s USB PD a samozřejmě Android 12, to jsou v základu nové Pixely od Googlu.",
          "link": "https://www.root.cz/zpravicky/google-predstavil-telefony-pixel-6-a-pixel-6-pro-s-vlastnim-5nm-cipem-tensor/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-20T09:40:52.000Z",
          "wordCount": 3208,
          "title": "Google představil telefony Pixel 6 a Pixel 6 Pro s vlastním 5nm čipem Tensor",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/301/google-pixel-6-1.jpg",
            "length": "37354",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-39529",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Docker je dnes technologie, která proces vývoje, testování a provozování softwaru velmi zjednodušuje. Provozujte cokoliv a kdekoliv. Už nečekejte na nastavení svého serveru nebo na aktualizaci nějaké knihovny. Mějte prostředí jako součást vaší aplikace.",
          "link": "https://www.root.cz/zpravicky/naucte-se-pracovat-s-dockerem-a-kontejnery-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-20T08:13:05.000Z",
          "wordCount": 817,
          "title": "Naučte se pracovat s Dockerem a kontejnery (školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/666/docker-logo-1.jpg",
            "length": "23650",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42927",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Nosná téma meetupu: CI/CD & DevOps culture, 20.10.2021 od 18:00 do 20:00.",
          "link": "https://www.root.cz/zpravicky/24-stretnutie-komunity-cloud-native-kubernetes-online-1/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-20T08:00:32.000Z",
          "wordCount": 891,
          "title": "24. stretnutie komunity Cloud Native – Kubernetes online",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/275/kubernetes-1.jpg",
            "length": "25370",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42928",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Na světě je nová verze webového prohlížeče Google Chrome (a též Chromium). Mezi novinkami přináší jednodušší routování pomocí URLPattern přímo v prohlížeči, dále API Eye Dropper poskytující zabudovaný nástroj pro výběr barev. Další novinky nalezneme v origin trials (například user-agent reduction).",
          "link": "https://www.root.cz/zpravicky/chrome-95-prinasi-urlpattern-ci-api-eye-dropper/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-20T06:38:05.000Z",
          "wordCount": 822,
          "title": "Chrome 95 přináší URLPattern či API Eye Dropper",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/198/chromium-vs-chrome-1.jpg",
            "length": "60818",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42923",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Společnost Apple má mezi svými produkty v nabídce čisticí hadřík. Koupí získá zákazník produkt vhodný k očištění jakýchkoli displejů Apple, včetně těch s nanotexturou. Seznam kompatibilních produktů je velmi dlouhý a logo Apple na hadříku Apple velmi povedené a dojem dokonalého výrobku podtrhuje cenovka 590 Kč.",
          "link": "https://www.root.cz/zpravicky/apple-prodava-hadrik-za-590-kc/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-19T13:30:00.000Z",
          "wordCount": 6993,
          "title": "Apple prodává hadřík za 590 Kč",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/63/eugene-atget-1.jpg",
            "length": "74222",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42922",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Raspberry Pi představuje novou rozšiřující desku pro své minipočítače. Raspberry Pi Build HAT umožní připojit k Raspberry Pi snímače či motory systému LEGO Technics / LEGO Education SPIKE, resp. oblíbené stavebnice LEGO Mindstorms (a další s konektorem LPF2). Raspberry Pi navíc mezi produkty přidává potřebné příslušenství jak na poli hardwaru (napájecí 48W zdroj, který se postará i o napájení samotného Raspberry Pi), tak na poli softwaru (Python Build HAT).",
          "link": "https://www.root.cz/zpravicky/raspberry-pi-build-hat-propoji-malinu-s-lego-technics-mindstorms/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-19T12:54:48.000Z",
          "wordCount": 2193,
          "title": "Raspberry Pi Build HAT propojí malinu s LEGO Technics / Mindstorms",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/641/raspberry-pi-build-hat-1.jpg",
            "length": "80003",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42921",
          "author": "redakce@root.cz (Root.cz: Michal Smrž)",
          "description": "Valve v rámci zkonzolovatění Linuxu na Decku spustilo hodnocení her, jak zákazníkům na Decku poběží. Hodnocení zahrnuje následující varianty:",
          "link": "https://www.root.cz/zpravicky/steam-deck-verified-hodnoceni-bezproblemovosti-chodu-her/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-19T11:33:00.000Z",
          "wordCount": 766,
          "title": "Steam Deck Verified: hodnocení bezproblémovosti chodu her",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/92/steam-deck-1.jpg",
            "length": "39877",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42920",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Dva nové čipy pro své počítače představil Apple v souvislosti s novými Macbooky Pro. Firma navyšuje počet CPU i GPU jader a hovoří až o 70 % vyšším CPU výkonu oproti M1 a o 2× rychlejším GPU v M1 Pro, resp. 4× rychlejším v M1 Max. Jinými slovy: už tak rychlé a úsporné řešení jménem Apple M1 v nových Macboocích Pro bude značně rychlejší a nikdo nemůže ani vzdáleně hovořit o tom, že by bylo (z hlediska výkonu) lepší, kdyby s Apple vrátil k Intelu (což je mimochodem plán Pata Gelsingera).",
          "link": "https://www.root.cz/zpravicky/apple-predstavil-az-10jadrova-soc-m1-pro-a-m1-max/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-18T22:00:00.000Z",
          "wordCount": 6991,
          "title": "Apple představil až 10jádrová SoC M1 Pro a M1 Max",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/535/apple-m1-pro-max-1.png",
            "length": "280919",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42919",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Canon USA je žalován kvůli multifunkčním all-in-one tiskárnám PIXMA MG6320, MG5420 a MX860, které s prázdnými zásobníky inkoustu odmítají skenovat i když k tomu žádný inkoust potřeba není. Na problém si stěžovalo přes dva tisíce uživatelů, ale Canon jim odpověděl, že je potřeba vyměnit zásobník s inkoustem.",
          "link": "https://www.root.cz/zpravicky/zaloba-na-canon-protoze-nejde-skenovat-bez-inkoustu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-18T15:40:19.000Z",
          "wordCount": 5552,
          "title": "Žaloba na Canon: není možné skenovat bez inkoustu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/231/canon-pixma-mg6320.jpg",
            "length": "33616",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42918",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Ve čtvrtek Interplay Entertainment oznámil, že aktualizoval spoustu klasických her na Steamu, aby fungovaly v Linuxu a macOS. Většinou půjde o přidání DOSBoxu. V seznamu her od Inteplay uvidíte nově velké množství her spustitelných v Linuxu (logo Steam). Jde třeba o Battle Chess, Battle Chess II: Chinese Chess, Battle Chess 4000, Descent a Descent 2.",
          "link": "https://www.root.cz/zpravicky/interplay-aktualizoval-spoustu-klasickych-her-aby-fungovaly-v-linuxu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-18T13:43:50.000Z",
          "wordCount": 1223,
          "title": "Interplay aktualizoval spoustu klasických her, aby fungovaly v Linuxu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/357/descent-2-1.jpg",
            "length": "78569",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42917",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Obchod Google Play hlásí, že si oficiálního klienta Telegram stáhla více než miliarda uživatelů. Pavel Durov, zakladatel tohoto komunikačního nástroje, přitom na začátku letošního roku tvrdil, že jej měsíčně použije asi půl miliardy uživatelů. Překročení miliardového milníku bylo urychleno také nedávnými velkými výpadky Facebooku, které postihly také WhatsApp a Messenger a přivedly Telegramu desítky milionů nových uživatelů.",
          "link": "https://www.root.cz/zpravicky/telegram-dosahl-miliardy-stazeni-v-google-play/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-18T11:31:31.000Z",
          "wordCount": 1118,
          "title": "Telegram dosáhl miliardy stažení v Google Play",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/675/telegram-1.jpg",
            "length": "35220",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42916",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "WhatsApp přestane od 1. listopadu fungovat na Androidu 4.0.4 a starším. Ke svému běhu bude potřebovat alespoň Android 4.1.",
          "link": "https://www.root.cz/zpravicky/whatsapp-prestane-od-1-listopadu-fungovat-na-androidu-4-04-a-starsim/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-18T08:06:35.000Z",
          "wordCount": 1555,
          "title": "WhatsApp přestane od 1. listopadu fungovat na Androidu 4.0.4 a starším",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/564/whatsapp-1.jpg",
            "length": "53663",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42915",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "V rámci programu Artemis plánuje NASA návrat astronautů na Měsíc v roce 2024. Předtím bude na Měsíci vybudována síť LunaNet, která bude podobná jako WiFi s velkým počtem vysílačů. To umožní využívat také přesnou polohu a čas.",
          "link": "https://www.root.cz/zpravicky/mesic-bude-mit-svuj-internet-lunanet/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-18T06:11:28.000Z",
          "wordCount": 5020,
          "title": "Měsíc bude mít svůj internet LunaNet",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/28/nasa-astronaut-mesic-vlajka-1.jpg",
            "length": "63175",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42914",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Společnost PINE64 včera představila linuxový telefon PinePhone Pro, který je vylepšením původního PinePhone. Obsahuje SoC Rockchip RK3399S (2× A72 + 4× A53 na 1,5 GHz) a 4 GB RAM. Interní úložiště má 128 GB eMMC a je možné připojit SDCX kartu až do velikosti 2 TB.",
          "link": "https://www.root.cz/zpravicky/linuxovy-telefon-pinephone-pro/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-16T11:25:32.000Z",
          "wordCount": 2875,
          "title": "Linuxový telefon PinePhone Pro",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/682/pinephone-pro-1.jpg",
            "length": "16313",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42913",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Následující vydání oblíbené distribuce Ubuntu 22.04 LTS bude mít označení Jammy Jellyfish. Tedy šťastná medúza nebo také medúza marmeládové konzistence.",
          "link": "https://www.root.cz/zpravicky/ubuntu-22-04-lts-bude-jammy-jellyfish/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-16T10:57:59.000Z",
          "wordCount": 990,
          "title": "Ubuntu 22.04 LTS bude Jammy Jellyfish",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/52/meduza-1.jpg",
            "length": "36696",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42912",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Panel Self Refresh (PSR) je vlastnost DisplayPortu, která při statickém obrazu umožňuje snížení spotřeby. AMD konečně zapíná ve výchozím stavu PSR pro nové integrované grafické karty DCN v jádře 5.16.",
          "link": "https://www.root.cz/zpravicky/amd-konecne-zapina-ve-vychozim-stavu-panel-self-refresh-pro-nove-apu-v-jadre-5-16/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-15T12:29:18.000Z",
          "wordCount": 840,
          "title": "AMD konečně zapíná ve výchozím stavu Panel Self Refresh pro nové APU v jádře 5.16",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/654/amd-apu-1.jpg",
            "length": "20496",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42911",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Sysmon (system monitor) je nástroj od Sysinternals pro monitorování systémové aktivity a odhalení škodlivých programů. Včera Mark Russinovich z Microsoftu (je spoluzakladatel Sysinternals, který později Microsoft koupil) oznámil Sysmon pro Linux.",
          "link": "https://www.root.cz/zpravicky/microsoft-vydal-sysmon-pro-linux/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-15T12:04:00.000Z",
          "wordCount": 1599,
          "title": "Microsoft vydal Sysmon pro Linux",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/567/linux-windows-tux.png",
            "length": "121771",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42910",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Claude Schwarz ve středu zveřejnil výsledek extrémního přetaktování Raspberry Pi Compute Module 4 až na 3 GHz.  K dosažení takového výsledku bylo potřeba odstranit víčko SoC a nahradit vodivou pastu lepším tekutým kovem Thermal Grizzly Conductonaut (obsahuje galium, cín a indium).",
          "link": "https://www.root.cz/zpravicky/extremni-pretaktovani-raspberry-pi-cm-4-na-3-ghz/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-15T07:06:04.000Z",
          "wordCount": 1387,
          "title": "Extrémní přetaktování Raspberry Pi CM 4 na 3 GHz",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/673/raspberry-pi-compute-module-4-1.jpg",
            "length": "54007",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "abclinuxu - aktuální články",
      "feedUrl": "http://www.abclinuxu.cz/auto/abc.rss",
      "siteUrl": "http://www.abclinuxu.cz/clanky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-42-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-42-2021",
          "publishedOn": "2021-10-22T22:01:00.000Z",
          "wordCount": 2329,
          "title": "Událo se v týdnu 42/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-umela-inteligence-a-signaly-odmen",
          "author": "Redakce",
          "description": "Problém zpětnovazebného učení u skutečné umělé inteligence. Primordiální černé díry. Záhadné rádiové vlny. Nejchytřejší psi. Drony jako hasiči.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-umela-inteligence-a-signaly-odmen",
          "publishedOn": "2021-10-21T22:01:00.000Z",
          "wordCount": 1716,
          "title": "Týden na ScienceMag.cz: Umělá inteligence a signály odměn"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-roste-podil-softwaru-ktery-vyuziva-umelou-inteligenci",
          "author": "Redakce",
          "description": "Podzimní smršť novinek od Aceru. SentinelOne v ČR nabere 300 lidí a investuje miliardu. Roste podíl softwaru, který využívá umělou inteligenci. Dodávky a ceny osobních počítačů z pohledu výrobce. VMworld: Zabezpečení na principu nulové důvěry.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-roste-podil-softwaru-ktery-vyuziva-umelou-inteligenci",
          "publishedOn": "2021-10-17T22:01:00.000Z",
          "wordCount": 1456,
          "title": "Týden na ITBiz: Roste podíl softwaru, který využívá umělou inteligenci"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-umela-inteligence-v-kooperativnich-hrach",
          "author": "Redakce",
          "description": "Nový typ magnetismu nezpůsobují spiny. Beethovenovu slavnou 10. symfonii dokončila umělá inteligence  Studium neuronových sítí může pomoci při zkoumání toho, jak se do mozku ukládají konspirační teorie. Minirobot se pohybuje díky gradientům teploty. Splynutí obřích černých děr provázejí nejen gravitační vlny.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-umela-inteligence-v-kooperativnich-hrach",
          "publishedOn": "2021-10-16T22:01:00.000Z",
          "wordCount": 1702,
          "title": "Týden na ScienceMag.cz: Umělá inteligence v kooperativních hrách"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-41-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-41-2021",
          "publishedOn": "2021-10-15T22:01:00.000Z",
          "wordCount": 2567,
          "title": "Událo se v týdnu 41/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/goodoffer24-dozivotni-licence-windows-11-za-16-66-nebo-windows-10-za-pouhych-12-52",
          "author": "Reklama",
          "description": "Získejte doživotní licenci Windows 11 za pouhých 16,66  €, Windows 10 za pouhých 12,52  €. Opět jde o finančně velmi výhodnou nabídku prodejního portálu GoodOffer24.com, kde lze najít kromě nástrojů produktivity také hry, ale i další softwarové produkty.",
          "link": "http://www.abclinuxu.cz/clanky/goodoffer24-dozivotni-licence-windows-11-za-16-66-nebo-windows-10-za-pouhych-12-52",
          "publishedOn": "2021-10-15T14:00:00.000Z",
          "wordCount": 1377,
          "title": "GoodOffer24: Doživotní licence Windows 11 za 16,66  € nebo Windows 10 za pouhých 12,52  €"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/key-trainings-je-openshift-tou-spravnou-volbou",
          "author": "Reklama",
          "description": "OpenShift je platforma pro provoz kontejnerů ve firemním prostředí. Usnadňuje standardizaci provozu vašich aplikací a současně zjednodušuje provoz a zvyšuje bezpečnost a spolehlivost provozu. Umožňuje vám přidělit vybraná oprávnění např. dodavatelským firmám a mít tak pod kontrolou větší část nebo celý vývojový cyklus aplikací. Současně vám přináší jednotný způsob monitoringu a sběru logů.",
          "link": "http://www.abclinuxu.cz/clanky/key-trainings-je-openshift-tou-spravnou-volbou",
          "publishedOn": "2021-10-13T22:01:00.000Z",
          "wordCount": 1531,
          "title": "KEY Trainings: Je OpenShift tou správnou volbou?"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/distribucni-novinky-38-40-2021",
          "author": "Redakce",
          "description": "Babí léto přineslo aktualizace řady více či méně specializovaných distribucí: přechod na Debian 11 v projektech Emmabuntüs DE4 nejen pro vzdělávání, Q4OS také s desktopovým prostředím Trinity, stabilní obrazy PureOS firmy Purism, dále Redo Rescue pro práci s diskovými oddíly, pokračující experimenty v EasyOS a mezi tím vším občerstvení MidnightBSD, UBports, IPFire, Tails, Feren OS či Debianu.",
          "link": "http://www.abclinuxu.cz/clanky/distribucni-novinky-38-40-2021",
          "publishedOn": "2021-10-11T22:01:00.000Z",
          "wordCount": 1990,
          "title": "Distribuční novinky 38-40/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-budovani-kyberneticky-odolne-spolecnosti",
          "author": "Redakce",
          "description": "Problémy s Wi-Fi mohou ohrozit fungování českých firem. Technologické trendy pro finanční ředitele: hyperautomatizace a inteligentní komponovaný byznys. Od pilotního projektu k produkčnímu nasazení umělé inteligence. S evidencí vandalismu pomůže umělá inteligence, řešení bude hledat Atos Hackathon. Budování kyberneticky odolné společnosti. Tiskárny během lockdownů a poté (1) Dodávky.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-budovani-kyberneticky-odolne-spolecnosti",
          "publishedOn": "2021-10-10T14:00:00.000Z",
          "wordCount": 1550,
          "title": "Týden na ITBiz: Budování kyberneticky odolné společnosti"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-40-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-40-2021",
          "publishedOn": "2021-10-08T22:01:00.000Z",
          "wordCount": 2952,
          "title": "Událo se v týdnu 40/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-supravodive-hydridy-ceru",
          "author": "Redakce",
          "description": "Světy s oceány a atmosférou z vodíku. Těžba ve vesmíru s pomocí bakterií. Panspermie v měřítku celé galaxie. Umělá inteligence pro předpověď počasí. Vylepšená uhlíková vlákna.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-supravodive-hydridy-ceru",
          "publishedOn": "2021-10-08T14:00:00.000Z",
          "wordCount": 1688,
          "title": "Týden na ScienceMag.cz: Supravodivé hydridy ceru"
        }
      ]
    },
    {
      "title": "abclinuxu - čerstvé zprávičky",
      "feedUrl": "http://www.abclinuxu.cz/auto/zpravicky.rss",
      "siteUrl": "http://www.abclinuxu.cz/zpravicky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/zpravicky/rozsireni-visual-studio-code-language-support-for-java-tm-by-red-hat-dospelo-do-verze-1.0",
          "author": "Ladislav Hagara",
          "description": "Rozšíření Visual Studio Code \"Language Support for Java(TM) by Red Hat\" dospělo do verze 1.0. Přehled novinek s náhledy a videi v příspěvku na blogu.",
          "link": "http://www.abclinuxu.cz/zpravicky/rozsireni-visual-studio-code-language-support-for-java-tm-by-red-hat-dospelo-do-verze-1.0",
          "publishedOn": "2021-10-22T17:00:05.000Z",
          "wordCount": 1186,
          "title": "Rozšíření Visual Studio Code \"Language Support for Java(TM) by Red Hat\" dospělo do verze 1.0"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/fosdem-2022-probehne-online",
          "author": "Ladislav Hagara",
          "description": "Bylo oznámeno, že konference FOSDEM 2022 (Free and Open source Software Developers’ European Meeting) proběhne online o víkendu 5. a 6. února 2022.",
          "link": "http://www.abclinuxu.cz/zpravicky/fosdem-2022-probehne-online",
          "publishedOn": "2021-10-22T12:35:07.000Z",
          "wordCount": 864,
          "title": "FOSDEM 2022 proběhne online"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/rust-1.56.0-a-rust-2021",
          "author": "Ladislav Hagara",
          "description": "Byla vydána verze 1.56.0 programovacího jazyka Rust (Wikipedie). Současně byla edice Rust 2021 prohlášena za stabilní. Podrobnosti v poznámkách k vydání. Vyzkoušet Rust lze například na stránce Rust by Example.",
          "link": "http://www.abclinuxu.cz/zpravicky/rust-1.56.0-a-rust-2021",
          "publishedOn": "2021-10-21T22:57:25.000Z",
          "wordCount": 1175,
          "title": "Rust 1.56.0 a Rust 2021"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/klavesnice-dactyl-manuform-s-tvrdymi-ohebnymi-pcb",
          "author": "Fluttershy, yay!",
          "description": "Dactyl-Manuform (kombinace Dactyl a Manuform) je svého druhu populární typ ergonomické klávesnice. Existuje několik parametrických generátorů variant šasi pro 3D tisk, řada forků a dokonce několik drobných výrobců nabízí sady nebo již sestavené klávesnice: patří mezi ně např. Bastard Keyboards (dříve HID Technologies), jenž nyní zveřejnil schémata tvrdých ohebných PCB ([1] [2]) pod licencí Creative Commons BY-NC-SA 4.0. Oproti původnímu ručnímu drátování je to krok k více funkcím (podsvícené či hotswap spínače) a příp. sériové výrobě.",
          "link": "http://www.abclinuxu.cz/zpravicky/klavesnice-dactyl-manuform-s-tvrdymi-ohebnymi-pcb",
          "publishedOn": "2021-10-21T21:26:23.000Z",
          "wordCount": 950,
          "title": "Klávesnice Dactyl-Manuform s tvrdými ohebnými PCB"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/bezpecnostni-chyba-cve-2021-21703-v-php",
          "author": "Ladislav Hagara",
          "description": "V PHP byla nalezena bezpečnostní chyba CVE-2021-21703 zneužitelná k lokální eskalaci práv. Opravena je v upstream verzi 8.0.12.",
          "link": "http://www.abclinuxu.cz/zpravicky/bezpecnostni-chyba-cve-2021-21703-v-php",
          "publishedOn": "2021-10-21T14:52:04.000Z",
          "wordCount": 1082,
          "title": "Bezpečnostní chyba CVE-2021-21703 v PHP"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/krakensdr",
          "author": "Ladislav Hagara",
          "description": "Na Crowd Supply běží kampaň na podporu zařízení KrakenSDR s pěti přijímači RTL-SDR. Lze je používat nezávisle nebo současně jako radiozaměřovač nebo pasivní radar.",
          "link": "http://www.abclinuxu.cz/zpravicky/krakensdr",
          "publishedOn": "2021-10-21T12:05:09.000Z",
          "wordCount": 3428,
          "title": "KrakenSDR"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/sequoia-pgp-prelicencovana-z-gpl-2plus-na-lgpl-2plus",
          "author": "Ladislav Hagara",
          "description": "Implementace OpenPGP Sequoia PGP byla přelicencována z GPL 2+ na LGPL 2+. Vývojáři to zdůvodňují na dvou příkladech: Apple nepovoluje GPL software ve svém App Storu a problém s GPL má také Thunderbird.",
          "link": "http://www.abclinuxu.cz/zpravicky/sequoia-pgp-prelicencovana-z-gpl-2plus-na-lgpl-2plus",
          "publishedOn": "2021-10-21T08:48:30.000Z",
          "wordCount": 893,
          "title": "Sequoia PGP přelicencována z GPL 2+ na LGPL 2+"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/raspberry-pi-4-s-2-gb-ram-docasne-zdrazilo-z-35-na-45-dolaru",
          "author": "Ladislav Hagara",
          "description": "Problémy s výrobou a dodáváním má také Raspberry Pi. Raspberry Pi 4 s 2 GB RAM proto dočasně zdražilo z 35 na 45 dolarů.",
          "link": "http://www.abclinuxu.cz/zpravicky/raspberry-pi-4-s-2-gb-ram-docasne-zdrazilo-z-35-na-45-dolaru",
          "publishedOn": "2021-10-21T08:15:10.000Z",
          "wordCount": 1214,
          "title": "Raspberry Pi 4 s 2 GB RAM dočasně zdražilo z 35 na 45 dolarů"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/gimp-2.99.8",
          "author": "Ladislav Hagara",
          "description": "Byla vydána vývojová verze 2.99.8 svobodné aplikace pro úpravu a vytváření rastrové grafiky GIMP. Jedná se o další krok směrem k verzi 3 postavené na GTK 3. Přehled novinek i s náhledy v oznámení o vydání a v souboru NEWS na GitLabu. Stabilní verze je 2.10.28.",
          "link": "http://www.abclinuxu.cz/zpravicky/gimp-2.99.8",
          "publishedOn": "2021-10-21T07:16:23.000Z",
          "wordCount": 879,
          "title": "GIMP 2.99.8"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/ok-lenovo-musime-si-promluvit-zapisek-vyvojare-haiku",
          "author": "Fluttershy, yay!",
          "description": "Obsáhlý zápisek v blogu jednoho z vývojářů Haiku, svobodného operačního systému inspirovaného BeOS, popisuje nejen zkušenosti s notebookem Lenovo ThinkPad T510 a posléze W541, ale průběžně také rozvíjí úvahy o svobodném softwaru, právu na opravu (right to repair), (ne)zveřejňování specifikací hardwaru, dotýká se politiky podepisování distribučních klíčů nejen Secure Boot aj.",
          "link": "http://www.abclinuxu.cz/zpravicky/ok-lenovo-musime-si-promluvit-zapisek-vyvojare-haiku",
          "publishedOn": "2021-10-20T21:58:23.000Z",
          "wordCount": 1906,
          "title": "OK Lenovo, musíme si promluvit! (zápisek vývojáře Haiku)"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Wine-6.20-Released",
          "author": null,
          "description": "Wine 6.20 was released today as the latest bi-weekly development release of this open-source software for enjoying Windows games and applications on Linux and other platforms...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Wine-6.20-Released",
          "publishedOn": "2021-10-22T19:57:01.000Z",
          "wordCount": 820,
          "title": "Wine 6.20 Released With More Modules Switching To The PE Format"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=System76-ACPI-Linux-5.16",
          "author": null,
          "description": "Patches queued this week into the platform-drivers-x86 \"for-next\" branch ahead of the Linux 5.16 merge window will provide some useful improvements to System76 laptop owners...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=System76-ACPI-Linux-5.16",
          "publishedOn": "2021-10-22T19:14:53.000Z",
          "wordCount": 850,
          "title": "System76 Laptops To See Some Useful Improvements With Linux 5.16"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=PipeWire-0.3.39-Released",
          "author": null,
          "description": "PipeWire 0.3.39 was released on Thursday as the newest update to this audio/video stream solution for Linux systems that continues proving itself capable of replacing the roles of JACK and PulseAudio, among other use-cases...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=PipeWire-0.3.39-Released",
          "publishedOn": "2021-10-22T17:43:38.000Z",
          "wordCount": 818,
          "title": "PipeWire 0.3.39 Brings Libcamera Plugin Improvements, Better Compatibility For JACK Apps"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-AMX-Linux-Part-4",
          "author": null,
          "description": "While for many years we have been accustomed to seeing Intel land their new hardware feature enablement work in the Linux kernel and related components well ahead of products shipping, occasionally there are lapses due to various internal and external timings. The launch of Sapphire Rapids is quickly approaching and one of the major additions is Advanced Matrix Extensions with its Linux support still being in the works...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-AMX-Linux-Part-4",
          "publishedOn": "2021-10-22T13:07:44.000Z",
          "wordCount": 1180,
          "title": "Intel Posts The \"Last Part\" To Their AMX Bring-Up For Linux"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GCC-12.0-October-Zen-3-Perf",
          "author": null,
          "description": "GCC 12 isn't seeing its stable release until around March~April as usual, but with feature development slowly wrapping up as approaching the next stage of development next month to focus on fixes, recently I wrapped up some preliminary benchmarks for how GCC 12.0 is currently performing against GCC 11.2 on an AMD Ryzen 9 5950X (Zen 3) system...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GCC-12.0-October-Zen-3-Perf",
          "publishedOn": "2021-10-22T10:07:35.000Z",
          "wordCount": 1036,
          "title": "An Early Look At The GCC 12 Compiler Performance On AMD Zen 3"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=DXVK-Native-1.9.2a",
          "author": null,
          "description": "Valve continues embracing DXVK-Native for allowing more of their older games to target Vulkan by using this Direct3D-to-Vulkan translation layer for native games. DXVK-Native 1.9.2a is out with the latest fixes and improvements...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=DXVK-Native-1.9.2a",
          "publishedOn": "2021-10-22T09:16:13.000Z",
          "wordCount": 805,
          "title": "DXVK-Native 1.9.2a Released For Direct3D-Over-Vulkan With Native Games"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Linux-5.16-Multi-LRC-Exec",
          "author": null,
          "description": "Intel's \"parallel submission\" user-space API for their i915 kernel graphics driver has been queued into DRM-Next today ahead of the Linux 5.16 kernel cycle...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Linux-5.16-Multi-LRC-Exec",
          "publishedOn": "2021-10-22T06:00:00.000Z",
          "wordCount": 983,
          "title": "Intel Graphics Driver's New Parallel Submission uAPI Landing For Linux 5.16"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-Continues-Mesa-Cache",
          "author": null,
          "description": "A new Steam client beta is out with a few Linux enhancements worth noting...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-Continues-Mesa-Cache",
          "publishedOn": "2021-10-22T04:00:00.000Z",
          "wordCount": 823,
          "title": "Steam Continues Improving Its Shader Pre-Caching Support, Other Beta Improvements"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=SiFive-P550-Successor",
          "author": null,
          "description": "SiFive just shared word that at today's Linley Conference they teased their Performance P550 successor that will \"set a new standard for the highest efficiency RISC-V processor available.\"..",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=SiFive-P550-Successor",
          "publishedOn": "2021-10-21T22:42:59.000Z",
          "wordCount": 786,
          "title": "SiFive Has A New RISC-V Core To Improve Performance By 50%, Outperform Cortex-A78"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-21.10-New-Install-Try",
          "author": null,
          "description": "An effort going on for a while at Canonical has been to develop a new desktop installer for Ubuntu. With the recent Ubuntu 21.10 release they are still using their classic Ubiquity installer by default but have published a new preview build of Ubuntu 21.10 with their new desktop installer option. Here is a look at Ubuntu's forthcoming new installer...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-21.10-New-Install-Try",
          "publishedOn": "2021-10-21T19:15:35.000Z",
          "wordCount": 1139,
          "title": "Trying Out Ubuntu's New Flutter+Curtin-Powered Desktop Installer Was Disappointing"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Chrome-96-Beta",
          "author": null,
          "description": "Following this week's release of Chrome 95, Google has now promoted Chrome 96 to beta status...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Chrome-96-Beta",
          "publishedOn": "2021-10-21T18:37:45.000Z",
          "wordCount": 917,
          "title": "Chrome 96 Beta Begins Preparing For Chrome 100, Adds Priority Hints Feature"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=XWayland-21.1.3-RC",
          "author": null,
          "description": "The release candidate to XWayland 21.1.3 is out today with just a few changes but made significant by support for the NVIDIA 495 series driver GBM code path...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=XWayland-21.1.3-RC",
          "publishedOn": "2021-10-21T17:57:22.000Z",
          "wordCount": 811,
          "title": "XWayland 21.1.3 Nears With Support For NVIDIA 495 Driver's GBM"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30634",
          "author": null,
          "description": "It's been a half-year already since AMD introduced the EPYC 7003 \"Milan\" processors that continue performing well and gaining marketshare. While the recently released Ubuntu 21.10 is not a long-term support (LTS) release, for those wondering what this latest Linux distribution means for EPYC 7003 series performance, here is a look at its performance across many benchmarks against that of Ubuntu 21.04 that was released right after the Milan launch and then Ubuntu 20.04 as the current LTS stable series.",
          "link": "https://www.phoronix.com/vr.php?view=30634",
          "publishedOn": "2021-10-21T13:00:00.000Z",
          "wordCount": 1032,
          "title": "AMD EPYC 7003 \"Milan\" Performance On Ubuntu Linux Six Months After Launch"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Smart-Trace-Buffer-Linux",
          "author": null,
          "description": "AMD patches this month have begun preparing support for a new CPU feature called Smart Trace Buffer (STB)...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Smart-Trace-Buffer-Linux",
          "publishedOn": "2021-10-21T10:15:06.000Z",
          "wordCount": 958,
          "title": "AMD \"Smart Trace Buffer\" Feature Being Wired Up For Linux"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=V3DV-Vulkan-1.1",
          "author": null,
          "description": "Mesa's V3DV driver for supporting newer Broadcom VideoCore graphics hardware with Vulkan now is advertising v1.1 support. This Vulkan 1.1 support in V3DV is notable as the Raspberry Pi 4 and newer are the most notable beneficiaries of this driver...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=V3DV-Vulkan-1.1",
          "publishedOn": "2021-10-21T09:19:39.000Z",
          "wordCount": 852,
          "title": "V3DV Raspberry Pi Driver Now Exposes Vulkan 1.1"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Raspberry-Pi-Supply-Chain",
          "author": null,
          "description": "The ongoing supply chain issues across the semiconductor industry (and more broadly) are now impacting the Raspberry Pi operations for end-users/customers when it comes to pricing...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Raspberry-Pi-Supply-Chain",
          "publishedOn": "2021-10-21T05:00:00.000Z",
          "wordCount": 863,
          "title": "Raspberry Pi Sees Their First Price Increase Due To Supply Chain issues"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ruby-YJIT",
          "author": null,
          "description": "The Ruby programming language implementation has merged YJIT, its new just-in-time (JIT) compiler...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ruby-YJIT",
          "publishedOn": "2021-10-21T04:00:00.000Z",
          "wordCount": 821,
          "title": "Ruby Lands \"YJIT\" As A Speedy, In-Process JIT Compiler"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-CUDA-11.5",
          "author": null,
          "description": "NVIDIA has made available CUDA 11.5 today as the latest version of their popular but proprietary compute stack/platform. Notable with CUDA 11.5 is that CUDA-Python has reached general availability status...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-CUDA-11.5",
          "publishedOn": "2021-10-20T23:00:11.000Z",
          "wordCount": 859,
          "title": "CUDA-Python Reaches \"GA\" With NVIDIA CUDA 11.5 Release, __int128 Preview"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GIMP-2.99.8-Released",
          "author": null,
          "description": "GIMP 3.0 as the GTK3 port of this open-source Adobe Photoshop alternative has been talked about for nearly a decade now and the work remains ongoing. However, out today is GIMP 2.99.8 as the newest development snapshot...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GIMP-2.99.8-Released",
          "publishedOn": "2021-10-20T19:06:57.000Z",
          "wordCount": 899,
          "title": "GIMP 2.99.8 Released As Another Step Toward The Long Overdue GIMP 3.0"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-ControlFlag-Open-Source",
          "author": null,
          "description": "Last year Intel announced ControlFlag as a machine learning tool for helping to uncover bugs within code. ControlFlag promised impressive results after being trained on more than one billion lines of code and at the end of 2020 was already being used internally on Intel's code-bases from firmware to software applications. We hadn't heard anything more about ControlFlag this year... Until today. Intel has now made ControlFlag open-source for helping to autonomously detect more programming bugs...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-ControlFlag-Open-Source",
          "publishedOn": "2021-10-20T18:29:35.000Z",
          "wordCount": 815,
          "title": "Intel Makes ControlFlag Open-Source For Helping To Detect Bugs In Code"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Eclipse-OpenJ9-v0.29",
          "author": null,
          "description": "The newest feature release to Eclipse OpenJ9 is now available, the high performance Java Virtual Machine originating from IBM J9...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Eclipse-OpenJ9-v0.29",
          "publishedOn": "2021-10-20T18:00:33.000Z",
          "wordCount": 862,
          "title": "Eclipse OpenJ9 0.29 Released With Full AArch64 Linux Support, More Mature JITServer Tech"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30628",
          "author": null,
          "description": "Just one week ago was the public launch of the Radeon RX 6600 as the newest offering in the RDNA2 GPU line-up. While in our Radeon RX 6600 Linux review the performance was good on AMD's well regarded open-source driver stack and standing ground against the likes of the GeForce RTX 3060 with NVIDIA's proprietary Linux driver, it turns out the RX 6600 Linux performance can be even better already. Here are benchmarks of the Radeon RX 6600 on Linux across six different driver configurations.",
          "link": "https://www.phoronix.com/vr.php?view=30628",
          "publishedOn": "2021-10-20T13:09:03.000Z",
          "wordCount": 1099,
          "title": "Radeon RX 6600 Linux Performance Rising Even Higher With Newest Open-Source Driver"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.16-Apple-Magic-2021",
          "author": null,
          "description": "Separate from all the ongoing Apple Silicon/M1 bring-up work for the Linux kernel, the Linux 5.16 cycle is set to support this year's Apple Magic Keyboard...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.16-Apple-Magic-2021",
          "publishedOn": "2021-10-20T13:03:56.000Z",
          "wordCount": 881,
          "title": "Linux 5.16 To Support The 2021 Apple Magic Keyboard"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Apple-PCIe-For-Linux-5.16",
          "author": null,
          "description": "Queued this week into the Linux PCI subsystem's \"next\" branch is the Apple PCIe driver needed to enable PCI Express support for Apple SoCs such as the M1...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Apple-PCIe-For-Linux-5.16",
          "publishedOn": "2021-10-20T09:54:53.000Z",
          "wordCount": 798,
          "title": "Apple Silicon PCIe Driver Queued For Linux 5.16"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Intel-Buddy-Allocator",
          "author": null,
          "description": "Thanks to the nature of open-source, AMD engineers for the \"AMDGPU\" kernel graphics driver are looking to make use of Intel's new i915 buddy allocator code they introduced as part of all their video memory management changes as part of their discrete graphics bring-up...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Intel-Buddy-Allocator",
          "publishedOn": "2021-10-20T07:00:00.000Z",
          "wordCount": 1044,
          "title": "AMD GPU Driver Looks To Make Use Of Intel's New Buddy Allocator Code In The Linux Kernel"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Wii-U-Gamepad-Driver-v4",
          "author": null,
          "description": "It's been a half-year since talking about the Wii U gamepad driver that's been in development with mainline ambitions for supporting this wireless gamepad in conjunction with the Nintendo Wii U console. The driver has just been revised to address earlier code review comments, again renewing interest in the effort and possible mainlining in a future kernel version...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Wii-U-Gamepad-Driver-v4",
          "publishedOn": "2021-10-20T04:00:00.000Z",
          "wordCount": 882,
          "title": "Nintendo Wii U Gamepad Linux Driver Support Still Pursuing Mainline"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GraalVM-21.3-Released",
          "author": null,
          "description": "Oracle has published its latest quarterly update to GraalVM, the  open-source Java JVM/JDK implemented in Java that also supports other execution modes and programming languages from Python to R to Ruby...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GraalVM-21.3-Released",
          "publishedOn": "2021-10-19T23:17:07.000Z",
          "wordCount": 882,
          "title": "Oracle Releases GraalVM 21.3 With Java 17 Support, Other Enhancements"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Chrome-95-Released",
          "author": null,
          "description": "Chrome 95 has rolled out as stable today as the latest version of Google's web browser...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Chrome-95-Released",
          "publishedOn": "2021-10-19T19:06:38.000Z",
          "wordCount": 848,
          "title": "Chrome 95 Released With FTP Support Completely Removed, New Developer Additions"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=RadeonSI-Continues-Tuning-SPEC",
          "author": null,
          "description": "In recent months we have seen a lot of RadeonSI optimizations focused on SPECViewPerf with AMD seemingly trying to get this open-source OpenGL driver into very capable shape moving forward for workstation GL workloads. Hitting Mesa 22.0-devel today is yet another round of patches for tuning SPECViewPerf...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=RadeonSI-Continues-Tuning-SPEC",
          "publishedOn": "2021-10-19T18:49:24.000Z",
          "wordCount": 874,
          "title": "RadeonSI Lands Another \"Very Large\" Optimization To Further Boost SPECViewPerf"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Singh-CentOS-Steps-Down",
          "author": null,
          "description": "Karanbir Singh who had served as the CentOS Project Leader and involved with the community-based RHEL distribution since 2004 has stepped down from his roles...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Singh-CentOS-Steps-Down",
          "publishedOn": "2021-10-19T18:10:50.000Z",
          "wordCount": 716,
          "title": "CentOS Project Chair Karanbir Singh Steps Down"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30623",
          "author": null,
          "description": "Announced earlier this year for Google Cloud was a new family of virtual machines called Tau VMs. The initial T2D instances are powered by AMD EPYC 7003 \"Milan\" processors to deliver leading performance and are also positioned to deliver great value in going up against the likes of Amazon's Graviton2 instances. Tau VM instances are now available as a preview and Google has provided us with gratis access to the new instance types for benchmarking.",
          "link": "https://www.phoronix.com/vr.php?view=30623",
          "publishedOn": "2021-10-19T13:01:00.000Z",
          "wordCount": 1160,
          "title": "Google Cloud Tau VM Instances Deliver Better Performance, Price-Performance Than Graviton2 M6g"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=OpenCL-3.0.9-Extensions",
          "author": null,
          "description": "Last Friday night we spotted OpenCL 3.0.9 with several new extensions included. Today The Khronos Group is formally announcing these latest OpenCL additions focused on Vulkan interoperability as well as neural network inferencing...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=OpenCL-3.0.9-Extensions",
          "publishedOn": "2021-10-19T13:00:00.000Z",
          "wordCount": 900,
          "title": "Vendors Including NVIDIA Talk Up New OpenCL Extensions For Vulkan Interop, NN Inference"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/rss.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2532/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2532/",
          "publishedOn": "2021-10-22T04:00:00.000Z",
          "wordCount": 187,
          "title": "Censored Vaccine Card"
        },
        {
          "id": "https://xkcd.com/2531/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2531/",
          "publishedOn": "2021-10-20T04:00:00.000Z",
          "wordCount": 185,
          "title": "Dark Arts"
        },
        {
          "id": "https://xkcd.com/2530/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2530/",
          "publishedOn": "2021-10-18T04:00:00.000Z",
          "wordCount": 185,
          "title": "Clinical Trials"
        },
        {
          "id": "https://xkcd.com/2529/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2529/",
          "publishedOn": "2021-10-15T04:00:00.000Z",
          "wordCount": 187,
          "title": "Unsolved Math Problems"
        }
      ]
    }
  ],
  "cliVersion": "1.11.3"
}