{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": [
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.2",
          "author": null,
          "description": "Fixed: unicode characters in URL caused download error\nFixed: project root npm install error\nAdded: unit test library\nChore: Dependency updates\nThank you: @CaptNo1",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.2",
          "publishedOn": "2021-09-26T18:45:39.000Z",
          "wordCount": 354,
          "title": "v1.11.2"
        },
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "author": null,
          "description": "Fixed: Unexpected nested element in author field crashes the parser\nThank you @ad-m",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "publishedOn": "2021-09-16T06:39:32.000Z",
          "wordCount": 344,
          "title": "v1.11.1"
        }
      ]
    },
    {
      "title": "Kotaku",
      "feedUrl": "https://kotaku.com/rss",
      "siteUrl": "https://kotaku.com",
      "articles": [
        {
          "id": "1845008808",
          "author": "Brian Ashcraft",
          "description": "Today is World Sake Day. October 1 has traditionally been the start of the brewing season, and Japan marks the day as Nihonshu no Hi (日本酒の日) or, literally, “Sake Day.”\nRead more...",
          "link": "https://kotaku.com/how-to-get-into-japans-gift-to-the-world-sake-1845008808",
          "publishedOn": "2021-10-01T11:00:00.000Z",
          "wordCount": 2737,
          "title": "How To Get Into Japan's Gift To The World, Sake"
        },
        {
          "id": "1847780371",
          "author": "Brian Ashcraft",
          "description": "In 2005, Bandai and Namco merged, and the following year, Bandai Namco was born. To mark the new conglomerate, the company got a yellow, red, and orange logo with the company’s name in white font. It’s not a bad look, and stands out among Japanese game companies. But next year, Bandai Namco is getting a redesigned…\nRead more...",
          "link": "https://kotaku.com/bandai-namco-changed-its-logo-and-fans-think-it-kinda-s-1847780371",
          "publishedOn": "2021-10-01T10:00:00.000Z",
          "wordCount": 579,
          "title": "Bandai Namco Changed Its Logo And Fans Think It Kinda Sucks"
        },
        {
          "id": "1847778128",
          "author": "Isaiah Colbert",
          "description": "Today, in advance of the release of Battlefield 2042 this November, EA announced the Battlefield Community Charter, a set of guidelines developed with the stated aim of “ensuring Battlefield remains a welcoming experience that encourages Positive Play.” Positive Play is EA’s set of initiatives which aim to “help keep…\nRead more...",
          "link": "https://kotaku.com/ea-is-encouraging-gamers-to-stop-being-assholes-via-bat-1847778128",
          "publishedOn": "2021-09-30T21:15:00.000Z",
          "wordCount": 505,
          "title": "EA Is Encouraging Gamers To Stop Being Jerks Via Battlefield 2042"
        },
        {
          "id": "1847777988",
          "author": "Jeremy Winslow",
          "description": "Konami’s long-running football simulation series underwent a name change this year, going from PES to eFootball. But this rebranding didn’t cover up the development deficiencies, as evidenced by frustrated Steam fans who are sharing their frustrations for what many say is “the worst football game” ever released.\n\nRead more...",
          "link": "https://kotaku.com/konamis-efootball-is-steams-most-hated-game-right-now-1847777988",
          "publishedOn": "2021-09-30T20:50:00.000Z",
          "wordCount": 609,
          "title": "Konami's eFootball Is Steam's Most-Hated Game Right Now"
        },
        {
          "id": "1847777718",
          "author": "Sisi Jiang",
          "description": "I didn’t pay much attention to the anime fighting game Melty Blood: Type Lumina until just yesterday, when the developers made the official announcement that Saber, Fate/Stay Night protagonist and the “King of Knights” herself, would be joining the new game’s roster. After seeing her video gameplay debut, I…\nRead more...",
          "link": "https://kotaku.com/thank-you-melty-blood-for-adding-fate-stay-night-s-sabe-1847777718",
          "publishedOn": "2021-09-30T20:40:00.000Z",
          "wordCount": 686,
          "title": "Thank You Melty Blood For Adding Fate/Stay Night’s Saber, My Sword Wife"
        },
        {
          "id": "1847777778",
          "author": "Ethan Gach",
          "description": "Almost a year after the PS5 and Xbox Series X came out they’re still incredibly hard to find, and expensive, including at Amazon where the monopolistic retailer appears to be selling at least a few Microsoft consoles for roughly $1,000, or twice what they’re actually supposed to cost.\nRead more...",
          "link": "https://kotaku.com/amazon-is-selling-rare-xbox-series-xs-at-scalper-markup-1847777778",
          "publishedOn": "2021-09-30T20:20:00.000Z",
          "wordCount": 688,
          "title": "Amazon Is Selling Used Xbox Series Xs At Scalper Markup Prices"
        },
        {
          "id": "1847777358",
          "author": "Zack Zwiezen",
          "description": "I have a boring ritual. Every few weeks, I make sure to check out the Prime Gaming Rewards page to see what free games are available. Most of the time it’s nothing too exciting, maybe a few good, smaller games along with some totally forgettable things I’ll never play. But October is different. This time Amazon is…\nRead more...",
          "link": "https://kotaku.com/amazon-prime-s-free-games-for-october-are-shockingly-go-1847777358",
          "publishedOn": "2021-09-30T19:40:00.000Z",
          "wordCount": 569,
          "title": "Amazon Prime’s Free Games For October Are Shockingly Good"
        },
        {
          "id": "1847777090",
          "author": "Mike Fahey",
          "description": "One of the best things about massively multiplayer online role-playing games is that everyone gets to play their own way, using their personal experience to create a story that is uniquely their own. Right now, in Amazon’s New World, my character’s story is all about finding a steady source of salt so I can craft…\nRead more...",
          "link": "https://kotaku.com/two-days-with-new-world-amazon-s-extravagant-food-harv-1847777090",
          "publishedOn": "2021-09-30T19:30:00.000Z",
          "wordCount": 1581,
          "title": "Two Days With New World, Amazon’s Extravagant Food-Harvesting MMO"
        },
        {
          "id": "1847776313",
          "author": "Jeremy Winslow",
          "description": "It turns out that not only are the Five Nights at Freddy’s creator’s politics problematic, it sounds like he might also be a touch difficult to work with. The film based on the series has lost its director, possibly because Scott Cawthon has a “final cut” mentality to the movie-making process, whatever that means.\nRead more...",
          "link": "https://kotaku.com/fnaf-movie-loses-its-director-amid-struggles-to-please-1847776313",
          "publishedOn": "2021-09-30T18:15:00.000Z",
          "wordCount": 579,
          "title": "FNAF Movie Loses Its Director Amid Struggles To Please Scott Cawthon"
        },
        {
          "id": "1847775676",
          "author": "Isaiah Colbert",
          "description": "Christopher Judge, the voice actor for Kratos in 2018’s God of War, stated that a number of surgeries he required in 2019 resulted in God of War Ragnarok being delayed. In a short, heartwarming series of tweets, he expressed gratitude to Sony Santa Monica, the studio behind the game, for its unwavering support…\nRead more...",
          "link": "https://kotaku.com/kratos-actor-reveals-wholesome-reason-for-god-of-war-ra-1847775676",
          "publishedOn": "2021-09-30T17:15:00.000Z",
          "wordCount": 460,
          "title": "Kratos Actor Reveals Wholesome Reason For God Of War Ragnarok Delay"
        },
        {
          "id": "1847774934",
          "author": "Renata Price",
          "description": "Welcome to my mind palace. I was just playing the recent-ish fighting game Guilty Gear Strive, and couldn’t stop noticing how all of the character portraits look like Tinder profiles. So, of course, I have chosen to sit down and create my own tier list, based on how successful and/or good I think these characters…\nRead more...",
          "link": "https://kotaku.com/the-official-guilty-gear-strive-tinder-tier-list-1847774934",
          "publishedOn": "2021-09-30T17:00:00.000Z",
          "wordCount": 1378,
          "title": "The Official Guilty Gear Strive Tinder Tier List"
        },
        {
          "id": "1847774799",
          "author": "Ethan Gach",
          "description": "Bluepoint Games is joining the PlayStation family. For real this time. Three months after Sony let the news slip in a rapidly deleted tweet, the PS5 maker has made it official.\nRead more...",
          "link": "https://kotaku.com/sony-is-buying-the-remaster-powerhouse-behind-all-those-1847774799",
          "publishedOn": "2021-09-30T16:45:00.000Z",
          "wordCount": 520,
          "title": "Sony Is Buying The Remaster Powerhouse Behind All Those Rad Remakes"
        },
        {
          "id": "1847774767",
          "author": "Zack Zwiezen",
          "description": "Last month, we reported that Rockstar Games was planning to release a collection of remastered versions of some classic Grand Theft Auto titles later this year. Now it appears that the (still unofficially announced) collection has received an age rating in Korea. This lines up with new information Kotaku has heard…\nRead more...",
          "link": "https://kotaku.com/the-gta-remastered-trilogy-sure-seems-imminent-now-1847774767",
          "publishedOn": "2021-09-30T16:30:00.000Z",
          "wordCount": 615,
          "title": "The GTA Remastered Trilogy Sure Seems Imminent Now"
        },
        {
          "id": "1847774758",
          "author": "Ethan Gach",
          "description": "Bungie CEO Pete Parsons announced yesterday that the studio behind genre-defining franchises like Halo and Destiny would be getting rid of mandatory arbitration clauses in its developer contracts moving forward. The news comes as the anti-worker policies face renewed criticism across the games industry in light of a…\nRead more...",
          "link": "https://kotaku.com/destiny-2-maker-ditches-corporate-anti-worker-policy-1847774758",
          "publishedOn": "2021-09-30T16:15:00.000Z",
          "wordCount": 605,
          "title": "Destiny 2 Maker Ditches Corporate Anti-Worker Policy"
        },
        {
          "id": "1847774532",
          "author": "Max Jean-Louis",
          "description": "Avid Game Pass users know that new titles come and go on a weekly basis. We took the undertaking upon ourselves to play every new title on Game Pass this month, and three games really stood out from the rest. Check out the video above to see our picks for the best ways to make the most of your monthly subscription.\nRead more...",
          "link": "https://kotaku.com/the-best-new-games-to-hit-xbox-game-pass-in-september-2-1847774532",
          "publishedOn": "2021-09-30T16:00:00.000Z",
          "wordCount": 732,
          "title": "The Best New Games to Hit Xbox Game Pass in September 2021"
        },
        {
          "id": "1847774648",
          "author": "Sisi Jiang",
          "description": "Free-to-play game Genshin Impact made $2 billion on the Google Play and Apple App stores in its first year. That makes Genshin Impact the third most financially successful mobile game in the world, sitting comfortably behind Honor of Kings and PUBG Mobile. Excluding sales figures from China, Genshin Impact is the…\nRead more...",
          "link": "https://kotaku.com/genshin-impact-made-2-billion-in-a-year-1847774648",
          "publishedOn": "2021-09-30T15:45:00.000Z",
          "wordCount": 486,
          "title": "Genshin Impact Made $2 Billion In A Year"
        },
        {
          "id": "1847773671",
          "author": "Ethan Gach",
          "description": "“Too many games” season is officially upon us. I’ve been spending more time than usual looking at the video game release calendar lately and marveling at how many of them I’ll be playing on Switch. It’s rarely a bad (or normal) time to be a Nintendo fan, but fall 2021 is shaping up to be a lot better than I had…\nRead more...",
          "link": "https://kotaku.com/it-turns-out-the-nintendo-switch-s-fall-lineup-actually-1847773671",
          "publishedOn": "2021-09-30T14:00:00.000Z",
          "wordCount": 1065,
          "title": "It Turns Out The Nintendo Switch’s Fall Lineup Actually Looks Pretty Strong"
        },
        {
          "id": "1847773492",
          "author": "Brian Ashcraft",
          "description": "As Kotaku reported earlier this spring, Evangelion creator Hideaki Anno is writing and directing a new Kamen Rider feature film. It’s called Shin Kamen Rider, and the movie’s first teasers give us a good look at how Anno is bringing the character to life. \n\nRead more...",
          "link": "https://kotaku.com/first-look-at-hideaki-annos-kamen-rider-1847773492",
          "publishedOn": "2021-09-30T13:30:00.000Z",
          "wordCount": 451,
          "title": "First Look At Hideaki Anno's Kamen Rider"
        },
        {
          "id": "1847773091",
          "author": "Brian Ashcraft",
          "description": "Kurtis Lau Wai-kin, better known as “Toyz,” has been arrested in Taipei on suspicion of trafficking marijuana. In Taiwan, marijuana is a class 2 illegal drug, and it carries a severe prison sentence and heavy fines.\nWhile marijuana might be seen as a “soft” drug in the U.S., in Taiwan it’s classified alongside …\nRead more...",
          "link": "https://kotaku.com/league-of-legends-champ-arrested-on-suspicion-of-drug-t-1847773091",
          "publishedOn": "2021-09-30T11:00:00.000Z",
          "wordCount": 511,
          "title": "League of Legends Champ Arrested On Suspicion Of Drug Trafficking"
        },
        {
          "id": "1847772946",
          "author": "Brian Ashcraft",
          "description": "Giant-bug shoot’em-up game Earth Defense Force 6 has been delayed. Last summer, the PlayStation Blog announced that the game would go on sale in 2021. On Thursday, it was revealed that the game has been pushed back to 2022. \n\nRead more...",
          "link": "https://kotaku.com/earth-defense-force-6-delayed-to-2022-1847772946",
          "publishedOn": "2021-09-30T10:00:00.000Z",
          "wordCount": 575,
          "title": "Earth Defense Force 6 Delayed To 2022"
        },
        {
          "id": "1847772902",
          "author": "Brian Ashcraft",
          "description": "This 2021 Tokyo Game Show, like last year’s, is an online affair. There is a teeny tiny in-person area with miniscule booths. The public is not allowed in, and even Sony doesn’t have a booth. But you know who does? Ikea. \n\nRead more...",
          "link": "https://kotaku.com/ikea-is-serious-enough-to-attend-japans-biggest-gaming-1847772902",
          "publishedOn": "2021-09-30T09:30:00.000Z",
          "wordCount": 512,
          "title": "Ikea Is Serious Enough To Attend Japan's Biggest Gaming Expo"
        },
        {
          "id": "1847768613",
          "author": "Ian Walker",
          "description": "When King of Fighters XV comes to PlayStation 4, PlayStation 5, Xbox Series X/S, and PC on February 14, it’ll do so with a bevy of characters, including all four heroes from past sagas of the decades-long storyline, long-dead fighters revived by the events of the previous game, and a pair of very cool-looking…\nRead more...",
          "link": "https://kotaku.com/king-of-fighters-xv-director-dishes-on-the-series-new-1847768613",
          "publishedOn": "2021-09-30T04:50:00.000Z",
          "wordCount": 1051,
          "title": "King Of Fighters XV Director Dishes On The Series' New, Possibly Best Girl"
        },
        {
          "id": "1847771572",
          "author": "Jeremy Winslow",
          "description": "Following news that Activision Blizzard plans to settle the U.S. Equal Employment Opportunity Commission’s (EEOC) complaint for just $18 million, workers at a labor union say it doesn’t do enough to curb “corporate bad actors.”\nRead more...",
          "link": "https://kotaku.com/labor-union-suggests-18m-activision-blizzard-settlemen-1847771572",
          "publishedOn": "2021-09-29T23:40:00.000Z",
          "wordCount": 642,
          "title": "Labor Union Suggests $18M Activision Blizzard Settlement Akin To Pennies"
        },
        {
          "id": "1847771280",
          "author": "Ethan Gach",
          "description": "For years, reports have alleged that Nintendo is working on a more powerful Switch, and for years, it has yet to come true. Instead of releasing a Switch Pro with 4K graphics this year as was rumored, Nintendo announced in July it would simply take the current version and slap an OLED screen on it. So what happened to…\nRead more...",
          "link": "https://kotaku.com/report-games-in-the-works-for-4k-nintendo-console-that-1847771280",
          "publishedOn": "2021-09-29T22:50:00.000Z",
          "wordCount": 818,
          "title": "Report: Games In The Works For 4K Nintendo Console That Doesn't Officially Exist [Update]"
        },
        {
          "id": "1847770886",
          "author": "Isaiah Colbert",
          "description": "Not many hero’s journey games lean into the journey part occurring from the back seat of a convertible, where you talk about how you had a crush on your best friend while their partner drives, but then, Get in the Car, Loser! isn’t afraid to get awkward, while also gaying up the place with all the style and grace that…\nRead more...",
          "link": "https://kotaku.com/gay-road-trip-rpgs-are-a-thing-now-and-im-into-it-1847770886",
          "publishedOn": "2021-09-29T22:00:00.000Z",
          "wordCount": 1334,
          "title": "Gay Road Trip RPGs Are A Thing Now, And I'm Into It"
        }
      ]
    },
    {
      "title": "Nintendo Life | Latest Updates",
      "feedUrl": "https://www.nintendolife.com/feeds/latest",
      "siteUrl": "https://www.nintendolife.com/feeds/latest",
      "articles": [
        {
          "id": "https://www.nintendolife.com/#article-121699",
          "author": null,
          "description": "Just made public, the patent was first placed in March 2020.\nPatents are always a rather intriguing thing to track in the technology industry - sometimes they represent ideas and products that'll never see the light of day, but there are occasions when they give clues to future releases. A freshly released US patent application could be the latter, as it addresses technology that could allow Nintendo to boost visuals in its hardware.\nOpened on 25th March 2020 and released publicly yesterday (30th September), the application is titled 'systems and methods for machine learned image conversion', and though the initial language can be a headscratcher it is essentially an idea similar to NVIDIA's DLSS. That's short for Deep Learning Super Sampling in NVIDIA's case, which works on some of its GPUs to upscale image resolution and quality in real time, while also being remarkably efficient and ensuring that the graphics card is under less strain. It's impressive technology, and it's been front and centre in a lot of talk about how Nintendo could produce a new Switch-style portable device that outputs higher resolution visuals while still working with low power output. Digital Foundry has explored this in detail.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/patent_reveals_nintendo_is_working_on_upscaling_technology",
          "publishedOn": "2021-10-01T12:00:00.000Z",
          "wordCount": 1795,
          "title": "Patent Reveals Nintendo Is Working On Upscaling Technology"
        },
        {
          "id": "https://www.nintendolife.com/#article-121694",
          "author": null,
          "description": "Out this month!\nSquare Enix has wrapped up its live show at TGS, which was a pretty solid showing overall. It also unveiled a surprise new title called Dungeon Encounters, which is directed by Hiroyuki Ito and will feature the ATB (Active Time Battle) system that he pioneered for the Final Fantasy series. It's arriving very soon, too, with a 14th October release date for Switch eShop.\nAs you can see in the trailer it's going for a minimalist, grid-based approach to dungeon crawling. You explore and have to pay attention to hex-based numbers, with trial and error likely to be key to clearing each dungeon. it's not just battles that trigger events, either, as the official website states that every action and pick-up - such as visiting shops etc - will also be an 'event' on the map.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/square_enix_unveils_dungeon_encounters_directed_by_hiroyuki_ito",
          "publishedOn": "2021-10-01T11:15:00.000Z",
          "wordCount": 1431,
          "title": "Square Enix Unveils Dungeon Encounters, Directed By Hiroyuki Ito"
        },
        {
          "id": "https://www.nintendolife.com/#article-121692",
          "author": null,
          "description": "Fancy another look?\nWith Splatoon 3 still trapped in a slightly vague '2022' release window, it's hard to say just how long we'll be waiting to get our hands on it. To remedy that a little, we've been keeping track of the game's official screenshots so that we can gaze at them all wide-eyed, dreaming of the day where running around the Splatlands becomes a reality.\nIn the images below, you'll get a good close-up look at the game's story mode, as well as some of the key locations you'll be calling home. Some of the story mode screenshots, in particular, look very lovely indeed, so scroll down and give your eyeballs a treat.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/gallery_stunning_splatoon_3_screenshots_show_the_games_story_mode_and_key_locations",
          "publishedOn": "2021-10-01T11:00:00.000Z",
          "wordCount": 1326,
          "title": "Gallery: Stunning Splatoon 3 Screenshots Show The Game's Story Mode And Key Locations"
        },
        {
          "id": "https://www.nintendolife.com/#article-121688",
          "author": null,
          "description": "Featuring a story mode and competitive PvP.\nIf you're looking for a new speedrunning platformer challenge, Aeon Drive might be just the ticket.\nThe game dashed onto the Switch eShop yesterday, bringing 100 cyberpunk-themed levels of speedrunning madness along for the ride. The press release describes it as \"the ultimate action-packed challenge\", and while you might want to wait for our review to see if that really is the case, the gameplay shown in the trailer above certainly shows a lot of promise.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/cyberpunk_platformer_aeon_drive_brings_100_speedrunning_levels_to_switch_and_its_out_now",
          "publishedOn": "2021-10-01T10:15:00.000Z",
          "wordCount": 918,
          "title": "Cyberpunk Platformer 'Aeon Drive' Brings 100 Speedrunning Levels To Switch, And It's Out Now"
        },
        {
          "id": "https://www.nintendolife.com/#article-121686",
          "author": null,
          "description": "Key game updates on the way.\nTokyo Game Show is into its second day, and we're into our second stream from the show that will hopefully have a bit of Switch goodness in it. This time around it's Square Enix in the hotseat promising updates on its key games.\nIt kicks off at 3am PT / 6am ET / 11am BST / noon CEST, so if you're in Europe (or a very early riser in North America) settle down in a cozy seat and enjoy the show!\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/watch_square_enix_presents_tgs_2021_-_live",
          "publishedOn": "2021-10-01T09:40:00.000Z",
          "wordCount": 987,
          "title": "Watch: Square Enix Presents TGS 2021 - Live!"
        },
        {
          "id": "https://www.nintendolife.com/#article-121680",
          "author": null,
          "description": "And we've been doing the maths...\nAs you can imagine, we play an awful lot of games here at Nintendo Life – you should see some of the team's total playtime on games like Splatoon 2 and Zelda: Breath of the Wild – but even we can't come close to the total time put in by this fan.\nIf you head to your profile page from the Switch's main menu, you'll be greeted with a list of the games you've played recently and the total number of hours you've put in. You'll likely see numbers in the tens, or possibly the hundreds for your favourite titles, but Reddit user daveboy2000 claims to have reached the Switch's maximum play time counter limit in Animal Crossing: New Horizons.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/another_fan_claims_to_have_reached_nintendo_switchs_maximum_hour_count",
          "publishedOn": "2021-10-01T09:15:00.000Z",
          "wordCount": 2818,
          "title": "Another Fan Claims To Have Reached Nintendo Switch's Maximum Hour Count"
        },
        {
          "id": "https://www.nintendolife.com/#article-121676",
          "author": null,
          "description": "And it's out now!\nOne 3D action-platfomer that's well worth a look on the Switch is Blue Fire - we said it was a \"superb\" title that put gameplay first, and was inspired some of the greats.\nIf you still haven't played it, now might be the time - with the publisher Graffiti Games and developer Robi Studios announcing the release of the Void of Sorrows DLC update. It's an entirely \"free update\" and is available now on the Switch.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/the_superb_3d_action-platformer_blue_fire_just_got_a_free_dlc_expansion",
          "publishedOn": "2021-10-01T04:30:00.000Z",
          "wordCount": 996,
          "title": "The Superb 3D Action-Platformer Blue Fire Just Got A Free DLC Expansion"
        },
        {
          "id": "https://www.nintendolife.com/#article-121675",
          "author": null,
          "description": "The PC version arrives next January.\nAs you might have heard, Capcom's insanely successful Nintendo Switch title Monster Hunter Rise is coming to the PC in 2022. If you're interested in checking out this version but are worried about having to start the hunt again, then read on.\nFollowing on from the game's spotlight at this year's Tokyo Game Show, Capcom has shared a survey asking fans a series of personal questions and how they feel about the game. One question, in particular, that's got a lot of attention makes reference to cross-play, cross-saves and cross-progression.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/want_cross-play_and_cross-progression_in_monster_hunter_rise_let_capcom_know_in_this_survey",
          "publishedOn": "2021-10-01T03:30:00.000Z",
          "wordCount": 1656,
          "title": "Want Cross-Play And Cross-Progression In Monster Hunter Rise? Let Capcom Know In This Survey"
        },
        {
          "id": "https://www.nintendolife.com/#article-121674",
          "author": null,
          "description": "100 classic minigames return.\nOctober is set to be a busy month for Nintendo with the release of the Switch OLED model and Metroid Dread just the beginning of it. Towards the very end of October though, we've got the arrival of Mario Party Superstars - the second Mario Party game to be released on the Switch.\nThis title includes an all-star line-up of minigames from the N64, GameCube, Wii and Wii U generations. In fact, there's a total of 100 to play, along with a collection of classic boards. In the lead-up to this game's release, Nintendo's Japanese YouTube has published a new three-minute introduction video. Although there are no subtitles, it still provides a look at what to expect:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/video_check_out_this_introduction_trailer_for_mario_party_superstars_ahead_of_its_launch_this_month",
          "publishedOn": "2021-10-01T02:30:00.000Z",
          "wordCount": 1691,
          "title": "Video: Check Out This Introduction Trailer For Mario Party Superstars Ahead Of Its Launch This Month"
        },
        {
          "id": "https://www.nintendolife.com/#article-121673",
          "author": null,
          "description": "What do you think?\nEvery now and then, companies like to refresh, change and update their logos for marketing reasons, and the latest company to do this will be Japanese publisher and developer Bandai Namco - known for series such as PAC-MAN, Tekken and Tales.\nThe new logo will come into effect in April next year, and will replace the current logo - which expresses the \"fusion\" of Bandai and Namco. This new logo, apparently reflects the company's new purpose \"fun for all into the future\".\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/bandai_namco_is_changing_its_logo_in_2022",
          "publishedOn": "2021-10-01T01:30:00.000Z",
          "wordCount": 4366,
          "title": "Bandai Namco Is Changing Its Logo In 2022"
        },
        {
          "id": "https://www.nintendolife.com/#article-121672",
          "author": null,
          "description": "Download it today.\n\nAlongside all the Tokyo Game Show announcements, Capcom has now rolled out Monster Hunter Rise Version 3.4.1.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/monster_hunter_rise_version_3_4_1_is_now_live_here_are_the_full_patch_notes",
          "publishedOn": "2021-10-01T00:30:00.000Z",
          "wordCount": 1560,
          "title": "Monster Hunter Rise Version 3.4.1 Is Now Live, Here Are The Full Patch Notes"
        },
        {
          "id": "https://www.nintendolife.com/#article-121671",
          "author": null,
          "description": "Hideo Kojima slated to win \"Best Friend\".\nThe Game Awards are like nerd Christmas, and Geoff Keighley is Santa Claus. He's also the Easter Bunny and the Tooth Fairy, and he's replacing your dad, and the voice in your head, too. He's everywhere these days, after all: Summer Game Fest, Gamescom, that one THQ Nordic livestream, Death Stranding, and apparently The Muppets Haunted Mansion. Quite the busy chap.\nBut of course he's hosting The Game Awards, since that's his baby: the awards show that usually brings multiple game announcements, exclusives, and premieres to our screens every December.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/the_game_awards_2021_will_be_an_in-person_event_this_december",
          "publishedOn": "2021-09-30T20:30:00.000Z",
          "wordCount": 2021,
          "title": "The Game Awards 2021 Will Be An In-Person Event This December"
        },
        {
          "id": "https://www.nintendolife.com/#article-121667",
          "author": null,
          "description": "Hardware sales still lower than usual.\nFamitsu's Japanese chart figures are now in for the week ending 26th September, revealing that Dragon Ball Z: Kakarot + A New Power Awakens Set has entered the rankings in second spot.\nThe game sold an estimated 42,074 copies in its opening week in Japan, making it the highest-charting Switch game of the week. First place (and third, actually) went to Lost Judgment, with the PS4 version outselling its PS5 counterpart.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/japanese_charts_dragon_ball_z_debuts_in_second_as_switch_takes_seven_of_the_top_ten",
          "publishedOn": "2021-09-30T20:00:00.000Z",
          "wordCount": 1407,
          "title": "Japanese Charts: Dragon Ball Z Debuts In Second As Switch Takes Seven Of The Top Ten"
        },
        {
          "id": "https://www.nintendolife.com/#article-121191",
          "author": null,
          "description": "A pleasant trip down Memory Lane.\nThere are few characters in the world of anime more iconic than Goku, the Saiyan sent to Earth as a baby who eventually becomes one of the most powerful beings in the universe. His story has been told across almost every medium imaginable since his manga debut in 1984, including anime, video games, and the terrible live-action adaptation that we don’t speak of. The latest in a long line of video games based on Dragon Ball to hit consoles, Dragon Ball Z: Kakarot, has made its way to Switch.\nDragon Ball Z: Kakarot is mainly a love-letter to fans of the series. From the first moment that the iconic Japanese theme song starts through to some of the obscure characters who show up as you explore the world, this game is a nostalgia-fest for anime fans. Considering the long-standing voice actors for both the Japanese and English dubs reprise their roles here, it all feels familiar and comforting from the very beginning.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/reviews/nintendo-switch/dragon_ball_z_kakarot_plus_a_new_power_awakens_set",
          "publishedOn": "2021-09-30T19:00:00.000Z",
          "wordCount": 3294,
          "title": "Review: Dragon Ball Z: Kakarot + A New Power Awakens Set - An Iconic Story Retold Well"
        },
        {
          "id": "https://www.nintendolife.com/#article-121652",
          "author": null,
          "description": "Or lions, apparently.\nSonic's had one heck of a journey over the last 30 years, and while he and Mario are the best of buds these days with their regular Olympic outings, the two were the largest of rivals in the gaming industry once upon a time. It's that particular fact that makes this little discovery all the more interesting, though, and all the more bizarre.\nLet's be clear before we dive in – this isn't Mario appearing in the original Sonic the Hedgehog game. What it is, is a carving that looks uncannily like Mario, and we can't believe we haven't ever noticed it before.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/random_wait_a_sec_that_sure_looks_like_mario_in_sonic_the_hedgehogs_marble_zone",
          "publishedOn": "2021-09-30T18:00:00.000Z",
          "wordCount": 2409,
          "title": "Random: Wait A Sec, That Sure Looks Like Mario In Sonic The Hedgehog's Marble Zone"
        },
        {
          "id": "https://www.nintendolife.com/#article-120344",
          "author": null,
          "description": "Back up and play your Game Boy carts on PC.\nCasual readers would be forgiven for seeing the maker's name on the box of the GB Operator — a neat little device that lets you play your Game Boy, Game Boy Color and Game Boy Advance carts on your PC — and confusing the company with Analogue, the producer of such quality retro-playing consoles as the Analogue NT (SNES) and the upcoming Analogue Pocket (Game Boy).\nThe cheekily-named Epilogue is obviously hoping to align itself with the same brand of uncompromising quality Analogue is known for, and has adopted the slogan 'No compromises' for its Operator series. The Romanian company's first effort is a strong entry into the field of retro gaming, although it's a very different product to anything Analogue has produced, and one which may have limited appeal.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/hardware_review_gb_operator_lets_you_switch_between_game_boy_and_pc_with_ease",
          "publishedOn": "2021-09-30T17:00:00.000Z",
          "wordCount": 3901,
          "title": "Hardware Review: GB Operator Lets You Switch Between Game Boy And PC With Ease"
        },
        {
          "id": "https://www.nintendolife.com/#article-121662",
          "author": null,
          "description": "Also announces the return of a classic monster in Sunbreak expansion.\nYou may have been watching Capcom's Monster Hunter Showcase from Tokyo Game Show with us earlier, but if you weren't there are certainly a few Monster Hunter Rise updates that you need to know about.\nFirst up is a fun collaboration with Ghosts 'n Goblins Resurrection, which arrives on 29th October. It'll have an event quest in which you can earn the Arthur-inspired layered armour, and it'll even feature music from the tough platformer for good measure.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/capcom_confirms_monster_hunter_rise_collabs_with_ghosts_n_goblins_and_sonic",
          "publishedOn": "2021-09-30T16:00:00.000Z",
          "wordCount": 1838,
          "title": "Capcom Confirms Monster Hunter Rise Collabs With Ghosts 'n Goblins And Sonic"
        },
        {
          "id": "https://www.nintendolife.com/#article-121655",
          "author": null,
          "description": "Return to an apocalyptic planet Earth.\nDarksiders III is now available on Switch, meaning that the entire series is now available to play on Nintendo's hybrid console.\nAs you may already know, this new Switch edition of the game comes with both DLCs (Keepers of the Void and The Crucible) included, and is available to pick up both digitally on the eShop and physically at retail. It's a hack-n-slash action-adventure where players take on the role of Fury, the third of the Four Horsemen of the Apocalypse:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/darksiders_iii_is_out_on_switch_today_heres_the_launch_trailer",
          "publishedOn": "2021-09-30T15:30:00.000Z",
          "wordCount": 1990,
          "title": "Darksiders III Is Out On Switch Today, Here's The Launch Trailer"
        },
        {
          "id": "https://www.nintendolife.com/#article-121651",
          "author": null,
          "description": "Warning: Lots of images contained within!\nHere's a bit of Donkey Kong trivia for you, and no mistake.\nThe Donkey Kong Jungle Action Special was an officially licensed British comic based on Donkey Kong Country for the SNES and published in 1995 by Fleetway Editions. Richard Burton (no, not that one) is listed as the Managing Editor – comic fans might recognise his name from the British sci-fi comic 2000AD, as well as the successful UK publication Sonic the Comic, which was also published by Fleetway.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/check_out_this_forgotten_donkey_kong_country_comic_from_the_uk",
          "publishedOn": "2021-09-30T15:00:00.000Z",
          "wordCount": 1831,
          "title": "Check Out This Forgotten Donkey Kong Country Comic From The UK"
        },
        {
          "id": "https://www.nintendolife.com/#article-117555",
          "author": null,
          "description": "Super Monkey Ball Banana Mania! Astria Ascending! Nickelodeon All-Star Brawl!\nThe latest Nintendo Download update for North America has arrived, and it's bringing new games galore to the eShop in your region. As always, be sure to drop a vote in our poll and comment down below with your potential picks for the week. Enjoy!\nSwitch eShop - Highlights\nSuper Monkey Ball Banana Mania (SEGA, 5th Oct, $39.99) - Go bananas with your favorite monkey gang in the ultimate Super Monkey Ball adventure! Roll through wondrous worlds with AiAi and friends as you race to stop monkey mad scientist Dr. Bad-Boon from blowing up Jungle Island! Join the all-star monkey team of AiAi, MeeMee, GonGon, Baby, YanYan and Doctor as you bounce, tilt and roll your way across hundreds of delightfully crafted levels and mazes. It’s monkey business for the gang as you take down Dr. Bad-Boon and steal back your beloved bananas! Super Monkey Ball Banana Mania will be available on Oct. 5. - Read our Super Monkey Ball Banana Mania review\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/nintendo_download_30th_september_north_america",
          "publishedOn": "2021-09-30T14:35:00.000Z",
          "wordCount": 8317,
          "title": "Nintendo Download: 30th September (North America)"
        },
        {
          "id": "https://www.nintendolife.com/#article-121659",
          "author": null,
          "description": "With Switch-exclusive local multiplayer.\nPopular multiplayer party hit Gang Beasts will punch its way onto the Switch eShop on 7th October, it's been confirmed.\nThe Switch version comes packed with 21 stages and costume customisation, as well as online and local multiplayer – the latter of which is exclusive to Nintendo's platform. Gang Beasts was first revealed for Switch in August during an Indie World Showcase, but was actually being considered for a release on the platform all the way back in 2017, can you believe?\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/gang_beasts_gets_feisty_on_switch_next_week_physical_edition_also_confirmed",
          "publishedOn": "2021-09-30T14:20:00.000Z",
          "wordCount": 1230,
          "title": "Gang Beasts Gets Feisty On Switch Next Week, Physical Edition Also Confirmed"
        },
        {
          "id": "https://www.nintendolife.com/#article-119457",
          "author": null,
          "description": "Update: Korean rating confirms collection is coming.\nUpdate: A rating for 'Grand Theft Auto: The Trilogy – The Definitive Edition' has surfaced in Korea. No platforms are listed.\n\nOriginal Story : Ever since the Nintendo Switch launched plenty have hoped for some sort of Grand Theft Auto port on the system, with plenty wondering whether Grand Theft Auto V would make its way to the hybrid system. However, now Kotaku has shared a report suggesting another long-rumoured release is on the way to Switch and other systems.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/grand_theft_auto_trilogy_reportedly_heading_to_switch",
          "publishedOn": "2021-09-30T14:15:00.000Z",
          "wordCount": 9619,
          "title": "Grand Theft Auto Trilogy Reportedly Heading To Switch"
        },
        {
          "id": "https://www.nintendolife.com/#article-117744",
          "author": null,
          "description": "Update: More stock now available from My Nintendo Store UK.\n\nUpdate 30th September - My Nintendo Store UK now has more Switch OLED stock available for pre-order. If you've been waiting for a restock in the UK, now's the time to secure one for launch on Friday 8th Oct...\nUpdate 13th September - My Nintendo Store UK now has live OLED pre-order links, with hardware + game bundles including either Metroid Dread, Mario Golf: Super Rush, Zelda: Skyward Sword or Super Mario 3D World, plus a free Switch case.\nUpdate 6th September - UK retailer Argos has the white Switch OLED Model up for pre-order again. Just over a month to go!\nUpdate 11th August - UK retailer Argos currently has Switch OLED pre-orders available for the white model.\nUpdate 16th July - You can now place a pre-order at Amazon UK. Be quick!\nUpdate 15th July - Most North American pre-orders will go live today at 12pm PT / 3pm ET.\nUpdate 14th July - Very.co.uk has now gone live with their pre-order pages if you missed the other UK options.\nUpdate: 8th July - Amazon UK's product pages are now live, although you cannot place a pre-order at this time.\n\nThe lovingly titled Nintendo Switch (OLED model) has a very similar overall size to the Nintendo Switch console, but with a larger, vibrant 7-inch OLED screen with vivid colours and high contrast. It also features a wide adjustable stand for tabletop mode, a new dock with a wired LAN port for stable online play, 64GB of internal storage, and onboard speakers with enhanced audio for handheld and tabletop play.\n\nNintendo Switch OLED Model Vs. Standard Switch / Switch Lite: Full Tech Specs Comparison\n\nJust like the standard Nintendo Switch, Nintendo Switch (OLED model) allows users to play on the TV and share the detachable Joy-Con controllers for the familiar out-of-the-box multiplayer fun. The new Switch comes in two colours — a version with the standard Neon Red and Blue Joy-Con and a black LAN dock and a new variant with white Joy-Con and white LAN dock.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/guides/where-to-pre-order-nintendo-switch-oled-model",
          "publishedOn": "2021-09-30T14:10:00.000Z",
          "wordCount": 13449,
          "title": "Guide: Where To Pre-Order Nintendo Switch OLED Model"
        },
        {
          "id": "https://www.nintendolife.com/#article-121645",
          "author": null,
          "description": "Free update adds Japanese voiceover.\nUpdate:\nWe've been advised that the free update originally due today (30th September) has had a small delay to 7th October. That free update will now arrive alongside the paid DLC next week.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/children_of_morta_has_the_ancient_spirits_dlc_on_the_way_free_update_out_now",
          "publishedOn": "2021-09-30T14:00:00.000Z",
          "wordCount": 1045,
          "title": "Children Of Morta Has 'The Ancient Spirits' DLC On The Way, Free Update Out Now"
        },
        {
          "id": "https://www.nintendolife.com/#article-85135",
          "author": null,
          "description": "FIFA 22! Darksiders 3! Hot Wheels Unleashed!\nThe latest Nintendo Download update for Europe has arrived, and it's bringing new games galore to the eShop in your region. As always, be sure to drop a vote in our poll and comment down below with your potential picks for the week. Enjoy!\nSwitch Retail eShop - New Releases\nAgatha Christie - Hercule Poirot: The First Cases (Microids, 28th Sep, £34.99 / €39.99) - Discover an untold crime story from the mysterious youth of the famous detective Hercule Poirot. In his early years as a detective, Hercule Poirot is invited to a reception by the influential Van den Bosch family, for the announcement of their daughter’s engagement. But tensions amongst the guests run high as a snowstorm descends on the town, trapping everyone inside the manor. The happy event is soon marred by the murder of one of the guests… In the right place at the right time, Poirot immediately begins to investigate. What buried secrets and deadly rivalries will he uncover?\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/nintendo_download_30th_september_europe",
          "publishedOn": "2021-09-30T13:45:00.000Z",
          "wordCount": 5848,
          "title": "Nintendo Download: 30th September (Europe)"
        }
      ]
    },
    {
      "title": "Rock Paper Shotgun Latest Articles Feed",
      "feedUrl": "https://www.rockpapershotgun.com/feed",
      "siteUrl": "https://www.rockpapershotgun.com/feed",
      "articles": [
        {
          "id": "https://www.rockpapershotgun.com/new-world-transfer-character",
          "author": "Ollie Toms",
          "description": "Wondering how to transfer your character to a different server in New World? Amazon's titanic MMORPG New World is full to bursting with players across its various servers and realms, but as with all such games, some servers are going to be more preferable to certain players than others. Whether it's about dodging long wait times and lag, or just joining the same realm as your friends, most players want to know sooner or later about character transfers and how they work.\nRead on to find out how and when you can transfer your character over to another server in New World.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-transfer-character",
          "publishedOn": "2021-10-01T12:05:56.000Z",
          "wordCount": 977,
          "title": "How to transfer your character in New World"
        },
        {
          "id": "https://www.rockpapershotgun.com/square-enix-announce-dungeon-encounters-led-by-ff6-director",
          "author": "Alice O'Connor",
          "description": "Square Enix today announced new game Dungeon Encounters, and surprise, it's launching in only a fortnight.\r\nThe dungeon crawler is directed by Hiroyuki Ito, who directed Final Fantasy VI, IX, and XII, as well as creating the Active Time Battle system. Some other FF veterans are onboard too. But more important than all that is: along with all manner of warriors, possible party members include a giant cat named Sir Cat, a dog holding a sword in its mouth, and a hamster. Yes, thanks.\nRead more",
          "link": "https://www.rockpapershotgun.com/square-enix-announce-dungeon-encounters-led-by-ff6-director",
          "publishedOn": "2021-10-01T12:01:43.000Z",
          "wordCount": 800,
          "title": "Square Enix announce Dungeon Encounters, led by FF6 director"
        },
        {
          "id": "https://www.rockpapershotgun.com/dream-cycle-is-a-strange-blend-of-skyrim-and-dishonored-with-big-potential",
          "author": "Ed Thorn",
          "description": "Action adventure Dream Cycle certainly feels like an early access game. Animations are stiff, the audio mix is a bit funky, and it doesn't really have a save system yet. But look past the jank and I reckon there's a bright future ahead of Cathuria Games' latest. The studio was set up by Toby Gard, one of the folks who helped create Lara Croft, the tomb-raiding OG, so there's adventure pedigree at the helm, even if Dream Cycle bears no real resemblance to Tomb Raider. However, if you're into Skyrim and Dishonored, I'd definitely urge you to keep an eye on its progress.\nRead more",
          "link": "https://www.rockpapershotgun.com/dream-cycle-is-a-strange-blend-of-skyrim-and-dishonored-with-big-potential",
          "publishedOn": "2021-10-01T12:00:00.000Z",
          "wordCount": 1284,
          "title": "Dream Cycle is a strange blend of Skyrim and Dishonored with big potential"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-name-change",
          "author": "Ollie Toms",
          "description": "Want to know if you can change your name in New World? It's a common tale of woe among MMO players: your ideal name is already taken, so you have to settle for an inferior moniker. Then later you realise that it just doesn't sit right and you need a name name to strike fear into the hearts of your enemies. But can it be done? Find out whether you can rename your character in New World below.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-name-change",
          "publishedOn": "2021-10-01T11:41:55.000Z",
          "wordCount": 967,
          "title": "Can you change your name in New World?"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-afk-timer",
          "author": "Rebecca Jones",
          "description": "How long is New World's AFK timer? Amazon's gigantic new MMO New World has had quite a launch week — with players reporting hours-long queue times before they can even set foot on the island of Aeternum — and we've not even had the first weekend yet. Amazon have promised more and bigger servers to handle the demand, which they say will begin rolling out within the next two weeks.\n Read more",
          "link": "https://www.rockpapershotgun.com/new-world-afk-timer",
          "publishedOn": "2021-10-01T11:30:23.000Z",
          "wordCount": 981,
          "title": "New World AFK timer: how long can you remain inactive before getting kicked?"
        },
        {
          "id": "https://www.rockpapershotgun.com/stranger-of-paradise-final-fantasy-origin-is-coming-march-18th",
          "author": "Alice O'Connor",
          "description": "Square Enix today announced a release date of March 18th, 2022 for Stranger Of Paradise Final Fantasy Origin, the curious action-RPG spin-off made by the studio behind Nioh, Team Ninja. A new trailer is here too and I have to say it looks more Final Fantasy-y and less less ha-ha-hilariously edgy than June's announcement trailer. It still looks plenty edgy, mind: watch out for the poor wee cactrot which gets... turned into a blood crystal and exploded?\nRead more",
          "link": "https://www.rockpapershotgun.com/stranger-of-paradise-final-fantasy-origin-is-coming-march-18th",
          "publishedOn": "2021-10-01T11:20:46.000Z",
          "wordCount": 765,
          "title": "Stranger Of Paradise Final Fantasy Origin is coming March 18th"
        },
        {
          "id": "https://www.rockpapershotgun.com/destiny-2-will-add-full-auto-as-an-accessibility-option",
          "author": "Alice O'Connor",
          "description": "To fire some of Destiny 2's guns at their fastest possible rate, you need to click six times per second. This sucks. This especially sucks if you have physical issues which impede rapid clicking. Honestly, with these semi-auto weapon archetypes I've often looked for rolls with the Full Auto Trigger System perk to spare my hands. So it's grand to hear from Bungie's new accessibility initiative that yep, they're planning to add some sort of accessibility option enabling automatic fire. In some way.\nRead more",
          "link": "https://www.rockpapershotgun.com/destiny-2-will-add-full-auto-as-an-accessibility-option",
          "publishedOn": "2021-10-01T10:43:34.000Z",
          "wordCount": 1164,
          "title": "Destiny 2 will add full-auto as an accessibility option"
        },
        {
          "id": "https://www.rockpapershotgun.com/genshin-impact-house-serenitea-pot",
          "author": "Amelia Zollner",
          "description": "Wondering how to get a house in Genshin Impact? Genshin Impact’s Serenitea Pot system grants you the ability to decorate your own realm with characters, furniture, plants, rocks, and even pets. Some players have carefully crafted gardens with elegantly decorated houses. Other players have simply used their teapots to trap Venti in an empty room filled with animals — whatever you want to do with your house, we can’t judge.\nWhether you haven’t unlocked the housing system yet or you’re looking for ways to improve your Serenitea Pot, this guide will show you everything you need, including unlocking housing, placing characters, choosing a layout, getting furniture, and increasing your Trust Rank and Adeptal Energy. \nRead more",
          "link": "https://www.rockpapershotgun.com/genshin-impact-house-serenitea-pot",
          "publishedOn": "2021-10-01T09:57:01.000Z",
          "wordCount": 2461,
          "title": "How to get a house in Genshin Impact: Serenitea Pot system explained"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-10-best-songs-in-pc-games",
          "author": "Brendan Caldwell",
          "description": "Not just the best songs. These are the best songs performed by characters in-game. In other words, if it's not sung by a fictional band, hollered by a karaoke-obsessed protagonist, or purred by a honey-tongued vocalist who also shoots at you with a ridiculous firearm, then it doesn't count. For this reason, in-game radios are also out. It's too easy, video games. Sorry. That means no rock station classics from Grand Theft Auto and no 80s bangers from Metal Gear Solid V. Learn to accept it. The best music is diegetic, baby. \nRead more",
          "link": "https://www.rockpapershotgun.com/the-10-best-songs-in-pc-games",
          "publishedOn": "2021-10-01T09:30:00.000Z",
          "wordCount": 1637,
          "title": "The 10 best songs in PC games"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-save-progress",
          "author": "Hayden Hefford",
          "description": "Want to know how to save in New World? MMOs can be complicated beasts, and you could easily spend hours just mining iron or strolling along the shores of Aeternum in New World. The last thing you’d want is that time to be wasted by failing to save your game.\nThis guide will tell you how to save your game in New World, so that you don’t need to feel unsure about whether all your progress will be waiting for you next time you log on.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-save-progress",
          "publishedOn": "2021-10-01T08:49:45.000Z",
          "wordCount": 883,
          "title": "How to save your progress in New World"
        },
        {
          "id": "https://www.rockpapershotgun.com/impostor-factory-aka-to-the-moon-3-is-out-now",
          "author": "Graham Smith",
          "description": "Impostor Factory has been described repeatedly by developer Kan Gao as \"To The Moon 3(?)\", complete with paranthetical question mark. Whatever the reality in terms of its plot, it definitely forms a trio in terms of theme and tone, closing out the series with another melancholy, pixelated adventure. It's out now.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/impostor-factory-aka-to-the-moon-3-is-out-now",
          "publishedOn": "2021-09-30T22:46:42.000Z",
          "wordCount": 767,
          "title": "Impostor Factory (aka To The Moon 3) is out now"
        },
        {
          "id": "https://www.rockpapershotgun.com/a-lot-of-you-are-petting-the-pets-in-crusader-kings-3",
          "author": "Graham Smith",
          "description": "1240 Pepsi Max cans quaffed. 30 Toffee Crisps swallowed. 600 sneezes sneezed. These are the stats of my past year. Crusader Kings 3's past year offers bigger numbers.\r\n\nTo celebrate the kingdom sim's first year of release, Paradox have put out a set of in-game stats, which includes: 18 million marriages, 334 million children, and \"4 million pets petted.\"\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/a-lot-of-you-are-petting-the-pets-in-crusader-kings-3",
          "publishedOn": "2021-09-30T22:01:17.000Z",
          "wordCount": 766,
          "title": "A lot of you are petting the pets in Crusader Kings 3"
        },
        {
          "id": "https://www.rockpapershotgun.com/monster-hunter-rise-will-launch-on-pc-january-12-with-a-demo-due-next-month",
          "author": "Graham Smith",
          "description": "Monster Hunter Rise is the sixth mainline game in Capcom's series about biffing majestic beasts and turning them into fetching headgear. It released on Switch earlier this year, and we've known all along that it was coming to PC eventually. Now it has a specific release date: January 12th, 2022.\r\n\nBetter yet, it's getting a demo, and it'll be available on October 13th.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/monster-hunter-rise-will-launch-on-pc-january-12-with-a-demo-due-next-month",
          "publishedOn": "2021-09-30T21:28:45.000Z",
          "wordCount": 784,
          "title": "Monster Hunter Rise will launch on PC January 12, with a demo due next month"
        },
        {
          "id": "https://www.rockpapershotgun.com/efootball-2022-is-now-the-worst-rated-game-on-steam",
          "author": "Graham Smith",
          "description": "eFootball 2022 is now the worst rated game on Steam, less than a day after release. Konami's free-to-play 'football platform' was announced earlier this year as the successor to PES, with a barebones launch planned to be expanded in perpetuity with optional DLC. Yet even accepting its relatively thin amount of content, players are sharing screenshots of terrible faces, broken animations, and plenty of bugs.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/efootball-2022-is-now-the-worst-rated-game-on-steam",
          "publishedOn": "2021-09-30T20:52:47.000Z",
          "wordCount": 886,
          "title": "eFootball 2022 is now the worst rated game on Steam"
        },
        {
          "id": "https://www.rockpapershotgun.com/humbles-square-enix-sale-offers-up-to-85-off-nier-final-fantasy-and-more",
          "author": "Will Judd",
          "description": "Square Enix, or Sqix to its close friends, is having a bloody great sale over at the Humble store. The discounts are up to 85% off, and include the likes of Nier, Final Fantasy, Dragon Quest and more. \nRead more",
          "link": "https://www.rockpapershotgun.com/humbles-square-enix-sale-offers-up-to-85-off-nier-final-fantasy-and-more",
          "publishedOn": "2021-09-30T20:49:27.000Z",
          "wordCount": 833,
          "title": "Humble's Square Enix sale offers up to 85% off Nier, Final Fantasy and more"
        },
        {
          "id": "https://www.rockpapershotgun.com/this-1tb-samsung-ssd-is-82-at-ebuyer-with-far-cry-6-free",
          "author": "Will Judd",
          "description": "The Samsung 870 Qvo is our pick for 'the best big SATA SSD for gaming', as it's a reasonably fast SATA SSD that is also much cheaper than its competitors. Today, it's retailing for just £82 at CCL, who are also offering a free copy of Far Cry 6 (a £50 value) with the drive. I reckon that's a strong offer, but let me tell you more about the 870 Qvo!\nRead more",
          "link": "https://www.rockpapershotgun.com/this-1tb-samsung-ssd-is-82-at-ebuyer-with-far-cry-6-free",
          "publishedOn": "2021-09-30T20:27:11.000Z",
          "wordCount": 874,
          "title": "This 1TB Samsung SSD is £82 at Ebuyer with Far Cry 6 free"
        },
        {
          "id": "https://www.rockpapershotgun.com/europa-universalis-iv-is-free-to-keep-on-epic-right-now",
          "author": "Alice O'Connor",
          "description": "Tick tock it's free game o'clock, with Paradox's Europa Universalis IV now becoming the latest freebie on the Epic Games Store for the next week. The historical grand strategy game puts you in charge of a nation from the middle ages through to early modernity, charting a course through countless economic, political, military, and religious crises. EU4 is eight years old but still a good'un, and Paradox are still updating it with expansions and patches.\nRead more",
          "link": "https://www.rockpapershotgun.com/europa-universalis-iv-is-free-to-keep-on-epic-right-now",
          "publishedOn": "2021-09-30T16:04:34.000Z",
          "wordCount": 764,
          "title": "Europa Universalis IV is free to keep on Epic right now"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-twitch-drops",
          "author": "Rebecca Jones",
          "description": "How do you claim Twitch Drops in New World, and can you still claim the Golden Rage armor? Twitch is an Amazon-owned platform and New World is a game developed by Amazon, so it's absolutely unsurprising that there's some crossover in the form of New World Twitch Drops.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-twitch-drops",
          "publishedOn": "2021-09-30T15:47:12.000Z",
          "wordCount": 1429,
          "title": "New World Twitch Drops: can you still claim the Golden Rage armor?"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-electronic-wireless-show-podcast-episode-158-the-best-spaceships-in-games-special",
          "author": "Alice Bell",
          "description": "In honour of the new DLC for Outer Wilds, this week on The Electronic Wireless Show Podcast we're discussing our favourite spaceships in games. In the process, while we do discuss some games, there is quite a lot of chat about the origin of the spaceship as 'space-house' - the hub area where all your pals hang out - both in games and in wider space media. Also, Nate has a great Cavern Of Lies that is Star Wars themed, and does indeed give us a terrible fright.\nDigressions this week are a big discussion on Matthew's tooth situation, and a semi-argument about what planetary circumstances would be enough for me to agree to go into space (e.g. planet covered in really nice soup). Also: is Elon Musk's divorce the origin story for Warhammer 40k?\nRead more",
          "link": "https://www.rockpapershotgun.com/the-electronic-wireless-show-podcast-episode-158-the-best-spaceships-in-games-special",
          "publishedOn": "2021-09-30T15:12:42.000Z",
          "wordCount": 852,
          "title": "EWS podcast episode 158: the best spaceships special"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-iron-fae-iron",
          "author": "Hayden Hefford",
          "description": "Want to know how to get iron ore in New World? Crafting is very important in New World, as it is in most MMOs. If you want to make new weapons or armour for your character, you’ll probably end up needing some iron ore pretty soon.\nThis guide will walk you through everything that you need to know about Iron in New World, including how to get iron ore and what you can use iron ore to make.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-iron-fae-iron",
          "publishedOn": "2021-09-30T15:03:59.000Z",
          "wordCount": 1172,
          "title": "How to get Iron and Fae Iron in New World"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-new-world-armor",
          "author": "Rebecca Jones",
          "description": "What is the best armor in New World, and how do you craft it? New World is a game all about war and conquest, so naturally armor plays a large role and should be one of your first considerations when choosing your character's loadout. Fortunately, armor is abundant on Aeternum. Unfortunately, that can make it very difficult to decide what pieces to equip, especially as the game doesn't waste a lot of time explaining it to you. But luckily, that's what this New World armor guide is for.\nRead more",
          "link": "https://www.rockpapershotgun.com/best-new-world-armor",
          "publishedOn": "2021-09-30T14:40:56.000Z",
          "wordCount": 1346,
          "title": "Best New World armor: New World's armor types explained"
        },
        {
          "id": "https://www.rockpapershotgun.com/twitch-fights-hate-raids-with-options-to-require-phone-verification-for-chat",
          "author": "Alice O'Connor",
          "description": "Twitch yesterday launched new moderation options which let hosts restrict chat to people who have verified their account by tying it to a phone number, hopefully helping fight the plague of 'hate raids'. Frustrations with the livestreaming platform's ineffectual response to harrassment recently came to a head with the #ADayOffTwitch campaign, when many streamers and viewers skipped Twitch for one day. The new (optional) options are fairly nuanced, and should help channels control marauding hordes of bots and dickheads without keeping chat fully locked down.\nRead more",
          "link": "https://www.rockpapershotgun.com/twitch-fights-hate-raids-with-options-to-require-phone-verification-for-chat",
          "publishedOn": "2021-09-30T14:06:09.000Z",
          "wordCount": 1165,
          "title": "Twitch fights 'hate raids' with options to require phone verification for chat"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-eternal-cylinder-review",
          "author": "Jim Rossignol",
          "description": "Deep in the endless sediment of the ancient, fossilised internet, it is possible to find signs of an interview in which I spoke to ACE Team about their weird beat ‘em up sequel, Zeno Clash 2. Company founder Carlos Bordeu finished up that interview by saying: “aesthetic choices have been intentionally made to make our game stand out from the mass of traditional fantasy games that continue to mimic each other”. I feel that it’s probably fair to say that these choices have continued to be made almost a decade later, with Bordeu now the game director of The Eternal Cylinder, a game about a giant cylinder.\r\n\n\r\nBut is it really about a giant cylinder? And what do such esoteric choices add up to in this latest Ace Team venture into the unfamiliar? Let’s find out.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-eternal-cylinder-review",
          "publishedOn": "2021-09-30T14:00:00.000Z",
          "wordCount": 2095,
          "title": "The Eternal Cylinder review: an outlandish, delightful, and surprisingly approachable survival adventure"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-top-10-games-on-pc-in-october-2021",
          "author": "Colm Ahern",
          "description": "After a few lean months over the last year, we’re really in it now. So, I hope you’ve done all your book-reading, TV-watching, and music-listening, because the next four weeks is just wall-to-wall video games. \nRead more",
          "link": "https://www.rockpapershotgun.com/the-top-10-games-on-pc-in-october-2021",
          "publishedOn": "2021-09-30T13:30:00.000Z",
          "wordCount": 2413,
          "title": "The top 10 games on PC in October"
        },
        {
          "id": "https://www.rockpapershotgun.com/here-are-some-tokyo-game-show-schedule-highlights-for-this-week",
          "author": "Imogen Beckhelling",
          "description": "The Tokyo Game Show 2021 has begun, and from today it'll have a bunch of announceathons from the likes of Square Enix, Capcom, Ubisoft and more stretching over the weekend. Like most other games events this year, TGS is a digital affair, streaming good game stuff to your screens via YouTube and Twitch. There's a heck of a lot on too, so I've had a look through the official programs and gathered some highlights right here. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/here-are-some-tokyo-game-show-schedule-highlights-for-this-week",
          "publishedOn": "2021-09-30T13:15:47.000Z",
          "wordCount": 1066,
          "title": "Here are some Tokyo Game Show schedule highlights for this week"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-to-install-a-cpu",
          "author": "James Archer",
          "description": "With Intel’s Alder Lake chips breathing down our necks (or are already here, if you’re reading this in 2022 or whatever), now seems like an opportune time for a refresher on how to install a CPU. And yes, AMD, you can come too.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/how-to-install-a-cpu",
          "publishedOn": "2021-09-30T13:07:05.000Z",
          "wordCount": 1780,
          "title": "How to install a CPU"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-turkeys",
          "author": "Hayden Hefford",
          "description": "Want to find Turkey locations in New World? Turkeys roam the world of Aeternum, gobbling as they trot around various areas. Though they are rather cute to watch, Turkeys are the main way to get feathers, poultry, and eggs in New World, making them quite important.\nThis guide will walk you through everything that you need to find and skin Turkeys in New World, so that you can save time searching for them and get on with completing quests for your faction.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-turkeys",
          "publishedOn": "2021-09-30T11:33:00.000Z",
          "wordCount": 1125,
          "title": "How to find Turkey locations and get Feathers in New World"
        },
        {
          "id": "https://www.rockpapershotgun.com/while-you-queued-new-world-players-were-being-absolute-weirdos",
          "author": "Imogen Beckhelling",
          "description": "New World is out, and that's exciting. It's been ages since we've seen a big new MMORPG, which is possibly why thousands upon thousands of you have sat in endless queues trying to get into overloaded servers. But would you like to know what players have been doing while you waited? They've been wiggling around on the floor like budget Human Centipedes.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/while-you-queued-new-world-players-were-being-absolute-weirdos",
          "publishedOn": "2021-09-30T10:19:05.000Z",
          "wordCount": 937,
          "title": "While you queued, New World players were being absolute weirdos"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-opens-more-servers-planning-to-enlarge-servers-too",
          "author": "Alice O'Connor",
          "description": "Amazon's sandbox MMO New World instantly become one of the most-played games on Steam when it launched this week (briefly the most), and some of those 700,000 'players' even made it through the server queues to actually play. The devs have been scrambling to meet demand ever since and continue to open new servers, in the past 24 hours opening over 100 new New World worlds. They're also exploring the possibility of increasing the capacity of individual servers.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-opens-more-servers-planning-to-enlarge-servers-too",
          "publishedOn": "2021-09-30T09:31:19.000Z",
          "wordCount": 847,
          "title": "New World opens more servers, planning to enlarge servers too"
        },
        {
          "id": "https://www.rockpapershotgun.com/rogue-lords-review-a-compelling-roguelike-where-cheaters-prosper-for-a-while",
          "author": "Matt Cox",
          "description": "Fighting against Satan must be miserable. You think you’ve got one of his minions cornered and then bam, down (up?) comes the hand of evil incarnate. Schwoop, Evil says, as he waves away most of your priest’s health bar. Pffft, he scoffs, as he flicks a shield from your bounty hunter to his succubus. Pop, he mouths, as he recharges Bloody Mary’s stabbing skill and sends her in for the kill. If this sounds unfair, that’s because it is - though fortunately, you’re not actually that side of the pentagram. Rogue Lords is a roguelike where the rules and UI elements are old Nick’s playthings, and you’re the lucky devil in charge of all his toys. \r\n\n\r\nOf course, that doesn’t wind up mattering nearly as much as you think it might.\nRead more",
          "link": "https://www.rockpapershotgun.com/rogue-lords-review-a-compelling-roguelike-where-cheaters-prosper-for-a-while",
          "publishedOn": "2021-09-30T09:00:00.000Z",
          "wordCount": 2026,
          "title": "Rogue Lords review: a compelling roguelike where cheaters prosper - for a while"
        },
        {
          "id": "https://www.rockpapershotgun.com/chess-plus-cards-roguelike-pawnbarian-has-launched-its-shiny-new-version",
          "author": "Lauren Morton",
          "description": "When you double down and then triple down on strategy, Pawnbarian must be pure essence that emerges. This tactical dungeon crawler throws chess on top of a roguelike plus some cards just for fun. Despite the undeniably deep strategic potential, it really is quick and breezy to pick up if you remember how chess pieces move. You can take your turn with it in its demo or pick up the shiny new release that its developer has whipped up to build on its former free browser version.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/chess-plus-cards-roguelike-pawnbarian-has-launched-its-shiny-new-version",
          "publishedOn": "2021-09-29T22:21:00.000Z",
          "wordCount": 861,
          "title": "Chess plus cards roguelike Pawnbarian has launched its shiny new version"
        },
        {
          "id": "https://www.rockpapershotgun.com/rfm-is-a-retro-future-tactical-roguelite-with-a-demo-this-weekend",
          "author": "Lauren Morton",
          "description": "This stylish retro-future strategy game has you diving into real-time tactical battles as an inter-dimensional mercenary. It's quite a looker, with a very chill, retro synth soundtrack to match. Don't let that get you too relaxed though, it looks like these battles may get a bit hectic as you dive deeper. RFM is looking to launch sometime next year, but you'll also be able to take it for a spin in the upcoming Steam Next Fest that kicks off this Friday.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/rfm-is-a-retro-future-tactical-roguelite-with-a-demo-this-weekend",
          "publishedOn": "2021-09-29T20:52:59.000Z",
          "wordCount": 775,
          "title": "RFM is a retro-future tactical roguelite with a demo this weekend"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-an-rps-recommended-razer-gaming-chair-for-155-off",
          "author": "Will Judd",
          "description": "The Razer Iskur is a rather excellent gaming chair if you're a relatively tall person or a normal-sized cat - or at least so says Katharine in her review. This premium chair normally retails for £500, but today Ebuyer have discounted it to £345, and they're also throwing in a pair of Razer peripherals to sweeten the deal. \nRead more",
          "link": "https://www.rockpapershotgun.com/get-an-rps-recommended-razer-gaming-chair-for-155-off",
          "publishedOn": "2021-09-29T20:20:43.000Z",
          "wordCount": 870,
          "title": "Get an RPS-recommended Razer gaming chair for £155 off"
        },
        {
          "id": "https://www.rockpapershotgun.com/this-high-spec-3400mbs-crucial-ssd-is-going-cheap-78-for-1tb",
          "author": "Will Judd",
          "description": "The Crucial P5 is a high-end PCIe 3.0 SSD, capable of read speeds up to 3400MB/s - about four to five times faster than your average SATA SSD. It's normally around £100 for a 1TB model, but today it's been heavily discounted at Ebuyer via Ebay - you can pay just £78 to take this new SSD home. \nRead more",
          "link": "https://www.rockpapershotgun.com/this-high-spec-3400mbs-crucial-ssd-is-going-cheap-78-for-1tb",
          "publishedOn": "2021-09-29T20:02:08.000Z",
          "wordCount": 815,
          "title": "This high-spec 3400MB/s Crucial SSD is going cheap: £78 for 1TB"
        },
        {
          "id": "https://www.rockpapershotgun.com/correction-you-can-be-jeff-bezos-in-new-world-sort-of",
          "author": "Lauren Morton",
          "description": "As is ever the case in starting a new MMO, picking a character name can be tough. Not least because naming things is hard, but also because some words are on the no-no list. In Amazon's MMO New World, that includes most versions of attempting to name your character after Amazon's founder. As Graham found out yesterday, you can't be Jeff Bezos in New World. Well, not exactly, anyway. You can be close to Jeff Bezos, depending on how far you're willing to stretch his name. At least one player—though I suspect there are hundreds more—has successfully bent the rules and landed in Aeternum as a knockoff Jeff.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/correction-you-can-be-jeff-bezos-in-new-world-sort-of",
          "publishedOn": "2021-09-29T19:39:13.000Z",
          "wordCount": 921,
          "title": "Correction: you can be Jeff Bezos in New World, sort of"
        },
        {
          "id": "https://www.rockpapershotgun.com/halo-infinite-is-letting-in-non-insiders-for-this-weekends-big-team-battle-beta",
          "author": "Lauren Morton",
          "description": "This weekend's Halo Infinite beta is bigger than before, both in player invites going out and in the matches you'll tackle. Registered Halo Insiders have been getting their hands on with Halo Infinite's multiplayer in 343's recent beta tests and now this weekend you can too. Well, maybe, provided you can pester a friend invite code out of a pal of yours who's already an Insider. If you find yourself queued up to play, you'll be participating in those chaotic 12v12 spartan matches Friday through Sunday. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/halo-infinite-is-letting-in-non-insiders-for-this-weekends-big-team-battle-beta",
          "publishedOn": "2021-09-29T17:58:59.000Z",
          "wordCount": 1024,
          "title": "Halo Infinite is letting in non-Insiders for this weekend's big team battle beta"
        },
        {
          "id": "https://www.rockpapershotgun.com/this-is-what-peak-dark-souls-fitness-looks-like",
          "author": "Ed Thorn",
          "description": "Lots of people are excited for Elden Ring. You're excited for Elden Ring, I'm excited for Elden Ring, all the old folks down at your local Spoons at 10am? Yes, this is the game they contemplate over a remarkably early cold one.\nThis is nothing, though. This is a terrible level of excitement in comparison to abusaad3, who is more up for Elden Ring than anyone on this planet. To prove it, they're doing a no-hit boss challenge each day in Dark Souls 3 until Elden Ring is released. This is phenomenal levels of dedication and I am very here for it.\nRead more",
          "link": "https://www.rockpapershotgun.com/this-is-what-peak-dark-souls-fitness-looks-like",
          "publishedOn": "2021-09-29T16:14:33.000Z",
          "wordCount": 721,
          "title": "This is what peak Dark Souls fitness looks like"
        },
        {
          "id": "https://www.rockpapershotgun.com/horrific-pikmin-like-adventure-dap-has-you-protect-a-gaggle-of-spooky-pals",
          "author": "Lauren Morton",
          "description": "At last, it's nearly horror games month-eve and so even the concept of friendship must become frightening. Pikmin-like action puzzler game Dap is all about collecting your Dap pals and attempting to lead them home out of a spooky dream world forest without being consumed by Dap infighting. The nightmare has begun today, so you can lead your own Dap pack out of the woods right now if that's your thing.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/horrific-pikmin-like-adventure-dap-has-you-protect-a-gaggle-of-spooky-pals",
          "publishedOn": "2021-09-29T16:01:06.000Z",
          "wordCount": 809,
          "title": "Horrific Pikmin-like adventure Dap has you protect a gaggle of spooky pals"
        },
        {
          "id": "https://www.rockpapershotgun.com/halo-infinites-maps-are-vintage-multiplayer-jungle-gyms",
          "author": "Brendan Caldwell",
          "description": "The multiplayer maps of Halos past had a devotion to footstep fairness, the principle that every step I take toward the giant laser cannon should equal one step you take toward the same brutal death-tube. Halo Infinite abides by that time-honored rule, at least judging by the recent public test.\nThese maps are classic Master Chief party houses, loyal to the supremacy of abstract shapes, with clarity to every corner and a pared-back art style that makes a brief glance of an enemy in a doorway pop out. Pick-ups lounge on exposed podiums like glimmering sirens. Isolated platforms furnish gravity hammers, surrounded by a grinning void. They are arenas that somehow feel both dangerous and fair. But they are something else too. They're playful.\nRead more",
          "link": "https://www.rockpapershotgun.com/halo-infinites-maps-are-vintage-multiplayer-jungle-gyms",
          "publishedOn": "2021-09-29T16:00:00.000Z",
          "wordCount": 1977,
          "title": "Halo Infinite's maps are vintage multiplayer jungle gyms"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-factions-companies",
          "author": "Rebecca Jones",
          "description": "Which Faction should you pick in New World, and how do you start and join Companies? Amazon's new MMO New World features both PvP and PvE gameplay, and even though it is theoretically possible to go it alone and still enjoy some of the features, joining up with other players is a lot more fun. The complex social heirarchies of New World are divided up into Factions and Companies — two separate, but linked, types of player organisation. It can all be a bit confusing, though, so below we've laid out the difference between them, as well as how to join a Faction or Company.\n Read more",
          "link": "https://www.rockpapershotgun.com/new-world-factions-companies",
          "publishedOn": "2021-09-29T15:22:36.000Z",
          "wordCount": 1717,
          "title": "New World Factions & Companies explained: which faction should you pick?"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-new-gamesmasters-host-is-robert-florence",
          "author": "Alice O'Connor",
          "description": "The co-host of the UK's best video games TV show is becoming the host of its most beloved one, as Channel 4 have named Robert Florence lead host of their rebooted GamesMaster. You know, Rab from VideoGaiden and Consolevania, and from BBC Scotland sketch show Burnistoun, and from RPS board games column Cardboard Children. Honestly, he's a great shout. But no, he's not going to be the actual GamesMaster.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-new-gamesmasters-host-is-robert-florence",
          "publishedOn": "2021-09-29T15:22:35.000Z",
          "wordCount": 866,
          "title": "The new GamesMaster's host is Robert Florence"
        },
        {
          "id": "https://www.rockpapershotgun.com/marvels-avengers-hits-xbox-game-pass-tomorrow",
          "author": "Imogen Beckhelling",
          "description": "Ill-fated co-op superhero game Marvel's Avengers comes to Xbox Game Pass tomorrow. The live service action-RPG first launched in September last year to an overwhelmingly \"meh\" reaction from players, but if you were curious about it, at least now you don't need to pay full price to try it out. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/marvels-avengers-hits-xbox-game-pass-tomorrow",
          "publishedOn": "2021-09-29T14:53:26.000Z",
          "wordCount": 775,
          "title": "Marvel's Avengers hits Xbox Game Pass tomorrow"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-best-settings",
          "author": "James Archer",
          "description": "Even though you can’t play as Jeff Bezos, Amazon Game Studios’ MMO New World is proving popular. So popular, in fact, that some players are apparently willing to queue for hours if it means joining their preferred server. If you find yourself waiting to get to the front of the line, why not kill time efficiently by reading this guide to New World’s best settings? Despite some light-looking system requirements, New World can hammer your hardware in certain areas, and even if you own one of the best graphics cards it’s worth knowing which settings to tone down in exchange for those morish frames per second. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-best-settings",
          "publishedOn": "2021-09-29T14:44:18.000Z",
          "wordCount": 1809,
          "title": "New World: the best settings to improve performance"
        },
        {
          "id": "https://www.rockpapershotgun.com/oh-lord-will-wrights-new-game-is-built-on-nfts",
          "author": "Alice O'Connor",
          "description": "Will Wright, the legendary designer behind games from SimCity to The Sims, has opened up about his mysterious new game. It's named Proxi, and it's some sort of world-building AI simulation game inspired by \"how the brain stores memories\". Normally news on a new Will Wright game would be cause for celebration but ah jeez he's fallen for NFTs, oh no.\nRead more",
          "link": "https://www.rockpapershotgun.com/oh-lord-will-wrights-new-game-is-built-on-nfts",
          "publishedOn": "2021-09-29T14:19:30.000Z",
          "wordCount": 1437,
          "title": "Oh lord, Will Wright's new game is built on NFTs"
        },
        {
          "id": "https://www.rockpapershotgun.com/colts-squishy-vulnerability-is-stopping-me-from-enjoying-deathloops-action",
          "author": "Ed Thorn",
          "description": "Let's try action. Let's try action. Let's try action. This is the Deathloop I'm in at the moment, but I'm slowly beginning to think it's worth breaking the cycle and taking the stealthy approach as often as I can. I'm confused, you see. In many of the game's pre-release teasers, we saw Colt bursting into action. Stealth? No no, this is more of an FPS. The music flares, enemies die, it is carnage.\nBut when I actually give action a go in the game, I'm mostly left dead in seconds. Either that, or I meekly duck behind some cover and regret not trying the stealthy approach. And the problem is that sometimes I have no option but to go all guns blazing, and I think, \"Colt isn't built for this. He's only a squishy lad.\" I just think he's a stealth character being forced to break cover when he's clearly uncomfortable doing so.\nRead more",
          "link": "https://www.rockpapershotgun.com/colts-squishy-vulnerability-is-stopping-me-from-enjoying-deathloops-action",
          "publishedOn": "2021-09-29T13:00:00.000Z",
          "wordCount": 1462,
          "title": "Colt's squishy vulnerability is stopping me from enjoying Deathloop's action"
        },
        {
          "id": "https://www.rockpapershotgun.com/tunic-isnt-a-soulslike-says-dev-but-it-wont-go-easy-on-you",
          "author": "Imogen Beckhelling",
          "description": "At first glance, the upcoming action-adventure game Tunic looks remarkably similar to The Legend Of Zelda. Its protagonist is a cute little dude (well, a fox, in this case) with a sword and shield and similar taste in green adventure-wear, and they get to run around all sorts of lush forests, bright temples and more. But upon playing the game, people have already discovered that it's a fair bit tougher than it looks. More Dark Souls, than Zelda, perhaps.\nJust because Tunic isn't dark and gloomy doesn't mean it can't offer its fair share of challenges, so I spoke to Tunic creator Andrew Shouldice to find out how he's managing expectations, as well as tackling difficulty and accessibility. We also talked about the joy of exploring and uncovering secrets, but we'll check behind that waterfall in a bit.\nRead more",
          "link": "https://www.rockpapershotgun.com/tunic-isnt-a-soulslike-says-dev-but-it-wont-go-easy-on-you",
          "publishedOn": "2021-09-29T12:00:00.000Z",
          "wordCount": 1994,
          "title": "Tunic isn't a Soulslike, says dev, but it won't go easy on you"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-azoth",
          "author": "Hayden Hefford",
          "description": "Want to learn about Azoth in New World? Azoth is a very important resource that you will use for some crucial activities in New World, including fast travel and crafting. You'll do those often in an MMO, so Azoth’s pretty darn useful.\nThis guide will explain everything that you need to know about Azoth, including where you can find Azoth and the quickest way to farm Azoth in New World.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-azoth",
          "publishedOn": "2021-09-29T11:32:55.000Z",
          "wordCount": 1255,
          "title": "How to get Azoth in New World"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-epic-games-store-is-coming-to-the-microsoft-store-for-some-reason",
          "author": "Imogen Beckhelling",
          "description": "Microsoft are making a new Microsoft Store, and you'll be able to download even more stores from it. They've announced that they're adding a number of third-party storefront apps, including Amazon and Epic Games. These will arrive sometime in the next few months, after the new Microsoft Store launches alongside Windows 11 next week. Finally, you'll be able to launch a store you don't want from a store you really don't want.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-epic-games-store-is-coming-to-the-microsoft-store-for-some-reason",
          "publishedOn": "2021-09-29T11:22:49.000Z",
          "wordCount": 861,
          "title": "The Epic Games Store is coming to the Microsoft Store, for some reason"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-new-world-character-builds",
          "author": "Rebecca Jones",
          "description": "What are the best character builds in New World? Unlike many MMOs of a similar type, New World doesn't have character classes. Instead, you build your character over time by allocating points into their Attributes and Weapon Masteries. This gives you the opportunity to experiment with gameplay a little before committing to a play style, allowing you to find the build that works best for you.\nRead more",
          "link": "https://www.rockpapershotgun.com/best-new-world-character-builds",
          "publishedOn": "2021-09-29T10:05:09.000Z",
          "wordCount": 2149,
          "title": "Best New World builds: the best character builds for PvP and PvE"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-will-offer-free-server-transfers-over-the-next-two-weeks",
          "author": "Imogen Beckhelling",
          "description": "New World has had quite the start to life, becoming the most popular game on Steam last night. Unfortunately, the MMORPG's popularity has caused an awful lot of queuing, with players having to wait hours to get their preferred servers. Amazon Games have announced a sort of workaround for that, though. Over the next two weeks, if you get your character started on a lower player count server, the devs will let you transfer them for free to the server you want to settle down in.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-will-offer-free-server-transfers-over-the-next-two-weeks",
          "publishedOn": "2021-09-29T09:56:21.000Z",
          "wordCount": 845,
          "title": "New World will offer free server transfers to help with queues"
        },
        {
          "id": "https://www.rockpapershotgun.com/diablo-2-resurrected-respec",
          "author": "Charlie Biggerstaff",
          "description": "Trying to figure out how to respec in Diablo 2? A quick initiation for those who aren’t RPG diehards - respec simply refers to the process of refunding and reallocating things like skill and attribute points that are common to the genre. Respecing in many modern RPGs is a simple, repeatable process, but things aren’t quite so easy in Diablo 2: Resurrected. While you will earn a few easy respec opportunities, once you’ve used them getting another will be a fittingly grindy process. To make sure you don’t waste your chances and cripple your build, we’ll walk you through all the ways to respec your character in Diablo 2: Resurrected.\nRead more",
          "link": "https://www.rockpapershotgun.com/diablo-2-resurrected-respec",
          "publishedOn": "2021-09-29T09:45:04.000Z",
          "wordCount": 1210,
          "title": "How to respec in Diablo 2: Resurrected"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-ray-tracing",
          "author": "Hayden Hefford",
          "description": "Want to learn about RTX ray tracing in Minecraft? When you think of gorgeous graphics, Minecraft might not be the first thing that comes to mind. Sure, it has a charming aesthetic, and texture packs can make your worlds look really unique, but it isn’t very realistic. However, Nvidia have now created ray traced RTX worlds in Minecraft that will completely transform your experience.\nThis guide will explain everything that you need to know to get RTX ray tracing in Minecraft, including the minimum requirements for ray tracing.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-ray-tracing",
          "publishedOn": "2021-09-29T08:33:07.000Z",
          "wordCount": 1312,
          "title": "How to enable RTX ray tracing in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/netflix-have-bought-the-developers-of-oxenfree",
          "author": "Graham Smith",
          "description": "Night School Studio are \"joining the Netflix team.\" The developers of Oxenfree and Afterparty are the first games studio to be bought by Netflix, with founder and creative director Sean Krankel writing in a blog post that they'll continue working on the in-development Oxenfree 2. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/netflix-have-bought-the-developers-of-oxenfree",
          "publishedOn": "2021-09-28T22:35:46.000Z",
          "wordCount": 760,
          "title": "Netflix have bought the developers of Oxenfree"
        },
        {
          "id": "https://www.rockpapershotgun.com/you-cant-be-jeff-bezos-in-new-world",
          "author": "Graham Smith",
          "description": "Picture the scene. You're playing newly released coloniast theme park New World when who should walk over to you but Amazon founder Jeff Bezos. The billionaire says that he's locked out of his bank accounts, but if you buy him several Amazon gift cards, he'll pay you back with \"extra\" once he gets his access back.\r\n\nThis situation probably can't happen, because \"Jeff Bezos\" and almost every variation of it aren't permitted names in Amazon's MMO.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/you-cant-be-jeff-bezos-in-new-world",
          "publishedOn": "2021-09-28T21:41:51.000Z",
          "wordCount": 699,
          "title": "You can't be Jeff Bezos in New World"
        },
        {
          "id": "https://www.rockpapershotgun.com/you-can-now-play-the-demo-for-pony-island-devs-creepy-card-game",
          "author": "Graham Smith",
          "description": "Inscryption is reportedly \"inky black card-based odyssey that blends the deckbuilding roguelike, escape-room style puzzles, and psychological horror into a blood-laced smoothie.\" It's also from Daniel Mullins, the makers of Pony Island and The Hex, which means it's probably a few other, secret genres, too. It's coming October 19th, but there's a demo available now and a new trailer below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/you-can-now-play-the-demo-for-pony-island-devs-creepy-card-game",
          "publishedOn": "2021-09-28T21:11:47.000Z",
          "wordCount": 758,
          "title": "You can now play the demo for Pony Island dev's creepy card game"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-is-currently-the-most-popular-game-on-steam",
          "author": "Graham Smith",
          "description": "Amazon's MMO New World launched earlier today, and it's apparently great if you like queues. \r\n\nTo put the login issues players are experiencing in context however, it's maybe worth noting that New World is currently the most popular game on Steam, knocking CS:GO from its perch within hours of release.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-is-currently-the-most-popular-game-on-steam",
          "publishedOn": "2021-09-28T20:11:33.000Z",
          "wordCount": 768,
          "title": "New World is currently the most popular game on Steam"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-a-500w-seasonic-sfx-l-power-supply-for-35-at-newegg",
          "author": "Will Judd",
          "description": "Seasonic is known the world over for their high-spec, high-reliability power supplies, and today one of their small form factor (SFX-L) PSUs is heavily discounted at Newegg. The fully modular Focus SGX-500 is a 500W PSU that comes with a ten-year warranty and a footprint of less than 5 x 5 inches. Normally you'd expect to pay $120 for it, but a combination of a Newegg discount, a $15 mail in rebate and a code for $10 off (NEOCTOBER) has dropped it to just $35 when all is said and done - pretty impressive! \nRead more",
          "link": "https://www.rockpapershotgun.com/get-a-500w-seasonic-sfx-l-power-supply-for-35-at-newegg",
          "publishedOn": "2021-09-28T19:41:12.000Z",
          "wordCount": 873,
          "title": "Get a 500W Seasonic SFX-L power supply for $35 at Newegg"
        },
        {
          "id": "https://www.rockpapershotgun.com/this-rps-approved-ultrawide-gaming-monitor-is-400-off-today",
          "author": "Will Judd",
          "description": "Yesterday we featured a cut-price 49-in Samsung ultrawide monitor, which was marked down to £1099. That's still stonking expensive, so how about something more reasonable? This is the Samsung CRG9, the Odyssey G9's predecessor, and it offers almost all the same specs for much less - just £699, down from £1099. Here's why it gets the sagely RPS nod of approval. \nRead more",
          "link": "https://www.rockpapershotgun.com/this-rps-approved-ultrawide-gaming-monitor-is-400-off-today",
          "publishedOn": "2021-09-28T19:24:23.000Z",
          "wordCount": 1029,
          "title": "This RPS-approved ultrawide gaming monitor is £400 off today"
        },
        {
          "id": "https://www.rockpapershotgun.com/halo-infinites-multiplayer-reminds-me-of-old-halo-and-i-mean-that-in-the-best-way",
          "author": "Ed Thorn",
          "description": "I adored Halo 3 and Halo Reach's multiplayer. So much so, I never want to play them again. In my mind, I view them through a next-gen lens, coloured by nostalgia and post-homework energy. I know that if I jump into the Halo: The Master Chief Collection, I simply won't be able to recapture those heady times. I'm genuinely afraid of tarnishing those memories.\nHalo 4 didn't do it for me, and I skipped Halo 5 altogether. They just felt off, you know? But having spent some time with Halo Infinite's tech preview this weekend, though, I'm hopeful that this is the Halo that recaptures those former glory days. It's a step backwards in the best possible way.\nRead more",
          "link": "https://www.rockpapershotgun.com/halo-infinites-multiplayer-reminds-me-of-old-halo-and-i-mean-that-in-the-best-way",
          "publishedOn": "2021-09-28T17:00:00.000Z",
          "wordCount": 1459,
          "title": "Halo Infinite's multiplayer reminds me of old Halo, and I mean that in the best way"
        },
        {
          "id": "https://www.rockpapershotgun.com/battlefield-2042-open-beta-dates-confirmed-starts-october-8",
          "author": "Alice O'Connor",
          "description": "Following the recent delay of Battlefield 2042's launch into November, Electronic Arts have now confirmed new timing for the open beta test of Dice's near-future shooter. It'll start on Friday the 8th of October and run until the morning of  Sunday the 10th, inviting everyone to play Conquest mod on the map Orbital.\nRead more",
          "link": "https://www.rockpapershotgun.com/battlefield-2042-open-beta-dates-confirmed-starts-october-8",
          "publishedOn": "2021-09-28T16:22:21.000Z",
          "wordCount": 886,
          "title": "Battlefield 2042 open beta dates confirmed, starts October 8"
        },
        {
          "id": "https://www.rockpapershotgun.com/echoes-of-the-eye-is-sensational-dlc-for-outer-wilds-dont-let-anyone-spoil-it-for-you",
          "author": "Matthew Castle",
          "description": "Echoes Of The Eye, the new expansion for Outer Wilds, is out... now! And I’d like to congratulate Mobius Digital and Annapurna on just how little promoting their promotional campaign did. The reveal trailer did anything but, showing us the familiar solar system of Outer Wilds, only with the beginning of an eclipse followed by shots of murky caves and forests. And take a look at the official screenshots used in this article: obscured to the point of ugliness. Here’s a team so determined to keep their secrets they’d rather present the game in an unflattering light. It was worth it.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/echoes-of-the-eye-is-sensational-dlc-for-outer-wilds-dont-let-anyone-spoil-it-for-you",
          "publishedOn": "2021-09-28T16:00:00.000Z",
          "wordCount": 1935,
          "title": "Echoes Of The Eye is sensational DLC for Outer Wilds - don’t let anyone spoil it for you"
        },
        {
          "id": "https://www.rockpapershotgun.com/pc-gaming-weekspot-podcast-055-outer-wilds-echoes-of-the-eye",
          "author": "Colm Ahern",
          "description": "So, the main point of discussion on this week's podcast is the Outer Wilds: Echoes Of The Eye DLC. Talking about it is tricky, because saying pretty much anything about it feels spoiler-y. Christ, I'm trying to be careful writing this blurb in case I say something that I shouldn't. But, somehow, I think we managed to talk about it, without talking about it. Know what I mean?\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/pc-gaming-weekspot-podcast-055-outer-wilds-echoes-of-the-eye",
          "publishedOn": "2021-09-28T16:00:00.000Z",
          "wordCount": 804,
          "title": "The Weekspot podcast #055: eye and mighty"
        },
        {
          "id": "https://www.rockpapershotgun.com/roblox-players-are-making-loads-of-squid-game-games",
          "author": "Imogen Beckhelling",
          "description": "Squid Game is a South Korean survival drama show that's been taking Netflix by storm recently, and it's inspired a whole bunch of Squid Game games on Roblox. The show pits folks against each other in games like tug-of-war, where the winners earn cash, and the losers earn, well, death. It's a fun (read: somehow even more sinister) twist on the battle royale genre. It reminds me a bit of when the Hunger Games films inspired loads of Minecraft mods.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/roblox-players-are-making-loads-of-squid-game-games",
          "publishedOn": "2021-09-28T15:51:39.000Z",
          "wordCount": 838,
          "title": "Roblox players are making loads of Squid Game games"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-new-world-weapons-tier-list",
          "author": "Rebecca Jones",
          "description": "Looking for the best weapons in New World? The highly-anticipated MMO New World from Amazon Game Studios is now available as a full release, and for most players getting stuck into life on Aeternum Island, putting together a good selection of weapons will be their number one priority. In this tier list, we've ranked each weapon according to our experiences, and also put together some pointers on choosing the best weapons for your play style.\n Read more",
          "link": "https://www.rockpapershotgun.com/best-new-world-weapons-tier-list",
          "publishedOn": "2021-09-28T15:35:14.000Z",
          "wordCount": 1952,
          "title": "New World weapon tier list: best New World weapons for PvP and PvE"
        },
        {
          "id": "https://www.rockpapershotgun.com/time-looping-arena-shooter-lemnis-gate-is-out-now",
          "author": "Imogen Beckhelling",
          "description": "'Tis the season of the time loop. If you have any space left in your brain after Deathloop for more groundhog day-like shenanigans, you might be interested in Lemnis Gate, a strategic first-person shooter that launched today. It pits players against each other in 1v1 and 2v2 matches, letting you plan out moves in 25 second-long rounds. It sounds a little confusing, but seems pretty fun. It also has some excellent-looking sci-fi backgrounds and laser guns, which is truly the most important part.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/time-looping-arena-shooter-lemnis-gate-is-out-now",
          "publishedOn": "2021-09-28T14:30:53.000Z",
          "wordCount": 850,
          "title": "Time looping arena shooter Lemnis Gate is out now"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-dripstone-infinite-lave-source",
          "author": "Hayden Hefford",
          "description": "Want to learn more about Dripstone in Minecraft? Caves are getting a huge revamp in Minecraft 1.18, and Dripstone is going to be an important new block, as you can use it to make an infinite lava source in your base.\nThis guide will explain everything you need to know about Dripstone, including where you will be able to find it and how to use Pointed Dripstone to create a lava farm in Minecraft.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-dripstone-infinite-lave-source",
          "publishedOn": "2021-09-28T14:01:50.000Z",
          "wordCount": 1298,
          "title": "Everything we know about Dripstone in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-neo-the-world-ends-with-you-captures-the-15-year-evolution-of-shibuya-and-is-a-better-game-for-it",
          "author": "Alicia Haddick",
          "description": "NEO: The World Ends With You is out on PC today (via the Epic Games Store), and marks the grand return of a franchise that, despite a rabid fanbase and numerous re-releases, is only receiving its first sequel after 15 years. The original The World Ends With You impressed audiences on Nintendo DS as much for the game’s stylish Tokyo setting as it did for a unique battle system that saw players control multiple characters on multiple screens simultaneously. Yet what made this game really memorable was how it transformed the fashion and pop-cultural power of Shibuya into its own JRPG battle system. Your drip gave you strength, your armor made you a trendsetter, and the music and energy of the city were translated into a story about coming-of-age, self-worth and finding strength in yourself and your friends by embracing the things that make you unique. \nNow, NEO: The World Ends With You has arrived, but this long-awaited sequel is far from a simple retread of what the first game did 15 years ago. Shibuya itself has changed a lot in the intervening years and it's fascinating to see how NEO's setting and its gameplay mechanics have evolved alongside it. \nRead more",
          "link": "https://www.rockpapershotgun.com/how-neo-the-world-ends-with-you-captures-the-15-year-evolution-of-shibuya-and-is-a-better-game-for-it",
          "publishedOn": "2021-09-28T12:00:00.000Z",
          "wordCount": 2121,
          "title": "How NEO: The World Ends With You captures the 15 year evolution of Shibuya, and is a better game for it"
        },
        {
          "id": "https://www.rockpapershotgun.com/gigabyte-g5-review-a-ray-tracing-gaming-laptop-at-a-good-price",
          "author": "James Archer",
          "description": "With graphics card prices being what they are, gaming laptops like the Gigabyte G5 have been making a lot more sense. Believe it or not, this particular model is – at £850 / $969 – one of the cheapest routes possible into a complete PC gaming system with Nvidia’s RTX ray tracing and DLSS powers.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/gigabyte-g5-review-a-ray-tracing-gaming-laptop-at-a-good-price",
          "publishedOn": "2021-09-28T11:35:17.000Z",
          "wordCount": 2167,
          "title": "Gigabyte G5 review: a ray tracing gaming laptop at a good price"
        },
        {
          "id": "https://www.rockpapershotgun.com/uk-advertising-authority-set-guidance-for-in-game-purchases",
          "author": "Alice O'Connor",
          "description": "As various UK agencies and organisations continue to regard microtransactions and loot boxes with escalating curiosity and suspicion, the Advertising Standards Authority have laid out new guidelines for advertising in-game in purchases. Basically, they think games should be clear about what they're selling and how much things cost in real money, and that advertising shouldn't pressure or mislead. The ASA are relatively toothless but fairly prolific, and their interest might lead to more official interest.\nRead more",
          "link": "https://www.rockpapershotgun.com/uk-advertising-authority-set-guidance-for-in-game-purchases",
          "publishedOn": "2021-09-28T10:49:14.000Z",
          "wordCount": 1189,
          "title": "UK advertising authority set guidance for in-game purchases"
        },
        {
          "id": "https://www.rockpapershotgun.com/amazons-mmo-new-world-is-out-now-but-the-servers-are-struggling",
          "author": "Imogen Beckhelling",
          "description": "At long last, Amazon's MMO New World has launched. After multiple delays and two rather popular betas, folks can now jump onto the supernatural island of Aeternum and stay there for as long as they please. The EU servers are already live, with the rest of the world to follow throughout today. Do watch out if you're jumping in this morning though, because some players are reporting long queue times, while others are struggling to get into the queue in the first place.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/amazons-mmo-new-world-is-out-now-but-the-servers-are-struggling",
          "publishedOn": "2021-09-28T10:30:11.000Z",
          "wordCount": 1008,
          "title": "Amazon's MMO New World is out now, but the servers are struggling"
        },
        {
          "id": "https://www.rockpapershotgun.com/activision-blizzard-commit-to-18-million-settlement-with-equal-employment-opportunity-commission",
          "author": "Alice O'Connor",
          "description": "Activision Blizzard have agreed to create a claims fund of $18 million (£13m) for employees who experienced harm from \"sexual harassment, pregnancy discrimination and/or related retaliation\". This is part of a settlement with the USA's Equal Employment Opportunity Commission (EEOC), who had taken Actiblizz to court with allegations of those issues. This is only one of Activision Blizzard's current legal battles over alleged workplace problems, and not the big one you're probably thinking of. The company also had to agree to, like, not do any of those bad things—but the settlement is not an admission of guilt.\nRead more",
          "link": "https://www.rockpapershotgun.com/activision-blizzard-commit-to-18-million-settlement-with-equal-employment-opportunity-commission",
          "publishedOn": "2021-09-28T09:59:52.000Z",
          "wordCount": 1031,
          "title": "Activision Blizzard commit to $18 million settlement with Equal Employment Opportunity Commission"
        },
        {
          "id": "https://www.rockpapershotgun.com/league-of-legends-series-arcane-premieres-throughout-november",
          "author": "Lauren Morton",
          "description": "Yet another beefy trailer and launch date exploded out of Netflix's corner this weekend. Their upcoming animated series Arcane, set in the universe of Riot's League Of Legends, has gotten one of each. The new trailer down here digs into the dynamic between protagonist sisters Vi and Jinx. The release date, at least the first of them, is coming up pretty quick too, scheduled for November 6th.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/league-of-legends-series-arcane-premieres-throughout-november",
          "publishedOn": "2021-09-27T22:37:16.000Z",
          "wordCount": 816,
          "title": "League Of Legends series Arcane premieres throughout November"
        },
        {
          "id": "https://www.rockpapershotgun.com/steam-may-be-planning-to-restrict-player-access-to-old-game-builds",
          "author": "Lauren Morton",
          "description": "As they always do, things in Steam are likely to change again. Unlike Valve's Steam Labs experiments for storefront discoverability or downstream effects of the upcoming Steam Deck, this one is a little more under the hood. As spotted by the unaffiliated Steam tracking site SteamDB, the beta version of Steam's client now has a new method that is capable of preventing users from accessing former builds of games they own. The majority of players likely aren't pulling up old game builds often, if ever, but this change could make life a lot tougher for modders, speedrunners, and anyone trying to roll back a buggy game update while they wait for a hotfix.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/steam-may-be-planning-to-restrict-player-access-to-old-game-builds",
          "publishedOn": "2021-09-27T21:55:12.000Z",
          "wordCount": 976,
          "title": "Steam may be planning to restrict player access to old game builds"
        },
        {
          "id": "https://www.rockpapershotgun.com/oculus-announces-resident-evil-4-vr-release-date-for-october",
          "author": "Lauren Morton",
          "description": "October is creeping up on us all and, like a proper jump scare just before I'd expected it, so has Resident Evil 4 VR. Leon Kennedy's spooky cult adventure begins again in the first-person and hands-on version that's arriving on the Oculus Quest 2 next month. Now that you'll be getting all up close and personal with Salazar and Saddler and El Gigante and all, they've gotten some fresh pixels as well, which you can catch a look at once again in a new trailer.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/oculus-announces-resident-evil-4-vr-release-date-for-october",
          "publishedOn": "2021-09-27T20:14:37.000Z",
          "wordCount": 762,
          "title": "Oculus announces Resident Evil 4 VR release date for October"
        },
        {
          "id": "https://www.rockpapershotgun.com/netflixs-lady-assassin-movie-kate-is-getting-an-action-roguelike-tie-in-game",
          "author": "Lauren Morton",
          "description": "I've been positively held hostage by the lady assassin action movie trend—having been in the same room as my partner relentlessly devouring the likes of The Old Guard, Ava, Terminal, and Gunpowder Milkshake. No surprise then that I also got sucked into watching Kate, Netflix's new action movie starring assassin Mary Elizabeth Winstead and her teen hostage slash sidekick Miku Martineau. What is surprising—even though Netflix have shown an increasing interest in games—is that Kate is getting a tie-in action game called Kate: Collateral Damage. It's a fast-paced and arcade-y roguelike with some twin-stick style shooting coming out in October.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/netflixs-lady-assassin-movie-kate-is-getting-an-action-roguelike-tie-in-game",
          "publishedOn": "2021-09-27T18:19:30.000Z",
          "wordCount": 888,
          "title": "Netflix's lady assassin movie Kate is getting an action roguelike tie-in game"
        },
        {
          "id": "https://www.rockpapershotgun.com/this-27-in-240hz-samsung-monitor-is-229-right-now-70-off",
          "author": "Will Judd",
          "description": "For a while, I was super into Counter-Strike: Global Offensive, and I took getting better at the game very seriously. I swapped out my mouse and headset, practiced grenade line-ups for hours and even learned a few Russian phrases to try and get the respect of my match-making teammates. All these steps worked, but the real results came when I swapped my old 144Hz monitor for a 240Hz model, the Samsung CRG5. Hitting such a high frame-rate in Counter-Strike isn't difficult even on old hardware, and the increase in clarity meant hitting shots a lot easier. \nIf you want to follow in my footsteps, then it's good news: this 240Hz screen is going cheap on Amazon today. They're asking £229 for it, £70 off its regular price of £299, and I think that's a great deal. \nRead more",
          "link": "https://www.rockpapershotgun.com/this-27-in-240hz-samsung-monitor-is-229-right-now-70-off",
          "publishedOn": "2021-09-27T17:55:30.000Z",
          "wordCount": 1099,
          "title": "This 27-in 240Hz Samsung monitor is £229 right now (£70 off)"
        },
        {
          "id": "https://www.rockpapershotgun.com/samsungs-2tb-870-evo-ssd-is-down-to-19750-at-amazon",
          "author": "Will Judd",
          "description": "We reckon that Samsung's 870 Evo is the best SATA SSD for gaming, and today the mammoth 2TB model has been reduced on Amazon. It's now retailing for £197.50, the best price we've seen on this drive since the Chia mining craze began and some £45 below RRP. It's even cheaper than the (older and slower) 860 Evo. Here's a link to the deal and a few more words on why we like this particular drive so very much. \nRead more",
          "link": "https://www.rockpapershotgun.com/samsungs-2tb-870-evo-ssd-is-down-to-19750-at-amazon",
          "publishedOn": "2021-09-27T16:55:34.000Z",
          "wordCount": 885,
          "title": "Samsung's 2TB 870 Evo SSD is down to £197.50 at Amazon"
        },
        {
          "id": "https://www.rockpapershotgun.com/netflix-shows-off-more-the-witcher-season-2-clips-and-announces-season-3",
          "author": "Lauren Morton",
          "description": "If you thought there was any risk of Netflix dumping Geralt and company in the near future, you can rest your head easy after this weekend. They've now shown off several more clips for the upcoming second season of their main, Cavill-powered Witcher TV series and also announced that they're definitely going to be going for a third season. Not just that, but there are even more Witcher projects on the way: another animated movie, that Blood Origin series, and—for some unfathomable reason—a children's show. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/netflix-shows-off-more-the-witcher-season-2-clips-and-announces-season-3",
          "publishedOn": "2021-09-27T16:07:35.000Z",
          "wordCount": 873,
          "title": "Netflix shows off more The Witcher season 2 clips and announces season 3"
        },
        {
          "id": "https://www.rockpapershotgun.com/commuting-home-from-work-turns-mighty-spooky-in-this-indie-game",
          "author": "Imogen Beckhelling",
          "description": "The Plane Effect is a moody isometric adventure game about a guy trying to get home. Pretty normal stuff, except there is a cosmic anomaly looming over the city that seems to be causing some weirdness, so good luck with that. Out now, the game will have you puzzling through levels full of high-contrast moody lighting. It reminds me a bit of Inside, if Inside had rooms full of scary-looking red lasers.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/commuting-home-from-work-turns-mighty-spooky-in-this-indie-game",
          "publishedOn": "2021-09-27T15:56:38.000Z",
          "wordCount": 838,
          "title": "Commuting home from work turns mighty spooky in this indie game"
        },
        {
          "id": "https://www.rockpapershotgun.com/smashing-ingredients-in-potion-craft-is-better-than-mediation-or-yoga",
          "author": "Alice Bell",
          "description": "Potion Craft came out in early access last week, and while I still think the economy and haggling bits need a little tweaking, I am really enjoying the methodical nature of being an alchemist. It's part art, part science, because you have to sort of feel your way around the potion map and fudge recipes with the ingredients you have. Your recipe book is limited, so I've started writing down extra recipes in real life, crossing things out and updating them as I find better combinations. It's just like being a real backwoods alchemist throwing twigs in a bucket!\nBut my favourite thing is the pestle and mortar. Smashing ingredients up (and grinding them into sludge) awakens their properties so they move further on your potion map, like how crushing mint will make for a livelier mojito. And I love it intensely.\nRead more",
          "link": "https://www.rockpapershotgun.com/smashing-ingredients-in-potion-craft-is-better-than-mediation-or-yoga",
          "publishedOn": "2021-09-27T14:39:39.000Z",
          "wordCount": 737,
          "title": "Smashing ingredients in Potion Craft is better than meditation or yoga"
        },
        {
          "id": "https://www.rockpapershotgun.com/overwatch-2-will-make-murderbot-bastion-more-mobile",
          "author": "Imogen Beckhelling",
          "description": "Rejoice! The absolute pain in the arse that is Bastion is getting a rework for Overwatch 2, and he'll no longer be able to heal himself or turn into a murderous tank. He will be a lot more mobile and have a sticky grenade however, so watch out for that. Over the weekend, Blizzard revealed the changes coming to both Bastion and Sombra in the sequel. While Sombra's tweaks are a little more minimal, it looks like Bastion's will make him play a whole lot differently. Importantly, he'll also wear one of Torbjorn's caps. Fashion.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/overwatch-2-will-make-murderbot-bastion-more-mobile",
          "publishedOn": "2021-09-27T14:34:22.000Z",
          "wordCount": 1197,
          "title": "Overwatch 2 will make murderbot Bastion more mobile"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-warden-deep-dark",
          "author": "Hayden Hefford",
          "description": "Want to know more about the Warden in Minecraft? The Warden is a new mob that will arrive in Minecraft 1.18, otherwise known as the Caves and Cliffs update. It is set to be a terrifying addition, making every adventure underground a trip that could result in a particularly scary death.\nThis guide will cover everything that we currently know about the Warden in Minecraft, including its behaviour and where it will spawn.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-warden-deep-dark",
          "publishedOn": "2021-09-27T13:07:54.000Z",
          "wordCount": 1126,
          "title": "Everything that we know about the Warden in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/astria-ascending-review",
          "author": "Katharine Castle",
          "description": "On the face of it, Astria Ascending should be right up my street. With its lush visuals, intriguing character designs and often engaging turn-based battle system, this handsome hand drawn adventure could have been a surprise dark horse to rival recent JRPG greats such as Tales Of Arise and Bravely Default II. Colombian RPG Cris Tales managed it, so why not Astria Ascending?\nFrench Canadian developers Artisan Studios have certainly tried hard to fulfill J part of this Japanese-inspired RPG, acquiring the talents of Final Fantasy XII composer Hitoshi Sakimoto and Final Fantasy X writer Kazushige Nojima to bolster their small team, but even these big name veterans can't salvage this game from the depths of its own tedium. Between its bewildering, colour-swap dungeons, cringeworthy voice acting and uneven focus on its large cast, Astria Ascending stumbles before it ever has the chance to soar. \nRead more",
          "link": "https://www.rockpapershotgun.com/astria-ascending-review",
          "publishedOn": "2021-09-27T12:00:00.000Z",
          "wordCount": 2262,
          "title": "Astria Ascending review: peak tedium"
        },
        {
          "id": "https://www.rockpapershotgun.com/valheim-food-cooking",
          "author": "Rebecca Jones",
          "description": "How do you cook in Valheim? Valheim has never been short on food and recipes, but with the recent Hearth & Home update, the game's cooking system has been significantly expanded and overhauled. Gone are the days when nearly every animal dropped the same generic type of meat, or when you could cook sausages without the right spices (ugh, so bland, you monster). The buffs offered by some of the original foods have also been rebalanced, so read on for an up-to-date culinary guide to Valheim.\n Read more",
          "link": "https://www.rockpapershotgun.com/valheim-food-cooking",
          "publishedOn": "2021-09-27T11:25:24.000Z",
          "wordCount": 1577,
          "title": "Valheim food and cooking: all recipes, what buffs they provide, and where to cook them"
        },
        {
          "id": "https://www.rockpapershotgun.com/diablo-2-resurrected-players-still-cant-access-some-of-their-characters",
          "author": "Imogen Beckhelling",
          "description": "Diablo 2: Resurrected launched last week, letting players dive into a remaster of Blizzard's hellish action-RPG. Alas, \"hellish\" seems appropriate in more ways than one, because players are still struggling with launch bugs. While the developers issued a number of fixes over the weekend, some players are still experiencing \"lockout\", meaning they can't play with certain characters because the game thinks they're already in use.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/diablo-2-resurrected-players-still-cant-access-some-of-their-characters",
          "publishedOn": "2021-09-27T11:23:14.000Z",
          "wordCount": 957,
          "title": "Diablo 2: Resurrected players still can't access some of their characters"
        },
        {
          "id": "https://www.rockpapershotgun.com/elder-scrolls-online-video-shows-nvidias-new-dlaa-tech-in-action",
          "author": "James Archer",
          "description": "The Elder Scrolls Online is the first game to implement Nvidia DLAA (Deep Learning Anti-Aliasing), and thanks to YouTuber MxBenchmarkPC you can now see how the AI-powered edge-smoothing system looks in the fantasy MMO. DLAA is a new spin on Nvidia’s existing DLSS (Deep Learning Super-Sampling): whereas DLSS involves rendering a game at a lower resolution then upscaling, reducing the performance hit of the AA it applies, DLAA skips the upscaling part and keeps the resolution native.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/elder-scrolls-online-video-shows-nvidias-new-dlaa-tech-in-action",
          "publishedOn": "2021-09-27T10:37:11.000Z",
          "wordCount": 920,
          "title": "Elder Scrolls Online video shows Nvidia’s new DLAA tech in action"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-sunday-papers-612",
          "author": "Ed Thorn",
          "description": "Sundays are for watching Antiques Roadshow with all your might. Before you tune in, let's read this week's best writing about games.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-sunday-papers-612",
          "publishedOn": "2021-09-26T13:44:17.000Z",
          "wordCount": 1181,
          "title": "The Sunday Papers"
        },
        {
          "id": "https://www.rockpapershotgun.com/im-going-to-use-the-new-n64-controller-on-pc-and-you-cant-stop-me",
          "author": "Graham Smith",
          "description": "During this week's Nintendo Direct, we found out that N64 games would soon be playable on Switch via Nintendo's online subscription. More importantly, we found out that Nintendo are making a new wireless N64 controller for use with the Switch.\r\n\nYou can connect the Switch Pro controller to PC with or without a wire, so it stands to reason I'll be able to use this new N64 controller on PC too, right? Because if so, I'm gonna.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/im-going-to-use-the-new-n64-controller-on-pc-and-you-cant-stop-me",
          "publishedOn": "2021-09-25T22:57:03.000Z",
          "wordCount": 1023,
          "title": "I'm going to use the new N64 controller on PC and you can't stop me"
        },
        {
          "id": "https://www.rockpapershotgun.com/foxholes-entrenched-update-makes-the-massive-multiplayer-shooter-even-bigger",
          "author": "Graham Smith",
          "description": "Foxhole has made foxholes better. The Entrenched update for the massive, multiplayer sandbox war game adds a lot, but top of the pile is new building tools for crafting better bunkers, trenches, and frontline defenses. The update is live now, and there's a video introducing its many features below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/foxholes-entrenched-update-makes-the-massive-multiplayer-shooter-even-bigger",
          "publishedOn": "2021-09-25T21:44:32.000Z",
          "wordCount": 801,
          "title": "Foxhole's Entrenched update makes the massive multiplayer shooter even bigger"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-signal-state-is-a-zachlike-about-rewiring-synthesizers",
          "author": "Graham Smith",
          "description": "Is it still a Zachlike if it's not made by Zachtronics? Because The Signal State sure looks like a Zachlike. It's about solving logic puzzles inspired by modular synthesizers, which means you'll tinker with ornate machinery by twisting knobs and changing wiring. It's also wrapped in a post-apocalyptic story in which your actions will \"change the fate of agriculture.\"\r\n\nIt's out now. Check out the trailer below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-signal-state-is-a-zachlike-about-rewiring-synthesizers",
          "publishedOn": "2021-09-25T21:10:17.000Z",
          "wordCount": 716,
          "title": "The Signal State is a Zachlike about rewiring synthesizers"
        },
        {
          "id": "https://www.rockpapershotgun.com/hitman-is-now-on-gog-but-getting-slammed-for-its-lack-of-offline-features",
          "author": "Graham Smith",
          "description": "Good news! Hitman: Game Of The Year Edition is now on GOG and 70% off. Bad news! The game requires an internet connection for so many singleplayer features that customers on the DRM-free digital store are real mad about it.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/hitman-is-now-on-gog-but-getting-slammed-for-its-lack-of-offline-features",
          "publishedOn": "2021-09-25T20:22:30.000Z",
          "wordCount": 981,
          "title": "Hitman is now on GOG, but getting slammed for its lack of offline features"
        },
        {
          "id": "https://www.rockpapershotgun.com/battleye-anti-cheat-will-support-steam-deck-and-proton-too",
          "author": "Graham Smith",
          "description": "Valve's claim that the Steam Deck would run every game in your Steam library is looking more and more like fact. Yesterday Easy Anti-Cheat announced support for Linux and the Proton compatibility laters the Deck relies upon. \r\n\nToday, BattlEye Anti-Cheat followed suit, announcing they'd support the Steam Deck and Proton in a tweet.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/battleye-anti-cheat-will-support-steam-deck-and-proton-too",
          "publishedOn": "2021-09-25T19:45:50.000Z",
          "wordCount": 839,
          "title": "BattlEye Anti-Cheat will support Steam Deck and Proton, too"
        },
        {
          "id": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-163",
          "author": "Alice O'Connor",
          "description": "Okay, here we are: it is now autumn. I'm ready. I've folded my summer bedding away, pulled out the big duvet, and bought a bigger Thermos. And this is the nice part of autumn, when things are cosy and transitionary, before the feeling of death sets in. I was cheered by reading about your favourite autumn games this week. But anyway, what are you playing this weekend? Here's what we're clicking on.\nRead more",
          "link": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-163",
          "publishedOn": "2021-09-25T08:00:00.000Z",
          "wordCount": 1126,
          "title": "What are we all playing this weekend?"
        },
        {
          "id": "https://www.rockpapershotgun.com/handcop-is-a-hilariously-horrifying-fist-person-shooter-in-development",
          "author": "Lauren Morton",
          "description": "Handcop is a work in progress \"fist person shooter\" that's just as neat as it is horrifying. This wacky prodecurally-animated cop hand has three legs and chest hair for goodness sake. I can't decide if three \"legs\" is better or worse than three finger \"arms\". Oh, and of course officier Michael McWrist is running about carrying a giant gun. It's relatively early days for Handcop right now, it sounds like, but its wacky animations are already catching the internet's attention.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/handcop-is-a-hilariously-horrifying-fist-person-shooter-in-development",
          "publishedOn": "2021-09-24T22:39:48.000Z",
          "wordCount": 964,
          "title": "Handcop is a hilariously horrifying \"fist person shooter\" in development"
        },
        {
          "id": "https://www.rockpapershotgun.com/frankenstein-and-dracula-are-roomies-in-this-moody-narrative-adventure",
          "author": "Lauren Morton",
          "description": "\"Dracula and Frankenstein are modern day 20-something flatmates who never see one another and only exchange sticky notes. Also they are both very sad. Also Dracula wears puple shades,\" is the kind of message I'd expect to see from one of my writing acquaintances with the timestamp [2:15am]. It's also the kind of thing I'd respond to with a \"yes, do it,\" eager to find out exactly how the hell they would. That's the energy that I downloaded Frank And Drake's demo with, and it sure is a moody, somber narrative adventure about two unlikely housemates.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/frankenstein-and-dracula-are-roomies-in-this-moody-narrative-adventure",
          "publishedOn": "2021-09-24T21:36:11.000Z",
          "wordCount": 869,
          "title": "Frankenstein and Dracula are roomies in this moody narrative adventure"
        },
        {
          "id": "https://www.rockpapershotgun.com/castlevania-advance-collection-whips-out-four-classics-now-on-pc",
          "author": "Lauren Morton",
          "description": "Dracula's back from the dead again and so are four Castlevania games from the aughts. Three different vampire stomping adventures originally hailing from the Game Boy Advance—and one SNES—have made their way into a new collection on PC via Steam. Two Belmonts, a Graves, and a Cruz all get their time to shine against those undead baddies in Castlevania: Circle Of The Moon, Harmony Of Dissonance, Aria Of Sorrow, and Dracula X. Konami launched the Castlevania Advance Collection yesterday, complete with some modern conveniences for us PC players in the year 2021.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/castlevania-advance-collection-whips-out-four-classics-now-on-pc",
          "publishedOn": "2021-09-24T20:11:56.000Z",
          "wordCount": 787,
          "title": "Castlevania Advance Collection whips out four classics now on PC"
        },
        {
          "id": "https://www.rockpapershotgun.com/this-mod-adds-a-universal-photo-mode-to-over-300-unreal-engine-games",
          "author": "Lauren Morton",
          "description": "Photo modes are undeniably in fashion now, so much so that I've just started assuming most major RPGs and third-person action games will have one built in at launch. I've never put in the time to get particularly skilled at lining up the best shots, but I'm always well impressed by those who do. It's a bummer though when a looker of a game doesn't have a way to really get up close and personal with its pretty cast and environments. Tales Of Arise, which just launched this month, doesn't have one yet, for instance. That's where the extremely nifty and very handy Universal Unreal Engine 4 Unlocker comes in. It's a mod that lets you toggle a free camera to take amazing screenshots in over 300 Unreal Engine games.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/this-mod-adds-a-universal-photo-mode-to-over-300-unreal-engine-games",
          "publishedOn": "2021-09-24T18:46:50.000Z",
          "wordCount": 984,
          "title": "This mod adds a universal photo mode to over 300 Unreal Engine games"
        },
        {
          "id": "https://www.rockpapershotgun.com/tmorpg-book-of-travels-will-launch-in-early-access-on-october-11th",
          "author": "Lauren Morton",
          "description": "Might And Delight's \"tiny Multiplayer Online RPG\" Book Of Travels has scheduled itself a new early access launch date after its most recent delay. As M&D previously reassured fans, it is indeed a shorter wait than I'd feared. Their cozy online RPG is now setting out into early access on October 11th, with plans to work towards a full launch in two years.  \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/tmorpg-book-of-travels-will-launch-in-early-access-on-october-11th",
          "publishedOn": "2021-09-24T16:15:28.000Z",
          "wordCount": 1050,
          "title": "\"TMORPG\" Book Of Travels will launch in early access on October 11th"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-castle-ideas",
          "author": "Hayden Hefford",
          "description": "Want to build an epic Castle in Minecraft? How about 8 castles? That’s how many we’ve got for you in this list, so you’d best get building! These castles look truly stunning, but we're sure they'll be even better atop the new mountains that are coming when the Minecraft 1.18 update launches later this year.\nCheck out all of these builds to get some inspiration for your own world in Minecraft, or just follow along with the Youtube tutorials if you like what you see!\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-castle-ideas",
          "publishedOn": "2021-09-24T15:41:32.000Z",
          "wordCount": 1423,
          "title": "8 Minecraft castle ideas to build in 1.17"
        },
        {
          "id": "https://www.rockpapershotgun.com/squid-game-is-the-perfect-netflix-show-for-zero-escape-danganronpa-likers",
          "author": "Katharine Castle",
          "description": "Listen up, escape room fans. There's a new Korean drama you need to watch. It's called Squid Game, it's on Netflix, and it's real good. It's a show about 456 down and outers - folks with no life, family or who are in huge piles of debt - who enter a deadly competition to win a truck ton of money to help them turn their life around. All they need to do is compete in six games. Easy peasy, everyone thinks. How hard can that be? Only the first of those games, a riff on the classic children's game Statues / Grandma's Footsteps / Red Light Green Light - involves running toward a giant automaton with motion sensors in her eyes, as well as a team of snipers waiting in the rafters to take down anyone who does stay perfectly at the right time. \nIt's grim, but it's also the perfect blend of some of my favourite things ever: Zero Escape, Danganronpa and Battle Royale (the Japanese thriller, not the game genre) - and I implore you to give it a go.\nRead more",
          "link": "https://www.rockpapershotgun.com/squid-game-is-the-perfect-netflix-show-for-zero-escape-danganronpa-likers",
          "publishedOn": "2021-09-24T15:30:00.000Z",
          "wordCount": 834,
          "title": "Squid Game is the perfect Netflix show for Zero Escape & Danganronpa likers"
        }
      ]
    },
    {
      "title": "Root.cz - články",
      "feedUrl": "https://www.root.cz/rss/clanky/",
      "siteUrl": "https://www.root.cz/clanky/",
      "articles": [
        {
          "id": "www.root.cz-text-15686",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Naposledy se dnes podíváme na vybrané novinky z vývoje jádra Linux 5.15. Čeká nás třeba 12. generace Intel Core, přechod na GCC 5.1, rychlejší I/O, podpora Rustu i první náhled na následný Linux 5.16.",
          "link": "https://www.root.cz/clanky/co-se-chysta-pro-linux-5-15-a-primes-novinek-pro-verzi-5-16/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-30T22:00:00.000Z",
          "wordCount": 1758,
          "title": "Co se chystá pro Linux 5.15 a příměs novinek pro verzi 5.16",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/357/tucnak-cisarsky-tux-linux-1.jpg",
            "length": "34098",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15551",
          "author": "redakce@root.cz (Root.cz: Karel Kulhavý)",
          "description": "Dcraw koriguje chromatickou aberaci a G'MIC vinětaci jednoduché soustavy dalekohledu a iPhonu, kterým vyfotíme manuálně v režimu raw a data přeneseme do Linuxu přes Wi-Fi nebo USB.",
          "link": "https://www.root.cz/clanky/fotografovani-dalekohledem-priprava-a-softwarova-optimalizace/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-29T22:00:10.000Z",
          "wordCount": 2058,
          "title": "Fotografování dalekohledem: příprava a softwarová optimalizace",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/426/dalekohled-1.jpg",
            "length": "42720",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15685",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "V deváté části seriálu o křivkách si popíšeme některé křivky, které byly po svém objevu nazývány „matematická monstra“, protože neodpovídaly tehdejším představám o chování „správných“ křivek.",
          "link": "https://www.root.cz/clanky/patologicke-krivky-a-jina-matematicka-monstra/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-29T22:00:05.000Z",
          "wordCount": 7586,
          "title": "Patologické křivky a jiná matematická monstra",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/507/krivka-perex-1.jpg",
            "length": "74201",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15683",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "Představíme si projekt nazvaný ULua, což je distribuce tohoto programovacího jazyka pro všechny tři nejpoužívanější operační systémy, která kromě LuaJITu obsahuje i správce balíčků upkg.",
          "link": "https://www.root.cz/clanky/ulua-univerzalni-distribuce-programovaciho-jazyka-lua/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-28T22:00:10.000Z",
          "wordCount": 5079,
          "title": "ULua: univerzální distribuce programovacího jazyka Lua",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/679/lua-mesic-noc-mesto-1.jpg",
            "length": "69823",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15682",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Sonda do světa otevřeného softwaru. Dnes si představíme nástroj pro práci se snímky obrazovky, vyzkoušíme software pro práci s MPO 3D fotografiemi, přeložíme si texty do jiných jazyků a vytvoříme si nějaké ty vědecké grafy.",
          "link": "https://www.root.cz/clanky/softwarova-sklizen-29-9-2021/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-28T22:00:05.000Z",
          "wordCount": 1009,
          "title": "Softwarová sklizeň (29. 9. 2021)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/root/368/kombajn-sklizen.jpg",
            "length": "394618",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15681",
          "author": "redakce@root.cz (Root.cz: CESNET CERTS)",
          "description": "Tentokrát se podíváme na zranitelnosti WordPressu, Drupalu, Apache OpenOffice a Nagiosu, na malware Capoae a OpenSUpdater. Naopak potěší, že provozovatel DDoSových serverů i mafiáni dojdou zasloužené odplaty.",
          "link": "https://www.root.cz/clanky/postrehy-z-bezpecnosti-velka-uroda-malwaru-i-zranitelnosti/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-26T22:00:10.000Z",
          "wordCount": 1505,
          "title": "Postřehy z bezpečnosti: velká úroda malwaru i zranitelností",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/213/malware-1.jpg",
            "length": "57907",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15677",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Canonical vydal veřejnou betu Ubuntu 21.10 „Impish Indri“. Tým kolem operačního systému FreeBSD plánuje změnit výchozí root shell. Operační systém LineageOS 18.1 rozšířil seznam podporovaných zařízení.",
          "link": "https://www.root.cz/clanky/distribucni-vestnik-ubuntu-21-10-v-bete-lineageos-podporuje-nova-zarizeni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-26T22:00:05.000Z",
          "wordCount": 1150,
          "title": "Distribuční věstník: Ubuntu 21.10 v betě, LineageOS podporuje nová zařízení",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/537/ubuntu-21-10-impish-indri-1.jpg",
            "length": "13671",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15680",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Beta verze Ubuntu 21.10, MidnightBSD 2.1 přechází na LLVM 10, Apple vydal iPhony 13, nabídne i ProRes video, vývojová verze Wine 6.18, Joe Biden jmenoval šéfku AMD do svého poradního týmu, AMD a Mediatek dohromady.",
          "link": "https://www.root.cz/clanky/novy-textovy-editor-pro-gnome-100procentne-evropske-risc-v-procesory-epi-epac10/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-25T22:00:00.000Z",
          "wordCount": 1579,
          "title": "Nový textový editor pro GNOME, 100% evropské RISC-V procesory EPI EPAC1.0",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/252/dr-lisa-su-1.jpg",
            "length": "21252",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15678",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Exekutivě Evropské unie došla trpělivost a chystá nařízení, kterým sjednotí roztříštěný svět nabíječek (nejen) smartphonů. Postihne to všechny, kdo se vymykají standardu USB-C, v čele s Apple.",
          "link": "https://www.root.cz/clanky/evropska-komise-chce-jednotnou-nabijecku-s-usb-c-a-power-delivery/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-23T22:00:10.000Z",
          "wordCount": 2111,
          "title": "Evropská komise chce jednotnou nabíječku s USB-C a Power Delivery",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/485/usb-c-1.jpg",
            "length": "22817",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15675",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Na konci září vyprší platnost kořenového certifikátu DST Root CA X3, na kterém od začátku stála podpora certifikační autority Let's Encrypt. Ta už sice používá nový kořen, ale staré systémy budou mít problém.",
          "link": "https://www.root.cz/clanky/koren-let-s-encrypt-na-konci-mesice-vyprsi-dotkne-se-to-starsich-klientu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T22:00:10.000Z",
          "wordCount": 1805,
          "title": "Kořen Let's Encrypt na konci měsíce vyprší, dotkne se to starších klientů",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/102/cerveny-zamek-1.jpg",
            "length": "46645",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "Root.cz - zprávičky",
      "feedUrl": "https://www.root.cz/rss/zpravicky/",
      "siteUrl": "https://www.root.cz/zpravicky/",
      "articles": [
        {
          "id": "www.root.cz-actuality-41285",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "VPN umožňuje bezpečně propojit různá zařízení pomocí šifrovaných tunelů. Umožňuje také zapojit uživatele do vnitřní sítě přes zabezpečený přístupový bod. Na našem školení VPN a bezpečné připojení k síti s OpenVPN si prakticky ukážeme, jak to celé nastavit a zprovoznit.",
          "link": "https://www.root.cz/zpravicky/vytvorte-si-bezpecnou-vpn-pomoci-openvpn-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-01T08:27:14.000Z",
          "wordCount": 763,
          "title": "Vytvořte si bezpečnou VPN pomocí OpenVPN (školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/102/openvpn-logo-1.jpg",
            "length": "18777",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42862",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Výzkumníci z univerzit ve Velké Brtitánii a z DeepMind, který je vlastněný Google, vytvořili umělou inteligenci schopnou přesně krátkodobě předpovídat srážky. Předpověď má platnost do dvou hodin, používá se pro ni anglický termín nowcast na rozdíl od běžné předpovědi na den až tři dopředu forecast. Tyto krátkodobé předpovědi používají jen data ze srážkového radaru.",
          "link": "https://www.root.cz/zpravicky/ai-pro-kratkodobou-predpoved-pocasi/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-01T08:23:12.000Z",
          "wordCount": 832,
          "title": "AI pro krátkodobou předpověď počasí",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/595/bourka-blesk-mrak-dest-1.jpg",
            "length": "20450",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42861",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Jak už bylo certifikační autoritou Let's Encrypt předem avizováno, 30. září 2021 ve 14:00 UTC došlo k expiraci kořenového certifikátu DST Root CA, který byl používán jako dočasný po několik let. V zásadě by nemělo dojít k potížím, protože Let's Encrypt CA používá ISRG Root X1 pro RSA nebo ISRG Root X2 pro ECDSA již mnoho měsíců.",
          "link": "https://www.root.cz/zpravicky/vyprsel-korenovy-certifikat-dst-root-ca-pouzivany-autoritou-let-s-encrypt/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-30T21:09:10.000Z",
          "wordCount": 1573,
          "title": "Vypršel kořenový certifikát DST Root CA používaný autoritou Let's Encrypt",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/65/let-s-encrypt-logo-1.jpg",
            "length": "26850",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42860",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Zhruba před 11 lety přišel Intel s velmi kontroverzním a negativně vnímaným programem Upgrade Service. V rámci něj bylo možné u vybraných CPU za úplatek odemknout do té doby neaktivní části CPU a zvýšit tak jeho parametry (tu odemknout HyperThreading, tu zvýšit frekvence, tu zvětšit cache). Program by přijat s odporem IT komunity a víceméně během roku 2011 vyšuměl do ztracena.",
          "link": "https://www.root.cz/zpravicky/intel-software-defined-silicon-sdsi-softwarove-upgrady-cpu-se-vraci-na-scenu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-29T14:54:38.000Z",
          "wordCount": 5247,
          "title": "Intel Software Defined Silicon (SDSi), softwarové upgrady CPU se vrací na scénu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/338/pat-gelsinger-intel-s-ponte-vecchio-1.jpg",
            "length": "44408",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42859",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "AMD představila svoji vizi pro příští čtyři roky. Firma věří, že do roku 2025 dosáhnou její procesory 30× vyšší efektivity při běhu AI a HPC úloh. Slovem procesory jsou zde myšleny jak modely řady EPYC, tak GPU typu (Radeon) Instinct.",
          "link": "https://www.root.cz/zpravicky/amd-chce-30-efektivnejsi-ai-na-cpu-i-gpu-do-roku-2025/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-29T14:23:02.000Z",
          "wordCount": 1125,
          "title": "AMD chce 30× efektivnější AI na CPU i GPU do roku 2025",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/607/radeon-instinct.jpg",
            "length": "30510",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42858",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Vydání pětatřicáté Fedory se blíží, máme tu beta verzi a s ní i přijatelně fungující možnost vyzkoušet si nejen čerstvé GNOME 41, ale také další novinky, kterými Fedora posouvá linuxový desktop zase více do budoucnosti (v čele třeba s projektem PipeWire). Ostrá verze bude vydána na konci října, beta je k dispozici mimo jiné v podobě Workstation, Server i IoT, samozřejmě pak též v podobě Spinů (s jinými desktopovými prostředími) a Lab(s)ů (předpřipravená pro specifické potřeby) a také pro platformu ARM.",
          "link": "https://www.root.cz/zpravicky/fedora-linux-35-beta-vyzkousejte-si-gnome-41/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-29T09:49:46.000Z",
          "wordCount": 1042,
          "title": "Fedora Linux 35 Beta, vyzkoušejte si GNOME 41",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/563/gnome-1.jpg",
            "length": "37205",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-39289",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "HTTPS se stává běžným, většina webů už ho nasadila. Jak to ale udělat správně, opravdu bezpečně a hlavně bezbolestně? Na školení HTTPS pro správce serverů si ukážeme si nejnovější trendy, prakticky si vyzkoušíme vygenerování certifikátu a nasazení na web server.",
          "link": "https://www.root.cz/zpravicky/https-pro-spravce-serveru-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-29T08:26:52.000Z",
          "wordCount": 797,
          "title": "HTTPS pro správce serverů (online školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/131/https-1.jpg",
            "length": "50861",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42857",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Před lety varoval tehdejší šéf Intelu Brian Krzanich před tím, aby AMD získalo 15–20% podíl v serverech (resp. že jej získá), na úkor firemních výdělečných Xeonů. Intel ale stále není schopen dodat novou generaci Xeonů v množství dostatečném pro saturování zákazníků, takže ti častěji pokukují po EPYCech od AMD, které ostatně nabízí lepší parametry.",
          "link": "https://www.root.cz/zpravicky/amd-dosahla-16-podilu-v-serverech-xeony-ice-lake-stale-nedostatkove/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-28T10:53:13.000Z",
          "wordCount": 1273,
          "title": "AMD dosáhla 16% podílu v serverech, Xeony Ice Lake stále nedostatkové",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/612/lisa-su-s-64core-amd-epyc-rome-1.jpg",
            "length": "41520",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42856",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Electronic Frontier Foundation se připravuje na postupné ukončení podpory pro rozšíření HTTPS Everywhere, které na webech automaticky přepíná z HTTP na HTTPS. To už podle organizace začíná být zbytečné, protože rozšíření HTTPS zažilo v posledních letech výrazný nárůst a prohlížeče navíc přišly s vlastním řešením automatického přechodu na HTTPS.",
          "link": "https://www.root.cz/zpravicky/rozsireni-https-everywhere-miri-do-duchodu-uz-neni-potreba/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-27T12:15:46.000Z",
          "wordCount": 1337,
          "title": "Rozšíření HTTPS Everywhere míří do důchodu, už není potřeba",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/483/https-1.jpg",
            "length": "37159",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42855",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Vývojáři uvolnili novou verzi balíku OpenSSH s označením 8.8. Hlavní novinkou je vypnutí podpory protokolu ssh-rsa, který staví na slabém hašovacím algoritmu SHA-1. Na změnu upozorňovalo několik předchozích verzí, většina uživatelů si navíc ničeho nevšimne, protože OpenSSH podporuje algoritmy RSA/SHA-256/512 (RFC8332) od verze 7.2 a automaticky je použije.",
          "link": "https://www.root.cz/zpravicky/openssh-8-8-vypina-podporu-protokolu-ssh-rsa/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-27T12:03:01.000Z",
          "wordCount": 2301,
          "title": "OpenSSH 8.8 vypíná podporu protokolu ssh-rsa",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/218/openssh-1.jpg",
            "length": "23624",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42853",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Na Kickstarteru před několika dny začala kampaň na novou verzi kamery OAK-D-Lite. Umožní snadno a rychle vytvořit aplikaci, která bude pracovat s obsahem videa. Může například rozpoznávat SPZ, překládat znakový jazyk, rozpoznávat gesta rukou a podobně.",
          "link": "https://www.root.cz/zpravicky/kampan-na-programovatelnou-kameru-oak-d-lite-na-kickstarteru/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-27T11:22:03.000Z",
          "wordCount": 969,
          "title": "Kampaň na programovatelnou kameru OAK-D-Lite na Kickstarteru",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/372/oak-d-lite-1.jpg",
            "length": "48912",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42854",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Dňa 29. 9. 2021 od 18:00 do 20:00, 23. stretnutie komunity ohľadne technológií Cloud Native – Kubernetes – ONLINE",
          "link": "https://www.root.cz/zpravicky/23-stretnutie-komunity-ohladne-technologii-cloud-native-kubernetes-online/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-27T11:11:58.000Z",
          "wordCount": 836,
          "title": "23. stretnutie komunity ohľadne technológií Cloud Native – Kubernetes - ONLINE",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/122/kubernetes-1.jpg",
            "length": "21058",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-40262",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Většina počítačových programů generuje logy – tedy zprávy a záznamy o své činnosti. ELK Stack – ElasticSearch, Logstash, Kibana – je populární nástroj, který umí logy efektivně zpracovávat, ukládat a zpřístupňovat.",
          "link": "https://www.root.cz/zpravicky/elk-stack-naucte-se-elasticsearch-logstach-a-kibana-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-27T09:53:21.000Z",
          "wordCount": 791,
          "title": "ELK Stack: naučte se Elasticsearch, Logstash a Kibana (školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/244/elk-logo-1.png",
            "length": "100652",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42851",
          "author": "redakce@root.cz (Root.cz: klokan)",
          "description": "Server This Week in Rust přinesl odkaz na zajímavý článek z pera tří vývojářů projektu Chromium. Autoři v něm rozvíjejí myšlenku implementovat v C++ stejná, nebo alespoň podobná pravidla paměťové bezpečnosti na úrovni typového systému, jako má Rust (tzv. Borrow Checking).",
          "link": "https://www.root.cz/zpravicky/uvahy-o-borrow-checkeru-pro-c/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-25T10:43:21.000Z",
          "wordCount": 17453,
          "title": "Úvahy o Borrow Checkeru pro C++",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/116/fustrovany-programator-1.jpg",
            "length": "53261",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42850",
          "author": "redakce@root.cz (Root.cz: spajk)",
          "description": "Společnost Brave, známá především svým internetovým prohlížečem zaměřeným na soukromí představila novou službu na bezpečné videohovory. Jmenuje se Brave Talk, v základu je zdarma, běží na Jitsi as a Service a je open-source. Začít můžete na talk.brave.com.",
          "link": "https://www.root.cz/zpravicky/brave-vydal-brave-talk-sluzbu-pro-bezpecne-videohovory/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-24T13:35:15.000Z",
          "wordCount": 2688,
          "title": "Brave vydal Brave Talk: službu pro bezpečné videohovory",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/28/brave-talk-1.jpg",
            "length": "47485",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42849",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Vývojáři uvolnili konečnou betaverzi připravovaného Ubuntu 21.10 s kódovým označením Impish Indri (rošťácký lemur). Vše jde podle připraveného časového harmonogramu, čeká nás ještě kandidát na vydání a poté přijde 14. října ostrá verze.",
          "link": "https://www.root.cz/zpravicky/vysla-konecna-betaverze-ubuntu-21-10-vydani-je-planovano-na-14-rijna/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-24T10:35:29.000Z",
          "wordCount": 1335,
          "title": "Vyšla konečná betaverze Ubuntu 21.10, vydání je plánováno na 14. října",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/537/ubuntu-21-10-impish-indri-1.jpg",
            "length": "13671",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-40036",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Na internetu píšou, že začít s automatizací správy serverů můžete do půl hodiny. Dokážeme vám, že s Ansible to je pravda. Stačí navštívit naše pražské školení Ansible – úvod do automatizace a pak navazující Ansible – role a AWX.",
          "link": "https://www.root.cz/zpravicky/ansible-uvod-do-automatizace-role-a-awx-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-24T09:51:46.000Z",
          "wordCount": 797,
          "title": "Ansible: úvod do automatizace, role a AWX (školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/330/ansible-1.jpg",
            "length": "20637",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42848",
          "author": "redakce@root.cz (Root.cz: D.A. Tiger)",
          "description": "Sourcetrail je open-source program, který slouží k statické analýze a vizualizaci zdrojových kódů v jazycích C, C++ a Python. Dnes jeho vývojáři na svém blogu oznámili ukončení jeho vývoje.",
          "link": "https://www.root.cz/zpravicky/sourcetrail-konci-vyvoj-je-prilis-narocny/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-24T07:20:16.000Z",
          "wordCount": 1872,
          "title": "Sourcetrail končí, vývoj je příliš náročný",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/343/sourcetrail-1.jpg",
            "length": "23300",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42846",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Na základě článku laboratoře QRATOR labs firma MikroTik na svých stránkách upozorňuje na další vlnu DDoS útoků.",
          "link": "https://www.root.cz/zpravicky/mikrotik-zaziva-dalsi-vlnu-ddos-utoku/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-23T07:13:54.000Z",
          "wordCount": 5109,
          "title": "MikroTik zažívá další vlnu DDoS útoků",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/639/mikrotik-1.jpg",
            "length": "30507",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42847",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Vývojáři uvolnili pravidelnou půlroční aktualizaci desktopového prostředí GNOME, tentokrát s označením 41. Mezi hlavní novinky patří vylepšení správce software, nastavení multitaskingu a vylepšení power managementu. Kromě toho je tu nová aplikace Connections, aktualizovaná aplikace Music a vylepšení výkonu v celé řadě komponent.",
          "link": "https://www.root.cz/zpravicky/gnome-41-prinasi-vylepseni-vykonu-a-novinky-v-podpore-waylandu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-23T07:10:05.000Z",
          "wordCount": 806,
          "title": "GNOME 41 přináší vylepšení výkonu a novinky v podpoře Waylandu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/563/gnome-1.jpg",
            "length": "37205",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42845",
          "author": "redakce@root.cz (Root.cz: LD)",
          "description": "Včera večer byla vydána opravná verze VMware vCenter 6.5, 6.7 a 7.0. Tato nová sada verzí opravuje několik kritických zranitelností, od XSS, přístupu k skrytým endpointům API, neoprávněnou manipulaci s nastavením sítě virtuálních strojů, vzdálené mazání souborů na vCenteru až po asi nejzávažnější vzdálené spuštění kódu.",
          "link": "https://www.root.cz/zpravicky/rada-kritickych-chyb-ve-vmware-vcenter/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T20:42:02.000Z",
          "wordCount": 1200,
          "title": "Řada kritických chyb ve VMware vCenter",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/295/vmware-1.jpg",
            "length": "60135",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42844",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Možná nejvýznačnější novinkou v Chrome/Chromium 94 pro uživatele je to, že element canvas je nyní implicitně kalibrován na barevný prostor sRGB, nicméně stránka může specifikovat jiný, podporován je i DCI-P3. Pete LaPage dále doporučuje na web.dev věnovat pozornost textu Eugena Zemtsova o WebCodecs s příklady využití přímého videa pomocí hardwarově akcelerovaných kodeků, které již prohlížeč má (aneb blíží se konec nutnosti dodávat v kódu vlastní neakcelerovanou WASM verzi kodeků). Podpora kodeků skrze WebCodecs se týká jak přehrávání, tak komprese.",
          "link": "https://www.root.cz/zpravicky/chrome-94-nasazuje-srgb-u-elementu-canvas-a-pridava-webgpu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T15:45:46.000Z",
          "wordCount": 876,
          "title": "Chrome 94 nasazuje sRGB u elementu canvas a přidává WebGPU",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/328/chrome-1.jpg",
            "length": "14231",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42843",
          "author": "redakce@root.cz (Root.cz: spajk)",
          "description": "Test deseti webových prezentací politických stran odhalil v pěti případech kritické zranitelnosti, nejčastěji se jednalo o cross-site scripting, objevily se ale zranitelné zastaralé knihovny a v jednom případě také děravý jedenáct let starý Apache. Více ve zprávě na webu spajk.cz.",
          "link": "https://www.root.cz/zpravicky/webove-stranky-politickych-stran-obsahuji-zranitelnosti/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T08:12:18.000Z",
          "wordCount": 4462,
          "title": "Webové stránky politických stran obsahují zranitelnosti",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/208/xss-notebook-1.jpg",
            "length": "64540",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42841",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "V Linuxu 5.16 dojde ke změně v ovladači nct6775, který obstarává čtení dat ze senzorů mnohých základních desek značky ASUS. Ovladač dostane podporu přístupu k ASIC za použití funkcí ASUS WMI (desky od Asusteku nepoužívají standardní cestu přes ACPI, kterou ovladač disponuje již nyní). S úpravou pak logicky do jádra zamíří i podpora níže uvedeného seznamu základních desek:",
          "link": "https://www.root.cz/zpravicky/linux-5-16-prinese-podporu-senzoru-dalsich-zakladnich-desek-asus/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T06:00:00.000Z",
          "wordCount": 918,
          "title": "Linux 5.16 přinese podporu senzorů dalších základních desek ASUS",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/52/asus-rog-strix-x470-f-gaming-1.jpg",
            "length": "35903",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42840",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Na GIMP 3.0 si ještě chvíli počkáme, vezměmež tedy zavděk dalším, víceméně opravným vydání dva-desítkové řady. GIMP 2.10.28 totiž přináší solidní množství oprav.",
          "link": "https://www.root.cz/zpravicky/gimp-2-10-28-opravuje-dalsi-chyby/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T05:00:00.000Z",
          "wordCount": 852,
          "title": "GIMP 2.10.28 opravuje další chyby",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/158/gimp-2-10-20-1.jpg",
            "length": "50629",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "abclinuxu - aktuální články",
      "feedUrl": "http://www.abclinuxu.cz/auto/abc.rss",
      "siteUrl": "http://www.abclinuxu.cz/clanky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/clanky/distribucni-novinky-36-37-2021",
          "author": "Redakce",
          "description": "Na sklonku léta vyšel nový Whonix, podíváme se na systém pro klientské stanice ThinStation a aktualizovány byly také distribuce Finnix, Lakka, GhostBSD, Tails, Kali, Ubuntu LTS, Sailfish OS nebo Sparky Linux.",
          "link": "http://www.abclinuxu.cz/clanky/distribucni-novinky-36-37-2021",
          "publishedOn": "2021-09-29T00:00:00.000Z",
          "wordCount": 1884,
          "title": "Distribuční novinky 36-37/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/chcete-vedet-kolik-byste-mohli-vydelavat-u-konkurence-na-stejne-pozici",
          "author": "Reklama",
          "description": "Peníze jsou ožehavé téma, obzvlášť jedná-li se o výplaty v zaměstnání. Člověk přemýšlí, zda kolegové nevydělávají víc nebo jestli by si u jiného zaměstnavatele nepolepšil. Jak to ale zjistit? Teď naštěstí jednoduše, protože IT pracovní portál No Fluff Jobs u všech nabídek zveřejňuje nabízené platové ohodnocení.",
          "link": "http://www.abclinuxu.cz/clanky/chcete-vedet-kolik-byste-mohli-vydelavat-u-konkurence-na-stejne-pozici",
          "publishedOn": "2021-09-26T22:01:00.000Z",
          "wordCount": 1348,
          "title": "Chcete vědět kolik byste mohli vydělávat u konkurence na stejné pozici?"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-umela-inteligence-uprostred-jihoamerickych-lesu-pomaha-zachranit-psiho-samotare",
          "author": "Redakce",
          "description": "Video, se kterým konečně pochopíte rozdíl mezi běžným a moderním úložištěm. Digitalizace zákaznické péče: jak vybrat nejlepší řešení kontaktního centra. Jaké novinky přináší Arcserve UDP 8.1? On-line konference VMworld 2021: stovky přednášek a tutoriálů zdarma. Gartner na křivce seřadil klíčové nastupující technologie. Studie Dell Technologies: hrozba ztráty dat po kyberútoku je větší, než kdy jindy. Umělá inteligence uprostřed jihoamerických lesů pomáhá zachránit psího samotáře.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-umela-inteligence-uprostred-jihoamerickych-lesu-pomaha-zachranit-psiho-samotare",
          "publishedOn": "2021-09-25T22:01:00.000Z",
          "wordCount": 1754,
          "title": "Týden na ITBiz: Umělá inteligence uprostřed jihoamerických lesů pomáhá zachránit psího samotáře"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-38-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-38-2021",
          "publishedOn": "2021-09-24T22:01:00.000Z",
          "wordCount": 2655,
          "title": "Událo se v týdnu 38/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-planety-v-centru-mlecne-drahy",
          "author": "Redakce",
          "description": "Moudrost davu. Dokážeme úspěšně předpovědět, kdy k nám dorazí světlo supernovy? Kvasary jako standardní svíčky. Neutron má na povrchu záporný náboj. Proč se zlato vyskytuje vedle arsenu.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-planety-v-centru-mlecne-drahy",
          "publishedOn": "2021-09-23T22:30:00.000Z",
          "wordCount": 1667,
          "title": "Týden na ScienceMag.cz: Planety v centru Mléčné dráhy"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-komunikace-ma-zvysovat-produktivitu-vyvojaru",
          "author": "Redakce",
          "description": "Hlavní trendy umělé inteligence: Malá a rozprostřená data. Nový typ kybernetických útoků – zneužívání proxyware platforem. Roboti, kteří udělají přesnou díru do hlavy, zachraňují životy. O vstupu do nebe rozhoduje sv. Petr, pro síť je tu ClearPass. Kouzla zbavené? Nepravděpodobné řešení hrozící personální krize ve finančních službách. Honeywell u nás investuje do R&D. Komunikace má zvyšovat produktivitu vývojářů.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-komunikace-ma-zvysovat-produktivitu-vyvojaru",
          "publishedOn": "2021-09-19T22:01:00.000Z",
          "wordCount": 1844,
          "title": "Týden na ITBiz: Komunikace má zvyšovat produktivitu vývojářů"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-prepinane-zrcadlo-z-roztaveneho-kovu",
          "author": "Redakce",
          "description": "Černá díra vyžrala hvězdu. Nanotechnologie s černým oxidem titaničitým. Život v atmosféře subneptunů. Maličké hory na neutronových hvězdách.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-prepinane-zrcadlo-z-roztaveneho-kovu",
          "publishedOn": "2021-09-18T22:01:00.000Z",
          "wordCount": 1654,
          "title": "Týden na ScienceMag.cz: Přepínané zrcadlo z roztaveného kovu"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-37-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-37-2021",
          "publishedOn": "2021-09-17T22:01:00.000Z",
          "wordCount": 2651,
          "title": "Událo se v týdnu 37/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/goodoffer24-dozivotni-licence-windows-10-pouze-za-12-super-slevy-az-91",
          "author": "Reklama",
          "description": "Pořiďte si doživotní aktivační klíč k Windows 10 za 12,52 EUR na prodejním portálu GoodOffer24.com. Kromě toho nástrojů produktivity od Microsoftu zde lze získat i hry a další software. Nezapomeňte zadat před dokončením nákupu slevový kód  AX30.",
          "link": "http://www.abclinuxu.cz/clanky/goodoffer24-dozivotni-licence-windows-10-pouze-za-12-super-slevy-az-91",
          "publishedOn": "2021-09-17T16:00:00.000Z",
          "wordCount": 1441,
          "title": "GoodOffer24: Doživotní licence Windows 10 pouze za 12 €, super slevy až 91%!"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/distribucni-novinky-34-35-2021",
          "author": "Redakce",
          "description": "Závěr letních prázdnin a začátek školního roku přinesly několik významných vydání, LibreELEC s novým Kodi, příručky Linux From Scratch nebo novou stabilní větev OpenWrt, a také aktualizace Clonezilly, Ubuntu LTS, EndeavourOS, EasyOS či NuTyXu.",
          "link": "http://www.abclinuxu.cz/clanky/distribucni-novinky-34-35-2021",
          "publishedOn": "2021-09-13T23:00:00.000Z",
          "wordCount": 1774,
          "title": "Distribuční novinky 34-35/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-sprava-a-analyza-dat-tlaci-podniky-do-cloudu",
          "author": "Redakce",
          "description": "Lenovo představuje hybridní tablety budoucnosti. Canon rozšiřuje nabídku A3 multifunkcí pro hybridní pracovní prostředí. Správa a analýza dat tlačí podniky do cloudu.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-sprava-a-analyza-dat-tlaci-podniky-do-cloudu",
          "publishedOn": "2021-09-12T22:01:00.000Z",
          "wordCount": 1425,
          "title": "Týden na ITBiz: Správa a analýza dat tlačí podniky do cloudu"
        }
      ]
    },
    {
      "title": "abclinuxu - čerstvé zprávičky",
      "feedUrl": "http://www.abclinuxu.cz/auto/zpravicky.rss",
      "siteUrl": "http://www.abclinuxu.cz/zpravicky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/zpravicky/fairphone-4",
          "author": "Fluttershy, yay!",
          "description": "Firma Fairphone otevřela objednávky smartphone Fairphone 4 s Androidem 11 a pětiletou zárukou (Fairphone udržuje vydání Androidu i po skončení oficiální podpory). Ačkoliv se výrobce snaží o opravitelnost, použití etičtěji získaných materiálů atd., model Fairphone 4 nemá 3,5mm jack pro sluchátka, a tak je nutné dokoupit buď převodník pro zpětnou kompatibilitu, nebo použít bezdrátová sluchátka.",
          "link": "http://www.abclinuxu.cz/zpravicky/fairphone-4",
          "publishedOn": "2021-09-30T21:33:58.000Z",
          "wordCount": 1433,
          "title": "Fairphone 4"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/magpi-110-hackspace-47-a-wireframe-54",
          "author": "Ladislav Hagara",
          "description": "Nová čísla časopisů od nakladatelství Raspberry Pi: MagPi 110 (pdf), HackSpace 47 (pdf) a  Wireframe 54 (pdf).",
          "link": "http://www.abclinuxu.cz/zpravicky/magpi-110-hackspace-47-a-wireframe-54",
          "publishedOn": "2021-09-30T15:33:36.000Z",
          "wordCount": 873,
          "title": "MagPi 110, HackSpace 47 a Wireframe 54"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/postgresql-14",
          "author": "Ladislav Hagara",
          "description": "Byl vydán PostgreSQL ve verzi 14.0. Přehled novinek v poznámkách k vydání.",
          "link": "http://www.abclinuxu.cz/zpravicky/postgresql-14",
          "publishedOn": "2021-09-30T13:33:47.000Z",
          "wordCount": 854,
          "title": "PostgreSQL 14"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/qt-6.2-lts-qt-6.2-for-android-a-qt-design-studio-2.2",
          "author": "Ladislav Hagara",
          "description": "Byla vydána nová stabilní verze 6.2 multiplatformního frameworku a GUI toolkitu Qt. Více v přehledu novinek. Jedná se o LTS verzi. Dlouhodobá podpora je ale pouze pro držitele komerční licence. Současně bylo vydáno Qt 6.2 for Android a Qt Design Studio 2.2.",
          "link": "http://www.abclinuxu.cz/zpravicky/qt-6.2-lts-qt-6.2-for-android-a-qt-design-studio-2.2",
          "publishedOn": "2021-09-30T11:33:48.000Z",
          "wordCount": 967,
          "title": "Qt 6.2 LTS, Qt 6.2 for Android a Qt Design Studio 2.2"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/kea-2.0.0",
          "author": "Ladislav Hagara",
          "description": "Vývojáři open source DHCPv4 a DHCPv6 serveru Kea (Wikipedie) oznámili vydání nové stabilní verze 2.0.0. Přehled novinek v příspěvku na blogu.",
          "link": "http://www.abclinuxu.cz/zpravicky/kea-2.0.0",
          "publishedOn": "2021-09-29T21:27:01.000Z",
          "wordCount": 1141,
          "title": "Kea 2.0.0"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/soutez-pro-mlade-programatory-youth-hacking-4-freedom-yh4f",
          "author": "Ladislav Hagara",
          "description": "Free Software Foundation Europe (FSFE) organizuje soutěž pro mladé programátory ve věku 14 až 18 let s názvem Youth Hacking 4 Freedom (YH4F). Zaregistrovat se mohou do 31. října. Na vývoj svého svobodného softwaru budou mít pět měsíců, tj. do konce března. Šest nejlepších získá peněžitou výhru (2 x 4 096 €, 2 x 2 048 €, 2 x 1 024 €) a výlet do Bruselu.",
          "link": "http://www.abclinuxu.cz/zpravicky/soutez-pro-mlade-programatory-youth-hacking-4-freedom-yh4f",
          "publishedOn": "2021-09-28T23:52:15.000Z",
          "wordCount": 1125,
          "title": "Soutěž pro mladé programátory: Youth Hacking 4 Freedom (YH4F)"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/intel-software-defined-silicon-sdsi",
          "author": "Ladislav Hagara",
          "description": "Intel poslal do Linuxu patche přinášející podporu pro Intel Software Defined Silicon (SDSi). Uživatelé procesorů Xeon budou moci získat licence pro další funkce procesoru.",
          "link": "http://www.abclinuxu.cz/zpravicky/intel-software-defined-silicon-sdsi",
          "publishedOn": "2021-09-28T22:55:57.000Z",
          "wordCount": 1396,
          "title": "Intel Software Defined Silicon (SDSi)"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/bangle.js-2-open-source-chytre-hodinky",
          "author": "Ladislav Hagara",
          "description": "Na Kickstarteru běží kampaň na podporu open source chytrých hodinek Bangle.js 2. Programovat je lze v JavaScriptu (Espruino Open Source JavaScript interpreter). Koupit je lze za £59 (1 744 korun). Dodání je plánováno na listopad.",
          "link": "http://www.abclinuxu.cz/zpravicky/bangle.js-2-open-source-chytre-hodinky",
          "publishedOn": "2021-09-28T21:40:51.000Z",
          "wordCount": 1146,
          "title": "Bangle.js 2, open source chytré hodinky"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/supertuxkart-1.3",
          "author": "Ladislav Hagara",
          "description": "Byla vydána nová verze 1.3 svobodné multiplatformní závodní hry SuperTuxKart (STK). Přehled novinek v příspěvku na blogu v traileru na YouTube. Kompletní seznam změn na GitHubu.",
          "link": "http://www.abclinuxu.cz/zpravicky/supertuxkart-1.3",
          "publishedOn": "2021-09-28T21:02:14.000Z",
          "wordCount": 875,
          "title": "SuperTuxKart 1.3"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/fedora-linux-35-beta",
          "author": "Ladislav Hagara",
          "description": "Byla vydána betaverze Fedora Linuxu 35, tj. o poslední zastávce před vydáním finální verze, která je momentálně naplánována na 19. října. Fedora Workstation přichází s GNOME 41. Nově vychází Fedora Kinoite s prostředím KDE Plasma založena na rpm-ostree, podobně jako Fedora Silverblue s prostředím GNOME.",
          "link": "http://www.abclinuxu.cz/zpravicky/fedora-linux-35-beta",
          "publishedOn": "2021-09-28T20:48:38.000Z",
          "wordCount": 1009,
          "title": "Fedora Linux 35 Beta"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Armv9-GNU-Toolchain-Starting",
          "author": null,
          "description": "Arm engineers have begun landing their Armv9 enablement work in the GNU compiler toolchain...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Armv9-GNU-Toolchain-Starting",
          "publishedOn": "2021-10-01T11:22:00.000Z",
          "wordCount": 815,
          "title": "Arm Begins Adding Armv9 Support To The GNU Compiler Toolchain"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Proton-6.3-7-Plus-DLSS-Exp",
          "author": null,
          "description": "Valve published new versions of Proton and Proton Experimental last night...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Proton-6.3-7-Plus-DLSS-Exp",
          "publishedOn": "2021-10-01T09:10:12.000Z",
          "wordCount": 849,
          "title": "Proton Experimental Enables NVIDIA DLSS For D3D12 Games, Proton Now Handles More Games"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=September-2021-Highlights",
          "author": null,
          "description": "That's a wrap for September with 229 original news articles and another 13 featured Linux hardware reviews / multi-page benchmark articles, all written by your's truly. It was another eventful month with Linux 5.15 moving forward, a lot of driver activity by AMD and Intel, and other open-source milestones like the release of GNOME 41 and the shipping of the Ubuntu 21.10 and Fedora 35 beta releases...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=September-2021-Highlights",
          "publishedOn": "2021-10-01T04:00:00.000Z",
          "wordCount": 2771,
          "title": "Linux 5.15, AMD / Radeon Advancements, Intel SDSi Dominated Discussions This Month"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-CPU-GPU-Prio-Nice-Sched",
          "author": null,
          "description": "Intel's open-source Linux graphics driver engineers are evaluating possible improvements to the Linux kernel for accommodating CPU and GPU synchronized priority scheduling...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-CPU-GPU-Prio-Nice-Sched",
          "publishedOn": "2021-09-30T19:34:31.000Z",
          "wordCount": 963,
          "title": "Intel Exploring CPU+GPU Synchronized Priority Scheduling For Linux"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Linux-Audio-Guybrush",
          "author": null,
          "description": "In addition to Linux 5.15 adding a new AMD audio driver for \"Van Gogh\" APUs such as found in the forthcoming Steam Deck, AMD's open-source Linux driver engineers have also been working on other audio improvements -- this time on the Chromebook front...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Linux-Audio-Guybrush",
          "publishedOn": "2021-09-30T18:58:25.000Z",
          "wordCount": 807,
          "title": "New AMD Linux Audio Driver Patches Posted - Aimed For Enhancing Chromebook Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Loihi-2-Lava",
          "author": null,
          "description": "Intel has some new announcements around their neuromorphic computing research...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Loihi-2-Lava",
          "publishedOn": "2021-09-30T15:00:00.000Z",
          "wordCount": 926,
          "title": "Intel Announces Loihi 2, Lava Software Framework For Advancing Neuromorphic Computing"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.1M-IOPS-Per-Core",
          "author": null,
          "description": "Linux kernel developers have been working tirelessly to squeeze more performance out of IO_uring and the block / I/O code in general. IO_uring lead developer Jens Axboe who also serves as the Linux block subsystem's maintainer (among other roles and major contributions over the years) has used his system as a baseline for evaluating such kernel improvements. He's now moved to using AMD Zen 3 while sticking to Intel Optane storage and is seeing a mighty speed boost out of AMD's latest processors...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.1M-IOPS-Per-Core",
          "publishedOn": "2021-09-30T13:53:35.000Z",
          "wordCount": 825,
          "title": "Linux Achieves 5.1M IOPS Per-Core With AMD Zen 3 + Intel Optane"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=PostgreSQL-14",
          "author": null,
          "description": "PostgreSQL 14.0 is now officially available as the latest version of this widely-used, open-source SQL server...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=PostgreSQL-14",
          "publishedOn": "2021-09-30T13:19:19.000Z",
          "wordCount": 725,
          "title": "PostgreSQL 14.0 Released With More Performance Improvements"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=VirtIO-Linux-5.16-Ctx-Type",
          "author": null,
          "description": "Google's work on the VirtIO DRM kernel driver around the notion of \"context types\" and being able to initialize different types of contexts is set to be merged for Linux 5.16 in opening up more use-cases for this driver that is an important part of the open-source virtualization graphics stack for graphics...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=VirtIO-Linux-5.16-Ctx-Type",
          "publishedOn": "2021-09-30T12:29:44.000Z",
          "wordCount": 825,
          "title": "Linux 5.16 To Feature More Extensible VirtIO GPU Driver With \"Context Types\" Addition"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Qt-6.2-LTS-Released",
          "author": null,
          "description": "Qt 6.2 LTS is out today as the first long-term support release in the Qt6 series and also with all of the major modules now ported over from Qt5 in aiming to make this a suitable point to transition from Qt 5.15 LTS...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Qt-6.2-LTS-Released",
          "publishedOn": "2021-09-30T10:38:36.000Z",
          "wordCount": 858,
          "title": "Qt 6.2 LTS Released With Qt6 Now Aiming To Be Ready For Widespread Adoption"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMDVLK-2021.Q3.7",
          "author": null,
          "description": "AMD has pushed out one more code drop of their AMDVLK official open-source Vulkan driver before ending out the quarter...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMDVLK-2021.Q3.7",
          "publishedOn": "2021-09-30T10:09:48.000Z",
          "wordCount": 758,
          "title": "AMDVLK 2021.Q3.7 Driver Released With New Extensions, More Optimizations"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ampere-Altra-Max-Pricing",
          "author": null,
          "description": "From our Ampere Altra Max M128-30 Linux performance preview earlier this week, one of the questions a number of readers were wondering about and a question I also still had open was on the Altra Max pricing... I've now received the current price list and actually comes in much lower than expected for a 128-core CPU in 2021...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ampere-Altra-Max-Pricing",
          "publishedOn": "2021-09-30T09:55:28.000Z",
          "wordCount": 933,
          "title": "Ampere Altra Max 128-Core CPU Is Priced Lower Than Flagship Xeon, EPYC CPUs"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.2.3-Released",
          "author": null,
          "description": "Succeeding Mesa 21.2.2 from earlier this month that was a much delayed and in turn very large release, Mesa 21.2.3 is out today and it's on the quieter side...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.2.3-Released",
          "publishedOn": "2021-09-29T23:27:14.000Z",
          "wordCount": 777,
          "title": "Mesa 21.2.3 Released As A Small Update To This Graphics Driver Stack"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-pkill_on_warn",
          "author": null,
          "description": "A new kernel option was proposed today called \"pkill_on_warn\" that would kill all threads in a process if that process provoked a kernel warning...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-pkill_on_warn",
          "publishedOn": "2021-09-29T19:32:45.000Z",
          "wordCount": 882,
          "title": "\"pkill_on_warn\" Proposed For Killing Linux Processes That Cause A Kernel Warning"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=libcamera-2021",
          "author": null,
          "description": "Libcamera as an open-source camera stack that has been coming together over the past few years has been maturing quite well, broadening its supported hardware and feature set, and more in filling a void in the Linux camera ecosystem...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=libcamera-2021",
          "publishedOn": "2021-09-29T18:30:06.000Z",
          "wordCount": 804,
          "title": "Libcamera Maturing Well As Open-Source Camera Stack"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30568",
          "author": null,
          "description": "Recently I carried out some updated Windows 11 benchmarks against Linux to look at how this forthcoming Microsoft operating system release is competing with Ubuntu. In this article is a fresh look at the Windows Subsystem for Linux (WSL2) performance on the near-final Windows 11 against Ubuntu Linux.",
          "link": "https://www.phoronix.com/vr.php?view=30568",
          "publishedOn": "2021-09-29T13:18:02.000Z",
          "wordCount": 901,
          "title": "Windows 11 WSL2 Performance Is Quite Competitive Against Ubuntu 20.04 LTS / Ubuntu 21.10"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-30x-Energy-Efficiency-2025",
          "author": null,
          "description": "AMD this morning announced a goal of increasing the energy efficiency of EPYC processors running AI training and high performance workloads by 30x... Within the next four years...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-30x-Energy-Efficiency-2025",
          "publishedOn": "2021-09-29T13:09:14.000Z",
          "wordCount": 768,
          "title": "AMD Aims For 30x Energy Efficiency Improvement For AI Training + HPC By 2025"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=LibreOffice-Qt6-VCL",
          "author": null,
          "description": "Merged this morning into the LibreOffice code-base is the initial Qt6 VCL plug-in...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=LibreOffice-Qt6-VCL",
          "publishedOn": "2021-09-29T12:54:22.000Z",
          "wordCount": 722,
          "title": "LibreOffice Lands Initial Code For Qt6 Toolkit Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Zstd-Updated-For-Kernel-Soon",
          "author": null,
          "description": "While the Linux kernel is increasingly supporting the use of Zstd for various compression purposes, the current Zstd code within the kernel is out-of-date and efforts so far to re-base it against the closer to upstream Zstd state have been stalled. Fortunately, a new attempt at getting the Zstd code updated for the Linux kernel will be published soon...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Zstd-Updated-For-Kernel-Soon",
          "publishedOn": "2021-09-29T09:45:31.000Z",
          "wordCount": 900,
          "title": "Updated Zstd Implementation For The Linux Kernel Coming Soon"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-Better-VLK-Pre-Cache",
          "author": null,
          "description": "With the initial Steam Deck release quickly approaching, Valve continues to be quite busy on a variety of improvements to enhance their Steam Linux builds...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-Better-VLK-Pre-Cache",
          "publishedOn": "2021-09-29T00:51:22.000Z",
          "wordCount": 857,
          "title": "Steam Beta Improves Its Vulkan Pre-Caching System, PipeWire Capture Now Opt-In"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-RadeonSI-More-NGG",
          "author": null,
          "description": "AMD open-source driver developers today merged another big set of patches providing various micro-optimizations and other enhancements to the RadeonSI Gallium3D driver...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-RadeonSI-More-NGG",
          "publishedOn": "2021-09-28T22:35:54.000Z",
          "wordCount": 945,
          "title": "RadeonSI Driver Merges NGG Improvements, Other Optimizations For Mesa 21.3"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-PSF-Linux-5.16-KVM",
          "author": null,
          "description": "While the Linux kernel still hasn't added any formal control yet for AMD Predictive Store Forwarding to disable it short of also toggling Spectre V4 / SSBD, with the Linux 5.16 kernel the AMD PSF bit will now be exposed to KVM guest virtual machines so that they -- either with a patched/future kernel or for other operating systems -- may choose to toggle explicitly disable this AMD CPU feature...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-PSF-Linux-5.16-KVM",
          "publishedOn": "2021-09-28T18:48:42.000Z",
          "wordCount": 917,
          "title": "Linux 5.16 To Expose AMD PSF Disable Bit To KVM Guests"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Fedora-35-Beta-Released",
          "author": null,
          "description": "After seeing some initial release challenges, Fedora 35 Beta was released today across the Fedora Workstation, Fedora Server, and Fedora IoT flavors as well as their other versions...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Fedora-35-Beta-Released",
          "publishedOn": "2021-09-28T17:48:53.000Z",
          "wordCount": 823,
          "title": "Fedora 35 Beta Released With Many New Features, Countless Package Updates"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30562",
          "author": null,
          "description": "The past month we have started our testing of Ampere's Altra Max M128-30, the company's new 128 core server processor, and in this article today are our initial benchmarks of this promising chip for high core count servers in both 1P and 2P configurations tested.",
          "link": "https://www.phoronix.com/vr.php?view=30562",
          "publishedOn": "2021-09-28T13:30:00.000Z",
          "wordCount": 943,
          "title": "Ampere Altra Max M128-30 Linux Performance Preview"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Vulkan-1.2.194-Released",
          "author": null,
          "description": "Vulkan 1.2.194 is out as the latest spec revision to this high performance graphics and compute API...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Vulkan-1.2.194-Released",
          "publishedOn": "2021-09-28T13:29:28.000Z",
          "wordCount": 756,
          "title": "Vulkan 1.2.194 Brings New Extension For Google's Fuchsia OS"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Picolibc-2021",
          "author": null,
          "description": "While Keith Packard is known for his work on X11/X.Org, the past few years he has also been developing Picolibc as a C library intended for embedded systems. He also recently jumped from SiFive to Amazon and appears at the ecommerce giant to be working on Picolibc in an official capacity, presumably for use on Amazon's growing hardware devices...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Picolibc-2021",
          "publishedOn": "2021-09-28T13:00:12.000Z",
          "wordCount": 824,
          "title": "Picolibc Continues Maturing As Very Lightweight C Library For The Embedded World"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=OmniOS-r151038",
          "author": null,
          "description": "The open-source Solaris/Illumos ecosystem certainly isn't vibrant these days like back during the Sun Microsystems times with OpenSolaris, but OmniOS continues progressing as one of the few still-active and useful Solaris/Illumos-powered platforms...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=OmniOS-r151038",
          "publishedOn": "2021-09-28T12:09:53.000Z",
          "wordCount": 752,
          "title": "OmniOS Adds VirtFS File Sharing For Bhyve, Better System Console Performance"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Fedora-Java-Rough-Shape",
          "author": null,
          "description": "While many years ago Fedora's Java support was in great shape with quickly integrating OpenJDK going back to IcedTea, these days Fedora's Java packages are barely maintained and largely fallen into disrepair...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Fedora-Java-Rough-Shape",
          "publishedOn": "2021-09-28T09:51:46.000Z",
          "wordCount": 907,
          "title": "Fedora's Java Packages Have Fallen Into Rough Shape"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Cyan-Skillfish-DCN-2.01",
          "author": null,
          "description": "Since July we've seen AMD open-source driver engineers posting code for \"Cyan Skillfish\" as an APU with Navi 1x graphics. While initial support for Cyan Skillfish was merged for Linux 5.15, it turns out the display code isn't yet wired up due to being a different DCN2 variant for its display block...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Cyan-Skillfish-DCN-2.01",
          "publishedOn": "2021-09-28T04:00:00.000Z",
          "wordCount": 969,
          "title": "AMD Posts Code Enabling \"Cyan Skillfish\" Display Support Due To Different DCN2 Variant"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMDGPU-DP-2.0-Linux-5.16",
          "author": null,
          "description": "A batch of feature updates was submitted today for DRM-Next of early feature work slated to come to the next version of the Linux kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMDGPU-DP-2.0-Linux-5.16",
          "publishedOn": "2021-09-27T21:46:34.000Z",
          "wordCount": 968,
          "title": "Linux 5.16 To Bring Initial DisplayPort 2.0 Support For AMD Radeon Driver (AMDGPU)"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Software-Defined-Silicon",
          "author": null,
          "description": "There has been talk of Intel moving to offer more license-able/opt-in features for hardware capabilities found within a given processor as an upgrade. We are now seeing the Linux signs of that support coming with a driver for \"Intel Software Defined Silicon\" to allow for the secure activation of such features baked into the processor's silicon but only available as an up-charge option...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Software-Defined-Silicon",
          "publishedOn": "2021-09-27T18:45:32.000Z",
          "wordCount": 912,
          "title": "\"Intel Software Defined Silicon\" Coming To Linux For Activating Extra Licensed Hardware Features"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30554",
          "author": null,
          "description": "With the in-development Linux 5.15 kernel there is now support for ACPI Platform Profiles on supported ASUS laptops. This ASUS laptop platform profile support joins the likes of HP, Dell, and Lenovo laptops already having this support exposed under Linux that allows users to control their power/performance preference. Here are some tests with the ASUS ROG Strix G15 AMD Advantage laptop with the platform profile options under Linux 5.15.",
          "link": "https://www.phoronix.com/vr.php?view=30554",
          "publishedOn": "2021-09-27T12:15:52.000Z",
          "wordCount": 845,
          "title": "Testing The New ASUS Platform Profile Support In Linux 5.15"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/rss.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2522/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2522/",
          "publishedOn": "2021-09-29T04:00:00.000Z",
          "wordCount": 187,
          "title": "Two-Factor Security Key"
        },
        {
          "id": "https://xkcd.com/2521/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2521/",
          "publishedOn": "2021-09-27T04:00:00.000Z",
          "wordCount": 183,
          "title": "Toothpaste"
        },
        {
          "id": "https://xkcd.com/2520/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2520/",
          "publishedOn": "2021-09-24T04:00:00.000Z",
          "wordCount": 183,
          "title": "Symbols"
        },
        {
          "id": "https://xkcd.com/2519/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2519/",
          "publishedOn": "2021-09-22T04:00:00.000Z",
          "wordCount": 185,
          "title": "Sloped Border"
        }
      ]
    }
  ],
  "cliVersion": "1.11.2"
}