{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": [
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "author": null,
          "description": "Fixed: Unexpected nested element in author field crashes the parser\nThank you @ad-m",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "publishedOn": "2021-09-16T06:39:32.000Z",
          "wordCount": 343,
          "title": "v1.11.1"
        }
      ]
    },
    {
      "title": "Kotaku",
      "feedUrl": "https://kotaku.com/rss",
      "siteUrl": "https://kotaku.com",
      "articles": [
        {
          "id": "1847662757",
          "author": "Luke Plunkett",
          "description": "I can’t do it anymore. This is the year that NBA 2K has turned me into the Joker.\nRead more...",
          "link": "https://kotaku.com/nba-2k22-the-kotaku-review-1847662757",
          "publishedOn": "2021-09-23T00:30:00.000Z",
          "wordCount": 1656,
          "title": "NBA 2K22: The Kotaku Review"
        },
        {
          "id": "1847727356",
          "author": "Luke Plunkett",
          "description": "Look, Apex Legends is a fine shooter, but Titanfall 2 was one of the greatest first-person games of all time, so you can understand why folks just will not shut up about wanting another entry in the series.\n\nRead more...",
          "link": "https://kotaku.com/were-just-never-getting-another-titanfall-are-we-1847727356",
          "publishedOn": "2021-09-22T23:40:00.000Z",
          "wordCount": 436,
          "title": "We're Just Never Getting Another Titanfall, Are We [Update]"
        },
        {
          "id": "1847726453",
          "author": "Ian Walker",
          "description": "While fresh duds and some great quality-of-life changes are definitely exciting, today’s Pokémon Unite update also included a huge list of gameplay adjustments. As usual, some Pokémon were helped and some were hindered, but it’s hard to argue that anyone was more affected than Snorlax and Wigglytuff. Both saw a…\nRead more...",
          "link": "https://kotaku.com/pokemon-unite-sleep-nerf-could-devastate-snorlax-wiggl-1847726453",
          "publishedOn": "2021-09-22T21:30:00.000Z",
          "wordCount": 620,
          "title": "Pokémon Unite Sleep Nerf Could Devastate Snorlax, Wigglytuff Players"
        },
        {
          "id": "1847726293",
          "author": "Sisi Jiang",
          "description": "The Animal Crossing character Ankha is currently a popular meme trending on TikTok, and (perhaps not so) surprisingly, it’s because of a fan-made animated porn clip of her. \nRead more...",
          "link": "https://kotaku.com/animal-crossings-ankha-porn-video-becomes-internet-sens-1847726293",
          "publishedOn": "2021-09-22T21:10:00.000Z",
          "wordCount": 539,
          "title": "Animal Crossing's Ankha Porn Video Becomes Internet Sensation"
        },
        {
          "id": "1847725473",
          "author": "Ethan Gach",
          "description": "Video games are inescapably intertwined with iteration and do-overs. It’s written into the technology that builds them, the development practices that craft them, and often the very rules governing how they work: win-lose, trial and error. Some games have tried to mask this artifice in the service of more naturalistic…\nRead more...",
          "link": "https://kotaku.com/deathloop-the-kotaku-review-1847725473",
          "publishedOn": "2021-09-22T20:00:00.000Z",
          "wordCount": 2686,
          "title": "Deathloop: The Kotaku Review"
        },
        {
          "id": "1847725379",
          "author": "Jeremy Winslow",
          "description": "Skater XL, the skateboarding simulator developed by Easy Day Studios, is one of two more recent genre entries that attempts to capture the zeitgeist of EA’s Skate. The game plops you in a myriad of selectable maps, each replete with various obstacles (such as benches and rails) to trick over, all while skating as…\nRead more...",
          "link": "https://kotaku.com/the-whiteness-of-skater-xl-s-mods-is-a-major-bummer-1847725379",
          "publishedOn": "2021-09-22T19:40:00.000Z",
          "wordCount": 1004,
          "title": "The Whiteness of Skater XL’s Mods Is A Major Bummer"
        },
        {
          "id": "1847725192",
          "author": "Renata Price",
          "description": "Today, Tim Sweeney confirmed on Twitter just how massive of an “L” Epic took in its recent trial against Apple. Apple has effectively “blacklisted” Fortnite from all Apple products until the legal clash between the two massive corporations reaches its conclusion, which could take as long as five years. (It’s even…\nRead more...",
          "link": "https://kotaku.com/epic-confirms-massive-l-fortnite-not-returning-to-appl-1847725192",
          "publishedOn": "2021-09-22T19:15:00.000Z",
          "wordCount": 644,
          "title": "Epic Confirms Massive L: Fortnite Not Returning To Apple Any Time Soon"
        },
        {
          "id": "1847724901",
          "author": "Renata Price",
          "description": "Fighting game YouTubers (like JMSCrofts, Jiyuna, and Rooflemonger) are talking a lot about Melty Blood: Type Lumina. This is not a complaint. As someone very new to fighting games it has been great to watch people absolutely lose their minds over an upcoming release (while still expressing concerns), and for them to…\nRead more...",
          "link": "https://kotaku.com/why-the-fgc-won-t-stop-talking-about-melty-blood-type-1847724901",
          "publishedOn": "2021-09-22T18:45:00.000Z",
          "wordCount": 1258,
          "title": "Why The FGC Won’t Stop Talking About Melty Blood: Type Lumina"
        },
        {
          "id": "1847724601",
          "author": "Ian Walker",
          "description": "If you’ve visited Final Fantasy XIV city-state Ishgard recently, you might have noticed a throng of players surrounding the home of Ishgardian noble Count Edmont de Fortemps. Over the last several days, mourners have turned Fortemps Manor into a makeshift vigil for voice actor Stephen Critchlow, who sadly passed away…\nRead more...",
          "link": "https://kotaku.com/final-fantasy-xiv-players-mourn-voice-actor-s-death-wit-1847724601",
          "publishedOn": "2021-09-22T18:30:00.000Z",
          "wordCount": 482,
          "title": "Final Fantasy XIV Players Mourn Voice Actor’s Death With In-Game Vigils"
        },
        {
          "id": "1847723095",
          "author": "Patricia Hernandez",
          "description": "Since release, it’s been difficult to talk about the merits of pocket monster MOBA Pokémon Unite. The fun factor was there, though largely obscured by TiMi Studio Group’s monetization practices, which allow you to boost items with real-world money. But with Wednesday’s big new patch, Pokémon Unite is now way more…\nRead more...",
          "link": "https://kotaku.com/pokemon-unite-just-massively-leveled-the-playing-field-1847723095",
          "publishedOn": "2021-09-22T18:00:00.000Z",
          "wordCount": 1124,
          "title": "Pokémon Unite Just Massively Leveled The Playing Field Against 'Pay To Win'"
        },
        {
          "id": "1847722674",
          "author": "Ari Notis",
          "description": "Life doesn’t often let you know when your brain will flip. If you ever do receive such a heads-up, you’d be wise to heed it. I learned so while playing Renaissance Faire, a massively multiplayer real-world role-playing game that is only nominally about the Renaissance.\nRead more...",
          "link": "https://kotaku.com/renaissance-faire-the-kotaku-review-1847722674",
          "publishedOn": "2021-09-22T16:30:00.000Z",
          "wordCount": 2301,
          "title": "Renaissance Faire: The Kotaku Review"
        },
        {
          "id": "1847723098",
          "author": "Carolyn Petit",
          "description": "Years ago, I saw a video on YouTube—since removed, it seems, though a few like it still remain—of a GTAV player deliberately brutalizing some of the game’s trans sex workers for his own amusement. In the comments, one viewer voiced these chilling words of encouragement: “You’re doing God’s work.”\n\nRead more...",
          "link": "https://kotaku.com/gtav-s-enhanced-2022-release-should-leave-the-2013-tran-1847723098",
          "publishedOn": "2021-09-22T16:05:00.000Z",
          "wordCount": 1398,
          "title": "GTAV’s Enhanced 2022 Release Should Leave The 2013 Transphobia Behind"
        },
        {
          "id": "1847722557",
          "author": "Sisi Jiang",
          "description": "I’ve been building up my Raiden Shogun character so that I could use her to clear Genshin Impact’s latest chapter. She’s the main antagonist of the game’s Inazuma region, so I thought it would be interesting to attack and dethrone god using god herself. \nRead more...",
          "link": "https://kotaku.com/playing-genshin-impacts-last-update-as-its-villain-was-1847722557",
          "publishedOn": "2021-09-22T15:15:00.000Z",
          "wordCount": 1226,
          "title": "Playing Genshin Impact's Last Update As Its Villain Was Eye-Opening"
        },
        {
          "id": "1847722504",
          "author": "Ari Notis",
          "description": "Pour one out for every gamer who had plans after work tomorrow. Nintendo will host a Nintendo Direct at 6:00 p.m. ET sharp, it announced today in a tweet. The showcase, which will cover Switch games “launching this winter,” is slated to last about 40 minutes.\nRead more...",
          "link": "https://kotaku.com/nintendo-announces-surprise-40-minute-direct-for-thursd-1847722504",
          "publishedOn": "2021-09-22T14:55:00.000Z",
          "wordCount": 460,
          "title": "Nintendo Announces Surprise 40-Minute Direct For Thursday"
        },
        {
          "id": "1847721984",
          "author": "Alex Walker",
          "description": "If you’re a CSGO fan, get ready for some of the biggest changes the game has seen in years.\nRead more...",
          "link": "https://kotaku.com/the-latest-csgo-update-might-be-the-biggest-in-years-1847721984",
          "publishedOn": "2021-09-22T13:55:00.000Z",
          "wordCount": 945,
          "title": "The Latest CSGO Update Might Be The Biggest In Years"
        },
        {
          "id": "1847720236",
          "author": "Luke Plunkett",
          "description": "When Paradox announced Victoria III earlier this year, I was very excited, but also a little wary. Simulating the comedic excesses of medieval rulers is one thing, but how was a game coming out in 2022 (?) going to handle depictions of very real and lingering issues like the exploitation of workers and, on even…\nRead more...",
          "link": "https://kotaku.com/pc-game-is-gonna-really-lean-into-slavery-1847720236",
          "publishedOn": "2021-09-22T01:30:00.000Z",
          "wordCount": 1013,
          "title": "PC Game Is Gonna Really Lean Into Slavery"
        },
        {
          "id": "1847719663",
          "author": "Luke Plunkett",
          "description": "With Overwatch 2 still in development, the series’ executive producer has quit Blizzard for what the company says is “some time off.”\n\nRead more...",
          "link": "https://kotaku.com/overwatch-2s-boss-is-quitting-blizzard-for-some-time-o-1847719663",
          "publishedOn": "2021-09-21T23:30:00.000Z",
          "wordCount": 532,
          "title": "Overwatch 2's Boss Is Quitting Blizzard For \"Some Time Off\""
        },
        {
          "id": "1847719489",
          "author": "Isaiah Colbert",
          "description": "The rivalry between Mario and Sonic goes back for decades, but even one of Sonic’s creators was stunned to see the blue hedgehog apparently giving chase to Mario in a whole new realm: that of outrageously priced video game auctions.\nRead more...",
          "link": "https://kotaku.com/even-sonic-dad-yuji-naka-is-shocked-at-game-s-430-000-1847719489",
          "publishedOn": "2021-09-21T23:00:00.000Z",
          "wordCount": 498,
          "title": "Even Sonic Dad Yuji Naka Is Shocked At Game’s $430,500 Auction Price"
        },
        {
          "id": "1847719508",
          "author": "Luke Plunkett",
          "description": "Last year, a music industry crackdown on streaming site Twitch resulted in copyright strikes and a mass deletion of videos, as the National Music Publishers’ Association (NMPA) sought to cut down on streamers’ playing licensed music. Twitch has now made a deal with the NMPA, but for streamers it’s not exactly a…\nRead more...",
          "link": "https://kotaku.com/twitch-and-music-industry-strike-a-deal-but-its-not-gr-1847719508",
          "publishedOn": "2021-09-21T22:40:00.000Z",
          "wordCount": 756,
          "title": "Twitch And Music Industry Strike A Deal, But It's Not Great"
        },
        {
          "id": "1847719143",
          "author": "Ian Walker",
          "description": "The fine folks at Digital Foundry are back with another wonderfully tech-heavy video, this time examining the SSD options available to PlayStation 5 owners now that the console’s storage can be expanded. As it turns out, even the disk-access-heavy Ratchet & Clank: Rift Apart can be thoroughly enjoyed with the…\nRead more...",
          "link": "https://kotaku.com/ratchet-clank-still-runs-fine-on-the-worst-ps5-compat-1847719143",
          "publishedOn": "2021-09-21T22:00:00.000Z",
          "wordCount": 733,
          "title": "Ratchet & Clank Still Runs Fine On The Worst PS5-Compatible SSD"
        },
        {
          "id": "1847718451",
          "author": "Isaiah Colbert",
          "description": "It’s a fact: The women who helped shape the video game industry often go unacknowledged, hidden from history by popular narratives and male-centric scholarship. Mary Kenney, a narrative writer and game designer at Insomniac Games, aims to shed light on some of those overlooked pioneers by highlighting key women who’ve…\nRead more...",
          "link": "https://kotaku.com/uncovering-the-real-history-of-the-women-who-pioneered-1847718451",
          "publishedOn": "2021-09-21T20:30:00.000Z",
          "wordCount": 1373,
          "title": "Uncovering The Real History Of The Women Who Pioneered Video Games"
        },
        {
          "id": "1847717192",
          "author": "Ian Walker",
          "description": "UK developer Kinetic Games updated its multiplayer ghost-hunting game Phasmophobia several times over the last few weeks to celebrate its one-year anniversary, but the latest patch is a doozy, adding an offline single-player mode that I’m never, ever, evereverevereverever going to touch.\nRead more...",
          "link": "https://kotaku.com/phasmophobia-adds-offline-solo-mode-which-i-will-never-1847717192",
          "publishedOn": "2021-09-21T19:50:00.000Z",
          "wordCount": 497,
          "title": "Phasmophobia Adds Offline Solo Mode, Which I Will Never Use"
        },
        {
          "id": "1847716208",
          "author": "Ari Notis",
          "description": "Earlier this summer, developer 343 Industries hosted what was basically a beta for Halo Infinite, the story of one man’s quest to fall in love with a computer. It was bonkers. This week, over on Halo Waypoint, 343 detailed what’s in store for Infinite’s second beta (and, to a lesser degree, the game’s December 8…\nRead more...",
          "link": "https://kotaku.com/the-latest-stuff-coming-to-halo-infinite-you-should-kno-1847716208",
          "publishedOn": "2021-09-21T17:00:00.000Z",
          "wordCount": 890,
          "title": "The Latest Stuff Coming To Halo Infinite You Should Know About"
        },
        {
          "id": "1847716375",
          "author": "Renata Price",
          "description": "Quantic Dream, creators of “so bad, they’re bad” games like Heavy Rain and Detroit: Become Human, recently brought libel action against two French newspapers which had jointly published allegations of misconduct against individuals at the company back in 2018. Now the court has ruled both for and against the…\nRead more...",
          "link": "https://kotaku.com/detroit-dev-quantic-dreams-wins-lawsuit-without-actuall-1847716375",
          "publishedOn": "2021-09-21T16:45:00.000Z",
          "wordCount": 737,
          "title": "Detroit Dev Quantic Dream Wins Lawsuit Without Actually Disproving Misconduct Allegations"
        },
        {
          "id": "1847707750",
          "author": "John Walker",
          "description": "INT. X-WING PILOT APARTMENTS - DAY\nRead more...",
          "link": "https://kotaku.com/leaked-script-from-david-cages-star-wars-game-1847707750",
          "publishedOn": "2021-09-21T15:30:00.000Z",
          "wordCount": 662,
          "title": "Leaked Script From David Cage's Star Wars Game"
        }
      ]
    },
    {
      "title": "Nintendo Life | Latest Updates",
      "feedUrl": "https://www.nintendolife.com/feeds/latest",
      "siteUrl": "https://www.nintendolife.com/feeds/latest",
      "articles": [
        {
          "id": "https://www.nintendolife.com/#article-121283",
          "author": null,
          "description": "Has your main been nerfed?\nAlthough Pokémon Unite is arguably a lot more accessible than your average MOBA, that doesn't make it any less complicated when it comes to fine-tuning the game's balance.\nLike all games under this banner, Unite has been receiving balance adjustments in every update to ensure the competition remains fair at all times. In the latest patch - which added support for mobile devices and cross-play features, the developer rolled out a stack of changes to Pokémon stats and moves.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/pokemon_unite_has_been_updated_here_are_the_full_patch_notes",
          "publishedOn": "2021-09-23T05:30:00.000Z",
          "wordCount": 1998,
          "title": "Pokémon Unite Has Been Updated, Here Are The Full Patch Notes"
        },
        {
          "id": "https://www.nintendolife.com/#article-121284",
          "author": null,
          "description": "The first will be announced on October 2nd.\nAhead of the 25th anniversary of the RPG series Atelier next May, Koei Tecmo and Gust have launched a special website.\nThe series first started out with Atelier Marie: The Alchemist of Salburg on the original PlayStation in May 1997. To celebrate 25 years, the website will reveal a total of six projects.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/atelier_series_teases_six_exciting_projects_for_its_25th_anniversary",
          "publishedOn": "2021-09-23T04:30:00.000Z",
          "wordCount": 1493,
          "title": "Atelier Series Teases Six Exciting Projects For Its 25th Anniversary"
        },
        {
          "id": "https://www.nintendolife.com/#article-121281",
          "author": null,
          "description": "Would you pay $25k for a \"used\" Mew cookie?\n\nAs predicted, the \"limited-edition\" Pokémon Oreos are now being listed on sites like eBay for some insane prices.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/random_scalpers_are_now_attempting_to_sell_limited_edition_pokemon_oreos_for_outrageous_prices_on_ebay",
          "publishedOn": "2021-09-23T02:30:00.000Z",
          "wordCount": 1911,
          "title": "Random: Scalpers Are Now Attempting To Sell \"Limited Edition\" Pokémon Oreos For Outrageous Prices On eBay"
        },
        {
          "id": "https://www.nintendolife.com/#article-121279",
          "author": null,
          "description": "Master Chief, Waluigi, Fighters Pass 3...\nAs you might have heard, a new Nintendo Direct broadcast will be taking place tomorrow. The presentation will run for \"roughly\" 40 minutes and is expected to focus \"mainly\" on Nintendo Switch games launching this winter.\nWhile we've heard all sorts of rumours from Game Boy coming to Nintendo Switch Online to a mysterious new controller reveal in the lead up to this Direct, there's also been a lot of speculation about the final DLC fighter announcement for Super Smash Bros. Ultimate, and it seems to have now gone into overdrive - with Smash trending around the globe on platforms like Twitter, as fans make what could be their final predictions.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/random_nintendo_direct_announcement_sends_smash_bros_final_dlc_fighter_speculation_into_overdrive",
          "publishedOn": "2021-09-23T00:55:00.000Z",
          "wordCount": 4137,
          "title": "Random: Nintendo Direct Announcement Sends Smash Bros. Final DLC Fighter Speculation Into Overdrive"
        },
        {
          "id": "https://www.nintendolife.com/#article-121278",
          "author": null,
          "description": "Featuring songs from the past three decades.\nThere have been all sorts of video game anniversary celebrations this year, but one of the highlights of the lot would have to be Sonic the Hedgehog's 30th anniversary.\nEarlier this year Sega held a special Livestream announcing new games and the return of some old ones, and following this was a very special 30th-anniversary symphony - featuring iconic Sonic songs from the past three decades and even a performance by Crush 40.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/sonics_30th_anniversary_symphony_album_is_now_available_on_major_digital_services",
          "publishedOn": "2021-09-22T23:55:00.000Z",
          "wordCount": 1092,
          "title": "Sonic's 30th Anniversary Symphony Album Is Now Available On Major Digital Services"
        },
        {
          "id": "https://www.nintendolife.com/#article-121277",
          "author": null,
          "description": "Plus two special editions!\nRemember that movie Hitch, where Will Smith plays a terrible, egotistical matchmaker? Well, Cupid Parasite is a little bit like that, but also not really like that at all.\nYou'll play as Lynette Mirror, a bridal advisor and matchmaker who is also secretly Cupid, the god of love. But she's about to meet her match (pun intended) when she's tasked with fixing up the \"Parasite Five\", a group of five men who are apparently so hopeless that not even a literal god can get them dates. You'll be helping them the only way you know how: by staging a reality TV show, of course!\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/romantic_comedy_otome_cupid_parasite_is_coming_to_switch_this_year",
          "publishedOn": "2021-09-22T20:30:00.000Z",
          "wordCount": 1633,
          "title": "Romantic Comedy Otome 'Cupid Parasite' Is Coming To Switch This Year"
        },
        {
          "id": "https://www.nintendolife.com/#article-121276",
          "author": null,
          "description": "Wait 'til my father hears about this, Potter.\nIf you enjoyed Harry Potter, but wish that you could play something more LGBTQ+-friendly, then Ikenfell might scratch that particular itch: set in a world where magic-users must attend a school to harness and control their abilities, but where something powerful is on the loose, Ikenfell is all about how friendship, trust, trauma, and badass spells can help you defeat evil.\nNow, the turn-based RPG is getting a physical edition through Limited Run Games, with pre-orders starting on Friday, the 24th September and ending on Sunday, October 24th.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/wizard_school_rpg_ikenfell_is_getting_a_physical_edition",
          "publishedOn": "2021-09-22T19:30:00.000Z",
          "wordCount": 1402,
          "title": "Wizard School RPG Ikenfell Is Getting A Physical Edition"
        },
        {
          "id": "https://www.nintendolife.com/#article-121269",
          "author": null,
          "description": "From the team that brought us STAY.\nWhile download stores are full of certain game 'types' all vying for the same audience, there are also Indie studios producing experiences that are rather unique. Frank and Drake, from Spanish studio Appnormals Team, may be one to watch when it arrives on Switch in Spring 2022.\nAppnormals Team previously developed STAY on Switch, itself a fascinating piece of storytelling that we quite enjoyed in our review. Frank and Drake certainly has eye-catching visuals, which utilise a rotoscoping technique in which live action video is then painted over frame-by-frame. In terms of the storyline it draws inspiration from Frankenstein and Dracula, as two roommates communicate solely through notes and other means. One works only at night, another in the day, and the game promises multiple mysteries, varied characters to meet, assorted puzzles and multiple endings.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/frank_and_drake_is_an_intriguing_dual_narrative_inspired_by_frankenstein_and_dracula",
          "publishedOn": "2021-09-22T19:00:00.000Z",
          "wordCount": 908,
          "title": "Frank And Drake Is An Intriguing 'Dual Narrative' Inspired By Frankenstein And Dracula"
        },
        {
          "id": "https://www.nintendolife.com/#article-120713",
          "author": null,
          "description": "Nintendo is DOOMED.\n2016 is a long, long, loooong time ago now, but I'll try to take you back to October 20th, 2016, the day the Nintendo Switch was announced. The US Presidential Election was looming, Brexit was still a massive question mark, and Disney's Moana, Disney's Rogue One, Disney's Captain America: Civil War, and Disney's Finding Dory were dominating movie news headlines.\nThe Wii U had not performed well, and as a result, people were apprehensive, sceptical, and downright derisive when Nintendo finally announced that their next hardware release, codenamed NX, would be a hybrid home and portable console with the name \"Nintendo Switch\". It seemed gimmicky, a little tacky, and perhaps not the new direction that people were hoping for, and Nintendo's stock actually fell from $32.40 to $28.75 following the announcement.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/talking_point_remember_when_people_thought_switch_would_fail",
          "publishedOn": "2021-09-22T17:00:00.000Z",
          "wordCount": 18056,
          "title": "Talking Point: Remember When People Thought Switch Would Fail?"
        },
        {
          "id": "https://www.nintendolife.com/#article-116880",
          "author": null,
          "description": "Update: Bag a free microfibre cloth with My Nintendo Store UK pre-orders.\n\nUpdate (22nd Sep 2021): Pre-orders from My Nintendo Store UK will now come with a free microfibre cloth bonus gift (above) while stocks last. If you've previously pre-ordered the Zelda: Game & Watch from My Nintendo Store UK, your order will automatically by upgraded!\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/guides/where-to-pre-order-game-and-watch-the-legend-of-zelda",
          "publishedOn": "2021-09-22T16:50:00.000Z",
          "wordCount": 4785,
          "title": "Guide: Where To Pre-Order Game & Watch: The Legend of Zelda"
        },
        {
          "id": "https://www.nintendolife.com/#article-121270",
          "author": null,
          "description": "Can you make it to the top of the tower?\nDANGEN Entertainment has announced that Evertried, a tactical roguelite game headed to Nintendo Switch, will launch on the eShop on 21st October.\nSet in the afterlife, Evertried has you taking on the role of a fallen warrior who must ascend a mysterious tower. Each floor of the tower offers up a unique turn-based combat challenge, where you'll need to make great use of your positioning, attacks and movement to win each fight and make it to the next floor.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/tactical_roguelite_evertried_brings_strategic_turn-based_battles_to_switch_next_month",
          "publishedOn": "2021-09-22T16:00:00.000Z",
          "wordCount": 1239,
          "title": "Tactical Roguelite 'Evertried' Brings Strategic Turn-Based Battles To Switch Next Month"
        },
        {
          "id": "https://www.nintendolife.com/#article-121258",
          "author": null,
          "description": "Seven designs available.\nWhat's cooler than owning a phone capable of wireless charging? Using it with a wireless charging mat with Sonic's face on, that's what.\nYes, a new collection of official Sega wireless charging mats have hit the market thanks to Numskull Designs, and they're available to pick up right now from Sega's store (visit here for UK, and here for the rest of Europe).\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/these_new_sega_charging_mats_let_you_wirelessly_charge_your_phone_in_style",
          "publishedOn": "2021-09-22T15:00:00.000Z",
          "wordCount": 1401,
          "title": "These New Sega Charging Mats Let You Wirelessly Charge Your Phone In Style"
        },
        {
          "id": "https://www.nintendolife.com/#article-121256",
          "author": null,
          "description": "It's free, but you'll need to visit to play.\nThanks to a new partnership with The Palace of Versailles, Ubisoft has announced an all-new Rabbid augmented reality game for mobile.\nCalled 'Rabbids @ Versailles', this free app lets visitors of the palace take part in ten AR minigames which aim to give children \"a fun-filled learning experience\". These games take the form of a treasure hunt in which the Rabbids have invaded the palace's gardens – players must flush them out as they try to track down the mysterious Rabbid Louis XIV.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/ubisofts_rabbids_invade_the_palace_of_versailles_in_new_augmented_reality_app",
          "publishedOn": "2021-09-22T14:30:00.000Z",
          "wordCount": 1120,
          "title": "Ubisoft's Rabbids Invade The Palace Of Versailles In New Augmented Reality App"
        },
        {
          "id": "https://www.nintendolife.com/#article-120296",
          "author": null,
          "description": "What do you hope to see?\nNintendo has announced that its latest Nintendo Direct presentation will air tomorrow, Thursday 23rd September.\nThe show will be roughly 40 minutes long and will feature \"information focused mainly on Nintendo Switch games launching this winter.\"\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/next_nintendo_direct_to_air_tomorrow_23rd_september_2021",
          "publishedOn": "2021-09-22T14:01:00.000Z",
          "wordCount": 13615,
          "title": "Next Nintendo Direct To Air Tomorrow, 23rd September 2021"
        },
        {
          "id": "https://www.nintendolife.com/#article-121254",
          "author": null,
          "description": "Online, co-op and a campaign all included.\nLast year brought us Red Wings: Aces of the Sky on Switch eShop, an arcade-styled flying game with a big emphasis on dogfights and action. Developer All in! Games has now confirmed a spin-off that's heading to Switch and PC 'soon' - Red Wings: American Aces.\nIt's not just a shift in location and planes that are the focus of this new entry, but it seems that this arrival will bring quite a lot of additional content and modes. There'll still be a solo campaign with optional co-op, but there'll also be various options for local and online multiplayer.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/red_wings_american_aces_is_flying_onto_switch_soon",
          "publishedOn": "2021-09-22T14:00:00.000Z",
          "wordCount": 861,
          "title": "Red Wings: American Aces Is Flying Onto Switch 'Soon'"
        },
        {
          "id": "https://www.nintendolife.com/#article-121261",
          "author": null,
          "description": "The latest Metroid Dread report is here.\nNintendo has dropped the latest edition of its Metroid Dread report, giving us a great look at the areas you'll be exploring when the game launches on Switch next month.\nAs you may already know from all the footage shared so far, Metroid Dread takes Samus on a new adventure through Planet ZDR. This unexplored planet shares certain similarities with SR388 – a planet that Metroid II: Return of Samus and Metroid: Samus Returns fans will be more than familiar with – and is split up into several areas.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/metroid_dread_heres_a_closer_look_at_the_deadly_areas_youll_explore_on_planet_zdr",
          "publishedOn": "2021-09-22T13:30:00.000Z",
          "wordCount": 3487,
          "title": "Metroid Dread: Here's A Closer Look At The Deadly Areas You'll Explore On Planet ZDR"
        },
        {
          "id": "https://www.nintendolife.com/#article-121163",
          "author": null,
          "description": "We tried, okay?\nGather round, folks, for a tale of love, loss, and failure: For never was a story of more woe, than this of Kate and her, er, GameCube controller.\nLet's back up a little. 'Twas a Friday night after a long and tiring week, and my partner and I sat down for a game of Staxel, which is a sort of Minecraft-Animal Crossing-Harvest Moon hybrid launching on 23rd September that's entirely made out of voxels. Since it was the 20th anniversary week of the GameCube, we decided (or, well, I pitched to the editor) to try out the co-op aspect of the game by building a GameCube controller, in celebration of everyone's favourite game-shape that isn't already a cube.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/hands_on_we_created_a_gamecube_pad_in_minecraft-style_farm_sim_staxel",
          "publishedOn": "2021-09-22T13:00:00.000Z",
          "wordCount": 2124,
          "title": "Hands On: We Created A GameCube Pad In Minecraft-Style Farm Sim 'Staxel'"
        },
        {
          "id": "https://www.nintendolife.com/#article-121253",
          "author": null,
          "description": "*Insert gripe about MK8's age here...\nMario Kart Tour is now two years old, and is evidently still popular enough to keep on rolling with fortnightly events and content updates. Nintendo is rolling out plenty of goodies to celebrate the landmark with the 2nd Anniversary Tour, which is running now until 5th/6th October.\nAs you can see in the trailer a big part of the celebration is the return of 8 city courses into the rotation, adding a bit of style and variety for the next two weeks. Some familiar character designs are also returning, along with an RT promotion that could earn players a whole lot of coins.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/mario_kart_tour_launches_event_to_celebrate_its_2nd_anniversary",
          "publishedOn": "2021-09-22T12:30:00.000Z",
          "wordCount": 2401,
          "title": "Mario Kart Tour Launches Event To Celebrate Its 2nd Anniversary"
        },
        {
          "id": "https://www.nintendolife.com/#article-121245",
          "author": null,
          "description": "A Switch exclusive!\nRemember Slice of Life, the Switch-exclusive arcade-style tennis game that was revealed back in March 2020? Well, we've finally been treated to a new update on its progress, and a release date is right around the corner.\nOriginally planned to launch last summer, the game will now arrive on Nintendo's eShop on 8th October 2021. The new release date trailer (up above) gives us a fresh look at the game's story mode, where players take on the role of Drake Lacasse as he starts a new life at Rosegate University, makes new friends, and competes on the court.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/story-driven_arcade_tennis_game_slice_of_life_gets_new_trailer_and_october_release_date",
          "publishedOn": "2021-09-22T12:00:00.000Z",
          "wordCount": 1040,
          "title": "Story-Driven Arcade Tennis Game 'Slice Of Life' Gets New Trailer And October Release Date"
        },
        {
          "id": "https://www.nintendolife.com/#article-121243",
          "author": null,
          "description": "The eShop's biggest games.\nNintendo has shared an updated list of Europe's most-downloaded Switch eShop games, revealing which titles were the most popular during August 2021.\nMinecraft continues to sell incredibly well on the platform, moving up into first place this time around. It overtakes last month's number one The Legend of Zelda: Skyward Sword HD to get there, also fending off the threat of the similarly popular Among Us.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/nintendo_reveals_the_top_15_most-downloaded_switch_games_in_august_2021_europe",
          "publishedOn": "2021-09-22T11:00:00.000Z",
          "wordCount": 1154,
          "title": "Nintendo Reveals The Top 15 Most-Downloaded Switch Games In August 2021 (Europe)"
        },
        {
          "id": "https://www.nintendolife.com/#article-121250",
          "author": null,
          "description": "Nintendo apologises and offers new date.\nNintendo has announced that the double pack of amiibo set to launch alongside Metroid Dread next month have unfortunately been delayed across the UK and Europe, and will no longer appear at retail on 8th October as planned.\nInstead, the amiibo will now launch on 5th November. In a statement shared to social media, Nintendo apologises for the delay and cites \"unforeseen shipping delays\" as the reasoning behind the new, later release date.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/metroid_dreads_samus_and_emmi_amiibo_delayed_in_uk_and_europe",
          "publishedOn": "2021-09-22T10:10:00.000Z",
          "wordCount": 1717,
          "title": "Metroid Dread's Samus And EMMI amiibo Delayed In UK And Europe"
        },
        {
          "id": "https://www.nintendolife.com/#article-121242",
          "author": null,
          "description": "Celebi, Venusaur, and Whispy Woods star.\nDo images get any cuter than this?\nNintendo has unveiled its plans for the next Spirit Board event in Super Smash Bros. Ultimate, and this one's all about nature.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/smash_bros_ultimates_next_event_celebrates_all_things_nature",
          "publishedOn": "2021-09-22T10:00:00.000Z",
          "wordCount": 1040,
          "title": "Smash Bros. Ultimate's Next Event Celebrates All Things Nature"
        },
        {
          "id": "https://www.nintendolife.com/#article-121240",
          "author": null,
          "description": "Coming to Switch in 2022.\nPhantom Breaker: Omnia is headed to Switch and other platforms early next year, and Rocket Panda Games has given us our first taste of the game's English dub.\nIf you need catching up on this one, Phantom Breaker: Omnia is a 2D anime fighting game boasting 20 characters to choose from. Players can also choose between three different fighting styles, which the game's publisher notes \"will appeal to seasoned gamers while making the game accessible to newcomers\".\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/2d_anime_fighter_phantom_breaker_omnia_gets_an_english_dub_trailer",
          "publishedOn": "2021-09-22T09:30:00.000Z",
          "wordCount": 1389,
          "title": "2D Anime Fighter 'Phantom Breaker: Omnia' Gets An English Dub Trailer"
        },
        {
          "id": "https://www.nintendolife.com/#article-121239",
          "author": null,
          "description": "Will use \"wits, wings, weapons, and vegan fuel to pummel opponents\".\nAnimal rights organisation PETA has a long history of targeting Nintendo, having previously used titles such as 1-2-Switch, Pokémon and even Super Mario 3D Land to raise awareness of its cause.\nFounded in 1980 by Ingrid Newkirk and Alex Pacheco, PETA – which stands for 'People for the Ethical Treatment of Animals' – is a nonprofit corporation that has done much to raise awareness of the ill-treatment of animals all over the world. It is opposed to factory farming, fur farming, animal testing, and the use of animals in entertainment, but it also champions the vegan lifestyle and campaigns against the consumption of meat or fish, as well as the slaughter of animals which are regarded by many as pests.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/random_peta_wants_nintendo_to_add_a_gun-toting_chicken_to_smash_bros_ultimate",
          "publishedOn": "2021-09-22T09:00:00.000Z",
          "wordCount": 5436,
          "title": "Random: PETA Wants Nintendo To Add A Gun-Toting Chicken To Smash Bros. Ultimate"
        },
        {
          "id": "https://www.nintendolife.com/#article-121023",
          "author": null,
          "description": "Update: Confidentiality date tweak suggests imminent reveal.\nUpdate: It appears that the mysterious new controller could be revealed much sooner than we first thought.\nOn the original FCC application, a note read that all confidential material had an expiry date of 16th March 2022 (more details on that can be found in our original article below). This has now been changed, however, with Nintendo opting to have the application's confidentiality expire on 24th September 2021, potentially spelling an official reveal at some point this week.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/09/rumour_it_looks_like_nintendo_will_soon_unveil_a_new_controller_for_switch",
          "publishedOn": "2021-09-22T08:30:00.000Z",
          "wordCount": 4553,
          "title": "Rumour: It Looks Like Nintendo Will Soon Unveil A New Controller For Switch"
        }
      ]
    },
    {
      "title": "Rock Paper Shotgun Latest Articles Feed",
      "feedUrl": "https://www.rockpapershotgun.com/feed",
      "siteUrl": "https://www.rockpapershotgun.com/feed",
      "articles": [
        {
          "id": "https://www.rockpapershotgun.com/brewing-and-haggling-sim-potion-craft-opens-for-business-in-early-access",
          "author": "Lauren Morton",
          "description": "Step on in and please don't mind the badly-labelled vials I've left lying about the shop. Potion Craft is now in early access with all its myserious brewing and haggling and alchemy-ing. I've been quite taken with the demos and playtests for this one so far, not least because it brings some spirit back to the act of crafting. It's out now in early access, during which Niceplay Games will be adding even more crafting options to toy with before its full launch.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/brewing-and-haggling-sim-potion-craft-opens-for-business-in-early-access",
          "publishedOn": "2021-09-22T22:52:54.000Z",
          "wordCount": 949,
          "title": "Brewing and haggling sim Potion Craft opens for business in early access"
        },
        {
          "id": "https://www.rockpapershotgun.com/sable-review",
          "author": "Alice Bell",
          "description": "As you might expect from a game set on a desert planet, Sable has a lot of sand. You traverse it on your floating motorbike as the titular character, a young woman who's part of a nomadic culture where adolescents leave home to complete their Gliding. During this gap year of sorts, the Glider does odd jobs and explores the world until they figure out what they want to be for the rest of their life. Sand is a feature. But as they say, sand is coarse and rough and irritating, and it gets everywhere. Each individual grain of sand is small, but a pinch of sand in your bed will change how you feel about your entire sleep experience.\nRead more",
          "link": "https://www.rockpapershotgun.com/sable-review",
          "publishedOn": "2021-09-22T22:01:00.000Z",
          "wordCount": 2114,
          "title": "Sable review: a beautiful adventure beset by troubling bugs"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-chose-to-boot-its-melee-system-in-favor-of-that-excellent-kick",
          "author": "Lauren Morton",
          "description": "Time-looping murder puzzle Deathloop sure seems like it's worth putting on repeat. For all the usual action romp reasons that Arkane are good with, but also for some of its sillier bits. Kicking baddies off ledges sounds like it's the real backbone of Deathloop's comedy. Colt has one damn powerful boot and, according to a new chat with Deathloop director Dinga Bakaba, it's all thanks to Arkane's choice to scrap most of their melee combat system. Here's why Colt traded arm day for leg day. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-chose-to-boot-its-melee-system-in-favor-of-that-excellent-kick",
          "publishedOn": "2021-09-22T21:44:12.000Z",
          "wordCount": 882,
          "title": "Deathloop chose to boot its melee system in favor of that excellent kick"
        },
        {
          "id": "https://www.rockpapershotgun.com/apple-wont-let-fortnite-back-on-the-app-store-until-they-run-out-of-appeals",
          "author": "Lauren Morton",
          "description": "The legal battle between Epic Games and Apple continues as it seems that both are probably willing to cut the proverbial Fortnite baby in half. Earlier this month, the court ruled that Apple must allow third-party payment systems, which was apparently not enough for Epic, who decided to submit an appeal last week. Now, Apple have informed Epic that they will not be allowing Fortnite back into the App Store clubhouse until they've exhausted all their own avenues to appeal. Which means Fortnite could remain off the store for years yet, according to Epic.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/apple-wont-let-fortnite-back-on-the-app-store-until-they-run-out-of-appeals",
          "publishedOn": "2021-09-22T20:32:56.000Z",
          "wordCount": 822,
          "title": "Apple won't let Fortnite back on the App Store until they run out of appeals"
        },
        {
          "id": "https://www.rockpapershotgun.com/lesbian-road-trip-rpg-get-in-the-car-loser-has-just-hit-the-road",
          "author": "Lauren Morton",
          "description": "Get In The Car, Loser! begins as all RPGs about young protagonists with magical powers do—just a lot more bluntly. The world is being threatened by the evil Machine Devil and the Machine Devil cultists, and apparently no one is going to save it if not your plucky party of heroes. So hop on in the back seat, you dork. Get In The Car, Loser!, a free game written by Christine Love of Ladykiller In A Bind fame, is now fueled up and headed out on its self-proclaimed \"lesbian road trip RPG\".\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/lesbian-road-trip-rpg-get-in-the-car-loser-has-just-hit-the-road",
          "publishedOn": "2021-09-22T18:58:07.000Z",
          "wordCount": 859,
          "title": "\"Lesbian road trip RPG\" Get In The Car, Loser! has just hit the road"
        },
        {
          "id": "https://www.rockpapershotgun.com/jett-the-far-shores-fictional-language-started-life-as-gibberish-choral-music",
          "author": "Imogen Beckhelling",
          "description": "Lots of good sci-fi has made up languages, but I don't think many could claim their fictional languages were developed through song. Enter Jett: The Far Shore. It's an upcoming interstellar adventure made by Sword & Sworcery developers Superbrothers with Pine Scented Software, in which a team of scouts take off in their jetts to explore an uncharted planet. Better yet, it features its very own language that sound designer Priscilla Snow developed after finding meaning in the gibberish words she used to form the game's music. \r\n\n\r\nWhile the initial plan was never to have their own in-game language, the Jett team now have a dictionary around 2000 words strong, and I had a chance to talk to them about how it all came to be. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/jett-the-far-shores-fictional-language-started-life-as-gibberish-choral-music",
          "publishedOn": "2021-09-22T17:00:00.000Z",
          "wordCount": 2616,
          "title": "Jett: The Far Shore's fictional language started life as gibberish choral music"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-sims-4-just-added-a-massive-1200-new-color-swatches-to-149-build-items",
          "author": "Lauren Morton",
          "description": "Oh rejoice, a Sims 4 update that's all for me. Maxis have just dropped a free update which they say their art team totally took over by whipping up around 1,200 new color swatches for 149 different Buy and Build Mode objects. There are tons of new window drape colors, new countertop swatches, wood furniture choices, and even plants. That is a lot of new color choices for a lot of items and oh boy I will probably use them all. Fellow builders, this one is for us. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-sims-4-just-added-a-massive-1200-new-color-swatches-to-149-build-items",
          "publishedOn": "2021-09-22T16:27:42.000Z",
          "wordCount": 875,
          "title": "The Sims 4 just added a massive 1,200 new color swatches to 149 build items"
        },
        {
          "id": "https://www.rockpapershotgun.com/whats-better-unit-designers-or-handcrafted-art",
          "author": "Alice O'Connor",
          "description": "Last time, you decided that fiddling with environmental objects (henceforth known as fiddlebits) is better than rocket jumping. A toughie there, no doubt; I thank you for your careful deliberation. Next up, we're settling an issue of whose hand shapes  game, whether you're getting hands-on with your mens or having someone else lovingly handcraft the entire world for you.\r\nWhat's better: unit designers, or handcrafted art?\nRead more",
          "link": "https://www.rockpapershotgun.com/whats-better-unit-designers-or-handcrafted-art",
          "publishedOn": "2021-09-22T16:16:15.000Z",
          "wordCount": 1084,
          "title": "What's better: unit designers, or handcrafted art?"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-beacon-how-to-make-activate-beacon",
          "author": "Hayden Hefford",
          "description": "Want to know how to make and activate a Beacon in Minecraft? Beacons have two very important uses in Minecraft, as they give you status effects whilst also emitting a beam of light that can act as a waypoint marker to guide you and your friends home.\nThis guide will walk you through everything you need to know to make and use a Beacon in Minecraft, including how to get a Nether Star, which is one of the ingredients you will need.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-beacon-how-to-make-activate-beacon",
          "publishedOn": "2021-09-22T14:39:54.000Z",
          "wordCount": 1540,
          "title": "How to make and activate a Beacon in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/an-ode-to-cutting-off-boss-tails-in-dark-souls",
          "author": "Ed Thorn",
          "description": "Happy 10th anniversary Dark Souls! Here's to you, Sin the Slumbering Dragon. And to you, Crossbreed Priscilla. Chin-chin! Oi, not to you Ornstein, or to you, Smough. How did you even get in, anyway? This is an invitation only event for bosses who have cuttable tails.\nThere's a tinge of sadness to this celebration, though. Cuttable tails were all the rage back in the original Dark Souls but now they're lost to time, never to be seen again, just like the tails you cut off themselves. Although a part of me hopes that the cycle will renew (like the sort of tails that grow back after you cut them off). And just like skinny jeans are slowly going out of fashion in favour of the 90s wide leg, I'm hoping FromSoftware's bosses won't cling so closely to their tails in Elden Ring and maybe, just maybe, they'll let us lop them off again.\nRead more",
          "link": "https://www.rockpapershotgun.com/an-ode-to-cutting-off-boss-tails-in-dark-souls",
          "publishedOn": "2021-09-22T14:30:00.000Z",
          "wordCount": 802,
          "title": "An ode to cutting off boss tails in Dark Souls"
        },
        {
          "id": "https://www.rockpapershotgun.com/marvels-guardians-of-the-galaxys-chaotic-combat-owes-more-to-jrpgs-than-you-think",
          "author": "Ed Thorn",
          "description": "I went hands-on with roughly an hour's worth of Marvel's Guardians Of The Galaxy last week, and I have come away pleasantly surprised. I'll admit, I judged a book by its cover on this one, thinking it would be an action adventure game only Marvel stans with decades worth of MCU facts beamed into their brains could rally behind. But no, even I, who's watched precisely three Marvel films in the last ten years, had a lot of fun with it. Good fun, at that.\nMainly, I liked how the game's combat takes cues from JRPGs, of all things, cribbing off the likes of Final Fantasy XV and Tales Of Arise so your fellow guardians feel just as - if not more - important than yourself.\nRead more",
          "link": "https://www.rockpapershotgun.com/marvels-guardians-of-the-galaxys-chaotic-combat-owes-more-to-jrpgs-than-you-think",
          "publishedOn": "2021-09-22T13:00:00.000Z",
          "wordCount": 1718,
          "title": "Marvel's Guardians Of The Galaxy's chaotic combat owes more to JRPGs than you think"
        },
        {
          "id": "https://www.rockpapershotgun.com/what-are-your-favourite-autumn-games",
          "author": "Alice O'Connor",
          "description": "Today brings the autumn equinox and the start of the season where things, like, fall. It's a good season! I will always mourn the end of summer but I relish the brief window to hike through golden forests, swimming through shoals of leaves in rivers, cosy up around bonfires with cocoa, and break out the warm duvet again. But while we wait for the season to properly kick in, I'm curious: which autumns in video games do you enjoy? Yes, Halloween included.\nRead more",
          "link": "https://www.rockpapershotgun.com/what-are-your-favourite-autumn-games",
          "publishedOn": "2021-09-22T12:40:44.000Z",
          "wordCount": 789,
          "title": "What are your favourite autumn games?"
        },
        {
          "id": "https://www.rockpapershotgun.com/valorants-latest-patch-nerfed-the-floating-knife-fiend-jett",
          "author": "Imogen Beckhelling",
          "description": "If you play Valorant, you undoubtedly know one of those Jett players. The sort that will very un-tactfully launch all three of their smokes in a messy line so they can dash into or out of fights, bamboozling their teammates just as much as the enemy team. It should be a little harder for these speedy knife-slingers to perform such daft feats in the future, because Riot Games have taken away one of Jett's smokes, and they've nerfed her knives to boot.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/valorants-latest-patch-nerfed-the-floating-knife-fiend-jett",
          "publishedOn": "2021-09-22T11:00:27.000Z",
          "wordCount": 1274,
          "title": "Valorant's latest patch nerfed the floating knife-fiend Jett"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-wither-how-to-spawn-defeat-wither",
          "author": "Hayden Hefford",
          "description": "Want to know how to spawn and defeat the Wither boss in Minecraft? The Wither is one of the most formidable enemies in Minecraft, and is one of only two boss mobs that can be encountered in the game.\nIf you’re ready to fight the terrifying monster then gear up and read on, as this guide will walk you through everything that you need to know to find and beat the Wither in Minecraft.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-wither-how-to-spawn-defeat-wither",
          "publishedOn": "2021-09-22T10:27:39.000Z",
          "wordCount": 1562,
          "title": "How to find and defeat the Wither in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/dark-souls-bosses-rated-by-how-much-money-theyd-owe-you-after-a-night-out",
          "author": "Nic Reuben",
          "description": "So, thought you’d take all your great Lordran chums out for a drink to celebrate the 10th anniversary of Dark Souls, did you? Bad times, pal. Sure, they’ll take care of any everlasting dragons you happen to have hanging around on your lawn, but when it comes to a night on the bevvies, they might well be the sorriest bunch of cheapskates since Final Fantasy VIII’s GFs. Consider this your one and only warning before these fantasy grifters clear you out for the month. \nRead more",
          "link": "https://www.rockpapershotgun.com/dark-souls-bosses-rated-by-how-much-money-theyd-owe-you-after-a-night-out",
          "publishedOn": "2021-09-22T10:00:00.000Z",
          "wordCount": 1282,
          "title": "Dark Souls bosses rated by how much money they’d owe you after a night out"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-pc-patch-addresses-framerate-stuttering",
          "author": "Alice O'Connor",
          "description": "New Arkane Studios sneak-o-shooter Deathloop is a good'un, but the PC launch was marred by technical problems which caused the framerate to stutter for many players. One week later, they've put out a patch which should fix the stuttering for many folks playing with a mouse. However, you might not find the game hunky-dory now, as they say they're still investigating another potential stutterorama. Always tricky when multiple issues create similar-looking outcomes.\nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-pc-patch-addresses-framerate-stuttering",
          "publishedOn": "2021-09-22T09:23:30.000Z",
          "wordCount": 762,
          "title": "Deathloop PC patch addresses framerate stuttering"
        },
        {
          "id": "https://www.rockpapershotgun.com/heros-hour-is-a-strategy-rpg-with-huge-automatic-battles",
          "author": "Graham Smith",
          "description": "I spend roughly 90% of my free time watching what the YouTube algorithm offers me. I've not been radicalised yet, although I do now refer to any shopping I buy as a \"haul\" and end all my conversations by thanking Skillshare. \r\n\nTo my surprise, the algorithm has recently started throwing indie games my way. Hero's Hour is among the most interesting it's shown me: a strategy RPG in which you construct armies of pixelated fantasy beasts who then have automated battles.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/heros-hour-is-a-strategy-rpg-with-huge-automatic-battles",
          "publishedOn": "2021-09-21T22:25:50.000Z",
          "wordCount": 791,
          "title": "Hero's Hour is a strategy RPG with huge automatic battles"
        },
        {
          "id": "https://www.rockpapershotgun.com/phoenix-points-corrupted-horizons-will-open-up-on-october-1st",
          "author": "Graham Smith",
          "description": "Phoenix Point's fourth DLC is due on October 1st. Corrupted Horizons adds a new corruption mechanic which can sap the will of your squad, as well as new Mutoid soldiers, pictured above. The Mutoids are immune to corruption, can learn any class's skills, but are unable to heal.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/phoenix-points-corrupted-horizons-will-open-up-on-october-1st",
          "publishedOn": "2021-09-21T21:26:27.000Z",
          "wordCount": 757,
          "title": "Phoenix Point's Corrupted Horizons will open up on October 1st"
        },
        {
          "id": "https://www.rockpapershotgun.com/death-of-the-reprobate-will-complete-a-point-and-click-triptych",
          "author": "Graham Smith",
          "description": "I feel as if the header image successfully conveys the appeal of Joe Richardson's work. He makes point-and-click adventures which take real Renaissance paintings, animate them in cut-out style (think Monty Python), and juxtapose them with modern vernacular.\r\n\nHis next game was announced today. It's called Death Of The Reprobate, and there's a trailer showing both pointing and clicking below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/death-of-the-reprobate-will-complete-a-point-and-click-triptych",
          "publishedOn": "2021-09-21T21:01:59.000Z",
          "wordCount": 746,
          "title": "Death Of The Reprobate will complete a point and click triptych"
        },
        {
          "id": "https://www.rockpapershotgun.com/you-can-once-again-check-whether-your-pc-will-run-windows-11",
          "author": "Graham Smith",
          "description": "Microsoft have put their PC Health Check app back online. The simple tool is designed to tell you whether Windows 11 is compatible with your computer, but it was pulled offline back in June when it kept telling people with modern PCs that they couldn't run the new operating system, with little information as to why not. It's more recently been available to members of the Windows Insider program, but it's back now for all.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/you-can-once-again-check-whether-your-pc-will-run-windows-11",
          "publishedOn": "2021-09-21T20:24:45.000Z",
          "wordCount": 798,
          "title": "You can once again check whether your PC will run Windows 11"
        },
        {
          "id": "https://www.rockpapershotgun.com/neo-the-world-ends-with-you-comes-to-you-on-pc-next-week",
          "author": "Alice O'Connor",
          "description": "Following its debut on PlayStation 4 and Switch in July, Square Enix plan to bring Neo: The World Ends With You over to PC on the 28th of September. That's next Tuesday, day dudes. It's the sequel to an RPG from the Nintendo DS in 2007, set inside a colourful and weird version of Tokyo where young'uns get drawn into a deadly game.\nRead more",
          "link": "https://www.rockpapershotgun.com/neo-the-world-ends-with-you-comes-to-you-on-pc-next-week",
          "publishedOn": "2021-09-21T17:07:49.000Z",
          "wordCount": 740,
          "title": "Neo: The World Ends With You comes to you on PC next week"
        },
        {
          "id": "https://www.rockpapershotgun.com/pc-gaming-weekspot-podcast-054-deathloop-kena",
          "author": "Colm Ahern",
          "description": "After getting a taste last week, both myself and Matthew have spent the last few days in Blackreef. We've been enjoying doing the same things over and over. Yeah, Deathloop is pretty good.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/pc-gaming-weekspot-podcast-054-deathloop-kena",
          "publishedOn": "2021-09-21T16:00:00.000Z",
          "wordCount": 799,
          "title": "The Weekspot podcast #054: bridge of spies"
        },
        {
          "id": "https://www.rockpapershotgun.com/halo-infinite-will-have-back-to-back-tech-previews-this-weekend-and-next",
          "author": "Imogen Beckhelling",
          "description": "If you're not too busy Deathlooping, Kena: Bridge Of Spiriting, or Diablo 2: Resurrecting this weekend, perhaps you'll have a spare moment to drop into Halo Infinite's next technical preview. Between Thursday and Sunday, players registered as a Halo Insider will have a chance to try out the sci-fi FPS's 4v4 Arena mode. But that's not all! 343 have announced that the following weekend, Insiders can jump into another tech test, and have a crack at the game's 12v12 Big Team Battle mode too.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/halo-infinite-will-have-back-to-back-tech-previews-this-weekend-and-next",
          "publishedOn": "2021-09-21T15:54:31.000Z",
          "wordCount": 1071,
          "title": "Halo Infinite will have back-to-back tech previews this weekend and next"
        },
        {
          "id": "https://www.rockpapershotgun.com/call-of-duty-vanguards-open-beta-feels-like-modern-warfare-with-a-lick-of-ww2-paint",
          "author": "Ed Thorn",
          "description": "Call Of Duty: Vanguard's multiplayer feels familiar, have I been here before? Yes, in the past, but also in the future. Despite its World War II setting, Vanguard's open beta has me thinking back to the days of Call Of Duty: Modern Warfare. Having played a sizable chunk of it now, I'm not kidding when I say that it's like the Modern Warfare lot LARPING on a WWII set. For some this will be good. For others this will be bad. For me? It needs Warzone.\nRead more",
          "link": "https://www.rockpapershotgun.com/call-of-duty-vanguards-open-beta-feels-like-modern-warfare-with-a-lick-of-ww2-paint",
          "publishedOn": "2021-09-21T15:30:00.000Z",
          "wordCount": 1509,
          "title": "Call Of Duty: Vanguard's open beta feels like Modern Warfare with a lick of WW2 paint"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-crossbow-loadout-warzone",
          "author": "Kevin Foley",
          "description": "Looking for the best Crossbow loadout to bring into Warzone? It's certainly a unique option to consider in a game all about firearms and high tech weaponry. Still there's fun to be had when wielding this modern take on a medieval weapon, and it's more than capable of one-shotting enemies if you have the skills to wield it. Just don't take the Crossbow into Warzone with the expectation of dominating. It's a novelty at best, and you should be using the best guns in Warzone if your goal is to win.  \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/best-crossbow-loadout-warzone",
          "publishedOn": "2021-09-21T15:07:11.000Z",
          "wordCount": 980,
          "title": "Best Crossbow loadout in Warzone Season 5"
        },
        {
          "id": "https://www.rockpapershotgun.com/jackbox-party-pack-8-arriving-in-time-to-spook-your-halloween-party",
          "author": "Alice O'Connor",
          "description": "You've got a checklist for Halloween: peeled grapes (eyeballs); cold spaghetti (worms); 12-foot skeleton (skeleton); 25 metre bolt of black cotton (costume). But wait, what will people play? Friendo, you're in lucko. Jackbox Games have announced that The Jackbox Party Pack 8, their latest collection of funny party games, will launch on October 14th. It'll pack five games, from murder mystery to a new version of fan-favourite Drawful, this time having players animate their drawings.\nRead more",
          "link": "https://www.rockpapershotgun.com/jackbox-party-pack-8-arriving-in-time-to-spook-your-halloween-party",
          "publishedOn": "2021-09-21T15:04:54.000Z",
          "wordCount": 868,
          "title": "Jackbox Party Pack 8 arriving in time to spook your Halloween party"
        },
        {
          "id": "https://www.rockpapershotgun.com/rogue-lords-is-a-devilishly-fun-roguelike-where-cheating-is-considered-a-virtue",
          "author": "Imogen Beckhelling",
          "description": "Everything about Rogue Lords is very Halloween-y. It's an upcoming gothic roguelike in which you, the devil, send disciples out into the world to wage war with demon hunters and cause general mischief in the mortal world. Having played a bit myself, I already feel the need to start carving pumpkins and hanging up fake cobwebs around my house. It reminds me of all the spooky animated films you see on the telly throughout October, which makes sense because the developers at Cyanide and Leikir Studios tell me the game's art style is partially inspired by Tim Burton films.\nRead more",
          "link": "https://www.rockpapershotgun.com/rogue-lords-is-a-devilishly-fun-roguelike-where-cheating-is-considered-a-virtue",
          "publishedOn": "2021-09-21T15:00:00.000Z",
          "wordCount": 1756,
          "title": "Rogue Lords is a devilishly fun roguelike where cheating is considered a virtue"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-how-to-make-a-book",
          "author": "Hayden Hefford",
          "description": "Want to know how to make a Book in Minecraft? Books are very important, as you will need them to enchant your armour and weapons with various effects. You can also make pretty bookshelves to spruce up your home, if you aren’t interested in becoming an all-powerful wizard.\nThis guide will walk you through everything that you need to know to make a Book in Minecraft, including how to get Paper and Leather, which you will need.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-how-to-make-a-book",
          "publishedOn": "2021-09-21T14:39:27.000Z",
          "wordCount": 1380,
          "title": "How to make a Book in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-genshin-impact-sangonomiya-kokomi-build",
          "author": "Rebecca Jones",
          "description": "Want to learn how to create the best build for Sangonomiya Kokomi in Genshin Impact? Kokomi has been present in Genshin Impact since August's V2.0 update as an NPC, but a playable version of the character is now available as part of the Drifting Luminescence event (running from September 21st to October 12th).\n Read more",
          "link": "https://www.rockpapershotgun.com/best-genshin-impact-sangonomiya-kokomi-build",
          "publishedOn": "2021-09-21T14:17:21.000Z",
          "wordCount": 1975,
          "title": "The best Genshin Impact Sangonomiya Kokomi build"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-bosses-boss-fights",
          "author": "Ollie Toms",
          "description": "Want to learn about all the boss fights in Kena: Bridge Of Spirits? There is a grand total of 16 boss fights (that is, fights with big boss health bars at the top) in Kena: Bridge Of Spirits - and like everything else in Ember Lab's marvellous action-adventure game, each one offers some true spectacle. If you're looking for a list of all the boss fights and some advice on how to beat each one, you've come to the right place.\nKeep scrolling to check out all 16 bosses in Kena: Bridge Of Spirits, presented in the order you'll face them.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-bosses-boss-fights",
          "publishedOn": "2021-09-21T13:42:37.000Z",
          "wordCount": 2787,
          "title": "Kena: Bridge Of Spirits bosses and how to beat them"
        },
        {
          "id": "https://www.rockpapershotgun.com/activision-blizzard-are-now-being-investigated-by-the-us-government",
          "author": "Imogen Beckhelling",
          "description": "The US government's Securities and Exchange Commission (SEC) are investigating Activision Blizzard over the company's handling of sexual misconduct and harassment allegations. This comes just two months after the Call Of Duty publishers were sued by a State department for alleged workplace harassment, discrimination, and retaliation. Now, The SEC have subpoenaed a number of high-level executives, reportedly including CEO Bobby Kotick, and have requested internal documents relating to the allegations. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/activision-blizzard-are-now-being-investigated-by-the-us-government",
          "publishedOn": "2021-09-21T12:59:42.000Z",
          "wordCount": 947,
          "title": "Activision Blizzard are now being investigated by the US government"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-fishing-shrine",
          "author": "Ollie Toms",
          "description": "Wondering how to restore the Fishing Shrine in Kena: Bridge Of Spirits? Each of the other Shrines in the Forgotten Forest of Kena: Bridge Of Spirits are guarded by enemies, but the Fishing Shrine is guarded by a puzzle. And at first glance this puzzle may be a confusing one, because you may not even realise that a puzzle needs to be solved.\nFollow the steps below to learn how to restore the Fishing Shrine in Kena: Bridge Of Spirits!\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-fishing-shrine",
          "publishedOn": "2021-09-21T11:01:29.000Z",
          "wordCount": 1042,
          "title": "How to restore the Fishing Shrine in Kena: Bridge Of Spirits"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-invasion-is-a-zero-sum-mind-game-i-cant-stop-playing",
          "author": "Jeremy Peel",
          "description": "As I pass the eroding façade of a fisherman’s hut, a beret-topped goon strides by in the opposite direction, casually swinging a machete. They’d be conspicuous were it not for the fact that there are no fishermen in this village anymore. If anyone were to bother putting up a welcome sign, it’d read ‘Population: Goons’. They like me, though. This thug’s two-tone mask might be impassive, but the voice beneath it betrays starstruck awe. “Julianna,” they say. “It’s an honour, really.”\n“Shut the fuck up,” I hiss under my breath. “I’m in disguise. If the player hears you, we’re both mince. And thanks.”\nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-invasion-is-a-zero-sum-mind-game-i-cant-stop-playing",
          "publishedOn": "2021-09-21T11:00:00.000Z",
          "wordCount": 1531,
          "title": "Deathloop invasion is a zero-sum mind game I can't stop playing"
        },
        {
          "id": "https://www.rockpapershotgun.com/de-exit-is-about-a-voxel-skeleton-investigating-spooky-goo-in-the-afterlife",
          "author": "Imogen Beckhelling",
          "description": "De-Exit is an upcoming voxel puzzle platformer where you play as a skeleton person investigating strange happenings in the afterlife. You died and landed yourself in the in-between part, not quite heaven and not quite hell, but it's clear that something is a bit wrong. You'll need to explore ruins, collect artifacts and figure out why spooky goo is trying to engulf parts of the world. It's a bit Zelda-y and a bit Tomb Raider-y, but if both those games were filled with cubes.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/de-exit-is-about-a-voxel-skeleton-investigating-spooky-goo-in-the-afterlife",
          "publishedOn": "2021-09-21T10:20:00.000Z",
          "wordCount": 933,
          "title": "De-Exit is about a voxel skeleton investigating spooky goo in the afterlife"
        },
        {
          "id": "https://www.rockpapershotgun.com/scarf-is-a-journey-like-puzzle-platformer-with-a-magic-dragon-scarf",
          "author": "Imogen Beckhelling",
          "description": "Do you ever see something in a game and think, \"Man, I wish that was real\"? And I don't mean magic or spaceships because obviously those are great, but a specific item that would just be so cool to have. I want the scarf from Scarf, an upcoming puzzle platformer about a little blue dude trying to get home. This character has a firey red scarf that does dragon things! When you double jump, it turns into little dragon wings! 10/10 winter wear. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/scarf-is-a-journey-like-puzzle-platformer-with-a-magic-dragon-scarf",
          "publishedOn": "2021-09-21T10:05:00.000Z",
          "wordCount": 857,
          "title": "Scarf is a Journey-like puzzle platformer with a magic dragon scarf"
        },
        {
          "id": "https://www.rockpapershotgun.com/endling-is-a-game-about-a-mama-fox-protecting-her-cubs-in-a-human-ravaged-world",
          "author": "Imogen Beckhelling",
          "description": "Endling is going to break my heart. It's a game about a mama fox trying to look after her pups in an unpleasant future where forests are being destroyed, pollution is rife and these poor animals have been hunted to near-extinction. It's sad, because it really doesn't seem to distant a future from real life, but that's kind of the point. Endling looks gorgeous and poignant, the sort of game that seems important to play, even if it does break my heart.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/endling-is-a-game-about-a-mama-fox-protecting-her-cubs-in-a-human-ravaged-world",
          "publishedOn": "2021-09-21T09:53:31.000Z",
          "wordCount": 1116,
          "title": "Endling is a game about a mama fox protecting her cubs in a human-ravaged world"
        },
        {
          "id": "https://www.rockpapershotgun.com/older-xbox-wireless-controllers-are-getting-quick-switching-between-devices",
          "author": "James Archer",
          "description": "One of the cool things about the official Xbox Series X/S wireless controllers – if we’re using a dramatically expanded definition of the word “cool” – is that they can pair to both the console and a Bluetooth-enabled PC or laptop, then switch between both sources with a double-tap or hold of the pairing button. In what could be good news for owners of older, Xbox One-era wireless controllers, Microsoft are now rolling out a firmware update that brings this same quick-switch functionality to the more aged pads.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/older-xbox-wireless-controllers-are-getting-quick-switching-between-devices",
          "publishedOn": "2021-09-21T09:41:52.000Z",
          "wordCount": 1009,
          "title": "Older Xbox wireless controllers are getting quick-switching between devices"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-map-collectible-locations",
          "author": "Ollie Toms",
          "description": "Looking for a map of Kena: Bridge Of Spirits which shows the locations of all collectibles and hidden areas? Well, you're in luck, because I've spent a painstaking number of hours hundred-percenting Ember Lab's marvellous story-driven action-adventure game, and during my travels I jotted down the exact locations of every single Rot, Hat, Flower Shrine, Meditation Spot, Cursed Chest, and Spirit Mail in the game.\nBelow you'll find ten maps of various areas in Kena: Bridge Of Spirits, annotated with the locations of every single collectible and hidden area in the game, so you can have a far easier time hunting down those pesky remaining achievements. Take a look!\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-map-collectible-locations",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1700,
          "title": "Kena: Bridge Of Spirits map of all collectibles"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-long-is-kena-bridge-of-spirits",
          "author": "Ollie Toms",
          "description": "Wondering how long it'll take you to complete Kena: Bridge Of Spirits? It's a question that's preyed on the minds of many a prospective player since Ember Lab, the developers of this outrageously gorgeous new action-adventure game, previously stated in a tweet that \"you should be able to finish the game over a weekend\".\nBut a weekend of gaming means different things to different people. Does it mean you can blitz through Kena: Bridge Of Spirits in only a few hours, or will it take a solid 20 hours to complete? And does this take into account the many side activities and collectibles, or were Ember Lab simply talking about how quickly you can rush through the main story? Find out exactly how long it takes to complete Kena: Bridge Of Spirits below.\nRead more",
          "link": "https://www.rockpapershotgun.com/how-long-is-kena-bridge-of-spirits",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1040,
          "title": "How long is Kena: Bridge Of Spirits?"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-difficulty-levels",
          "author": "Ollie Toms",
          "description": "Want to know about the four difficulty levels in Kena: Bridge Of Spirits? Or perhaps you simply want to figure out which difficulty is right for you before you get stuck into playing? Kena: Bridge Of Spirits offers a choice of four different difficulty levels which change the game up in various ways to make Kena's journey safer or more perilous, depending on which you choose. Keep reading to find out how to change the difficulty level before and during a playthrough, and what each of the difficulty levels change about the game.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-difficulty-levels",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1164,
          "title": "Kena: Bridge Of Spirits difficulty levels"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-bow",
          "author": "Ollie Toms",
          "description": "Wondering how to unlock the bow in Kena: Bridge Of Spirits? The bow is an extremely useful part of Kena's toolkit, not only as a powerful weapon but also as a traversal tool, as it can be used as a grappling hook when fired at particular blue flowers dotted about the landscape of Kena: Bridge Of Spirits. Read on to find out where, when, and how to unlock the bow so you can get it as quickly as possible.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-bow",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1081,
          "title": "How to unlock the Bow in Kena: Bridge Of Spirits"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-abilities-upgrades-skill-tree",
          "author": "Ollie Toms",
          "description": "Want to learn more about Kena's abilities and upgrades in Kena: Bridge Of Spirits? Early on in Ember Lab's story-driven action-adventure game, you'll learn more about how you can use Karma to upgrade your abilities. Each of these abilities are well worth getting, but some are definitely worth prioritising over others, because they'll help you make quick work of nearly any enemy with some practice.\nBelow we'll walk you through every ability and upgrade in Kena: Bridge Of Spirits and what each one does, along with how to unlock abilities, how to gain Karma, and how to increase your Rot Level to make use of these new abilities.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-abilities-upgrades-skill-tree",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 2102,
          "title": "Kena: Bridge Of Spirits abilities and upgrades"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-spirit-mail-locations",
          "author": "Ollie Toms",
          "description": "Looking for all the Spirit Mail in Kena: Bridge Of Spirits? One of several different types of collectible in Ember Lab's story-focused action-adventure game, Spirit Mail can be collected and delivered back to certain houses in the central Village in order to unlock new areas and gain rewards. But finding them is often far easier said than done, and these puzzles don't get easier just by changing the difficulty level.\nBelow we'll walk you through where to find all 10 Spirit Mail locations in Kena: Bridge Of Spirits, so you can get to work purifying the land of the corruption which has spread across it before you arrived. After you've collected each Spirit Mail you can then see on the map the house in the Village to which it must be delivered.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-spirit-mail-locations",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1967,
          "title": "Kena: Bridge Of Spirits Spirit Mail locations"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-hay-piles",
          "author": "Ollie Toms",
          "description": "Wondering what to do with Hay Piles in Kena: Bridge Of Spirits? You'll find Hay Piles scattered about various areas of the Kena: Bridge Of Spirits map, and it's very unclear at first glance what you're meant to do about them. And it is important that you do something, because sometimes these Hay Piles must be cleared in order to reveal something valuable inside, such as a Rot to add to your growing army of adorable spirits.\nLearn how to destroy Hay Piles in Kena: Bridge Of Spirits below!\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-hay-piles",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1000,
          "title": "How to destroy Hay Piles in Kena: Bridge Of Spirits"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-achievements",
          "author": "Ollie Toms",
          "description": "Looking for a full list of all Kena: Bridge Of Spirits achievements? There is a grand total of 41 achievements to collect in Ember Lab's beautiful and incredibly enjoyable action-adventure title, and they run the gamut in challenge. Some require you to simply play through the story, so you'll unlock them either way eventually. Others require you to go out of your way collecting or setting up particular combat encounters to complete them.\nIn the below trophy guide you'll find a full list of all 41 achievements you can earn in Kena: Bridge Of Spirits, along with a few bits of advice on how to unlock some of the more challenging ones.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-achievements",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1283,
          "title": "Kena: Bridge Of Spirits achievements and trophy guide"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-hats",
          "author": "Ollie Toms",
          "description": "Looking for a list of all the Hats in Kena: Bridge Of Spirits? Yes, you can find Hats for your bouncy little spirit friends in Kena: Bridge Of Spirits, and you can purchase these hats at Hat Carts in order to dress your Rot army up exactly how you'd like. Have you ever heard of anything so sickeningly adorable? I sure haven't.\nBelow you'll be able to take a look at every single Rot Hat in the game, along with their cost in Gems and some information on how these cosmetic items can be procured at a Hat Cart.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-hats",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1275,
          "title": "Kena: Bridge Of Spirits Hats"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-tips",
          "author": "Ollie Toms",
          "description": "Looking for some top tips on beating the puzzles and quests of Kena: Bridge Of Spirits? Ember Lab's sumptuous-looking action-adventure game, Kena: Bridge Of Spirits, throws you into a bright, beautiful, and bittersweet world where Kena, a Spirit Guide, is trying to reach a sacred mountain shrine. But first she needs to cleanse the lands of corruption and uncover the mystery of how nature came to be so unbalanced in this part of the world.\nKena is a tough game at times, filled with dangerous combat segments, tricky platforming areas, and numerous puzzles you must complete with the help of your spirit friends, the Rot. This beginner's guide to Kena: Bridge Of Spirits will walk you through some top tips which will help you conquer (and enjoy) every aspect of Kena's journey.\nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-tips",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1961,
          "title": "Kena: Bridge Of Spirits tips and tricks"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-review",
          "author": "Amelia Hansford",
          "description": "Atmosphere can feel almost superfluous in video games at the moment. Despite its very obvious importance, there’s sometimes an assumption that if the more mechanical parts of a game serve their purpose - and do so reliably - then elements like immersion, environment and art style are merely contributors to a solid product. But my view is to the contrary; I think it’s usually those elements that turn a game into a phenomenon. This is very clearly proven by Kena: Bridge Of Spirits.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-review",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 1582,
          "title": "Kena: Bridge Of Spirits review: a beautiful action-adventure full of joy and wonder"
        },
        {
          "id": "https://www.rockpapershotgun.com/a-new-free-to-play-online-pokemon-trading-card-game-is-coming-to-pc",
          "author": "Lauren Morton",
          "description": "There's been a Pokémon card game on PC for years now which, I suspect, will come as news to some of us who were always more into the Pokémon RPGs. You TCG fans will want to know that the newly-announced Pokémon Trading Card Game Live will be replacing the current Pokémon Trading Card Game Online. Pokémon TCG Live is coming with upgrades like a ranked ladder, 3D avatars, and battle passes. It will also remove some major features such as in-game chat and—crucially—card trading. You can catch the announcement and the details here in the reveal trailer for Pokémon TCG Live.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/a-new-free-to-play-online-pokemon-trading-card-game-is-coming-to-pc",
          "publishedOn": "2021-09-20T23:32:57.000Z",
          "wordCount": 839,
          "title": "A new free-to-play online Pokémon trading card game is coming to PC"
        },
        {
          "id": "https://www.rockpapershotgun.com/swerys-the-good-life-finally-fetches-a-launch-date-for-october",
          "author": "Lauren Morton",
          "description": "Small towns always seem to have secrets afoot and it's no different in The Good Life. This mystery adventure led by Hidetaka 'Swery' Suehiro of Deadly Premonition fame has been publicly kicking about for a while now. It's dug up a date at last, proudly fetching us back an October 15th launch. That's when you'll be headed to the British countryside to photograph your way out of debt and try to learn the secrets of the town where everyone turns into animals.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/swerys-the-good-life-finally-fetches-a-launch-date-for-october",
          "publishedOn": "2021-09-20T20:47:42.000Z",
          "wordCount": 795,
          "title": "Swery's The Good Life finally fetches a launch date for October"
        },
        {
          "id": "https://www.rockpapershotgun.com/deltarune-chapter-2-launched-for-free-because-the-world-is-tough-enough",
          "author": "Lauren Morton",
          "description": "Unlike the cheeky surprise release of its first free chapter back in 2018, we got a warning about Deltarune Chapter 2. It's out now, also free, because creator Toby Fox says the world has been tough enough lately. The not-a-sequel-or-prequel-but-sort-of-related game to Fox's hit RPG Undertale is still a work in progress, but the newest chunk of story should hopefully keep fans busy chatting and hunting for secrets for a while yet. It may indeed be a while, once again. Fox plans to release chapters three through five as a paid release when they're finished but even he doesn't know when that will be just yet.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/deltarune-chapter-2-launched-for-free-because-the-world-is-tough-enough",
          "publishedOn": "2021-09-20T18:13:50.000Z",
          "wordCount": 957,
          "title": "Deltarune Chapter 2 launched for free because the world is tough enough"
        },
        {
          "id": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-introduces-more-big-bosses-and-adorable-photo-mode",
          "author": "Lauren Morton",
          "description": "The first game from former animation studio Ember Lab heads out on its spirit saving adventure tomorrow. Kena: Bridge Of Spirits definitely looks like it's made by an animation house, complete with excessively adorable little sidekick characters and all. Ahead of tomorrow's launch, Ember Lab have shown off another story trailer to peek a couple more of the big spirit bosses that Kena will be putting to rest along with the photo mode that you'll have to take full advantage of all that big screen-inspired character design.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/kena-bridge-of-spirits-introduces-more-big-bosses-and-adorable-photo-mode",
          "publishedOn": "2021-09-20T16:38:56.000Z",
          "wordCount": 1020,
          "title": "Kena: Bridge Of Spirits introduces more big bosses and adorable photo mode"
        },
        {
          "id": "https://www.rockpapershotgun.com/well-need-new-imperial-units-for-the-digital-age",
          "author": "Alice O'Connor",
          "description": "To distract from the ongoing dire consequences of leaving the European Union with all the grace and finesse of a child uninviting someone from their seventh birthday party, the UK government plan to revive imperial units. You know: 66 gallons to a hogshead, 6 hogsheads to a rod, 22 ounces to a watt, 9 Rodneys to a Del Boy, that sort of nostalgic masturbation. But a lot has changed since the dark days of the British Empire. If the obtuse unit system is to return (lol), we need new units for modern technologies. I have ideas.\nRead more",
          "link": "https://www.rockpapershotgun.com/well-need-new-imperial-units-for-the-digital-age",
          "publishedOn": "2021-09-20T16:24:04.000Z",
          "wordCount": 1135,
          "title": "We'll need new imperial units for the digital age"
        },
        {
          "id": "https://www.rockpapershotgun.com/rps-user-avatars-have-arrived",
          "author": "Katharine Castle",
          "description": "Ever since RPS was redesigned at the beginning of the year, our tech team has been hard at work improving our comments system and user ID features. The first of those updates arrives today. Behold, you can now assign an avatar to your Reedpop ID account. \nRead more",
          "link": "https://www.rockpapershotgun.com/rps-user-avatars-have-arrived",
          "publishedOn": "2021-09-20T16:18:38.000Z",
          "wordCount": 866,
          "title": "RPS user avatars have arrived"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-nvidia-rtx-30-series-one-year-on-should-you-upgrade",
          "author": "James Archer",
          "description": "Even if they don’t recall the exact date, plenty of gaming PC owners will remember what they were doing on September 17th 2020. They, and I, were staring at a black-and-green storefront, mashing F5 until a “Notify me” button changed to read “Out of stock”. This was the Nvidia GeForce RTX 3080 launch, and what initially looked like a one-off failure of Nvidia’s anti-bot measures ended up heralding the worst year in memory to upgrade a graphics card.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-nvidia-rtx-30-series-one-year-on-should-you-upgrade",
          "publishedOn": "2021-09-20T15:53:33.000Z",
          "wordCount": 1556,
          "title": "The Nvidia RTX 30 series, one year on: should you upgrade?"
        },
        {
          "id": "https://www.rockpapershotgun.com/rumour-quantic-dream-are-making-a-star-wars-game",
          "author": "Alice O'Connor",
          "description": "Here's a rumour that's wildly unsupported but so horrible that oh god you can imagine it being true: Quantic Dream are secretly making a Star Wars game. According to two separate Internauts, the French studio behind Heavy Rain and Detroit: Become Human have become pally with Disney and are working on some sort of game set in the galaxy which gave us Baby Yoda and probably some other stories or something too idk. Take this all with the hugest pinch of spacesalt, of course.\nRead more",
          "link": "https://www.rockpapershotgun.com/rumour-quantic-dream-are-making-a-star-wars-game",
          "publishedOn": "2021-09-20T14:25:12.000Z",
          "wordCount": 810,
          "title": "Rumour: Quantic Dream are making a Star Wars game"
        },
        {
          "id": "https://www.rockpapershotgun.com/frogwares-and-microids-are-escalating-the-war-for-sexiest-young-detective-in-games",
          "author": "Alice Bell",
          "description": "A few months ago I brought it to your attention that Microids are making a new video game called Agatha Christie - Hercule Poirot: The First Cases, in which Poirot is a young and and hot detective solving his first case. I made a comparison to Sherlock Holmes Chapter One, the also upcoming new entry in Frogwares' long-running detect 'em up series, in which Sherlock Holmes is young and hot and solving his first case. Last week, both developers released new videos for their respective games, and the timing of it all was almost enough to make me believe they were baiting me, specifically.\nLast week was Agatha Christie's birthday, you see, so Microids dropped a more in-depth gameplay video and a new dev diary talking about they were making \"a unique new moustache\", just after they make hot young Poirot wink. Then, the very next day - the next day! The. Next. Day. Frogwares put out a release date trailer that may as well have been called Sherlock Holmes: Eyes Wide Shut. And I'm absolutely here for this escalting sexy war.\nRead more",
          "link": "https://www.rockpapershotgun.com/frogwares-and-microids-are-escalating-the-war-for-sexiest-young-detective-in-games",
          "publishedOn": "2021-09-20T14:00:00.000Z",
          "wordCount": 810,
          "title": "Frogwares and Microids are escalating the war for sexiest young detective in games"
        },
        {
          "id": "https://www.rockpapershotgun.com/nvidia-dlss-now-supported-in-over-100-games-thanks-to-indie-push",
          "author": "James Archer",
          "description": "Nvidia DLSS is usually worth turning on for an easy frame rate bump, but even after DLSS 2.0 made it easier for developers to implement, the list of games that actually support the AI-powered anti-aliasing tech has never exactly been running off the page. That said, Nvidia can now claimed to have reached the milestone of 100 DLSS-compatible games, thanks in large part to a recent adoption wave from indie games.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/nvidia-dlss-now-supported-in-over-100-games-thanks-to-indie-push",
          "publishedOn": "2021-09-20T13:11:01.000Z",
          "wordCount": 920,
          "title": "Nvidia DLSS now supported in over 100 games, thanks to indie push"
        },
        {
          "id": "https://www.rockpapershotgun.com/call-of-duty-vanguards-open-beta-is-extended-so-how-are-you-liking-it",
          "author": "Alice O'Connor",
          "description": "Hey, you, you played the Call Of Duty: Vanguard multiplayer open beta this weekend? You like it? You wanna play more? If you do want more, or thought you'd missed your chance to play, good news: the open beta has (probably predictably) been extended. Originally due to end today, it'll now end Wednesday. More time to see CoD's latest return to World War 2.\nRead more",
          "link": "https://www.rockpapershotgun.com/call-of-duty-vanguards-open-beta-is-extended-so-how-are-you-liking-it",
          "publishedOn": "2021-09-20T12:37:28.000Z",
          "wordCount": 763,
          "title": "Call Of Duty: Vanguard's open beta is extended, so how are you liking it?"
        },
        {
          "id": "https://www.rockpapershotgun.com/valve-are-removing-32-bit-support-from-dota-2",
          "author": "Alice O'Connor",
          "description": "If you have an ancient PC, you may soon be ejected from Valve's wonderful world of warwizards. They have announced plans to strip Dota 2 of \"support for some older systems and configurations\", including 32-bit operating systems, saying it's so they can \"keep the game and the Source 2 engine fresh\". DirectX 9 and OpenGL are on the chopping block too (but Vulkan support will stand, obvs).\nRead more",
          "link": "https://www.rockpapershotgun.com/valve-are-removing-32-bit-support-from-dota-2",
          "publishedOn": "2021-09-20T11:01:50.000Z",
          "wordCount": 896,
          "title": "Valve are removing 32-bit support from Dota 2"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-sks-loadout-warzone",
          "author": "Kevin Foley",
          "description": "Looking for the best SKS loadout to bring into Warzone? It certainly offers a unique role as a Marksman Rifle with its semi-automatic fire rate capability. The SKS performs the odd role of being underpowered compared to Sniper Rifles, and slow to shoot compared to Tactical Rifles, but you may see that as a worthwhile tradeoff for times when Warzone matches require you to play a ranged support role that can consistently land accurate shots. For this reason, we've put together what we consider to be the best SKS loadout to bring into Warzone.\nRead more",
          "link": "https://www.rockpapershotgun.com/best-sks-loadout-warzone",
          "publishedOn": "2021-09-20T10:48:34.000Z",
          "wordCount": 1037,
          "title": "Best SKS loadout in Warzone Season 5"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-sunday-papers-611",
          "author": "Ed Thorn",
          "description": "Sundays are for treating yourself to some fancy hand sanitiser that smells like citrus. Before you press the pump, let's read this week's best writing about games.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-sunday-papers-611",
          "publishedOn": "2021-09-19T10:00:00.000Z",
          "wordCount": 1252,
          "title": "The Sunday Papers"
        },
        {
          "id": "https://www.rockpapershotgun.com/story-of-seasons-pioneers-of-olive-town-has-sprouted-on-steam",
          "author": "Graham Smith",
          "description": "Every Story Of Seasons game starts the same way, with a young person fleeing the big city for a more relaxing and simple life. Good luck to them, sez I, but personally I find takeaway delivery services much more relaxing and simple than growing my own beets. \r\n\nStory Of Seasons: Pioneers Of Olive Town repeats the myth, though I admit its pastoral greens and funny hats make a strong argument for country living. It's out on Steam now.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/story-of-seasons-pioneers-of-olive-town-has-sprouted-on-steam",
          "publishedOn": "2021-09-18T12:51:00.000Z",
          "wordCount": 798,
          "title": "Story Of Seasons: Pioneers Of Olive Town has sprouted on Steam"
        },
        {
          "id": "https://www.rockpapershotgun.com/dicey-spaceship-crisis-sim-tharsis-is-the-latest-epic-games-store-freebie",
          "author": "Graham Smith",
          "description": "Tharsis is a turn-based spaceship management game where your ability to deal with a Sandra Bullock of disasters is determined by a dice roll. Alec once sung its praises while calling it \"cruel as hell\" - and it's one of this week's free games from the Epic Games Store.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/dicey-spaceship-crisis-sim-tharsis-is-the-latest-epic-games-store-freebie",
          "publishedOn": "2021-09-18T11:13:00.000Z",
          "wordCount": 779,
          "title": "Dicey spaceship crisis sim Tharsis is the latest Epic Games Store freebie"
        },
        {
          "id": "https://www.rockpapershotgun.com/fifa-22-ultimate-team-will-let-you-see-inside-loot-boxes-from-launch",
          "author": "Graham Smith",
          "description": "EA have detailed how FIFA Ultimate Team is changing for FIFA 22 when it launches on September 26th. Chief among the new features is the adoption of Preview Packs, which let you see the contents of one of Ultimate Team's lucrative loot boxes before you decide whether to buy it.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/fifa-22-ultimate-team-will-let-you-see-inside-loot-boxes-from-launch",
          "publishedOn": "2021-09-18T10:30:00.000Z",
          "wordCount": 810,
          "title": "FIFA 22 Ultimate Team will let you see inside loot boxes from launch"
        },
        {
          "id": "https://www.rockpapershotgun.com/victoria-iii-details-its-approach-to-slavery-in-new-dev-diary",
          "author": "Graham Smith",
          "description": "The latest development diary post for Victoria III talks in detail about how Paradox's empire builder will deal with the topic of slavery. Extremely carefully, is the answer.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/victoria-iii-details-its-approach-to-slavery-in-new-dev-diary",
          "publishedOn": "2021-09-18T09:25:00.000Z",
          "wordCount": 895,
          "title": "Victoria III details its approach to slavery in new dev diary"
        },
        {
          "id": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-162",
          "author": "Alice O'Connor",
          "description": "Hold tight, it's still summer! Four more days and then you can put on as many jumps as you want and chug pumpkin spice lattes until you hurl but for now please, don't deny me the dregs of summer. I need this. You're probably indoors playing video games anyway, so what does it matter to you? Tell me: what are you playing this weekend?\nRead more",
          "link": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-162",
          "publishedOn": "2021-09-18T08:00:00.000Z",
          "wordCount": 1021,
          "title": "What are we all playing this weekend?"
        },
        {
          "id": "https://www.rockpapershotgun.com/grindstones-monsters-and-mamas-update-adds-new-playable-character",
          "author": "Graham Smith",
          "description": "Beloved puzzle battler Grindstone has received another free content update. \"Monsters And Mamas\" adds the game's first alternate playable character, letting you choose to ascend the mountain as vetern stonegrinder Jorja, pictured above. There's also a new Boss Blitz mode, new rewards, and a high-contrast accessibility feature for the colourblind.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/grindstones-monsters-and-mamas-update-adds-new-playable-character",
          "publishedOn": "2021-09-17T20:24:18.000Z",
          "wordCount": 763,
          "title": "Grindstone's Monsters And Mamas update adds new playable character"
        },
        {
          "id": "https://www.rockpapershotgun.com/crysis-remastered-is-available-on-steam-now",
          "author": "Graham Smith",
          "description": "Crysis Remastered landed on the Epic Games Store last year, and the Crysis Trilogy Remastered will similarly don its freshly dry-cleaned nanosuits for Epic's store on October 15th. But as of today, you can also grab Crysis Remastered from Steam.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/crysis-remastered-is-available-on-steam-now",
          "publishedOn": "2021-09-17T20:00:13.000Z",
          "wordCount": 764,
          "title": "Crysis Remastered is available on Steam now"
        },
        {
          "id": "https://www.rockpapershotgun.com/outcast-is-getting-a-sequel-20-years-after-the-original",
          "author": "Imogen Beckhelling",
          "description": "Hello, the 90s are calling and they'd like to offer you sequels to games you've probably forgotten about. Outcast 2: A New Beginning is the newly announced follow-up to 1999's Outcast. It's an open-world third-person shooter that takes place right after the events of the original, where Cutter Slade (the best-named man in the world) has been stuck in time for 20 years after trying to get home to Earth from the alien planet Adelpha. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/outcast-is-getting-a-sequel-20-years-after-the-original",
          "publishedOn": "2021-09-17T19:45:00.000Z",
          "wordCount": 884,
          "title": "Outcast is getting a sequel 20 years after the original"
        },
        {
          "id": "https://www.rockpapershotgun.com/jagged-alliance-3-is-coming-from-the-developers-of-surviving-mars",
          "author": "Graham Smith",
          "description": "Jagged Aliance 3 has been announced during this evening's THQ Nordic 10th anniversary showcase. The turn-based tactics sequel is the first numbered game in the series since 1999's Jagged Alliance 2. It's being developed by Haemimont Games, who are best known for several Tropico games or most recently citybuilder Surviving Mars.\r\n\nThere's a cinematic and gameplay trailer below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/jagged-alliance-3-is-coming-from-the-developers-of-surviving-mars",
          "publishedOn": "2021-09-17T19:45:00.000Z",
          "wordCount": 869,
          "title": "Jagged Alliance 3 is coming from the developers of Surviving Mars"
        },
        {
          "id": "https://www.rockpapershotgun.com/destroy-all-humans-2-reprobed-is-in-development",
          "author": "Graham Smith",
          "description": "Destroy All Humans 2: Reprobed has been announced. It's a ground-up remake of the 2006 third-person action game in which you go on a globe-trotting adventure to, uh, destroy all humans. Reprobed follows  last year's remake of the first Destroy All Humans, and comes from the same developer, Black Forest Games.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/destroy-all-humans-2-reprobed-is-in-development",
          "publishedOn": "2021-09-17T19:45:00.000Z",
          "wordCount": 776,
          "title": "Destroy All Humans! 2: Reprobed is in development"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-dead-cells-update-makes-it-more-approachable-to-newcomers",
          "author": "Kaan Serin",
          "description": "Dead Cells has received yet another update, named Practice Makes Perfect, which adds a training area, powerful buffs called Aspects, and other more. The devs say the patch is focused \"on improving the ease-of-use and learning curve for everyone (paticularly newcomers & occasional players), without altering the overall difficulty of the game.\" To facilitate this goal, all the new features are optional – allowing players to execute their sweet dodge rolls with the challenge they prefer.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/new-dead-cells-update-makes-it-more-approachable-to-newcomers",
          "publishedOn": "2021-09-17T16:31:26.000Z",
          "wordCount": 894,
          "title": "New Dead Cells update makes it more approachable to newcomers"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-making-of-dishonored-death-of-the-outsider-and-how-arkane-killed-a-god",
          "author": "Hirun Cryer",
          "description": "Dishonored: Death Of The Outsider is a revenge and redemption tale, only here the target of your revenge is god. 'We're going to kill a god’ might seem like a well-trodden path in JRPG country, but Death Of The Outsider brings something new to the table. Here, the god is a trickster, a victim, and the source of the player's power. He's a figure that has come to define the Dishonored series as a whole, and is both revered and pitied by its players. So how, exactly, do you go about killing a god like this? I spoke to the developers at Arkane to find out. \nRead more",
          "link": "https://www.rockpapershotgun.com/the-making-of-dishonored-death-of-the-outsider-and-how-arkane-killed-a-god",
          "publishedOn": "2021-09-17T16:00:00.000Z",
          "wordCount": 3279,
          "title": "The making of Dishonored: Death Of The Outsider, and how Arkane killed a god"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-safe-codes",
          "author": "Rebecca Jones",
          "description": "Where are all of the codes to open safes and doors and unlock machine terminals in Deathloop? In true Arkane tradition, Deathloop is full of safes and locked doors that can only be accessed with three- and four-digit codes. Some of the secrets hidden within are essential to progressing the story, while others just contain some good loot. Some of the Visionaries have also used codes to protect some of their machines, which you'll need to override in order to bypass their security.\n Read more",
          "link": "https://www.rockpapershotgun.com/deathloop-safe-codes",
          "publishedOn": "2021-09-17T15:18:38.000Z",
          "wordCount": 3193,
          "title": "Deathloop codes: safe, door, and machine code locations"
        },
        {
          "id": "https://www.rockpapershotgun.com/ultimate-audio-bang-14-big-meaty-guns-slapping-meat",
          "author": "Ed Thorn",
          "description": "Predictably, Imogen and I begin this week's episode of Ultimate Audio Bang by getting excited about Deathloop before realising that there's plenty of other newsy bits to cover. Listen to get our hot thoughts on the Call Of Duty: Vanguard reveal, Battlefield 2042's delay, the Overwatch League using an early build of Overwatch 2 in 2022, and plenty more shootery things.\nRead more",
          "link": "https://www.rockpapershotgun.com/ultimate-audio-bang-14-big-meaty-guns-slapping-meat",
          "publishedOn": "2021-09-17T15:10:25.000Z",
          "wordCount": 830,
          "title": "Ultimate Audio Bang #14: big meaty guns slapping meat"
        },
        {
          "id": "https://www.rockpapershotgun.com/wuchang-fallen-feathers-looks-like-a-chinese-take-on-bloodborne",
          "author": "Alice O'Connor",
          "description": "Following fawning over the Monkey King violence of Black Myth: Wukong, the latest upcoming Chinese game to turn heads with Souls-inspired action and shiny graphics might be Wuchang: Fallen Feathers. A new gameplay trailer released today gives a long look at a sexy babe fighting against plague-mutated people using her melee weapons, firearms, and gut-gouging counters. Yeah, feeling a lot of Bloodborne inspiration here. Have a look below.\nRead more",
          "link": "https://www.rockpapershotgun.com/wuchang-fallen-feathers-looks-like-a-chinese-take-on-bloodborne",
          "publishedOn": "2021-09-17T15:09:50.000Z",
          "wordCount": 766,
          "title": "Wuchang: Fallen Feathers looks like a Chinese take on Bloodborne"
        },
        {
          "id": "https://www.rockpapershotgun.com/arctic-cpu-coolers-to-get-free-mounting-kit-upgrades-for-intel-lga-1700-socket",
          "author": "James Archer",
          "description": "We haven’t seen much of Intel Alder Lake so far, despite being set for release in a matter of weeks.  One thing we do know is that like the majority of Intel’s last few chip family releases, the desktop contingent of these 12th-gen processors will need a brand-new motherboard socket: LGA 1700. \nRead more",
          "link": "https://www.rockpapershotgun.com/arctic-cpu-coolers-to-get-free-mounting-kit-upgrades-for-intel-lga-1700-socket",
          "publishedOn": "2021-09-17T15:09:34.000Z",
          "wordCount": 1019,
          "title": "Arctic CPU coolers to get free mounting kit upgrades for Intel LGA 1700 socket"
        },
        {
          "id": "https://www.rockpapershotgun.com/benchmarking-has-completely-ruined-my-steam-play-time-profile",
          "author": "Katharine Castle",
          "description": "I don't know if you know this about me, but I love a good list. For the past ten years, I've kept a detailed spreadsheet of all the games I've ever played. The bulk of it catalogues games by platform, but I've also kept a list of all the games I play per year since 2010. Call me crazy, but this document is a great source of joy for me. I love being able to look back and see when I last played a certain game, and it's also interesting to me to see just how many of them I manage to play each year. I also keep similar lists for films I see at the cinema, the books I read, as well as the plays and musicals I see at the theatre. I'm not kidding. I really do love a good list. \nPerhaps unsurprisingly, I'm also fascinated by the amount of time I spend playing games, too (and yes, I do have a list for this as well - albeit only for my Nintendo Wii games at the moment). Steam, of course, keeps excellent track of your play time - and because it's always open on my PC, there's no need to keep my own version of it. I can just load up my Steam profile and gaze lovingly at the hours and minutes in my All Games tab. Except I can't anymore, because four years' worth of professional benchmarking has absolutely ruined my play time figures. It upsets me. Because I haven't really spent 130 hours playing Shadow Of The Tomb Raider. Or 38 hours playing Doom. It's all benchmarking, and I wish there was a way to scrub these games clean again so everything can be nice and neat and orderly again, and most of all, accurate. \nRead more",
          "link": "https://www.rockpapershotgun.com/benchmarking-has-completely-ruined-my-steam-play-time-profile",
          "publishedOn": "2021-09-17T15:09:19.000Z",
          "wordCount": 964,
          "title": "Benchmarking has completely ruined my Steam play time profile"
        },
        {
          "id": "https://www.rockpapershotgun.com/give-yourself-a-good-day-by-playing-webbed",
          "author": "Sin Vega",
          "description": "It was 3am and Hucks the cellar spider was finally surrounded by, instead of carrying, her wee hatchlings. Clarice, her slightly dim neighbour, was resting after another hour spent fruitlessly stumbling around after an even dafter flying thingy that would eventually blunder right into her face.\r\n\nPlaying Webbed seemed inevitable for someone who watches her ceiling spiders when she can't sleep or finish an article. But within about a minute of playing, it became clear that it's the kind of game that will bring joy to almost anyone. Webbed is immediately brilliant.\nRead more",
          "link": "https://www.rockpapershotgun.com/give-yourself-a-good-day-by-playing-webbed",
          "publishedOn": "2021-09-17T14:30:10.000Z",
          "wordCount": 682,
          "title": "Give yourself a good day by playing Webbed"
        },
        {
          "id": "https://www.rockpapershotgun.com/steam-deck-dev-kit-screenshots-show-a-likely-big-picture-replacement-steamos-3-allegedly-leaks",
          "author": "James Archer",
          "description": "Whelp, that didn’t take long. Steam Deck dev kits were only sent out to game developers this week, and it looks like Valve’s handheld PC is already getting picked apart. That’s according to SteamDB creator Pavel Djundik, who tweeted screenshots of the Steam Deck UI before claiming the entire SteamOS 3 operating system has been leaked.\nRead more",
          "link": "https://www.rockpapershotgun.com/steam-deck-dev-kit-screenshots-show-a-likely-big-picture-replacement-steamos-3-allegedly-leaks",
          "publishedOn": "2021-09-17T13:03:49.000Z",
          "wordCount": 1029,
          "title": "Steam Deck dev kit screenshots show a likely Big Picture replacement, SteamOS 3 allegedly leaks"
        },
        {
          "id": "https://www.rockpapershotgun.com/clive-sinclair-who-brought-us-the-zx-spectrum-has-died",
          "author": "Alice O'Connor",
          "description": "Clive Sinclair, the founder of the company which brought us the ZX Spectrum computer, has died. The first encounter with PC gaming for many of a certain age in the UK wasn't through any beige box MS-DOS or Windows, it was on that futuristic wee black keyboard with rubbery keys and a colourful stripe, which loaded software from cassette tapes. I'm too young to have seen its glory days but I think the first PC game I played was a Speccy shoot 'em up, a magical experience I didn't believe would actually work when I first saw my pal plug a tape deck into a keyboard.\nRead more",
          "link": "https://www.rockpapershotgun.com/clive-sinclair-who-brought-us-the-zx-spectrum-has-died",
          "publishedOn": "2021-09-17T12:09:04.000Z",
          "wordCount": 1012,
          "title": "Clive Sinclair, who brought us the ZX Spectrum, has died"
        },
        {
          "id": "https://www.rockpapershotgun.com/tails-of-iron-review",
          "author": "Alice Bell",
          "description": "As enquiring minds already know, rats are very cute. I've not had pet rats myself, but a bunch of my friends have. Rats have lovely little pin-prick hands and feet, and they will give you wiffly-nose kisses while they assess whether your hair is worth exploring or not.\nThe rats in Tails Of Iron are cute. Little 2D inhabitants of a feudal rat kingdom, where they get milk from insects that look like cows, and royal succession is determined in trial by combat - which you, Prince Redgi, win, and shortly thereafter become King Redgi when your dad is murdered by frogs right in front of you. Let the amphibian bodies hit the floor. Time to kick this RPG into a side-on soulslike experience. Slice open a frog belly and see the guts spill out. These rats are cute, but also u wot? U wot? Say that again m8. Say that to my face. I'll 'ave you.\nRead more",
          "link": "https://www.rockpapershotgun.com/tails-of-iron-review",
          "publishedOn": "2021-09-17T12:04:39.000Z",
          "wordCount": 1782,
          "title": "Tails Of Iron review: a fun 2D Soulslike with a bit too much padding"
        },
        {
          "id": "https://www.rockpapershotgun.com/tales-of-arise-is-the-fastest-selling-game-in-the-series",
          "author": "Graham Smith",
          "description": "The Tales games stretch back to 1995's Tales Of Phantasia, but the latest entry, Tales Of Arise, is now the fastest selling in the series. In less than a week, it has sold a million copies, Bandai Namco say.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/tales-of-arise-is-the-fastest-selling-game-in-the-series",
          "publishedOn": "2021-09-16T22:36:13.000Z",
          "wordCount": 754,
          "title": "Tales Of Arise is the fastest selling game in the series"
        },
        {
          "id": "https://www.rockpapershotgun.com/titan-quest-and-jagged-alliance-are-free-to-keep-right-now",
          "author": "Graham Smith",
          "description": "THQ Nordic are celebrating their 10th anniversary by giving away free games via Steam. Surprisingly enduring action RPG Titan Quest is currently free-to-keep, and so is the ancient turn-based tactics of Jagged Alliance. \r\n\nThen, if you want something a little more modern, the real-time tactical stealth of Desperados 3 is free-to-try for the next three days.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/titan-quest-and-jagged-alliance-are-free-to-keep-right-now",
          "publishedOn": "2021-09-16T21:41:48.000Z",
          "wordCount": 837,
          "title": "Titan Quest and Jagged Alliance are free to keep right now"
        },
        {
          "id": "https://www.rockpapershotgun.com/please-ikea-make-me-some-grownup-gaming-furniture",
          "author": "Graham Smith",
          "description": "Ikea, makers of large, boring Lego projects for adults, are launching a range of gaming furniture. The set, created in collaboration with Republic Of Gamers, includes desks, chairs, streaming accessories and what The Guardian describes as a \"multi-functional cushion/blanket.\"\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/please-ikea-make-me-some-grownup-gaming-furniture",
          "publishedOn": "2021-09-16T21:01:31.000Z",
          "wordCount": 828,
          "title": "Please Ikea, make me some grownup gaming furniture"
        },
        {
          "id": "https://www.rockpapershotgun.com/call-of-duty-vanguards-beta-opens-to-all-this-weekend",
          "author": "Graham Smith",
          "description": "Call Of Duty: Vanguard has already had a beta on PlayStation, and if you've pre-ordered the game you can play it right now on PC. On Saturday however, the beta will open up to everyone with a Battle.net account. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/call-of-duty-vanguards-beta-opens-to-all-this-weekend",
          "publishedOn": "2021-09-16T20:07:11.000Z",
          "wordCount": 869,
          "title": "Call Of Duty: Vanguard's beta opens to all this weekend"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-to-overclock-gpu",
          "author": "James Archer",
          "description": "Learning how to overclock your GPU sounds like it should be one of gaming PC ownership’s essential skills, like knowing how to clean your PC or how to check CPU temperature. And why not? Coaxing extra performance out of a component will get you more frames-per-second at no additional charge, and you can do it with just about every gaming card under the sun. Even the best graphics cards that come with factory overclocks will leave headroom for additional gains to unlock yourself.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/how-to-overclock-gpu",
          "publishedOn": "2021-09-16T16:26:44.000Z",
          "wordCount": 2243,
          "title": "How to overclock your GPU"
        },
        {
          "id": "https://www.rockpapershotgun.com/valheim-has-added-a-hot-tub-for-vikings-to-unwind",
          "author": "Alice O'Connor",
          "description": "Trying to survive in purgatory isn't easy, having to hunt and build and craft everything you need to slay mighty mythical beasts. Thankfully, the Vikings of Valheim can now relax with their pals in a hot tub, one of many fancy household items added in the 'Home & Hearth' early access update today. Sure sure it brings new weapons and new creatures and balance changes and things too, but: hot tub!\nRead more",
          "link": "https://www.rockpapershotgun.com/valheim-has-added-a-hot-tub-for-vikings-to-unwind",
          "publishedOn": "2021-09-16T16:22:16.000Z",
          "wordCount": 805,
          "title": "Valheim has added a hot tub for Vikings to unwind"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-how-to-beat-yervha",
          "author": "Rebecca Jones",
          "description": "What are the correct answers to the Yervha's questions in Deathloop? The Yervha, a.k.a. Queen of Riddles, is a trivia machine in Deathloop. If you can answer all 10 of its questions correctly you'll win a prize! A very modest prize, but a prize nonetheless. And who doesn't love a good trivia challenge? You certainly seem to, since you're here!\nRead more",
          "link": "https://www.rockpapershotgun.com/deathloop-how-to-beat-yervha",
          "publishedOn": "2021-09-16T15:02:46.000Z",
          "wordCount": 1447,
          "title": "The Yervha: how to beat Deathloop's fiendish trivia machine"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-electronic-wireless-show-podcast-episode-156-the-best-doctors-in-games-special",
          "author": "Alice Bell",
          "description": "The recording of this episode of The Electronic Wireless Show podcast turned out to be unfortunately cursed with technical issues, which means I am (probably noticeably) tired and grumpy, and don't let Matthew and Nate reproduce their witty banter from the first time we tried to record. No cold open! Still, nothing to cheer me up like some good bedside manner from a doctor. Oh no, it turns out all game doctors are awful!\nWe discuss our favourite game medical types, and also discuss why doctors in games are so often evil baddies. The saga of Matthew and his teeth continues, as well as envisioning Matthew as a clown who just turns up to your kids birthday party smeared in his wife's lipstick, drinks all your Fanta, and leaves again. Now that's malpractice.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-electronic-wireless-show-podcast-episode-156-the-best-doctors-in-games-special",
          "publishedOn": "2021-09-16T15:00:00.000Z",
          "wordCount": 792,
          "title": "EWS podcast episode 156: the best doctors special"
        },
        {
          "id": "https://www.rockpapershotgun.com/gamedec-review",
          "author": "Khee Hoon Chan",
          "description": "From the stealth-oriented Foreclosed to the twin-sticky The Ascent, there has been a bumper crop of cyberpunk shooters this year, their endless gun fests typically set amidst a gaudy onslaught of neon-tinged billboards, metallic skyscrapers and indiscriminately-placed Asian motifs.\nIn spite of its roots, Gamedec initially seems like a reprieve from this recent blitz of cyberpunk games. It sticks steadfastly to its self-imposed, zero-combat rule, instead leaning heavily towards the genre’s crime fiction elements. That’s because in Gamedec, you’re a detective actually carrying out proper investigative work, rather than simply pointing the smokey end of a gun towards your problems. You’ll sleuth around for clues, make deductions based on your discoveries, and draw conclusions that will shape the outcome of your cases.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/gamedec-review",
          "publishedOn": "2021-09-16T14:00:00.000Z",
          "wordCount": 1787,
          "title": "Gamedec review: a great cyberpunk concept undone by a bloated script"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloop-trinkets",
          "author": "Rebecca Jones",
          "description": "What are the best trinkets in Deathloop? Trinkets might sound frivolous, but they are in fact Deathloop's answer to mods: applying them provides potentially very powerful combat buffs, and therefore they're actually very important. Deathloop's Trinkets come in two varieties: Character Trinkets (personal mods applied to your player character) and Weapon Trinkets (mods which can be applied individually to every gun in your possession).\n Read more",
          "link": "https://www.rockpapershotgun.com/deathloop-trinkets",
          "publishedOn": "2021-09-16T13:00:51.000Z",
          "wordCount": 2086,
          "title": "Best Deathloop trinkets: what every trinket does and which are best for your loadout"
        },
        {
          "id": "https://www.rockpapershotgun.com/mechwarrior-5-mercenaries-gets-marriage-melee-and-mech-switching-with-its-next-dlc",
          "author": "Imogen Beckhelling",
          "description": "Don't you just hate it when you're getting married to secure an alliance with a certain faction, but another faction insists on existing in-between your borders? Don't worry, it's a simple fix: send in an army of mechs to conquer them, then you and your betrothed get even more space to share! \r\n\n\r\nThis is pretty much the plot of the next MechWarrior 5: Mercenaries DLC, Legend Of The Kestrel Lancers. It's arriving on September 23rd alongside a free update that will finally let players punch other mechs in the face. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/mechwarrior-5-mercenaries-gets-marriage-melee-and-mech-switching-with-its-next-dlc",
          "publishedOn": "2021-09-16T13:00:00.000Z",
          "wordCount": 1346,
          "title": "MechWarrior 5: Mercenaries gets marriage, melee and mech-switching with its next DLC"
        },
        {
          "id": "https://www.rockpapershotgun.com/deltarune-chapter-2-continues-the-undertale-follow-up-tomorrow",
          "author": "Alice O'Connor",
          "description": "This week we'll get to play the second chapter of Deltarune, the neither-sequel-nor-prequel-but-maybe-related follow-up to Undertale, creator Toby Fox has announced. Surprise!\nRead more",
          "link": "https://www.rockpapershotgun.com/deltarune-chapter-2-continues-the-undertale-follow-up-tomorrow",
          "publishedOn": "2021-09-16T11:54:24.000Z",
          "wordCount": 882,
          "title": "Deltarune Chapter 2 continues the Undertale follow-up tomorrow"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-best-battle-royale-games",
          "author": "Ed Thorn",
          "description": "Outlast the rest of the competition and emerge the last person standing, that's the motto for the best battle royale games out there. Often there's a big circle of poison gas pushing people closer together, or like, everyone parachutes in for some reason. Some don't feature any of these things, and opt for obstacle courses, or zany community creations instead. You may have thought battle royale games were quite one-note, but they're actually quite varied. So below I've rounded up some of the best ways to prove you're the fittest survivor of them all.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-best-battle-royale-games",
          "publishedOn": "2021-09-16T11:06:09.000Z",
          "wordCount": 2801,
          "title": "The 10 best battle royale games"
        },
        {
          "id": "https://www.rockpapershotgun.com/skatebird-review",
          "author": "Brendan Caldwell",
          "description": "Skatebird is simultaneously a homage to the Tony Hawk games of old and a celebration of just how stupid birds can be. It's the arcadey kind of kickflipper, handling more like THUG than a Skate game. But don't expect the truly smooth flow of the Hawkster's outings. There's plenty of wobbly physics on show here, much of it intentional and jokey (as you'd expect from a game that seems to have resulted entirely from a single pun). But some of it perhaps not. Still, it's hard to hate on these feathery ones when they squawk so pure, and when their taste in music is im-peck-able.\nRead more",
          "link": "https://www.rockpapershotgun.com/skatebird-review",
          "publishedOn": "2021-09-16T11:02:28.000Z",
          "wordCount": 1838,
          "title": "Skatebird review: tiny hawks win the day in this wonky skating game"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-amazing-american-circus-review",
          "author": "Matt Cox",
          "description": "By the time Henry Ford rolled up to see my show, I was ready to pack my trunk and say goodbye to the circus. I’d been ready a long time ago, truth be told, some time between inciting industrial action amongst JP Morgan’s workers and nabbing an automaton from Tesla. My troupe spread delight wherever we roamed, but the crowds weren’t to know we’d been plying the same tricks for hour after hour - nor that it had hardly taken one to hone my act to the point where failure was inconceivable. Every meagre juggling trick brought whoops from the crowd and impatience to my heart. With every high-wire act, my spirit sank lower still. \r\n\n\r\nThere’s no turn around coming, I’m afraid. The Amazing American Circus is a deckbuilder with some nice ideas, but it’s far more clown than strongman. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-amazing-american-circus-review",
          "publishedOn": "2021-09-16T08:00:00.000Z",
          "wordCount": 1723,
          "title": "The Amazing American Circus review: I hate to say it, but there are better shows in town"
        },
        {
          "id": "https://www.rockpapershotgun.com/corsairs-pretty-240mm-aio-cooler-is-going-cheap-on-amazon-uk",
          "author": "Will Judd",
          "description": "Liquid CPU coolers are all the rage these days, as they look neat and provide the sort of excellent cooling performance you'd normally only get out of an oversized air cooler. Corsair make some of the best AiOs in the business, and today their (draws breath) iCue H100i Pro XT RGB 240mm CPU cooler (phew) is going cheap. It debuted at £115 and normally costs £90, but today you can pick it up for the relative bargain price of £72. \nRead more",
          "link": "https://www.rockpapershotgun.com/corsairs-pretty-240mm-aio-cooler-is-going-cheap-on-amazon-uk",
          "publishedOn": "2021-09-15T20:56:09.000Z",
          "wordCount": 919,
          "title": "Corsair's pretty 240mm AiO cooler is going cheap on Amazon UK"
        },
        {
          "id": "https://www.rockpapershotgun.com/a-crucial-mx500-1tb-ssd-for-85-headlines-a-host-of-newegg-deals",
          "author": "Will Judd",
          "description": "Newegg in the US is discounting a host of PC peripherals and components today, so we thought we'd highlight our favourite three deals especially for you. They include a full-size hot-swappable mechanical keyboard for $50, 16 gigabytes of 3600MHz RAM for $73 and a 1TB SSD for just $85. Here are all the details!\nRead more",
          "link": "https://www.rockpapershotgun.com/a-crucial-mx500-1tb-ssd-for-85-headlines-a-host-of-newegg-deals",
          "publishedOn": "2021-09-15T20:35:40.000Z",
          "wordCount": 1089,
          "title": "A Crucial MX500 1TB SSD for $85 headlines a host of Newegg deals"
        }
      ]
    },
    {
      "title": "Root.cz - články",
      "feedUrl": "https://www.root.cz/rss/clanky/",
      "siteUrl": "https://www.root.cz/clanky/",
      "articles": [
        {
          "id": "www.root.cz-text-15675",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Na konci září vyprší platnost kořenového certifikátu DST Root CA X3, na kterém od začátku stála podpora certifikační autority Let's Encrypt. Ta už sice používá nový kořen, ale staré systémy budou mít problém.",
          "link": "https://www.root.cz/clanky/koren-let-s-encrypt-na-konci-mesice-vyprsi-dotkne-se-to-starsich-klientu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T22:00:10.000Z",
          "wordCount": 1832,
          "title": "Kořen Let's Encrypt na konci měsíce vyprší, dotkne se to starších klientů",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/102/cerveny-zamek-1.jpg",
            "length": "46645",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15676",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "V první polovině osmdesátých let patřilo k dobrému vychování dodávat domácí i osobní počítače vybavené nějakým dialektem programovacího jazyka BASIC. Výjimkou není ani IBM PC, pro které byl dodáván mj. i GW-BASIC, později QBasic.",
          "link": "https://www.root.cz/clanky/pc-basic-reinkarnace-popularniho-i-zatracovaneho-gw-basicu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T22:00:05.000Z",
          "wordCount": 8468,
          "title": "PC-BASIC: reinkarnace populárního i zatracovaného GW-BASICu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/567/pc-basic-1.jpg",
            "length": "61248",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15662",
          "author": "redakce@root.cz (Root.cz: Ferenc Lengyel)",
          "description": "Platforma Arduino sa stala veľmi rozšírenou najmä vďaka tomu, že umožňuje veľmi jednoducho naprogramovať rôzne typy kontrolérov pre najrozmanitejšie úlohy. Zároveň využívame väčšinu výhod kontrolérov.",
          "link": "https://www.root.cz/clanky/arduino-mega-na-zbernici-s-pc/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-21T22:00:10.000Z",
          "wordCount": 2145,
          "title": "Arduino Mega na zbernici s PC",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/532/arduino-mega-1.jpg",
            "length": "76480",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15671",
          "author": "redakce@root.cz (Root.cz: Jiří Sluka)",
          "description": "Dnes si představíme jednoduchý editor odvozený z projektu lite, budeme optimalizovat velikost obrázků, začneme si vést vlastní deník a nakonec využijeme průzkumníka slovníků EPWING, LingvoDSL a StarDict.",
          "link": "https://www.root.cz/clanky/softwarova-sklizen-22-9-2021/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-21T22:00:05.000Z",
          "wordCount": 981,
          "title": "Softwarová sklizeň (22. 9. 2021)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/root/368/kombajn-sklizen.jpg",
            "length": "394618",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15642",
          "author": "redakce@root.cz (Root.cz: Michal Tauchman)",
          "description": "V druhé části článků o retrobrightingu se podíváme na samotné výsledky mého snažení. Ve většině případů je výsledek velmi uspokojivý, ale jak uvidíte v jednom případě, ne vždy je vše dokonalé.",
          "link": "https://www.root.cz/clanky/retrobrightin-g-vysledky-procesu-beleni-plastu-a-jeden-prusvih/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T22:00:10.000Z",
          "wordCount": 2655,
          "title": "Retrobrightin­g: výsledky procesu bělení plastu a jeden průšvih",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/324/amiga-retrobrighting-1.jpg",
            "length": "54531",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15668",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "V dnešní části seriálu o křivkách, které nalezneme v přírodě, architektuře, technice i v počítačové grafice, dokončíme popis různých typů spirál. Zabývat se budeme například klotoidou a evolventou.",
          "link": "https://www.root.cz/clanky/krivky-v-prirode-i-v-pocitacove-grafice-svet-spiral-dokonceni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T22:00:05.000Z",
          "wordCount": 7313,
          "title": "Křivky v přírodě i v počítačové grafice – svět spirál (dokončení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/507/krivka-perex-1.jpg",
            "length": "74201",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15667",
          "author": "redakce@root.cz (Root.cz: CSIRT.CZ)",
          "description": "V dnešním díle Postřehů se podíváme na další malý krok směřující ke konci hesel, na agenty NSA, kteří si přivydělávali jako námezdní hackeři, na eskalaci privilegií v HP Omen nebo nový návrh OWASP Top 10.",
          "link": "https://www.root.cz/clanky/postrehy-z-bezpecnosti-ukuste-to-bez-hesel-mily-marconi/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-19T22:00:10.000Z",
          "wordCount": 1416,
          "title": "Postřehy z bezpečnosti: zkuste to bez hesel, milý Marconi!",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/662/mobil-pocitac-1.jpg",
            "length": "40499",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15666",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Firefox Snap bude výchozím prohlížečem v Ubuntu 21.10. Kali Linux 2021.3 NetHunter běží na hodinkách TicWatch Pro. Společnost Jolla oznámila vydání nové verze operačního systému pro chytré telefony Sailfish OS 4.2.0 „Verla“.",
          "link": "https://www.root.cz/clanky/firefox-snap-bude-vychozi-v-ubuntu-kali-linux-na-hodinkach-ticwatch-pro/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-19T22:00:05.000Z",
          "wordCount": 1195,
          "title": "Firefox Snap bude v Ubuntu výchozí, Kali Linux na hodinkách TicWatch Pro",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/172/firefox-ubuntu-1.jpg",
            "length": "19494",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15669",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Objevily se podrobné informace o připravovaných procesorech z dílen firem Intel a AMD. Red Hat chce konečně pořádně vyřešit podporu HDR na linuxovém desktopu. Xiaomi má nový telefon 11T Pro s 108Mpix foťákem.",
          "link": "https://www.root.cz/clanky/red-hat-resi-hdr-v-linuxu-uniky-informaci-od-intelu-a-amd/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-18T22:00:10.000Z",
          "wordCount": 1371,
          "title": "Red Hat řeší HDR v Linuxu, úniky informací od Intelu a AMD",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/615/amd-epyc-64core-1.jpg",
            "length": "41676",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15653",
          "author": "redakce@root.cz (Root.cz: Petr Škuta)",
          "description": "Se značkou Tuxedo jsme se zde již párkrát setkali. Recenzí prošly dvě generace ultrabooků řady Infinity Book. Nyní ale na redakční stůl zamířil stroj ze zcela opačného spektra, a to herní Tuxedo Stellaris 15. Jak dopadl?",
          "link": "https://www.root.cz/clanky/kanon-na-vrabce-recenze-herniho-notebooku-tuxedo-stellaris-15/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-16T22:00:10.000Z",
          "wordCount": 2444,
          "title": "Kanón na vrabce: recenze herního notebooku Tuxedo Stellaris 15",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/237/tuxedo-stellaris-15-front-1.jpg",
            "length": "47745",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "Root.cz - zprávičky",
      "feedUrl": "https://www.root.cz/rss/zpravicky/",
      "siteUrl": "https://www.root.cz/zpravicky/",
      "articles": [
        {
          "id": "www.root.cz-actuality-42846",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Na základě článku laboratoře QRATOR labs firma MikroTik na svých stránkách upozorňuje na další vlnu DDoS útoků.",
          "link": "https://www.root.cz/zpravicky/mikrotik-zaziva-dalsi-vlnu-ddos-utoku/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-23T07:13:54.000Z",
          "wordCount": 835,
          "title": "MikroTik zažívá další vlnu DDoS útoků",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/639/mikrotik-1.jpg",
            "length": "30507",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42847",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Vývojáři uvolnili pravidelnou půlroční aktualizaci desktopového prostředí GNOME, tentokrát s označením 41. Mezi hlavní novinky patří vylepšení správce software, nastavení multitaskingu a vylepšení power managementu. Kromě toho je tu nová aplikace Connections, aktualizovaná aplikace Music a vylepšení výkonu v celé řadě komponent.",
          "link": "https://www.root.cz/zpravicky/gnome-41-prinasi-vylepseni-vykonu-a-novinky-v-podpore-waylandu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-23T07:10:05.000Z",
          "wordCount": 765,
          "title": "GNOME 41 přináší vylepšení výkonu a novinky v podpoře Waylandu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/563/gnome-1.jpg",
            "length": "37205",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42845",
          "author": "redakce@root.cz (Root.cz: LD)",
          "description": "Včera večer byla vydána opravná verze VMware vCenter 6.5, 6.7 a 7.0. Tato nová sada verzí opravuje několik kritických zranitelností, od XSS, přístupu k skrytým endpointům API, neoprávněnou manipulaci s nastavením sítě virtuálních strojů, vzdálené mazání souborů na vCenteru až po asi nejzávažnější vzdálené spuštění kódu.",
          "link": "https://www.root.cz/zpravicky/rada-kritickych-chyb-ve-vmware-vcenter/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T20:42:02.000Z",
          "wordCount": 784,
          "title": "Řada kritických chyb ve VMware vCenter",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/295/vmware-1.jpg",
            "length": "60135",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42844",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Možná nejvýznačnější novinkou v Chrome/Chromium 94 pro uživatele je to, že element canvas je nyní implicitně kalibrován na barevný prostor sRGB, nicméně stránka může specifikovat jiný, podporován je i DCI-P3. Pete LaPage dále doporučuje na web.dev věnovat pozornost textu Eugena Zemtsova o WebCodecs s příklady využití přímého videa pomocí hardwarově akcelerovaných kodeků, které již prohlížeč má (aneb blíží se konec nutnosti dodávat v kódu vlastní neakcelerovanou WASM verzi kodeků). Podpora kodeků skrze WebCodecs se týká jak přehrávání, tak komprese.",
          "link": "https://www.root.cz/zpravicky/chrome-94-nasazuje-srgb-u-elementu-canvas-a-pridava-webgpu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T15:45:46.000Z",
          "wordCount": 836,
          "title": "Chrome 94 nasazuje sRGB u elementu canvas a přidává WebGPU",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/328/chrome-1.jpg",
            "length": "14231",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-41285",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "VPN umožňuje bezpečně propojit různá zařízení pomocí šifrovaných tunelů. Umožňuje také zapojit uživatele do vnitřní sítě přes zabezpečený přístupový bod. Na našem školení VPN a bezpečné připojení k síti s OpenVPN si prakticky ukážeme, jak to celé nastavit a zprovoznit.",
          "link": "https://www.root.cz/zpravicky/vytvorte-si-bezpecnou-vpn-pomoci-openvpn-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T09:49:21.000Z",
          "wordCount": 725,
          "title": "Vytvořte si bezpečnou VPN pomocí OpenVPN (školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/102/openvpn-logo-1.jpg",
            "length": "18777",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42843",
          "author": "redakce@root.cz (Root.cz: spajk)",
          "description": "Test deseti webových prezentací politických stran odhalil v pěti případech kritické zranitelnosti, nejčastěji se jednalo o cross-site scripting, objevily se ale zranitelné zastaralé knihovny a v jednom případě také děravý jedenáct let starý Apache. Více ve zprávě na webu spajk.cz.",
          "link": "https://www.root.cz/zpravicky/webove-stranky-politickych-stran-obsahuji-zranitelnosti/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T08:12:18.000Z",
          "wordCount": 1709,
          "title": "Webové stránky politických stran obsahují zranitelnosti",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/208/xss-notebook-1.jpg",
            "length": "64540",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42841",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "V Linuxu 5.16 dojde ke změně v ovladači nct6775, který obstarává čtení dat ze senzorů mnohých základních desek značky ASUS. Ovladač dostane podporu přístupu k ASIC za použití funkcí ASUS WMI (desky od Asusteku nepoužívají standardní cestu přes ACPI, kterou ovladač disponuje již nyní). S úpravou pak logicky do jádra zamíří i podpora níže uvedeného seznamu základních desek:",
          "link": "https://www.root.cz/zpravicky/linux-5-16-prinese-podporu-senzoru-dalsich-zakladnich-desek-asus/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T06:00:00.000Z",
          "wordCount": 841,
          "title": "Linux 5.16 přinese podporu senzorů dalších základních desek ASUS",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/52/asus-rog-strix-x470-f-gaming-1.jpg",
            "length": "35903",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42840",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Na GIMP 3.0 si ještě chvíli počkáme, vezměmež tedy zavděk dalším, víceméně opravným vydání dva-desítkové řady. GIMP 2.10.28 totiž přináší solidní množství oprav.",
          "link": "https://www.root.cz/zpravicky/gimp-2-10-28-opravuje-dalsi-chyby/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-22T05:00:00.000Z",
          "wordCount": 818,
          "title": "GIMP 2.10.28 opravuje další chyby",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/158/gimp-2-10-20-1.jpg",
            "length": "50629",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42839",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Canonical rozhodl o prodloužení podpory starších LTS vydání operačního systému Ubuntu na 10 let od první vydané verze. To znamená, že řada Ubuntu 14.04 LTS „Trusty Tahr“ bude podporována až do dubna 2024 a řada Ubuntu 16.04 LTS „Xenial Xerus“ až do dubna 2026.",
          "link": "https://www.root.cz/zpravicky/podpora-ubuntu-14-04-lts-a-16-04-lts-se-prodluzuje-na-10-let/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-21T22:00:00.000Z",
          "wordCount": 1569,
          "title": "Podpora Ubuntu 14.04 LTS a 16.04 LTS se prodlužuje na 10 let",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/223/ubuntu-14-04-esm-1.jpg",
            "length": "22623",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42842",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Laboratoře CZ.NIC vydaly další verzi mobilní Datovky (1.13.0). Kromě oprav nalezených chyb, jako jsou oprava chyby při načítání uložených informací o datovém trezoru nebo vypnutí upozornění na vypršení platnosti hesla, pokud je zvoleno přihlašování Mobilním klíčem, byl podobně jako v případě desktopové aplikace přidán výběr způsobu platby za odesílané poštovní datové zprávy, pokud má uživatel k dispozici více možností.",
          "link": "https://www.root.cz/zpravicky/nova-mobilni-datovka-nabizi-dalsi-zpusob-platby-za-odesilane-postovni-datove-zpravy/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-21T20:00:08.000Z",
          "wordCount": 796,
          "title": "Nová mobilní Datovka nabízí další způsob platby za odesílané poštovní datové zprávy",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/556/datovka-cz-nic-1.jpg",
            "length": "16539",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42838",
          "author": "redakce@root.cz (Root.cz: Ondřej Nový)",
          "description": "Celodenní soutěžní hackathon pro programátory od české technologické společnosti Seznam.cz zná své vítěze. Nejlepší výkon předvedl tým s názvem EasyPeasy.Net ve složení Tomáš Jurásek, Michal Mrnuštík, Michal Motyčka a Adam Jež (zleva).",
          "link": "https://www.root.cz/zpravicky/v-seznamackem-hackathonu-zvitezil-tym-easypeasy-net/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-21T10:06:05.000Z",
          "wordCount": 2379,
          "title": "V seznamáckém hackathonu zvítězil tým EasyPeasy.Net",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/417/hackaton-seznam-cz-2021-1.jpg",
            "length": "67345",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42837",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Kolegové ze serveru Cnews.cz otestovali pět terabajtových SSD pro rozhraní PCIe 4.0. Konkrétně šlo o disky značek WD, Samsung, Adata, Seagate a Aorus, jejichž cena se pohybuje okolo 5500 Kč. Testován byl výkon po připojení na novou sběrnici PCIe 4.0, ale zároveň i ve zpětně kompatibilní PCIe 3.0.",
          "link": "https://www.root.cz/zpravicky/test-terabajtovych-ssd-pro-rozhrani-pcie-4-0-od-wd-samsung-adata-seagate-aorus/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-21T06:34:23.000Z",
          "wordCount": 2323,
          "title": "Test terabajtových SSD pro rozhraní PCIe 4.0 od WD, Samsung, Adata, Seagate, Aorus",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/282/ssd-1.jpg",
            "length": "64824",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42836",
          "author": "redakce@root.cz (Root.cz: Ondřej Caletka)",
          "description": "Chcete-li vytvořit bitovou kopii souborového systému, asi není úplně dobrý nápad používat nástroje jako dd, je-li disk zároveň připojen. Vytváření obrazu bude určitou dobu trvat a pokud se během této doby na disk zapisuje, bude výsledný obraz velmi poškozený.",
          "link": "https://www.root.cz/zpravicky/hot-clone-nastroj-umoznujici-ziskat-obraz-pripojeneho-disku/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T14:58:07.000Z",
          "wordCount": 815,
          "title": "Hot-clone: nástroj umožňující získat obraz připojeného disku",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/508/hdd-pevny-disk-1.jpg",
            "length": "27164",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42835",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "SMB3 server implementovaný v jádře s názvem KSMBD, za kterým stojí Samsung, se dostal do jádra 5.15. To ještě ani nevyšlo a už se v KSMBD objevila závažná zranitelnost, kdy pomocí znaků .. v cestě je možné přistupovat k souborům mimo sdílené adresáře.",
          "link": "https://www.root.cz/zpravicky/smb3-server-v-jadre-5-15-ksmbd-uz-ma-prvni-vaznou-opravu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T14:22:13.000Z",
          "wordCount": 4107,
          "title": "SMB3 server v jádře 5.15 KSMBD už má první vážnou opravu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/567/linux-windows-tux.png",
            "length": "121771",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42834",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Fedora 35 beta by měla vyjít každým dnem. Ostrá verze se očekává 19. října, nebo o týden později. Na serveru mojefedora.cz vyšel dnes článek shrnující novinky očekávané ve Fedoře 35 Workstation.",
          "link": "https://www.root.cz/zpravicky/co-ocekavame-ve-fedore-35/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T14:06:01.000Z",
          "wordCount": 768,
          "title": "Co očekáváme ve Fedoře 35",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/682/fedora-1.jpg",
            "length": "24750",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42833",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Edward Snowden se minulý týden na Twitteru vyjádřil, že nedporučuje používat ExpressVPN. Důvodem je, že bývalý CIO ExpressVPN Daniel Gericke spolu s dalšími dvěma bývalými zaměstnanci NSA pracovali jako nájemní hackeři mezi lety 2016 a 2019 pro firmu DarkMatter ve Spojených arabských emirátech. Za porušení exportních zákonů, jim soud uložil pokutu více jak 1,5 milionů dolarů. Navíc dostali doživotní zákaz bezpečnostní prověrky.",
          "link": "https://www.root.cz/zpravicky/edward-snowden-nedporucuje-pouzivat-expressvpn/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T09:13:40.000Z",
          "wordCount": 2313,
          "title": "Edward Snowden nedoporučuje používat ExpressVPN",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/683/edward-snowden-1.jpg",
            "length": "33281",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-40574",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Linuxových systémů přibývá, každý den se spouštějí nové servery a někdo se o ně musí starat. To znamená spoustu různých dovedností specifických právě pro linuxové prostředí. Jak to zprovoznit, kudy bezpečně dovnitř, co tam najdeme, jak se o to postaráme a jak to nastavíme nebo rozšíříme.",
          "link": "https://www.root.cz/zpravicky/naucte-se-pouzivat-linux-spravne-a-bezpecne-online-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T07:38:28.000Z",
          "wordCount": 745,
          "title": "Naučte se používat Linux správně a bezpečně (online školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/440/skoleni-1.jpg",
            "length": "61676",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42832",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Vývojář jádra Jens Axboe si minulý čtvrtek postěžoval na Lenovo X1 Carbon Gen 9, protože mu při paralelním překladu jádra ( make -j4) notebook sníží frekvenci procesoru až na 400 MHz a stane se prakticky nepoužitelný. Jde o thermal throttling, který má zabránit přehřívání čím dál tenčích a lehčích notebooků.",
          "link": "https://www.root.cz/zpravicky/jak-zabranit-castemu-snizovani-frekvence-u-notebooku/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-20T06:48:30.000Z",
          "wordCount": 980,
          "title": "Jak zabránit častému snižování frekvence u notebooků",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/230/fedora-lenovo-thinkpad-x1-carbon-1.jpg",
            "length": "33800",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42831",
          "author": "redakce@root.cz (Root.cz: Calculon)",
          "description": "Byla vydána verze 0.5.0 jazyka Idris 2. Z větších změn lze zmínit přidání inkrementálního překladu a zrychlení typové kontroly omezením redukcí v době překladu.",
          "link": "https://www.root.cz/zpravicky/nova-verze-jazyka-idris-2-pridava-inkrementalni-preklad-a-zrychluje-typovou-kontrolu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-19T19:23:50.000Z",
          "wordCount": 740,
          "title": "Nová verze jazyka Idris 2 přidává inkrementální překlad a zrychluje typovou kontrolu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/388/idris-1.jpg",
            "length": "21059",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42829",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Od 23. do 25. září bude probíhat online konference LibreOffice 2021. Během tří dnů je připraveno okolo padesáti přednášek, workshopů a komunitních setkání s tématy týkající se kancelářského balíku, komunity a open source.",
          "link": "https://www.root.cz/zpravicky/online-konference-libreoffice-2021/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-18T10:47:18.000Z",
          "wordCount": 750,
          "title": "Online konference LibreOffice 2021",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/534/libreoffice-1.jpg",
            "length": "14082",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42828",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Český LibreOffice tým vydává překlad příručky LibreOffice Impress 7.0. Tato příručka je určena pro začátečníky i pokročilé uživatele aplikace Impress, prezentační komponenty v LibreOffice. S její pomocí můžete vytvářet snímky, které obsahují text, číslované a odrážkové seznamy, tabulky, grafy, videoklipy, kliparty a další objekty. Impress přichází s předdefinovanými textovými styly a předlohami snímků; můžete si také vytvořit vlastní. Příručka je ke stažení na stránce dokumentace. Tým nyní pracuje na překladu příruček Draw a Base.",
          "link": "https://www.root.cz/zpravicky/cesky-preklad-prirucky-libreoffice-impress-7-0/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-18T06:12:43.000Z",
          "wordCount": 753,
          "title": "Český překlad příručky LibreOffice Impress 7.0",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/534/libreoffice-1.jpg",
            "length": "14082",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42827",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "ČTÚ má nový měřič rychlosti připojení k internetu NetTest. Starý NetMetr bude dál fungovat pod CZ.NIC. NetTest nabízí testování jen přes webové rozhraní, NetMetr měl i mobilní aplikace. NetTest je stejně jako NetMetr založen na open-source řešení rakouského telekomunikačního regulátora RTR. Licence NetTestu by měla být Apache 2.0, ale kód zatím zveřejněn nebyl.",
          "link": "https://www.root.cz/zpravicky/ctu-ma-novy-certifikovany-meric-rychlosti/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-17T15:58:20.000Z",
          "wordCount": 2056,
          "title": "ČTÚ má nový certifikovaný měřič rychlosti NetTest",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/430/tachometr-1.jpg",
            "length": "31442",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42826",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Mozilla a Canonical se dohodly, že Firefox bude v příštím vydání Ubuntu 21.10 dostupný jen jako balíček snap a ne jako doposud balíček deb. Výhodou je, že snap bude vytvářet přímo Mozilla a aktualizovaný Firefox bude tedy dostupný hned v den vydání. V současnosti Canonicalu trvá několik dní vyrobit deb balíček. Snap bude dostupný pro architektury amd64, arm64 a armhf.",
          "link": "https://www.root.cz/zpravicky/firefox-bude-v-ubuntu-21-10-jako-snap/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-17T10:50:03.000Z",
          "wordCount": 4472,
          "title": "Firefox bude v Ubuntu 21.10 jako snap",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/203/firefox-se-vzhledem-proton-1.png",
            "length": "134604",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42825",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "AMC Theaters je největším řetězcem kin na světě, má v Evropě 358 kin a v USA 620. Novinka se však týká jen kin v USA. Před měsícem bylo oznámeno, že do konce tohoto roku bude možné online platit lístky a předplatné pomocí Bitcoinu.",
          "link": "https://www.root.cz/zpravicky/v-kinech-amc-bude-mozne-platit-cryptomenami/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-17T06:40:10.000Z",
          "wordCount": 780,
          "title": "V kinech AMC bude možné platit kryptoměnami"
        },
        {
          "id": "www.root.cz-actuality-42824",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "V Londýně včera ve věku 81 let zemřel Sir Clive Sinclair, britský vynálezce a podnikatel. Známý je především jako tvůrce domácích počítačů ZX Spectrum. O jeho odchodu informoval britský deník The Guardian, s odkazem na informace od dcery Belindy. Příčinou jeho smrti byla dlouhodobá nemoc.",
          "link": "https://www.root.cz/zpravicky/zemrel-sir-clive-sinclair-tvurci-zx-spectra-bylo-81-let/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-09-17T06:04:37.000Z",
          "wordCount": 1950,
          "title": "Zemřel Sir Clive Sinclair, tvůrci ZX Spectra bylo 81 let",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/460/zx-spectrum-1.jpg",
            "length": "91866",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "abclinuxu - aktuální články",
      "feedUrl": "http://www.abclinuxu.cz/auto/abc.rss",
      "siteUrl": "http://www.abclinuxu.cz/clanky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-komunikace-ma-zvysovat-produktivitu-vyvojaru",
          "author": "Redakce",
          "description": "Hlavní trendy umělé inteligence: Malá a rozprostřená data. Nový typ kybernetických útoků – zneužívání proxyware platforem. Roboti, kteří udělají přesnou díru do hlavy, zachraňují životy. O vstupu do nebe rozhoduje sv. Petr, pro síť je tu ClearPass. Kouzla zbavené? Nepravděpodobné řešení hrozící personální krize ve finančních službách. Honeywell u nás investuje do R&D. Komunikace má zvyšovat produktivitu vývojářů.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-komunikace-ma-zvysovat-produktivitu-vyvojaru",
          "publishedOn": "2021-09-19T22:01:00.000Z",
          "wordCount": 1779,
          "title": "Týden na ITBiz: Komunikace má zvyšovat produktivitu vývojářů"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-prepinane-zrcadlo-z-roztaveneho-kovu",
          "author": "Redakce",
          "description": "Černá díra vyžrala hvězdu. Nanotechnologie s černým oxidem titaničitým. Život v atmosféře subneptunů. Maličké hory na neutronových hvězdách.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-prepinane-zrcadlo-z-roztaveneho-kovu",
          "publishedOn": "2021-09-18T22:01:00.000Z",
          "wordCount": 1586,
          "title": "Týden na ScienceMag.cz: Přepínané zrcadlo z roztaveného kovu"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-37-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-37-2021",
          "publishedOn": "2021-09-17T22:01:00.000Z",
          "wordCount": 2587,
          "title": "Událo se v týdnu 37/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/goodoffer24-dozivotni-licence-windows-10-pouze-za-12-super-slevy-az-91",
          "author": "Reklama",
          "description": "Pořiďte si doživotní aktivační klíč k Windows 10 za 12,52 EUR na prodejním portálu GoodOffer24.com. Kromě toho nástrojů produktivity od Microsoftu zde lze získat i hry a další software. Nezapomeňte zadat před dokončením nákupu slevový kód  AX30.",
          "link": "http://www.abclinuxu.cz/clanky/goodoffer24-dozivotni-licence-windows-10-pouze-za-12-super-slevy-az-91",
          "publishedOn": "2021-09-17T16:00:00.000Z",
          "wordCount": 1376,
          "title": "GoodOffer24: Doživotní licence Windows 10 pouze za 12 €, super slevy až 91%!"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/distribucni-novinky-34-35-2021",
          "author": "Redakce",
          "description": "Závěr letních prázdnin a začátek školního roku přinesly několik významných vydání, LibreELEC s novým Kodi, příručky Linux From Scratch nebo novou stabilní větev OpenWrt, a také aktualizace Clonezilly, Ubuntu LTS, EndeavourOS či EasyOS.",
          "link": "http://www.abclinuxu.cz/clanky/distribucni-novinky-34-35-2021",
          "publishedOn": "2021-09-13T23:00:00.000Z",
          "wordCount": 1649,
          "title": "Distribuční novinky 34-35/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-sprava-a-analyza-dat-tlaci-podniky-do-cloudu",
          "author": "Redakce",
          "description": "Lenovo představuje hybridní tablety budoucnosti. Canon rozšiřuje nabídku A3 multifunkcí pro hybridní pracovní prostředí. Správa a analýza dat tlačí podniky do cloudu.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-sprava-a-analyza-dat-tlaci-podniky-do-cloudu",
          "publishedOn": "2021-09-12T22:01:00.000Z",
          "wordCount": 1357,
          "title": "Týden na ITBiz: Správa a analýza dat tlačí podniky do cloudu"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-dokazali-prepnout-vodivost-z-2d-na-1d",
          "author": "Redakce",
          "description": "Topologické izolátory. Janusovský grafen a baterie. Zachycen nový typ gravitačních vln. Dvojvrstvý borofen. Hledání mimozemských civilizací. Dysonovy sféry u černých děr. Planeta Devět. Oblečení z umělých svalových vláken.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-dokazali-prepnout-vodivost-z-2d-na-1d",
          "publishedOn": "2021-09-11T22:01:00.000Z",
          "wordCount": 1600,
          "title": "Týden na ScienceMag.cz: Dokázali přepnout vodivost z 2D na 1D"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-36-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-36-2021",
          "publishedOn": "2021-09-10T22:01:00.000Z",
          "wordCount": 2257,
          "title": "Událo se v týdnu 36/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/originalni-dozivotni-aktivacni-klic-windows-10-pro-za-pouhych-12-52-eur-odgoodoffer24.com",
          "author": "Reklama",
          "description": "Získejte doživotní aktivační klíč k Windows 10 za 12,52 EUR na prodejním portálu GoodOffer24.com. Kromě toho zde můžete získat mnohem více, od dalších nástrojů produktivity od Microsoftu, až po hry. Nezapomeňte zadat před dokončením nákupu slevový kód  AX30.",
          "link": "http://www.abclinuxu.cz/clanky/originalni-dozivotni-aktivacni-klic-windows-10-pro-za-pouhych-12-52-eur-odgoodoffer24.com",
          "publishedOn": "2021-09-10T20:30:00.000Z",
          "wordCount": 1388,
          "title": "Originální doživotní aktivační klíč Windows 10 Pro za pouhých 12,52 EUR od Goodoffer24.com"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/jaderne-noviny-prehled-za-srpen-2021",
          "author": "Redakce",
          "description": "Přehled srpnových vydání Jaderných novin: stav vydání jádra, citáty týdne a seznam článků týkajících se jádra.",
          "link": "http://www.abclinuxu.cz/clanky/jaderne-noviny-prehled-za-srpen-2021",
          "publishedOn": "2021-09-06T22:01:00.000Z",
          "wordCount": 2051,
          "title": "Jaderné noviny – přehled za srpen 2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-co-prozradi-mys",
          "author": "Redakce",
          "description": "Grafen vrací do hry pevné disky, hustota dat může vzrůst až 10krát. Hlavní chyby digitální transformace. Kontejnery jsou klíčová technologie při vývoji podnikových aplikací. Co prozradí myš.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-co-prozradi-mys",
          "publishedOn": "2021-09-05T22:01:00.000Z",
          "wordCount": 1335,
          "title": "Týden na ITBiz: Co prozradí myš"
        }
      ]
    },
    {
      "title": "abclinuxu - čerstvé zprávičky",
      "feedUrl": "http://www.abclinuxu.cz/auto/zpravicky.rss",
      "siteUrl": "http://www.abclinuxu.cz/zpravicky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/zpravicky/jupyterlab-app-3.1.12-1",
          "author": "Ladislav Hagara",
          "description": "Po třech letech byl restartován vývoj a vydána nová verze 3.1.12-1 desktopové aplikace JupyterLab App postavené na frameworku Electron. Jedná se o distribuci JupyterLabu v jednom balíku.",
          "link": "http://www.abclinuxu.cz/zpravicky/jupyterlab-app-3.1.12-1",
          "publishedOn": "2021-09-23T01:24:47.000Z",
          "wordCount": 812,
          "title": "JupyterLab App 3.1.12-1"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/gnome-41",
          "author": "Ladislav Hagara",
          "description": "Po půl roce vývoje od vydání verze 40 bylo vydáno GNOME 41 (YouTube). Přehled novinek i s náhledy v poznámkách k vydání a v novinkách pro vývojáře a správce systémů.",
          "link": "http://www.abclinuxu.cz/zpravicky/gnome-41",
          "publishedOn": "2021-09-22T15:47:40.000Z",
          "wordCount": 2004,
          "title": "GNOME 41"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/mobilni-datovka-1.13.0",
          "author": "Ladislav Hagara",
          "description": "Mobilní Datovka, tj. svobodná mobilní aplikace pro přístup k datovým schránkám, byla vydána ve verzi 1.13.0. Existuje-li více možností platby za poštovní datovou zprávu, je nově uživateli při odesílání datové zprávy umožněn výběr způsobu platby.",
          "link": "http://www.abclinuxu.cz/zpravicky/mobilni-datovka-1.13.0",
          "publishedOn": "2021-09-22T13:13:29.000Z",
          "wordCount": 818,
          "title": "Mobilní Datovka 1.13.0"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/canonical-prodlouzil-podporu-ubuntu-14.04-a-16.04-na-10-let",
          "author": "Ladislav Hagara",
          "description": "Canonical prodloužil podporu Ubuntu 14.04 LTS (Trusty Tahr) a 16.04 LTS (Xenial Xerus) na 10 let. Ubuntu 14.04 je tedy podporováno do dubna 2024 a Ubuntu 16.04 do dubna 2026.",
          "link": "http://www.abclinuxu.cz/zpravicky/canonical-prodlouzil-podporu-ubuntu-14.04-a-16.04-na-10-let",
          "publishedOn": "2021-09-22T01:58:03.000Z",
          "wordCount": 1015,
          "title": "Canonical prodloužil podporu Ubuntu 14.04 a 16.04 na 10 let"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/google-chrome-94",
          "author": "Ladislav Hagara",
          "description": "Google Chrome 94 byl prohlášen za stabilní. Nejnovější stabilní verze 94.0.4606.54 přináší řadu oprav a vylepšení (YouTube). Zdůraznit lze WebCodecs a WebGPU. Opraveno bylo 19 bezpečnostních chyb. Vylepšeny byly také nástroje pro vývojáře (YouTube). Nově lze nastavit preferovaný jazyk.",
          "link": "http://www.abclinuxu.cz/zpravicky/google-chrome-94",
          "publishedOn": "2021-09-22T00:29:27.000Z",
          "wordCount": 825,
          "title": "Google Chrome 94"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/ubuntu-touch-ota-19",
          "author": "Ladislav Hagara",
          "description": "UBports, nadace a komunita kolem Ubuntu pro telefony a tablety Ubuntu Touch (seznam podporovaných zařízení), vydala Ubuntu Touch OTA-19. Nejnovější verze je pořád založena na Ubuntu 16.04. Pracuje se na přechodu na Ubuntu 20.04.",
          "link": "http://www.abclinuxu.cz/zpravicky/ubuntu-touch-ota-19",
          "publishedOn": "2021-09-21T23:46:23.000Z",
          "wordCount": 823,
          "title": "Ubuntu Touch OTA-19"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/pash-paralelizace-skriptu-v-posix-shellech",
          "author": "Ladislav Hagara",
          "description": "Konsorcium Linux Foundation oznámilo, že bude hostovat projekt PaSh. Cílem PaSh je automatizovaná paralelizace skriptů v POSIX shellech.",
          "link": "http://www.abclinuxu.cz/zpravicky/pash-paralelizace-skriptu-v-posix-shellech",
          "publishedOn": "2021-09-21T18:49:31.000Z",
          "wordCount": 813,
          "title": "PaSh, paralelizace skriptů v POSIX shellech"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/arcan-jako-navrh-operacniho-systemu",
          "author": "Fluttershy, yay!",
          "description": "Bjorn Stahl v obsáhlém zápisku rozebírá architekturu alternativního grafického frameworku a serveru Arcan z pohledu návrhu operačního systému.",
          "link": "http://www.abclinuxu.cz/zpravicky/arcan-jako-navrh-operacniho-systemu",
          "publishedOn": "2021-09-21T18:15:12.000Z",
          "wordCount": 992,
          "title": "Arcan jako návrh operačního systému"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/gthumb-3.12",
          "author": "Ladislav Hagara",
          "description": "Byla vydána verze 3.12 prohlížeče obrázků gThumb (Wikipedie, GitLab). Z novinek lze zdůraznit například přidání podpory AVIF, HEIF a JPEG XL.",
          "link": "http://www.abclinuxu.cz/zpravicky/gthumb-3.12",
          "publishedOn": "2021-09-21T13:46:05.000Z",
          "wordCount": 803,
          "title": "gThumb 3.12"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/swift-5.5",
          "author": "Ladislav Hagara",
          "description": "Byla vydána nová verze 5.5 programovacího jazyka Swift (Wikipedie). Zdrojové kódy jsou k dispozici na GitHubu. Ke stažení jsou oficiální binární balíčky pro Ubuntu 16.04, Ubuntu 18.04, Ubuntu 20.04, CentOS 7, CentOS 8 a Amazon Linux 2.",
          "link": "http://www.abclinuxu.cz/zpravicky/swift-5.5",
          "publishedOn": "2021-09-21T10:11:14.000Z",
          "wordCount": 822,
          "title": "Swift 5.5"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=systemd-oomd-2021",
          "author": null,
          "description": "Systemd-oomd as the out-of-memory daemon originally developed by Facebook has been maturing nicely since being merged last year and then its most notable deployment to date has been with Fedora 34's debut earlier this year. Anita Zhang of Facebook provided an update today on the systemd-oomd effort...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=systemd-oomd-2021",
          "publishedOn": "2021-09-23T04:00:00.000Z",
          "wordCount": 983,
          "title": "systemd OOMD Maturing Nicely, Adds Support For User Services"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-Deck-FAQ",
          "author": null,
          "description": "Valve today published a \"Steam Deck FAQ\" page sharing some additional information on this forthcoming Arch Linux powered handheld game system that will begin shipping at the end of Q4...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-Deck-FAQ",
          "publishedOn": "2021-09-23T00:18:02.000Z",
          "wordCount": 845,
          "title": "Valve Publishes New Steam Deck FAQ With A Few New Details Shared"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Android-Linux-Upstream-First",
          "author": null,
          "description": "Google's Android had been notorious for all of its downstream patches carried by the mobile operating system as well as various vendor/device kernel trees while in recent years more of that code has been upstreamed. Google has also been shifting to the Android Generic Kernel Image (GKI) as the basis for all their product kernels to further reduce the fragmentation. Looking ahead, Google is now talking of an \"upstream first\" approach for pushing new kernel features...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Android-Linux-Upstream-First",
          "publishedOn": "2021-09-22T18:38:46.000Z",
          "wordCount": 897,
          "title": "Google Finally Shifting To \"Upstream First\" Linux Kernel Approach For Android Features"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-RADV-RT-For-Older-GPUs",
          "author": null,
          "description": "Merged yesterday for Mesa 21.3 was open-source Vulkan ray-tracing for AMD RDNA2 / RX 6000 series GPUs with the RADV driver. Opened today now is a merge request that would provide Vulkan ray-tracing with RADV to pre-RDNA2 GPUs on this driver going back to the likes of Polaris, granted the performance is another story...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-RADV-RT-For-Older-GPUs",
          "publishedOn": "2021-09-22T17:14:25.000Z",
          "wordCount": 927,
          "title": "Mesa Merge Pending For Vulkan Ray-Tracing On Older AMD GPUs"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GNOME-41-Released",
          "author": null,
          "description": "GNOME 41 is out as the latest half-year update to this open-source desktop environment...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GNOME-41-Released",
          "publishedOn": "2021-09-22T15:23:58.000Z",
          "wordCount": 727,
          "title": "GNOME 41 Released With Wayland Improvements, More Performance Tuning"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30535",
          "author": null,
          "description": "Earlier this month AMD posted their initial public patches for the AMD P-State CPU frequency scaling driver that leverages ACPI CPPC for ultimately aiming to provide better power efficiency and more responsive CPU frequency scaling / performance state decisions on Zen 3 (and Zen 2 eventually) processors. This is part of the effort around AMD and Valve collaborating for better Linux efficiency especially with the AMD-powered Steam Deck.",
          "link": "https://www.phoronix.com/vr.php?view=30535",
          "publishedOn": "2021-09-22T13:38:59.000Z",
          "wordCount": 883,
          "title": "An Early Look At The AMD P-State CPPC Driver Performance vs. ACPI CPUFreq"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GCC-Better-OpenACC-Performance",
          "author": null,
          "description": "While the GNU Compiler Collection has supported OpenACC for a few years now as this parallel programming standard popular with GPUs/accelerators, the current implementation has been found to be inadequate for many real-world HPC workloads leveraging OpenACC. Fortunately, Siemens has been working to improve GCC's OpenACC kernels support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GCC-Better-OpenACC-Performance",
          "publishedOn": "2021-09-22T10:40:26.000Z",
          "wordCount": 807,
          "title": "Better Support & Performance For OpenACC Kernels Is Coming To GCC"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Aya-LPC2021-Update",
          "author": null,
          "description": "Aya was presented during this week's Linux Plumbers Conference for improving the eBPF developer experience by allowing Rust programs to easily run within the kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Aya-LPC2021-Update",
          "publishedOn": "2021-09-22T09:57:22.000Z",
          "wordCount": 795,
          "title": "Aya Makes It Easy To Write Rust-Based eBPF Programs For The Linux Kernel"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-Touch-OTA-19",
          "author": null,
          "description": "UBports on Tuesday released Ubuntu Touch OTA-19 as the latest refinement to this Ubuntu Linux spin for smartphones and tablets...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-Touch-OTA-19",
          "publishedOn": "2021-09-22T07:40:00.000Z",
          "wordCount": 835,
          "title": "Ubuntu Touch OTA-19 Released - Still Based On Ubuntu 16.04"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.2.2",
          "author": null,
          "description": "Mesa point releases generally come every two weeks but for the past month have fallen off the wagon. Mesa 21.2.1 came in mid-August and on Tuesday was finally succeeded by Mesa 21.2.2 as a \"late and very large\" update...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.2.2",
          "publishedOn": "2021-09-22T04:00:00.000Z",
          "wordCount": 851,
          "title": "Mesa 21.2.2 Released \"Late & Very Large\""
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=X.Org-Server-21.1-RC1",
          "author": null,
          "description": "More than three years after X.Org Server 1.20 was released, it's set to finally be succeeded soon by X.Org Server 21.1 under its new versioning scheme. Out today is the X.org Server 21.1 release candidate...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=X.Org-Server-21.1-RC1",
          "publishedOn": "2021-09-21T22:55:00.000Z",
          "wordCount": 836,
          "title": "X.Org Server 21.1 RC1 Released With VRR Support For Modesetting Driver, Other Features"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMDGPU-Device-Enumeration-IP",
          "author": null,
          "description": "AMD's open-source Linux graphics driver engineers are working to overhaul how the initial driver loading with device enumeration happens to ultimately make it more robust. In the process though PCI IDs become less important and in turn less of an avenue for exposing possible indicators of new graphics cards...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMDGPU-Device-Enumeration-IP",
          "publishedOn": "2021-09-21T21:00:00.000Z",
          "wordCount": 1118,
          "title": "AMDGPU Linux Driver To Overhaul Its Approach To Device Enumeration"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Blender-3.0-Lands-Cycles-X",
          "author": null,
          "description": "Cycles X as a modernizing of Blender's Cycles rendering engine has now landed in the latest development code for Blender 3.0. Cycles X brings big performance improvements but does eliminate OpenCL support in the process...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Blender-3.0-Lands-Cycles-X",
          "publishedOn": "2021-09-21T19:33:07.000Z",
          "wordCount": 909,
          "title": "Cycles X Merged Into Blender 3.0 With NVIDIA CUDA/OptiX Support, AMD HIP Pending"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Chrome-94-Released",
          "author": null,
          "description": "Chrome 94 is available today as another exciting update for Google's web browser...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Chrome-94-Released",
          "publishedOn": "2021-09-21T18:48:29.000Z",
          "wordCount": 835,
          "title": "Chrome 94 Released With WebGPU For Testing, WebCodecs API Now Official"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GNU-Profiler-gprofng",
          "author": null,
          "description": "Oracle engineers have been working on \"gprofng\" as a next-generation GNU Profiler that can analyze production binaries. Oracle talked up Gprofng today during the GNU Tools Track as part of Linux Plumbers Conference 2021...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GNU-Profiler-gprofng",
          "publishedOn": "2021-09-21T18:21:41.000Z",
          "wordCount": 741,
          "title": "Oracle's Next-Generation GNU Profiler \"gprofng\" Is Looking Great For Developers"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Foundation-PaSh",
          "author": null,
          "description": "The Linux Foundation announced today they will be hosting the PaSh project that is focused on automatically parallelizing POSIX shell scripts...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Foundation-PaSh",
          "publishedOn": "2021-09-21T17:16:59.000Z",
          "wordCount": 765,
          "title": "Linux Foundation To Host PaSh For Automatic Parallelizing Of Shell Scripts"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Samba-4.15",
          "author": null,
          "description": "While there is now KSMBD with Linux 5.15 for offering an in-kernel SMB file server, its scope is much more limited than that of the Samba project in user-space. With that said, Samba 4.15 is out now with its latest batch of features and improvements for open-source SMB/CIFS support on Linux and other platforms...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Samba-4.15",
          "publishedOn": "2021-09-21T12:40:31.000Z",
          "wordCount": 783,
          "title": "Samba 4.15 Released With Improved CLI Experience, Modernized VFS Interface"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-14.04-16.04-Ten-Years",
          "author": null,
          "description": "Canonical is announcing this morning they are extending the Ubuntu 14.04 LTS \"Trusty Tahr\" and Ubuntu 16.04 LTS \"Xenial Xerus\" releases to a ten year lifespan...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-14.04-16.04-Ten-Years",
          "publishedOn": "2021-09-21T12:00:00.000Z",
          "wordCount": 790,
          "title": "Canonical Extending Ubuntu 14.04/16.04 LTS Support To Ten Years"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Vulkan-Video-XDC2021",
          "author": null,
          "description": "Going public back in April was the provisional specification around the Vulkan Video extensions as a new industry-standard video encode/decode interface. While several months have passed, there hasn't been much activity yet in the open-source space around Vulkan Video...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Vulkan-Video-XDC2021",
          "publishedOn": "2021-09-21T10:33:48.000Z",
          "wordCount": 848,
          "title": "Vulkan Video Decoding Still In The Early Stages For Open-Source"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-RADV-Ray-Tracing",
          "author": null,
          "description": "Landing overnight into Mesa 21.3 was experimentally enabling the Vulkan ray-tracing extensions within the open-source Radeon \"RADV\" driver...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-RADV-Ray-Tracing",
          "publishedOn": "2021-09-21T09:25:36.000Z",
          "wordCount": 748,
          "title": "Mesa 21.3 Lands Initial Radeon Ray-Tracing Support In Open-Source RADV Vulkan Driver"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Extending-DWARF-GPUs",
          "author": null,
          "description": "In addition to AMD's increasing Linux kernel contributions, they are also contributing more improvements in user-space too thanks to their super-computing wins and other big enterprise deployments that are Linux-based. One of the areas talked about this week at the Linux Plumbers Conference with the GNU Tools track is how they are working to extend the DWARF debug format to better handle GPU debugging...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Extending-DWARF-GPUs",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 829,
          "title": "AMD Extending DWARF To Better Handle GPU Debugging, Continues Collaborating With GCC & LLVM"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Oktoberfest-2021-Special",
          "author": null,
          "description": "While Oktoberfest was once again cancelled due to the COVID-19 pandemic (then again, due to the state of the ad industry / ad-block users we haven't had any European meet-up / open-source gathering in years), the wiesn would have kicked off this past weekend. So as is tradition, there is the Phoronix Premium Oktoberfest sale where you can join the ad-free service as a reduced rate. If you enjoy the daily, original Linux and open-source content on Phoronix with plenty of benchmarking, you can do so at a reduced rate...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Oktoberfest-2021-Special",
          "publishedOn": "2021-09-21T03:59:36.000Z",
          "wordCount": 1055,
          "title": "Phoronix Ad-Free/Premium Special For Oktoberfest 2021"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-ENQCMD-Restoring-Patches",
          "author": null,
          "description": "While Intel is normally quite good with their new hardware support being in good shape well ahead of launch, their new code for supporting the ENQCMD functionality for the Data Streaming Accelerator (DSA) with Xeon \"Sapphire Rapids\" has been an exception. This summer the mainline Linux kernel disabled ENQCMD support since the code was \"broken beyond repair\" while now Intel engineers have sent out a new series looking to get it re-enabled...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-ENQCMD-Restoring-Patches",
          "publishedOn": "2021-09-20T20:25:44.000Z",
          "wordCount": 863,
          "title": "Intel Posts New Linux Patches Looking To Re-Enable ENQCMD Ahead Of Sapphire Rapids"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=CUPS-2.4-Next-Year-Then-2.5-3.0",
          "author": null,
          "description": "An Open Printing micro-conference took place today during the Linux Plumbers Conference 2021 week. While it's hard to get excited about printers in 2021, it is exciting the renewed effort around CUPS with it now being back to effectively led by the community and CUPS founder Michael Sweet who left Apple. CUPS 2.4 is coming as the first feature release in quite a while and then CUPS 2.5 followed by CUPS 3.0 are already being talked about with features being discussed...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=CUPS-2.4-Next-Year-Then-2.5-3.0",
          "publishedOn": "2021-09-20T19:02:04.000Z",
          "wordCount": 1034,
          "title": "CUPS 2.4 Coming Next Month, CUPS 2.5 + CUPS 3.0 Already In Planning"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=OpenVPN-DCO-Kernel",
          "author": null,
          "description": "OpenVPN has been implementing a kernel module for data channel offload (DCO) capabilities to enhance the performance of this virtual private network system...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=OpenVPN-DCO-Kernel",
          "publishedOn": "2021-09-20T18:31:55.000Z",
          "wordCount": 871,
          "title": "OpenVPN DCO Linux Kernel Module Aims To Offer Faster VPN Performance"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-470.74-Linux",
          "author": null,
          "description": "NVIDIA has released their latest 470 series Linux driver point release...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-470.74-Linux",
          "publishedOn": "2021-09-20T13:47:07.000Z",
          "wordCount": 852,
          "title": "NVIDIA 470.74 Linux Driver Released With Several Fixes"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=DXVK-1.9.2-Released",
          "author": null,
          "description": "DXVK 1.9.2 is out as the newest version of this key library necessary to the success of Valve's Steam Play (Proton) by translating Direct3D 9/10/11 calls to Vulkan for a much more performant Windows gaming experience on Linux...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=DXVK-1.9.2-Released",
          "publishedOn": "2021-09-20T13:36:52.000Z",
          "wordCount": 936,
          "title": "DXVK 1.9.2 Released With More Games In Better Shape"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Rust-Adds-Motorola-M68k",
          "author": null,
          "description": "With the m68k community continuing to be active around supporting the vintage Motorola 68000 series with modern open-source software, Rust has now merged support for these old processors...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Rust-Adds-Motorola-M68k",
          "publishedOn": "2021-09-20T13:02:30.000Z",
          "wordCount": 724,
          "title": "Rust Lands Support For The Motorola 68000 Processors"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-ROCm-CRIU-XDC2021",
          "author": null,
          "description": "Earlier this year AMD went public with prototyping CRIU support for Radeon GPUs around ROCm to be able to checkpoint/freeze running compute workloads and to then restore them at a later point. This CRIU focus is driven by their big accelerator needs and forthcoming supercomputers for migrating workloads particularly within containers. AMD continues working on CRIU support for GPUs and last week provided an update on the project...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-ROCm-CRIU-XDC2021",
          "publishedOn": "2021-09-20T12:21:50.000Z",
          "wordCount": 846,
          "title": "AMD Continues CRIU Work To Checkpoint/Restore ROCm Compute Workloads"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-EC-Driven-Backlights",
          "author": null,
          "description": "NVIDIA is contributing a new open-source driver to the upstream Linux kernel for dealing with upcoming laptops where the backlight controls are handled by the device's embedded controller (EC)...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-EC-Driven-Backlights",
          "publishedOn": "2021-09-20T11:17:47.000Z",
          "wordCount": 776,
          "title": "NVIDIA Prepares The Linux Kernel For Future Laptops With EC-Driven Backlights"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Fedora-35-Great-Features-Coming",
          "author": null,
          "description": "Fedora Workstation 35 will hopefully be out at the end of October (currently the beta is running behind schedule) and when it does ship it's once again at the bleeding-edge of Linux features. Fedora Workstation 35 is shaping up to be another great release for those interested in a feature-rich desktop experience...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Fedora-35-Great-Features-Coming",
          "publishedOn": "2021-09-20T10:00:59.000Z",
          "wordCount": 1053,
          "title": "Red Hat's Upstream Contributions Are Making For A Great Fedora Workstation 35"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30531",
          "author": null,
          "description": "As usual when the Linux 5.15 merge window began wrapping up, I set out to dive into its performance to see what is in store for this next version of the kernel and whether there was any regressions or other performance changes worth noting. Linux 5.15 overall has been in good shape for the \"-rc1\" state except noticing that code compilation workloads were taking longer on multiple Linux 5.15-rc1-running systems than Linux 5.14 or prior. Seeing it across multiple systems and a very real-world regression, it was worth bisecting and looking closer so here are the details.",
          "link": "https://www.phoronix.com/vr.php?view=30531",
          "publishedOn": "2021-09-16T11:00:00.000Z",
          "wordCount": 980,
          "title": "Running Linux 5.15-rc1 Causing A New Slowdown... Here's A Look"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/rss.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2519/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2519/",
          "publishedOn": "2021-09-22T04:00:00.000Z",
          "wordCount": 185,
          "title": "Sloped Border"
        },
        {
          "id": "https://xkcd.com/2518/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2518/",
          "publishedOn": "2021-09-20T04:00:00.000Z",
          "wordCount": 187,
          "title": "Lumpers and Splitters"
        },
        {
          "id": "https://xkcd.com/2517/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2517/",
          "publishedOn": "2021-09-17T04:00:00.000Z",
          "wordCount": 185,
          "title": "Rover Replies"
        },
        {
          "id": "https://xkcd.com/2516/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2516/",
          "publishedOn": "2021-09-15T04:00:00.000Z",
          "wordCount": 185,
          "title": "Hubble Tension"
        }
      ]
    }
  ],
  "cliVersion": "1.11.1"
}