{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": [
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.3",
          "author": null,
          "description": "Fixed: broken links in documentation\nChore: Dependency updates\nThank you: @hirdot",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.3",
          "publishedOn": "2021-10-16T00:01:47.000Z",
          "wordCount": 299,
          "title": "v1.11.3"
        },
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.2",
          "author": null,
          "description": "Fixed: unicode characters in URL caused download error\nFixed: project root npm install error\nAdded: unit test library\nChore: Dependency updates\nThank you: @CaptNo1",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.2",
          "publishedOn": "2021-09-26T18:45:39.000Z",
          "wordCount": 350,
          "title": "v1.11.2"
        }
      ]
    },
    {
      "title": "Kotaku",
      "feedUrl": "https://kotaku.com/rss",
      "siteUrl": "https://kotaku.com",
      "articles": [
        {
          "id": "1847907622",
          "author": "Ari Notis",
          "description": "One day after leaked footage from the Uncharted movie made the rounds, Sony officially dropped the trailer for the film. I can’t believe I’m saying this—especially given the, uh, history of films based on video games—but it actually looks pretty sick. Check it out:\n\nRead more...",
          "link": "https://kotaku.com/first-uncharted-movie-trailer-offers-a-great-look-at-to-1847907622",
          "publishedOn": "2021-10-21T13:45:00.000Z",
          "wordCount": 514,
          "title": "First Uncharted Movie Trailer Offers A Great Look At Tom Holland As Nathan Drake"
        },
        {
          "id": "1847856217",
          "author": "Adam Ismail",
          "description": "We’re less than a month away from Forza Horizon 5, and I for one am very much looking forward to putting away the chilly, cozy waning weeks of the year by sinking myself into another titanic automotive expedition. In the meantime, I was lucky enough to get a taste of the game, as Microsoft allowed Jalopnik to download…\nRead more...",
          "link": "https://kotaku.com/the-first-90-minutes-of-forza-horizon-5s-campaign-1847856217",
          "publishedOn": "2021-10-21T13:25:00.000Z",
          "wordCount": 1803,
          "title": "The First 90 Minutes Of Forza Horizon 5's Campaign"
        },
        {
          "id": "1847906871",
          "author": "Brian Ashcraft",
          "description": "As announced earlier this month, Sora became Super Smash Bros. Ultimate’s final DLC character. But how did Sora, Keyblade and all, end up in Smash Bros.? In his latest Weekly Famitsu column, creator Masahiro Sakurai explains just that. \n\nRead more...",
          "link": "https://kotaku.com/masahiro-sakurai-explains-how-sora-came-to-super-smash-1847906871",
          "publishedOn": "2021-10-21T10:30:00.000Z",
          "wordCount": 603,
          "title": "Masahiro Sakurai Explains How Sora Came To Super Smash Bros. Ultimate"
        },
        {
          "id": "1847905559",
          "author": "Luke Plunkett",
          "description": "RPCS3, an emulator I’ve been writing about since 2016, but which first began in 2011, has come along way since it made its first tentative steps towards making PS3 games playable on a PC. From those humble beginnings, the team behind it have just announced a huge milestone: everything ever released on the PS3 will now…\nRead more...",
          "link": "https://kotaku.com/ps3-emulator-will-now-boot-every-game-ever-released-on-1847905559",
          "publishedOn": "2021-10-21T01:15:00.000Z",
          "wordCount": 453,
          "title": "PS3 Emulator Will Now Boot Every Game Ever Released On The Console"
        },
        {
          "id": "1847905022",
          "author": "Luke Plunkett",
          "description": "The upcoming VR version of Resident Evil 4, which by my unofficial count is the 119th re-release of Capcom’s classic, is also apparently going to be  unique. At least one of the companies involved in its release, made up of Facebook, Capcom and Armature, has decided to remove some of its more suggestive content.\n\nRead more...",
          "link": "https://kotaku.com/resident-evil-4-vr-cuts-upskirts-suggestive-dialogue-1847905022",
          "publishedOn": "2021-10-20T23:30:00.000Z",
          "wordCount": 477,
          "title": "Resident Evil 4 VR Cuts Upskirts, Suggestive Dialogue"
        },
        {
          "id": "1847904404",
          "author": "Luke Plunkett",
          "description": "A World of Warcraft character named Gorge the Corpsegrinder, named after Cannibal Corpse frontman George ‘Corpsegrinder’ Fisher, has had its name changed. This is part of Blizzard’s continuing combing through the archives and finding references in the game that, in 2021, maybe aren’t as cool as they used to be.\n\nRead more...",
          "link": "https://kotaku.com/wow-character-renamed-after-2007-cocksucker-video-resur-1847904404",
          "publishedOn": "2021-10-20T22:30:00.000Z",
          "wordCount": 588,
          "title": "WoW Character Renamed After 2007 'C**ks*cker' Video Resurfaces"
        },
        {
          "id": "1847904272",
          "author": "Isaiah Colbert",
          "description": "The economy of Amazon’s new massively multiplayer online role-playing game New World is experiencing some growing pains. To be more specific, the currency on which the economy is based is in the midst of a deflation crisis, causing players to barter for items rather than spend their hard-earned coin.\nRead more...",
          "link": "https://kotaku.com/new-worlds-economy-is-so-busted-players-are-bartering-1847904272",
          "publishedOn": "2021-10-20T21:45:00.000Z",
          "wordCount": 531,
          "title": "New World's Economy Is So Busted, Players Are Bartering For Items"
        },
        {
          "id": "1847903620",
          "author": "Jeremy Winslow",
          "description": "Sora joined Super Smash Bros. Ultimate on October 18, becoming the 89th (and, at long last, final) playable character on the roster, and wrapping up a two-year process of expanding the game’s pool of fighters. Though in a sense he is just another sword-wielding anime boy, I think I actually stand corrected. Sora in …\nRead more...",
          "link": "https://kotaku.com/i-was-wrong-sora-in-smash-bros-is-kinda-cool-to-play-1847903620",
          "publishedOn": "2021-10-20T21:00:00.000Z",
          "wordCount": 800,
          "title": "I Was Wrong, Sora In Smash Bros. Is Kinda Cool To Play"
        },
        {
          "id": "1847902976",
          "author": "Sisi Jiang",
          "description": "In 2020, Sony filed a patent for allowing livestream spectators and participants to remove players from a game. Yesterday, the United States Patent and Trademark Office approved the patent, which you can read in full here. Besides removing unskilled players, the system would allow spectators to pay for the privilege…\nRead more...",
          "link": "https://kotaku.com/sony-patent-lets-viewers-vote-and-pay-to-boot-players-f-1847902976",
          "publishedOn": "2021-10-20T20:45:00.000Z",
          "wordCount": 676,
          "title": "Sony Patent Lets Viewers Vote And Pay To Boot Players From Games"
        },
        {
          "id": "1847902890",
          "author": "Zack Zwiezen",
          "description": "Celebrated filmmaker Jim Jarmusch once said, “Originality is non-existent. And don’t bother concealing your thievery—celebrate it if you feel like it.” Back 4 Blood, a new zombie-themed co-op shooter developed by Turtle Rock Studios, sure puts this principle into practice. Even its name is a direct callback to the…\nRead more...",
          "link": "https://kotaku.com/back-4-blood-the-kotaku-review-1847902890",
          "publishedOn": "2021-10-20T20:30:00.000Z",
          "wordCount": 2312,
          "title": "Back 4 Blood: The Kotaku Review"
        },
        {
          "id": "1847903337",
          "author": "Mike Fahey",
          "description": "Building a gaming PC for the first time can feel like an incredibly daunting task. Between gathering the required parts, making sure they all work together, fiddling with delicate wires, and trying not to destroy expensive components, the entire process is anxiety-inducing. Hardware maker NZXT now offers what I…\nRead more...",
          "link": "https://kotaku.com/new-kit-makes-building-a-gaming-pc-as-easy-as-putting-t-1847903337",
          "publishedOn": "2021-10-20T20:10:00.000Z",
          "wordCount": 579,
          "title": "New Kit Makes Building A Gaming PC As Easy As Putting Together A Model"
        },
        {
          "id": "1847903035",
          "author": "Renata Price",
          "description": "Today, Netflix’s trans employees and allies are walking out after the company released, and heavily promoted, yet another transphobic Dave Chappelle special. This walkout is also accompanied by a list of demands from Netflix employees who are deeply unsatisfied with the current state of the company. These demands…\nRead more...",
          "link": "https://kotaku.com/netflix-s-trans-folk-and-supporters-walked-out-today-s-1847903035",
          "publishedOn": "2021-10-20T19:45:00.000Z",
          "wordCount": 517,
          "title": "Netflix’s Trans Folk And Supporters Walked Out Today, So Stream Something Else Instead"
        },
        {
          "id": "1847901589",
          "author": "Ari Notis",
          "description": "Nothing’s free in this world. So why would anything, let alone public transit, be free in an idyllic video game world designed for escapism? When Animal Crossing: New Horizons soon gets the option to ride a ferry, those rides won’t be free.\n\nRead more...",
          "link": "https://kotaku.com/animal-crossing-new-horizons-fans-are-already-saving-u-1847901589",
          "publishedOn": "2021-10-20T17:40:00.000Z",
          "wordCount": 938,
          "title": "Animal Crossing: New Horizons Fans Are Already Saving Up For Kapp'n's Pricey Fares"
        },
        {
          "id": "1847901641",
          "author": "Ari Notis",
          "description": "Nope, you’re not getting (cyber)punk’d. CD Projekt Red has delayed the anticipated next-gen updates for its two massive role-playing games, Cyberpunk 2077 and The Witcher 3: Wild Hunt.\nRead more...",
          "link": "https://kotaku.com/cdpr-delays-next-gen-upgrades-for-cyberpunk-witcher-3-1847901641",
          "publishedOn": "2021-10-20T17:15:00.000Z",
          "wordCount": 650,
          "title": "CDPR Delays Next-Gen Upgrades For Cyberpunk, Witcher 3"
        },
        {
          "id": "1847900687",
          "author": "Mike Fahey",
          "description": "Switch owners like their game icons a certain way. They want bright colors and sharp-looking art. They’d also prefer the game’s logo be present in some way, shape, or form. What many of them don’t seem to like is slightly blurry, eyeless terror rabbits. I can’t see the problem. Neither can the rabbit, technically.\n\nRead more...",
          "link": "https://kotaku.com/please-don-t-ever-change-this-nightmare-inducing-switch-1847900687",
          "publishedOn": "2021-10-20T16:00:00.000Z",
          "wordCount": 596,
          "title": "Please Don’t Ever Change This Nightmare-Inducing Switch Icon"
        },
        {
          "id": "1847900599",
          "author": "Sisi Jiang",
          "description": "As if space exploration wasn’t already inherently a little spooky, No Man’s Sky is adding a Halloween update to the game today. “Emergence” is a story-driven campaign where players will have to fight mutant sand worms and uncover the secrets of a dark cult. This story event accompanies various quality-of-life updates. \nRead more...",
          "link": "https://kotaku.com/no-mans-sky-free-halloween-update-adds-giant-spooky-san-1847900599",
          "publishedOn": "2021-10-20T15:45:00.000Z",
          "wordCount": 424,
          "title": "No Man's Sky Free Halloween Update Adds Giant Spooky Sandworms"
        },
        {
          "id": "1847900565",
          "author": "Ethan Gach",
          "description": "God of War will be the latest PlayStation exclusive to come to PC. A new  listing for the 2018 action game revealed it will come to Steam and the Epic Games Store next year on January 14, 2022.\n\nRead more...",
          "link": "https://kotaku.com/sony-continues-bringing-playstation-exclusives-to-pc-wi-1847900565",
          "publishedOn": "2021-10-20T15:35:00.000Z",
          "wordCount": 531,
          "title": "God of War Comes To PC Next Year As Sony Continues Porting Exclusives"
        },
        {
          "id": "1847899812",
          "author": "Ethan Gach",
          "description": "Destiny 2 will get a lot of new content when The Witch Queen launches in February. Unfortunately, some of it will only be accessible to players who pony up for the Deluxe Edition of the annual expansion. It’s the latest development in the messy evolution of how Bungie monetizes Destiny, and a lot of players are upset…\nRead more...",
          "link": "https://kotaku.com/destiny-2-nickle-and-diming-for-new-dungeons-is-a-bumme-1847899812",
          "publishedOn": "2021-10-20T15:15:00.000Z",
          "wordCount": 1447,
          "title": "Destiny 2 Nickle-And-Diming For New Dungeons Is A Bummer"
        },
        {
          "id": "1847896530",
          "author": "Isaiah Colbert",
          "description": "Speedrun, a website where leaderboards crown the fastest players for any given game, recently added a commenting feature which hasn’t been going well for anyone. Since its implementation, users have been spammed with vulgar comments and inappropriate images. Worse, those plagued by this problem can’t moderate the…\nRead more...",
          "link": "https://kotaku.com/speedrunners-protest-leave-biggest-leaderboard-site-as-1847896530",
          "publishedOn": "2021-10-20T15:00:00.000Z",
          "wordCount": 1086,
          "title": "Speedrunners Protest, Leave Biggest Leaderboard Site As It Gets Flooded With Abusive Comments"
        },
        {
          "id": "1847900075",
          "author": "Jeremy Winslow",
          "description": "Have you ever flexed so hard in a game you made it crash? That’s apparently a dream coming true for Apex Legends players, where performing Epic animated poses is breaking the game. Respawn is asking players of the battle royale shooter to stop using them.\nRead more...",
          "link": "https://kotaku.com/posing-in-apex-legends-crashes-the-game-so-stop-it-alr-1847900075",
          "publishedOn": "2021-10-20T14:45:00.000Z",
          "wordCount": 431,
          "title": "Posing In Apex Legends Is Crashing The Game"
        },
        {
          "id": "1847899240",
          "author": "Mike Fahey",
          "description": "Last month Sony finally upgraded the PlayStation 5 firmware with support for additional storage via NVMe M.2 solid-state drives (that is, the latest, fast models of SSDs). While not quite as simple as popping open the lid and slotting a chip, with the right hardware and a single small Phillips head screwdriver, the…\nRead more...",
          "link": "https://kotaku.com/hands-on-the-ps5-s-storage-upgrade-is-quick-and-easy-1847899240",
          "publishedOn": "2021-10-20T13:30:00.000Z",
          "wordCount": 1257,
          "title": "Hands On: The PS5’s Storage Upgrade Is Quick And Easy"
        },
        {
          "id": "1847898969",
          "author": "Brian Ashcraft",
          "description": "Chris Ayres, perhaps best known as Frieza’s English language voice actor, has passed away. Besides the iconic Dragon Ball character, Ayres also voiced Kei Kurono in Gantz, and Shingen Takeda in Sengoku Basara. He was 56 years old. \n\nRead more...",
          "link": "https://kotaku.com/dragon-ball-voice-actor-chris-ayres-dies-age-56-1847898969",
          "publishedOn": "2021-10-20T12:45:00.000Z",
          "wordCount": 438,
          "title": "Dragon Ball Voice Actor Chris Ayres Dies Age 56"
        },
        {
          "id": "1847898756",
          "author": "Brian Ashcraft",
          "description": "In Japan, tipping is basically not a thing. There are a few occasions where one does tip, such as at a ryokan, or a traditional Japanese inn. But generally, good service is expected minus tips. So if you go to a restaurant, the price on your bill is what you pay. One Japanese company is trying to change that. \n“If you…\nRead more...",
          "link": "https://kotaku.com/tipping-in-japan-one-company-aims-to-spread-it-through-1847898756",
          "publishedOn": "2021-10-20T10:00:00.000Z",
          "wordCount": 839,
          "title": "Tipping In Japan? One Company Aims To Spread It Throughout The Country"
        },
        {
          "id": "1847897412",
          "author": "Luke Plunkett",
          "description": "As people finally settle in with Ubisoft’s latest Far Cry game, now’s the perfect time to look at some of the designs and models that went into Far Cry 6's development.\nRead more...",
          "link": "https://kotaku.com/the-art-of-far-cry-6-1847897412",
          "publishedOn": "2021-10-20T01:20:00.000Z",
          "wordCount": 277,
          "title": "The Art Of Far Cry 6"
        },
        {
          "id": "1847896535",
          "author": "Luke Plunkett",
          "description": "Lego Ideas, the platform where fans can design Lego sets, then see them licensed and sold in stores, has given us some fantastic builds over the years. Sadly, this big Hyrule Castle set won’t be one of them.\n\nRead more...",
          "link": "https://kotaku.com/lego-says-no-to-amazing-hyrule-castle-playset-1847896535",
          "publishedOn": "2021-10-20T00:15:00.000Z",
          "wordCount": 519,
          "title": "Lego Says No To Amazing Hyrule Castle Playset"
        }
      ]
    },
    {
      "title": "Nintendo Life | Latest Updates",
      "feedUrl": "https://www.nintendolife.com/feeds/latest",
      "siteUrl": "https://www.nintendolife.com/feeds/latest",
      "articles": [
        {
          "id": "https://www.nintendolife.com/#article-122609",
          "author": null,
          "description": "We'll never view island life the same way again.\nIf you're anything like us, you'll know that there aren't many things in life as sweet and wholesome as an island full of happy Animal Crossing villagers. Nothing brings us more joy than seeing our favourite villagers doing some yoga on the beach or singing along to their favourite tune, and we wouldn't let even the biggest, boldest baddie hurt a single hair on their furry little heads.\nBut what if we're the baddies? Plenty of us have come to the realisation that the human race probably does way more harm than good for this planet, and now we have to contend with the possibility that the very same thing is happening on our New Horizons islands. Without wanting to spoil too much more, check out this fantastic animated short from Densle:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/random-these-incredible-animal-crossing-animated-shorts-are-essential-viewing",
          "publishedOn": "2021-10-21T14:00:00.000Z",
          "wordCount": 860,
          "title": "Random: These Incredible Animal Crossing Animated Shorts Are Essential Viewing"
        },
        {
          "id": "https://www.nintendolife.com/#article-85135",
          "author": null,
          "description": "Raiden IV x MIKADO remix! Peppa Pig! Caligula Effect 2.\nThe latest Nintendo Download update for Europe has arrived, and it's bringing new games galore to the eShop in your region. As always, be sure to drop a vote in our poll and comment down below with your potential picks for the week. Enjoy!\nSwitch Retail eShop - New Releases\nAngry Alligator (Orange One, 19th Oct, £26.99 / €29.99) - Come on down to the swamp and go on an adventure like no other! Start as a small baby gator and grow into the biggest, baddest reptile around. Eat everything that moves, and more, so you can grow big and strong to face all challenges ahead. The fate of the swamp and all that reside within, lies on your scaled shoulders! Horrible hoomans have taken over and only you can scare them away! But never fear! You won’t be alone. Listen to the words of Wisecroc - the wisest croc in town - as he guides you along the squishy and swampy path to gator greatness.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/nintendo-download-21st-october-europe",
          "publishedOn": "2021-10-21T13:45:00.000Z",
          "wordCount": 3809,
          "title": "Nintendo Download: 21st October (Europe)"
        },
        {
          "id": "https://www.nintendolife.com/#article-117555",
          "author": null,
          "description": "Marvel's Guardians of the Galaxy (Cloud)! Skul: The Hero Slayer! Peppa Pig!\nThe latest Nintendo Download update for North America has arrived, and it's bringing new games galore to the eShop in your region. As always, be sure to drop a vote in our poll and comment down below with your potential picks for the week. Enjoy!\nSwitch eShop - Highlights\nMarvel’s Guardians of the Galaxy: Cloud Version (26th Oct, $0.00 initial trial) - Fire up Star-Lord’s jet boots for a wild ride across the cosmos in this third-person action-adventure game, a fresh take on Marvel’s Guardians of the Galaxy. With the unpredictable Guardians at your side, blast your way from one explosive situation to another, with original and iconic Marvel characters caught in a struggle for the fate of the universe. You got this. Probably. Marvel’s Guardians of the Galaxy: Cloud Version will be available on Oct. 26.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/nintendo-download-21st-october-north-america",
          "publishedOn": "2021-10-21T13:20:00.000Z",
          "wordCount": 5948,
          "title": "Nintendo Download: 21st October (North America)"
        },
        {
          "id": "https://www.nintendolife.com/#article-122495",
          "author": null,
          "description": "Update: Here's a better look.\nUpdate: After all of yesterday's confusion, The Pokémon Company has now shared a second look at the mysterious footage, but this time it's much clearer.\nAs you can see towards the end of the video, we get a clear look at Hisuian versions of both Zorua and Zoroark. And they look fantastic.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/hisuian-zorua-and-zoroark-revealed-in-mysterious-pokemon-legends-arceus-video",
          "publishedOn": "2021-10-21T13:10:00.000Z",
          "wordCount": 4072,
          "title": "Hisuian Zorua And Zoroark Revealed In Mysterious Pokémon Legends: Arceus Video"
        },
        {
          "id": "https://www.nintendolife.com/#article-122602",
          "author": null,
          "description": "Confirmation carefully emphasizes 'digital' for now.\nIt was back in August that Square Enix and the development team confirmed that Life Is Strange: True Colors was running \"a little late\" on Switch, but was still targeting a 2021 arrival. It's since arrived on other platforms and has been rather well received; you certainly don't need to look far on streaming platforms to still find plenty of people watching and playing the game.\nThe good news is that the wait on Switch is drawing to a close, for the eShop version at least. An update has confirmed that it's due in 'early December', with a date to be confirmed when everything's finalised and digital pre-orders are live.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/life-is-strange-true-colors-is-set-for-a-december-eshop-release",
          "publishedOn": "2021-10-21T12:45:00.000Z",
          "wordCount": 1178,
          "title": "Life Is Strange: True Colors Is Set For A December eShop Release"
        },
        {
          "id": "https://www.nintendolife.com/#article-122593",
          "author": null,
          "description": "Launching on the eShop in 2022.\nMore Metroidvania fun awaits on Nintendo Switch next year as Souldiers, from publisher Dear Villagers and developer Retro Forge, hits the eShop in spring 2022.\nBrought to life through an attractive, pixellated world, Souldiers has you fighting for your freedom in \"a sprawling fantasy world caught between the living and the fallen\". You'll be getting stuck into all of the genre's usual traits like puzzle-platforming, exploration and \"Souls-like\" combat, and there's an intriguing story to go with it:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/pixel-art-metroidvania-souldiers-brings-puzzles-platforming-and-combat-to-switch",
          "publishedOn": "2021-10-21T11:00:00.000Z",
          "wordCount": 1312,
          "title": "Pixel Art Metroidvania 'Souldiers' Brings Puzzles, Platforming And Combat To Switch"
        },
        {
          "id": "https://www.nintendolife.com/#article-122589",
          "author": null,
          "description": "Title Update #5 is now live.\nCapcom has released the latest patch for Monster Hunter Stories 2 today, adding new monsters and quests while also fixing some pesky bugs.\nThe update brings the game to Version 1.5.0 and Capcom has kindly shared the full patch notes. You can check these out for yourself below – note that some content goes live today, while some goes live in a week's time.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/monster-hunter-stories-2-update-adds-new-monsters-and-quests-here-are-the-full-patch-notes",
          "publishedOn": "2021-10-21T10:30:00.000Z",
          "wordCount": 956,
          "title": "Monster Hunter Stories 2 Update Adds New Monsters And Quests - Here Are The Full Patch Notes"
        },
        {
          "id": "https://www.nintendolife.com/#article-122588",
          "author": null,
          "description": "And it kicks off tomorrow.\nHaving to come up with new and interesting themes for Super Smash Bros. Ultimate's regular events must be getting difficult at this stage, so we'll have to forgive Nintendo for this latest effort.\nYes, Smash Ultimate's next Spirit Event focuses on \"characters with at least one fist raised\", which will then be followed by 'characters that use eyeballs to see' and 'characters who are beginning to regret their life choices'. OK, those might not be real...\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/super-smash-bros-ultimates-next-event-is-all-about-fists",
          "publishedOn": "2021-10-21T10:00:00.000Z",
          "wordCount": 987,
          "title": "Super Smash Bros. Ultimate's Next Event Is All About... Fists?"
        },
        {
          "id": "https://www.nintendolife.com/#article-122587",
          "author": null,
          "description": "Or say nothing at all...\nEver wished you could spend your entire shift simply saying \"no\", allowing your true pessimistic self to shine through without being told off for it? Well, Negative Nancy could be the ideal game for you.\nAvailable right now in Europe (currently enjoying a 15% discount and priced at £9.68) and coming to the Switch eShop on Saturday 23rd October in North America, Negative Nancy is a choose-your-own-adventure narrative-based game with a twist: you can only say \"no\".\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/negative-nancy-is-a-choose-your-own-adventure-game-where-you-can-only-say-no",
          "publishedOn": "2021-10-21T09:30:00.000Z",
          "wordCount": 1169,
          "title": "Negative Nancy Is A Choose-Your-Own-Adventure Game Where You Can Only Say 'No'"
        },
        {
          "id": "https://www.nintendolife.com/#article-122586",
          "author": null,
          "description": "And a free 'Safety' difficulty for those that need it.\nShin Megami Tensei V is just a few weeks from release on 12th November, and Atlus has confirmed a significant batch of day one DLC to lure in excited newcomers or eager series fans. So far the only official trailers and footage are in Japanese, but you can get a look at it above.\nThough the European eShop doesn't have localised information yet, the Digital Deluxe Edition (which includes all the DLC and the main game) has popped up on the North American store. Each DLC can also be bought individually - three 'Mitama' options are designed to help with progress, while four other DLC add-ons provide subquests that will also allow you to recruit special characters.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/shin-megami-tensei-v-gets-day-one-paid-dlc-and-digital-deluxe-edition",
          "publishedOn": "2021-10-21T09:00:00.000Z",
          "wordCount": 2501,
          "title": "Shin Megami Tensei V Gets Day One Paid DLC And Digital Deluxe Edition"
        },
        {
          "id": "https://www.nintendolife.com/#article-122583",
          "author": null,
          "description": "Mappy is back.\n\nIn recent times, Hamster has been releasing Bandai Namco games for its Arcade Archives collection on the Nintendo Switch. This week, the trend continues with the release of the 1983 action title, Mappy.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/hamster-adds-another-namco-classic-to-arcade-archives-on-nintendo-switch",
          "publishedOn": "2021-10-21T03:30:00.000Z",
          "wordCount": 1484,
          "title": "Hamster Adds Another Namco Classic To Arcade Archives On Nintendo Switch"
        },
        {
          "id": "https://www.nintendolife.com/#article-122582",
          "author": null,
          "description": "And the rest is history.\nAfter ongoing requests, Sora from Kingdom Hearts joined Super Smash Bros. Ultimate earlier this week as the final DLC fighter.\nFor a lot of fans, it still seems too good to be true, so how exactly did it happen? In Sakurai's latest column (translated by @PushDustIn and @KodyNOKOLO), the Smash director goes into details about how it all played out. While it was clear Sora was a fan favourite after the Fighter Ballot results, Sakurai himself still thought it would be highly unlikely.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/sakurai-reveals-how-a-chance-encounter-led-to-sora-in-smash-bros-ultimate",
          "publishedOn": "2021-10-21T02:30:00.000Z",
          "wordCount": 3434,
          "title": "Sakurai Reveals How A Chance Encounter Led To Sora In Smash Bros. Ultimate"
        },
        {
          "id": "https://www.nintendolife.com/#article-122581",
          "author": null,
          "description": "The crash error has been resolved.\nLast week, Nintendo issued a notice on its support website stating how it had been made aware of an error \"near the end\" of Metroid Dread that forced the software and game to close.\nIt said it was working on a fix to prevent this from happening, and it's now officially arrived. This minor patch bumps the game up to Version 1.0.1. Several other issues have also been fixed to improve the experience, but Nintendo doesn't go into further detail.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/nintendos-first-patch-for-metroid-dread-is-now-available-heres-whats-included",
          "publishedOn": "2021-10-21T01:30:00.000Z",
          "wordCount": 2261,
          "title": "Nintendo's First Patch For Metroid Dread Is Now Available, Here's What's Included"
        },
        {
          "id": "https://www.nintendolife.com/#article-122580",
          "author": null,
          "description": "Make it happen, Nintendo.\nThe legendary game designer Suda51 - who has just wrapped up work on No More Heroes 3 for the Switch - has once again admitted how cool it would be to collaborate with a company like Nintendo and \"reboot or remake\" some of its older IP.\nHere's exactly what he had to say during an interview with our friends over at VGC:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/suda51-says-it-would-be-really-cool-to-reboot-or-remake-nintendos-older-ip",
          "publishedOn": "2021-10-21T00:55:00.000Z",
          "wordCount": 2728,
          "title": "Suda51 Says It Would Be \"Really Cool\" To Reboot Or Remake Nintendo's Older IP"
        },
        {
          "id": "https://www.nintendolife.com/#article-122578",
          "author": null,
          "description": "Bug fixes, balancing and a Halloween update.\nAlongside the new update introducing Greedant and some Halloween content, the latest update for the Nintendo Switch and mobile MOBA Pokémon Unite also includes a lot of balancing.\nAs usual, some Pokémon have been nerfed, while others have received stat increases. This latest update bumps the game build-up to Version 1.2.1.8 and also includes bug and text fixes, event and shop updates, and more.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/pokemon-unite-has-been-updated-here-are-the-full-patch-notes",
          "publishedOn": "2021-10-20T23:45:00.000Z",
          "wordCount": 1714,
          "title": "Pokémon Unite Has Been Updated, Here Are The Full Patch Notes"
        },
        {
          "id": "https://www.nintendolife.com/#article-122330",
          "author": null,
          "description": "Games at their very best on Switch OLED.\nEarlier this month Nintendo released its first major Switch iteration in over two years with the Switch OLED model. It has a few benefits, like an improved kickstand, a bump in portable audio quality, double the internal storage and a LAN connector on the dock, but the main feature is in the name. Yep, it's the larger OLED screen, the first panel of its type we've seen in Nintendo portable hardware, although it's also made a lot of people reminisce about the original PS Vita model, too.\n\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/guides/25-games-that-are-better-on-switch-oled",
          "publishedOn": "2021-10-20T17:00:00.000Z",
          "wordCount": 4584,
          "title": "Guide: 25 Games That Are Better On Switch OLED"
        },
        {
          "id": "https://www.nintendolife.com/#article-122563",
          "author": null,
          "description": "A pacifist Metroidvania platformer.\nAs was promised towards the end of last month, Sheepo has launched on the Nintendo Switch eShop today.\nIf you missed that initial announcement, Sheepo offers up an alternative take on the Metroidvania genre by sacrificing combat and instead focusing on exploration and creature preservation. You play as the titular Sheepo, a shapeshifting sheep-alien (as you do), who must explore the uncharted planet Cebron and collect samples of its living species.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/out-now-new-metroidvania-sheepo-ditches-combat-for-cutesy-creature-collecting",
          "publishedOn": "2021-10-20T16:00:00.000Z",
          "wordCount": 1043,
          "title": "Out Now: New Metroidvania 'Sheepo' Ditches Combat For Cutesy Creature Collecting"
        },
        {
          "id": "https://www.nintendolife.com/#article-122554",
          "author": null,
          "description": "It's what you do with it that counts.\n\nThere was a time when we wished every video game were never-ending.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/features/talking-point-how-many-hours-is-a-short-game-for-you",
          "publishedOn": "2021-10-20T15:00:00.000Z",
          "wordCount": 15813,
          "title": "Talking Point: How Many Hours Is A 'Short' Game For You?"
        },
        {
          "id": "https://www.nintendolife.com/#article-122558",
          "author": null,
          "description": "Voting now open!\nThe full list of nominees for The Golden Joystick Awards 2021 has been revealed, and the voting is now open.\nA decent number of Nintendo games are up for a variety of awards, including The Legend of Zelda: Breath of the Wild 2 and Pokémon Legends: Arceus in the 'Most Wanted' category and, perhaps most notably, Metroid Dread in the 'Ultimate Game of the Year' category.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/metroid-dread-zelda-pokemon-and-mario-all-nominated-in-golden-joystick-awards-2021",
          "publishedOn": "2021-10-20T14:30:00.000Z",
          "wordCount": 3229,
          "title": "Metroid Dread, Zelda, Pokémon And Mario All Nominated In Golden Joystick Awards 2021"
        },
        {
          "id": "https://www.nintendolife.com/#article-121468",
          "author": null,
          "description": "Update: It's out today!\nUpdate: As promised, Horizon Chase Turbo's 'Senna Forever' expansion is now available on Nintendo Switch. You can find all the details you need in our original article below, but first, here's a message from Ayrton's niece Bianca Senna, shared today in a press release:\n\n\"This homage to Ayrton  is incredible, and I have to thank all of AQUIRIS’ team for it, a Brazilian gaming studio worldwide known in the industry. To be able to partner with a quality company from Brazil is extra special to Senna Brands. I’m sure Ayrton’s fans will love the Horizon Chase expansion, a democratic game for catering for many markets and being multiplatform. It’s great to have the chance to tell Ayrton’s racing career in a different way to a new, younger generation of fans.\"\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/horizon-chase-turbo-honours-f1s-ayrton-senna-in-new-senna-forever-expansion",
          "publishedOn": "2021-10-20T14:00:00.000Z",
          "wordCount": 3696,
          "title": "Horizon Chase Turbo Honours F1's Ayrton Senna In New 'Senna Forever' Expansion"
        },
        {
          "id": "https://www.nintendolife.com/#article-122552",
          "author": null,
          "description": "Release date confirmed.\nBoth BloodRayne: ReVamped and BloodRayne 2: ReVamped will launch on Nintendo Switch on 18th November, it's been revealed.\nInitially announced earlier this year, the two remasters will be launching not only on Switch, but also on Xbox One and PS4. Players take on the role of Rayne, a half-vampire femme fatale who finds herself \"travelling the world to foil Nazi plans, battle supernatural threats, and uncover more about her vampiric heritage.\"\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/bloodrayne-1-and-2-revamped-both-sink-their-teeth-into-switch-next-month",
          "publishedOn": "2021-10-20T13:30:00.000Z",
          "wordCount": 1465,
          "title": "BloodRayne 1 And 2 ReVamped Both Sink Their Teeth Into Switch Next Month"
        },
        {
          "id": "https://www.nintendolife.com/#article-122163",
          "author": null,
          "description": "Just over par.\nGolf games tend to come in a variety of flavours. You’ve got the realistic sim games such as PGA Tour 2K21, the more arcade focused romps like Mario Golf: Super Rush, and abstract, minimal titles like Golf Club: Wasteland. A Little Golf Journey sits in the latter camp, showcasing short, breezy levels with an accompanying selection of relaxing music. It’s a game that knows what it wants to be, but is admittedly in constant danger of repetition thanks to a distinct lack of variety in the levels themselves.\nLike a lot of the more minimal golf games on the market, A Little Golf Journey doesn’t feature any actual players, nor any supporting crowds; it’s just you and the ball. Each level is set out as a kind of diorama, and you start out surveying the area by navigating your camera around, plotting out the best possible route towards the hole. Once you’re done, you can then set up your shot.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/reviews/switch-eshop/a-little-golf-journey",
          "publishedOn": "2021-10-20T13:00:00.000Z",
          "wordCount": 1687,
          "title": "Mini Review: A Little Golf Journey - A Relaxing If Repetitive Round"
        },
        {
          "id": "https://www.nintendolife.com/#article-122540",
          "author": null,
          "description": "Mario Kart Tour's Halloween event gets underway.\nFirst he failed to get a spot in Smash, and now he's been turned into a vampire. Poor Waluigi just can't catch a stake, err... break.\nYes, Nintendo has kickstarted the latest tour in Mario Kart Tour, officially releasing 'Waluigi (Vampire)' as a playable character in-game. Complete with a top hat and cape, this new Waluigi variant comes with an also-new Vampire Flyer kart, which looks very cool indeed.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/nintendo-gives-fans-the-best-halloween-present-vampire-waluigi",
          "publishedOn": "2021-10-20T10:45:00.000Z",
          "wordCount": 1625,
          "title": "Nintendo ﻿Gives Fans The Best Halloween ﻿Present: Vampire Waluigi"
        },
        {
          "id": "https://www.nintendolife.com/#article-122537",
          "author": null,
          "description": "Time flies when you're having fun.\nFive years ago today, Nintendo showed off its shiny new Switch console for the very first time. Where on Earth does the time go?\nWe imagine plenty of you will remember the console's first trailer (up above) rather fondly; after what felt like an age of rumours about what Nintendo's 'NX' console could be, it was finally confirmed that it would indeed feature a tablet-like screen with detachable controllers, playable both in handheld and on the TV.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/wow-nintendo-switch-was-first-revealed-five-years-ago-today",
          "publishedOn": "2021-10-20T10:00:00.000Z",
          "wordCount": 5747,
          "title": "Wow, Nintendo Switch Was First Revealed Five Years Ago Today"
        },
        {
          "id": "https://www.nintendolife.com/#article-122534",
          "author": null,
          "description": "Does your pet have what it takes?\nIn celebration of Pokémon Brilliant Diamond and Shining Pearl's upcoming release, The Pokémon Company has launched a real-life Pokémon Contest – for your pets.\nThe 'Pokémon Presents Super Pet Contest' follows the formula of Diamond and Pearl's Contest events, with fans being able to submit photos of their pets into three categories: Clever, Cute and Cool. If you have a pet that has what it takes, entries are being accepted up until 9th November at 8am GMT, but you'll need to be from the UK, France, Germany or the US to take part.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/the-pokemon-company-wants-to-see-your-pets-and-prizes-are-up-for-grabs",
          "publishedOn": "2021-10-20T09:15:00.000Z",
          "wordCount": 1441,
          "title": "The Pokémon Company Wants To See Your Pets, And Prizes Are Up For Grabs"
        }
      ]
    },
    {
      "title": "Rock Paper Shotgun Latest Articles Feed",
      "feedUrl": "https://www.rockpapershotgun.com/feed",
      "siteUrl": "https://www.rockpapershotgun.com/feed",
      "articles": [
        {
          "id": "https://www.rockpapershotgun.com/letter-from-the-editor-03",
          "author": "Katharine Castle",
          "description": "Hello folks. Sorry to be writing this letter so late into October. This time two weeks ago I was walking the halls of London's ExCel on my way to host the first RPS Presents panel at EGX 2021, and all the planning and organising I had to do for it rather cut back on my available writing time. I then took some time off to recuperate a bit, and here we are, three weeks into October and I'm only just getting round to doing my monthly editor's letter. I do apologise. But! We are here now and there's plenty to talk about. A lot of it is EGX-related, but you'll hopefully have noticed some new site features being introduced these last few weeks as well, which I'll explain below. \nRead more",
          "link": "https://www.rockpapershotgun.com/letter-from-the-editor-03",
          "publishedOn": "2021-10-21T14:12:37.000Z",
          "wordCount": 840,
          "title": "Letter From The Editor #03: EGX Rezzed is dead, long live EGX Rezzed"
        },
        {
          "id": "https://www.rockpapershotgun.com/charming-tower-defence-toy-soldiers-has-an-hd-remaster-now",
          "author": "Alice O'Connor",
          "description": "2010 tower defence game Toy Soldiers has two big neat ideas: it looks like a toybox upended onto battlefield dioramas built on bedroom tables; and you can take to the battlefield yourself to control units and vehicles. It's a good'un, and today it relaunched with an 'HD' version. I liked the original enough to buy it on both Xbox 360 and PC, but wasn't interested in getting it again until I heard Toy Soldiers: HD offers more than the usual high-res texture overhaul.\nRead more",
          "link": "https://www.rockpapershotgun.com/charming-tower-defence-toy-soldiers-has-an-hd-remaster-now",
          "publishedOn": "2021-10-21T14:07:29.000Z",
          "wordCount": 956,
          "title": "Charming tower defence Toy Soldiers has an HD remaster now"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-dark-pictures-anthology-house-of-ashes-review",
          "author": "Alice Bell",
          "description": "I have a real soft spot for Supermassive Games. Until Dawn was a knowingly schlocky teen slasher horror film made into an interactive adventure game, and it was great for at least two thirds of its runtime. I've also felt the same about their more recent project, The Dark Pictures Anthology, which began with Man Of Medan in 2019. Every time a new instalment comes out I believe it's in with a shot of being well good - although each one has since made me doubt the \"knowing\" part of my interpretation of Until Dawn. The latest entry, House Of Ashes, comes the closest yet to recapturing the daft thrills of Until Dawn, with a classic survival-horror setup that's half The Descent and half Aliens.\nThe five playable protagonists you flit between are trapped in an ancient Sumerian temple that leads into an even deeper cavern, and then an even deeperer, ancienter ruin. The turducken of potholing. But instead of delicious stuffing, the surprise in these layers is a race of vampiric monsters whose vision is based on sound, and whose spit is LSD. Your job is to get your goons out alive, and the main problem is that the goons in question are - instead of a busload of teens on a field trip gone wrong - a small team of US marines searching for WMDs in 2003 Iraq. Wakka wakka.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-dark-pictures-anthology-house-of-ashes-review",
          "publishedOn": "2021-10-21T14:00:00.000Z",
          "wordCount": 2007,
          "title": "The Dark Pictures Anthology: House Of Ashes review: very nearly a fun horror romp"
        },
        {
          "id": "https://www.rockpapershotgun.com/austin-powers-spliced-into-mass-effect-makes-a-disturbingly-good-shepard",
          "author": "Imogen Beckhelling",
          "description": "The geth have begun launching seemingly random attacks on human colonies. Rumours are circling that ancient machines will soon emerge from darkspace. There is only one man equipped to deal with these threats: Intergalactic Man Of Mystery, Austin Powers. Someone has made a video editing Mike Myers' 60s spy into Mass Effect and I'm astounded at how well it works. I don't know what else to say. This is Mass Effect in its ultimate form. Please watch it, it's the best minute I've spent all week.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/austin-powers-spliced-into-mass-effect-makes-a-disturbingly-good-shepard",
          "publishedOn": "2021-10-21T13:04:21.000Z",
          "wordCount": 833,
          "title": "Austin Powers spliced into Mass Effect makes a disturbingly good Shepard"
        },
        {
          "id": "https://www.rockpapershotgun.com/into-the-pit-was-inspired-by-devil-daggers-and-a-nicolas-cage-film",
          "author": "Imogen Beckhelling",
          "description": "Into The Pit is a fast-paced roguelike shooter with hints of Doom, and excellent hands that shoot magical bullets. It's not the first occult-themed game to turn hands into guns (and I sure hope it won't be the last), but is inspired by one. I spoke to Into The Pit's creator, Tom Betts, who told me about the game's Devil Daggers influences, from weaponry to aesthetics, and why the occult setting works so well for the roguelike genre. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/into-the-pit-was-inspired-by-devil-daggers-and-a-nicolas-cage-film",
          "publishedOn": "2021-10-21T12:00:00.000Z",
          "wordCount": 1693,
          "title": "Into The Pit was inspired by Devil Daggers and a Nicolas Cage film"
        },
        {
          "id": "https://www.rockpapershotgun.com/bethesdas-new-starfield-trailer-introduces-mercenary-and-pirate-factions",
          "author": "Imogen Beckhelling",
          "description": "I'm fighting off a real Bethesda itch right now. I know I'll hate myself if I start yet another Skyrim playthrough, and I'm too fussy to decide on a Fallout to sink another fifty hours into. But now there's a new Starfield trailer, and it's making me pine for those damned RPGs all the more. The developers have dived into Starfield's history, and revealed a handful of factions we'll come across on our space travels. It's mostly concept art, but hey, it's very nice concept art.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/bethesdas-new-starfield-trailer-introduces-mercenary-and-pirate-factions",
          "publishedOn": "2021-10-21T10:08:17.000Z",
          "wordCount": 976,
          "title": "Bethesda's new Starfield trailer introduces mercenary and pirate factions"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-now-lets-you-transfer-your-character-to-another-server",
          "author": "Alice O'Connor",
          "description": "Server transfers opened up in New World overnight, letting players shunt their explorers from one world to another. This is a desirable feature in many MMOs, and particularly in this one because servers were so overloaded at launch that Amazon recommended players join any old server then transfer to their desired home later once things settled. All players get one transfer for free, but only one, with Amazon planning to start selling that service later.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-now-lets-you-transfer-your-character-to-another-server",
          "publishedOn": "2021-10-21T09:46:30.000Z",
          "wordCount": 929,
          "title": "New World now lets you transfer your character to another server"
        },
        {
          "id": "https://www.rockpapershotgun.com/evertried-review",
          "author": "Brendan Caldwell",
          "description": "There is no mouse cursor in Evertried. You control everything with the keyboard, from the hops and scythe attacks of your cute otherworldly hero, to the settings in the pause menu. It's a strange omission but one that is representative of the feeling this roguelike evokes throughout your time climbing its purgatorial tower of baddies. That is to say, a feeling that there's something important missing. In fact, there seems to be a lot missing from this tile-based timewaster, small touches that could have given its solid foundation the polish it needed to excel. \nRead more",
          "link": "https://www.rockpapershotgun.com/evertried-review",
          "publishedOn": "2021-10-21T08:00:00.000Z",
          "wordCount": 1829,
          "title": "Evertried review: a rough-hewn roguelike that fails to stand out"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-the-outstanding-razer-viper-ultralight-mouse-for-50-off",
          "author": "Will Judd",
          "description": "The Razer Viper is one of my favourite mice of all time, whether we're talking about the wireless Ultimate version, the compact Mini model or the vanilla Viper. It's this OG model that is on sale today at Amazon, who have marked it down from £80 to just £40 - an incredible bargain for an ultralight mouse with a high-end optical sensor, optical mouse buttons, flexible cable and low weight of just 69 grams. \nRead more",
          "link": "https://www.rockpapershotgun.com/get-the-outstanding-razer-viper-ultralight-mouse-for-50-off",
          "publishedOn": "2021-10-20T20:30:43.000Z",
          "wordCount": 965,
          "title": "Get the outstanding Razer Viper ultralight mouse for 50% off"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-an-rtx-3070-gaming-laptop-for-1250-after-a-150-discount",
          "author": "Will Judd",
          "description": "The Asus Tuf Gaming A15 is a great value gaming laptop that attracted warm reviews for its design and performance, and today it's also the cheapest RTX 3070 gaming laptop we can find*. The A15 FA506QR-HN006T specification, which includes a Ryzen 7 5800H processor, 16GB of RAM and 512GB SSD, is down to just £1250 at Overclockers after a £150 reduction. \nRead more",
          "link": "https://www.rockpapershotgun.com/get-an-rtx-3070-gaming-laptop-for-1250-after-a-150-discount",
          "publishedOn": "2021-10-20T20:05:43.000Z",
          "wordCount": 871,
          "title": "Get an RTX 3070 gaming laptop for £1250 after a £150 discount"
        },
        {
          "id": "https://www.rockpapershotgun.com/cd-projekt-red-delay-the-witcher-3s-next-gen-update",
          "author": "Alice O'Connor",
          "description": "The update adding raytracing and other mod cons to The Witcher 3 will not launch this year, developers CD Projekt Red announced today. They've been fancying up their fantasy RPG for the latest console generation, and those 'next-gen' additions are headed to PC in a patch too. But not this year. Instead, look to be blinded by the light in spring 2022. They've also delayed the next-gen version of Cyberpunk 2077 for consoles.\nRead more",
          "link": "https://www.rockpapershotgun.com/cd-projekt-red-delay-the-witcher-3s-next-gen-update",
          "publishedOn": "2021-10-20T19:17:05.000Z",
          "wordCount": 896,
          "title": "CD Projekt Red delay The Witcher 3's next-gen update"
        },
        {
          "id": "https://www.rockpapershotgun.com/god-of-war-is-coming-to-pc-in-january-2022",
          "author": "Alice O'Connor",
          "description": "As was rumoured, the dadtastic godstabber God Of War is indeed coming to PC. Sony today announced that the PlayStation-exclusive action-adventure game will launch for PC on the 14th of January, 2022. Good game, that. It'll have support for assorted PC technical fanciness too.\nRead more",
          "link": "https://www.rockpapershotgun.com/god-of-war-is-coming-to-pc-in-january-2022",
          "publishedOn": "2021-10-20T16:32:16.000Z",
          "wordCount": 907,
          "title": "God Of War is coming to PC in January 2022"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-subnautica-mods",
          "author": "Craig Pearson",
          "description": "Subnautica was a game I spent a lot of time just living in. It was a rare combination of survival and relaxation. I loved the base building, crafting what amounted to a reverse aquarium clinging to an underwater sea cliff. It grew from a small bulb of oxygen into a proper little sanctuary. When I picked it up, it was fairly late into its life, and a number of mods were already waiting to be installed. I quickly dialed down the game’s frustrations and made my time under the sea all the more enjoyable, so here are our picks for the best Subnautica mods available today.  \nRead more",
          "link": "https://www.rockpapershotgun.com/best-subnautica-mods",
          "publishedOn": "2021-10-20T15:36:25.000Z",
          "wordCount": 1738,
          "title": "Best Subnautica mods"
        },
        {
          "id": "https://www.rockpapershotgun.com/over-20-people-reported-for-behaviour-now-gone-from-activision-blizzard",
          "author": "Alice O'Connor",
          "description": "Activision Blizzard's initial response to allegations of workplace harrassment and discrimination was disappointing enough that thousands of current and former employees signed an open letter condemning it then hundreds staged a walkout in July. With several legal cases against the Warcraft and Call Of Duty owners underway, they've now admitted they haven't done enough. Yesterday, Along with laying out their next steps, they confirmed that over 20 people have \"exited\" Activision Blizzard in connection with reports against them.\nRead more",
          "link": "https://www.rockpapershotgun.com/over-20-people-reported-for-behaviour-now-gone-from-activision-blizzard",
          "publishedOn": "2021-10-20T15:26:38.000Z",
          "wordCount": 1212,
          "title": "Over 20 people reported for behaviour now gone from Activision Blizzard"
        },
        {
          "id": "https://www.rockpapershotgun.com/wd-blue-sn570-review",
          "author": "James Archer",
          "description": "There was a time, not so long ago, when the WD Blue line exemplified that “good but boring” quality that sees many a budget SSD damned by faint praise. Fast enough yet rarely eye-catchingly rapid, even when the WD Blue SN500 ditched SATA for the much quicker NVMe interface, they’ve always been sensible purchases that nonetheless lived in the shadow of the WD Black lineup. That all changes with the latest WD Blue SN570: it’s not just an excellent M.2 drive for the money, but quite possibly the single most compelling SSD for anyone sticking with PCIe 3.0.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/wd-blue-sn570-review",
          "publishedOn": "2021-10-20T15:23:23.000Z",
          "wordCount": 1262,
          "title": "WD Blue SN570 review: The best cheap SSD grows up"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-zombies-in-back-4-blood-are-more-fashionable-than-me",
          "author": "Ed Thorn",
          "description": "I don't know what I was expecting to take away from co-op FPS Back 4 Blood. A greater sense of comradery between myself and my friends? An appreciation of the weighty guns and how magazines snap into place with each reload? The sheer amount of blood that splashes on your person with each wave of zombies you cut down? Yes, all of these things.\nBut none more so than what the zombies wear. They favour comfortable clothing, but mainly the gilet. They love gilets. And they now have me questioning my fashion choices. Should I also join them as a wearer of gilets?\nRead more",
          "link": "https://www.rockpapershotgun.com/the-zombies-in-back-4-blood-are-more-fashionable-than-me",
          "publishedOn": "2021-10-20T14:41:24.000Z",
          "wordCount": 799,
          "title": "The zombies in Back 4 Blood are more fashionable than me"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-fireflies",
          "author": "Hayden Hefford",
          "description": "Want to know more about Fireflies in Minecraft? Whether you call them Fireflies, glowbugs, or lightning bugs, they’ll all occupy the same two pixels when they come to Minecraft and it’s time to get fired up for their arrival. Fireflies were announced at Minecraft Live 2021, which also shared more details on the upcoming Caves and Cliffs part 2 update.\nThis guide will explain everything that you need to know about Fireflies in Minecraft, including when you can expect Fireflies to come to Minecraft, where Fireflies will appear, and what they do.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-fireflies",
          "publishedOn": "2021-10-20T14:40:03.000Z",
          "wordCount": 994,
          "title": "Everything that we know about Fireflies in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-mangrove-swamp",
          "author": "Hayden Hefford",
          "description": "Want to know more about mangrove swamps in Minecraft? At Minecraft Live 2021, Mojang revealed that mangrove swamps - one of the options in the biome vote way back in 2019 - are finally coming to Minecraft. Many of the ideas mentioned back then, including mangrove trees and frogs, will be key features of the mangrove swamp biome.\nThis guide will explain everything that you need to know about mangrove swamps in Minecraft, including when mangrove swamps will be released, what you will find in the new biome, and how to grow your own mangrove trees with propagules.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-mangrove-swamp",
          "publishedOn": "2021-10-20T11:42:43.000Z",
          "wordCount": 1081,
          "title": "Everything you need to know about mangrove swamps in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/activision-blizzard-want-harassment-lawsuit-paused-over-conflict-of-interest",
          "author": "Imogen Beckhelling",
          "description": "Activision Blizzard have filed an application to halt the harassment and discrimination lawsuit from the California Department of Fair Employment and Housing (DFEH). This follows an update on the suit last week, which revealed that two DFEH lawyers previously worked for the Equal Employment Opportunity Commission (EEOC), who're also going through legal proceedings with Actiblizzard, creating a conflict of interest. Now the Call Of Duty and World Of Warcraft publishers want the DFEH's case to be paused so they can investigate, and decide whether they want to try and get the case disqualified, or find \"other appropriate remedies\". \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/activision-blizzard-want-harassment-lawsuit-paused-over-conflict-of-interest",
          "publishedOn": "2021-10-20T10:58:01.000Z",
          "wordCount": 999,
          "title": "Activision Blizzard want harassment lawsuit paused over conflict of interest"
        },
        {
          "id": "https://www.rockpapershotgun.com/gloomhaven-pc-review",
          "author": "Nic Reuben",
          "description": "Gloomhaven’s scoundrel has a custom animation for her flintlock pistol, and I am still jazzed about it. Releasing today in full after lurking in early access for the last two years, there are 17 classes in this digital adaptation of Cephalofair’s tabletop legacy dungeon crawler, hereafter referred to as ‘Tablehaven’. Each class, from psychic rodent Mindthief to basalt shithouse Cragheart, has around 30 ability cards each. And Flaming Fowl, alongside offering Tablehaven’s entire branching campaign, map editors, and a digi-only ‘Guildmaster’ campaign, have animated this single flintlock shot. It’s almost opulent. \nAll right, so I probably won’t use it much. Five damage at range four is a belter, but that burn hurts for a single target ability. I’ll be smiling when I do, though. Grinning as the scoundrel whips the silver pistol from her hip and deletes a cultist just before he summons a skeleton. Just as I’ve been grinning at these detailed, cel-shaded dungeons and grimy sewers, or the spoken narration before each quest. All Gloomhaven needed to do was not get in Tablehaven’s way too much. Accuracy and usability would have been just fine. But there’s enough passion and pizzaz in this wonderful package that a part of me wishes I was new here, just so I could be surprised all over again.\nRead more",
          "link": "https://www.rockpapershotgun.com/gloomhaven-pc-review",
          "publishedOn": "2021-10-20T10:00:00.000Z",
          "wordCount": 1903,
          "title": "Gloomhaven review: a loving adaptation that nails the ambition and detail of the tabletop original"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-frogs",
          "author": "Hayden Hefford",
          "description": "Want to know more about frogs in Minecraft? If you’ve always looked at lakes and rivers in Minecraft and thought ‘those need some slimy little amphibians that leap on lily pads and whip fireflies out of the sky with their tongues’, then you’re in luck! At Minecraft Live 2021, the team shared that we are getting frogs in Minecraft, and they’ll actually have a lot more depth than you might expect.\nThis guide will explain everything that we currently know about frogs in Minecraft, including how to get the different frog variants and how they act.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-frogs",
          "publishedOn": "2021-10-20T09:54:34.000Z",
          "wordCount": 994,
          "title": "Everything we know about frogs in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-genshin-impact-hu-tao-build",
          "author": "Amelia Zollner",
          "description": "Want to learn how to create the best Hu Tao build in Genshin Impact? As the 77th Director of the Wangsheng Funeral Parlor, Hu Tao has the help of ghosts in battle, where she’ll stir up a fright as she absolutely demolishes enemies. Despite being a bit of a prankster, the Pyro Polearm wielder will make a great DPS addition to your team.\nThis guide will show you how to create the best Hu Tao build in Genshin Impact. Below we'll cover everything you need to know about Hu Tao, including wishing, weapons, artifacts, ascension materials, talents, abilities, and constellations.\nRead more",
          "link": "https://www.rockpapershotgun.com/best-genshin-impact-hu-tao-build",
          "publishedOn": "2021-10-20T09:53:26.000Z",
          "wordCount": 2095,
          "title": "Best Genshin Impact Hu Tao build"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-allay",
          "author": "Hayden Hefford",
          "description": "Want to know more about the Allay in Minecraft? For the past few years, Minecraft Live has included lots of announcements about new updates, as well as a fan vote for a new Minecraft mob. For Minecraft Live 2021, the options were the Glare, the Copper Golem, and the Allay. Ultimately, the Allay came out on top, and will be added to Minecraft in 2022.\nHere’s everything that you need to know about the adorable Allay, including when it will arrive in Minecraft and what the Allay will do.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-allay",
          "publishedOn": "2021-10-20T08:52:58.000Z",
          "wordCount": 947,
          "title": "Everything that we know about the Allay in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/riders-republic-will-offer-a-free-trial-week-before-launch",
          "author": "Graham Smith",
          "description": "I'm exhausted at the mere thought of most Ubisoft games now, but I do want to fall down mountains in Riders Republic. To make that easier for me, Ubisoft are offering a trial week for their bigly multiplayer extreme sports 'em up. From October 21st until the 27th, you'll be able to play four hours of Riders Republic for free, with progress carrying over to the full game should you buy it.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/riders-republic-will-offer-a-free-trial-week-before-launch",
          "publishedOn": "2021-10-19T23:11:21.000Z",
          "wordCount": 785,
          "title": "Riders Republic will offer a free trial week before launch"
        },
        {
          "id": "https://www.rockpapershotgun.com/microsoft-flight-simulator-is-getting-more-free-updates-with-goty-edition",
          "author": "Graham Smith",
          "description": "Microsoft Flight Simulator is getting a 'Game Of The Year' edition. The skybound sim has received regular free updates since launch, each adding new cities and points of interest. The GOTY edition will bring even more, including new potogrammetry cities, 8 new airpirts, and 5 new aircraft. It'll launch on November 18th and be free to all existing players.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/microsoft-flight-simulator-is-getting-more-free-updates-with-goty-edition",
          "publishedOn": "2021-10-19T22:18:02.000Z",
          "wordCount": 787,
          "title": "Microsoft Flight Simulator is getting more free updates with GOTY edition"
        },
        {
          "id": "https://www.rockpapershotgun.com/halo-and-disintegrations-marcus-lehto-founding-new-studio-with-ea",
          "author": "Graham Smith",
          "description": "Marcus Lehto, former creative director at Bungie and the artist responsible for Master Chief, has joined EA to found a new studio that will make first-person games. Lehto's last company was V1 Interactive, who released the short-lived Disintegration last year.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/halo-and-disintegrations-marcus-lehto-founding-new-studio-with-ea",
          "publishedOn": "2021-10-19T21:55:45.000Z",
          "wordCount": 716,
          "title": "Halo and Disintegration's Marcus Lehto founding new studio with EA"
        },
        {
          "id": "https://www.rockpapershotgun.com/dead-by-daylights-hellraiser-models-are-now-an-nft",
          "author": "Graham Smith",
          "description": "Do you enjoy the feeling of having pins hammered into your head? Then allow me to introduce you to: our modern reality. \r\n\nToday's pin to the brow is that you can now buy NFTs based on Dead By Daylight's in-game models of Hellraiser's Pinhead. I can tell the difference between pleasure and pain, and this is pain.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/dead-by-daylights-hellraiser-models-are-now-an-nft",
          "publishedOn": "2021-10-19T21:33:16.000Z",
          "wordCount": 944,
          "title": "Dead By Daylight's Hellraiser models are now an NFT"
        },
        {
          "id": "https://www.rockpapershotgun.com/leaked-do-not-ban-list-reveals-how-twitch-dealt-with-rule-breakers",
          "author": "Graham Smith",
          "description": "Among the many discoveries of this month's Twitch source code and data leak was a file called \"do_not_ban_list.\" While not as black and white as the name suggest, the file sheds light on the otherwise opaque way Twitch has enforced its rules when streamers break them.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/leaked-do-not-ban-list-reveals-how-twitch-dealt-with-rule-breakers",
          "publishedOn": "2021-10-19T20:24:00.000Z",
          "wordCount": 929,
          "title": "Leaked 'do not ban' list reveals how Twitch dealt with rule breakers"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-an-rtx-3060-gaming-laptop-for-850-in-an-early-black-friday-deal",
          "author": "Will Judd",
          "description": "The MSI GF65 Thin is the first Black Friday gaming laptop deal we've spotted, around a month before the shopping holiday traditionally begins. At Best Buy, you can pick up this RTX 3060 equipped machine for $850, a cool $250 below its usual price of $1100. That's a fantastic value for a laptop that's seen strong reviews since its release earlier this year.\nRead more",
          "link": "https://www.rockpapershotgun.com/get-an-rtx-3060-gaming-laptop-for-850-in-an-early-black-friday-deal",
          "publishedOn": "2021-10-19T19:16:48.000Z",
          "wordCount": 1011,
          "title": "Get an RTX 3060 gaming laptop for $850 in an early Black Friday deal"
        },
        {
          "id": "https://www.rockpapershotgun.com/upgrade-your-pc-with-two-sticks-of-8gb-3200mhz-ram-for-55",
          "author": "Will Judd",
          "description": "Adata is one of the best brands for budget RAM, and their long-standing Gammix D10 series offers a good balance of low price and high performance. Right now you can pick up two 8GB sticks of DDR4-3200 CL16 memory from Ebuyer for £56, around £10 cheaper than you'd pay for RAM with the same specs on Amazon. \nRead more",
          "link": "https://www.rockpapershotgun.com/upgrade-your-pc-with-two-sticks-of-8gb-3200mhz-ram-for-55",
          "publishedOn": "2021-10-19T18:01:48.000Z",
          "wordCount": 840,
          "title": "Upgrade your PC with two sticks of 8GB 3200MHz RAM for £55"
        },
        {
          "id": "https://www.rockpapershotgun.com/grotto-review",
          "author": "Katharine Castle",
          "description": "It's a hard life, being a soothsayer in Grotto. You live in a dingy little cave, the locals look at you with varying levels of distrust and suspicion, and occasionally your campfire will perk up and talk to you when no one's looking, its yellow flames turning an ominous shade of blue as it whispers dread-filled words about failure and the beating heart of the mountain into your ear. It's unclear how you ended up like this, but day after day you're tasked with consulting the handful of stars visible through a crack in the cave's ceiling to dole out advice to the local tribespeople, a group of anthropomorphic animals known only as The Brutes. \nSaid advice comes in the form of 24 constellations you can discover by looking up and drawing shapes in the sky with your mouse. You'll need to give one of them to each Brute that asks you a question, but when every constellation has its own fortune-cookie-like meaning attached to it, finding the right one to answer their question successfully can be a challenge. As the toad man Ouuch tells you at the start, if you ask three separate people what the word 'blue' means to them, you'll get three separate answers. Sometimes, your intentions will be misinterpreted, while others will willfully ignore you. But one thing Grotto always manages to do is to keep you coming back for more. Once you've set this car crash of consequences in motion, it's very hard to tear your eyes away.\nRead more",
          "link": "https://www.rockpapershotgun.com/grotto-review",
          "publishedOn": "2021-10-19T17:00:00.000Z",
          "wordCount": 1894,
          "title": "Grotto review: a grim, mystical tale about the limitations of language"
        },
        {
          "id": "https://www.rockpapershotgun.com/crysis-remastered-trilogy-new-and-old-versions-compared",
          "author": "James Archer",
          "description": "The Crysis Remastered Trilogy is out, complete with all the angry nanosuit men, angry alien squids, and solitary angry Cockney bloke of the originals – now with 8K support. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/crysis-remastered-trilogy-new-and-old-versions-compared",
          "publishedOn": "2021-10-19T16:11:42.000Z",
          "wordCount": 2151,
          "title": "Crysis Remastered Trilogy: new and old versions compared"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-1-19-the-wild-update",
          "author": "Hayden Hefford",
          "description": "Want to know more about the Minecraft 1.19 update? The Wild Update was revealed at Minecraft Live 2021, where we got details about all of the new additions, including frogs, fireflies, and mangrove swamps. This will be the first Minecraft update in 2022, and will be the next major update after Caves and Cliffs part 2.\nThis guide will explain everything that you can expect with Minecraft 1.19, so that you don’t go wild looking for details all over.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-1-19-the-wild-update",
          "publishedOn": "2021-10-19T15:17:15.000Z",
          "wordCount": 1619,
          "title": "Minecraft 1.19 release date: The Wild Update"
        },
        {
          "id": "https://www.rockpapershotgun.com/total-war-warhammer-3-trailer-shows-grand-cathay-and-tzeentch-rumbling",
          "author": "Alice O'Connor",
          "description": "After a lot of explaining how the factions of Grand Cathay and Tzeentch will work in Total War: Warhammer 3, Creative Assembly today demonstrated with a nine-minute video dramatically recapping a battle between the two. The third game in their fantasy real-time strategy series has needed to invent and fill out a lot of armies not present in the tabletop game, so it's interesting to see them in action. Got some nice colours and weird warmen, at the very least.\nRead more",
          "link": "https://www.rockpapershotgun.com/total-war-warhammer-3-trailer-shows-grand-cathay-and-tzeentch-rumbling",
          "publishedOn": "2021-10-19T14:04:33.000Z",
          "wordCount": 839,
          "title": "Total War: Warhammer 3 trailer shows Grand Cathay and Tzeentch rumbling"
        },
        {
          "id": "https://www.rockpapershotgun.com/amazon-games-investigating-new-world-invulnerability-exploit",
          "author": "Imogen Beckhelling",
          "description": "New World players have found an exploit that lets you turn invincible, which is certainly not the sort of exploit you want in your PvP-focused MMORPG. According to players who've encountered the bug, it's pretty easy to replicate, and folks are calling for wars to be disabled until there's a fix. Amazon Games say they're aware of the problem and are investigating, so hopefully they'll patch the game soon to make sure everyone's staying vincible.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/amazon-games-investigating-new-world-invulnerability-exploit",
          "publishedOn": "2021-10-19T12:43:28.000Z",
          "wordCount": 859,
          "title": "Amazon Games investigating New World invulnerability exploit"
        },
        {
          "id": "https://www.rockpapershotgun.com/assassins-creed-valhallas-educational-discovery-tour-is-out-today",
          "author": "Alice O'Connor",
          "description": "The best part of primary school in the UK is learning about Vikings: getting to make and decorate cardboard swords and jewellery, write stories about legends, and maybe even escape school with a visit to a historical site. Well, Assassin's Creed Valhalla might not offer the same crafting opportunities, but you can learn a lot about the game's history with the new Discovery Tour mode. It hits Valhalla today in a free update, and will also be sold separately for folks who don't want Valhalla.\nRead more",
          "link": "https://www.rockpapershotgun.com/assassins-creed-valhallas-educational-discovery-tour-is-out-today",
          "publishedOn": "2021-10-19T12:31:58.000Z",
          "wordCount": 888,
          "title": "Assassin's Creed Valhalla's educational Discovery Tour is out today"
        },
        {
          "id": "https://www.rockpapershotgun.com/apex-legends-new-character-is-a-familiar-face-from-titanfall-2",
          "author": "Imogen Beckhelling",
          "description": "Apex Legends is adding a second spooky murderbot to its roster, one that both Apex and Titanfall 2 fans might recognise. Ash is a simulacrum (human consciousness in a freaky robot) who was previously a baddie in Titanfall 2. Since May this year, she's been overseeing Apex's new 3v3 Arenas mode - you know, that ominous voice that tells you to crush your enemies. But in the battle royale's next season, Escape, she'll be joining the fight herself.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/apex-legends-new-character-is-a-familiar-face-from-titanfall-2",
          "publishedOn": "2021-10-19T11:17:01.000Z",
          "wordCount": 899,
          "title": "Apex Legends' new character is a familiar face from Titanfall 2"
        },
        {
          "id": "https://www.rockpapershotgun.com/im-sorry-to-say-it-new-world-but-you-need-mounts-mate",
          "author": "Ed Thorn",
          "description": "My heart sinks every time I accept a quest in MMORPG New World, which isn't ideal. These are tickets to adventure, to discovery, to that sweet, sweet EXP. But the more time I spend with the game, the more I'm beginning to loathe them. It's got nothing to do with what you actually do in them, it's the getting there that's the problem. I have to run my little legs ragged and I'm tired. I'm so very tired of it.\nRead more",
          "link": "https://www.rockpapershotgun.com/im-sorry-to-say-it-new-world-but-you-need-mounts-mate",
          "publishedOn": "2021-10-19T10:00:00.000Z",
          "wordCount": 1305,
          "title": "I'm sorry to say it New World, but you need mounts, mate"
        },
        {
          "id": "https://www.rockpapershotgun.com/actraiser-renaissance-review",
          "author": "Nadia Oxford",
          "description": "1990's ActRaiser is special. Most video games released in the late '80s tasked you with saving a princess from a dragon. ActRaiser says, “Hey, would you mind playing God with the people living on the demon-scarred land you just liberated? They're really squishy and helpless. Thanks, you’re a peach.\"\nThe game's developer, Quintet, was pretty special, too. Once a branch of Enix before the latter joined with Squaresoft in 2003, Quintet was behind a lot of SNES-era RPGs that are still fondly remembered today, such Illusion of Gaia and Terranigma. They’re all solid adventures that share a canon, albeit vaguely, and tackle some pretty heavy subject matter, including colonialism, poverty, and the slave trade. Alas, Quintet disbanded when Square Enix was born, and most of its team scattered to the winds. There’s been a Q-shaped hole in my heart ever since, so I hope I can be excused for yelling like a madwoman when ActRaiser Renaissance made a surprise debut at the September 2021 Nintendo Direct presentation.\nRead more",
          "link": "https://www.rockpapershotgun.com/actraiser-renaissance-review",
          "publishedOn": "2021-10-19T10:00:00.000Z",
          "wordCount": 1741,
          "title": "ActRaiser Renaissance review: raise one for a great remake of a 16-bit classic"
        },
        {
          "id": "https://www.rockpapershotgun.com/rps-asks-you-to-please-take-our-2021-readership-survey",
          "author": "Katharine Castle",
          "description": "It's that time of year again where we come to you with a single question: would you fill out our RPS Readership Survey, please? It should only take around 5-10 minutes of your time to complete, and it will be a big help to us going forward - particularly when it comes to shaping the future of the RPS supporter program.\nRead more",
          "link": "https://www.rockpapershotgun.com/rps-asks-you-to-please-take-our-2021-readership-survey",
          "publishedOn": "2021-10-19T09:40:18.000Z",
          "wordCount": 831,
          "title": "RPS Asks: you to please take our 2021 readership survey"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-genshin-impact-childe-build-tartaglia",
          "author": "Amelia Zollner",
          "description": "Want to learn how to create the best Childe build in Genshin Impact? Thanks to his unique ability set that enables both close-range and long-range combat, Hydro Bow user Childe (also known as Tartaglia) is especially powerful in almost any situation and is great as a main or sub DPS. As the 11th Harbinger of the Fatui, he’s an incredibly fierce warrior who also cares deeply for those he loves.\nThis guide will show you how to create the best Childe build in Genshin Impact. Below we'll cover everything you need to know about Childe, including wishing, weapons, artifacts, ascension materials, talents, abilities, and constellations.\nRead more",
          "link": "https://www.rockpapershotgun.com/best-genshin-impact-childe-build-tartaglia",
          "publishedOn": "2021-10-19T09:06:28.000Z",
          "wordCount": 2159,
          "title": "The best Genshin Impact Childe build (Tartaglia)"
        },
        {
          "id": "https://www.rockpapershotgun.com/dells-1440p-240hz-alienware-monitor-is-back-to-550",
          "author": "Will Judd",
          "description": "The Dell Alienware AW2721D is one of our top recommended monitors, sitting right in the emerging 1440p 240Hz sweet spot preferred by players of fast-paced shooters and racing titles. Right now, the monitor has returned to the lowest price we've ever seen for it, £550, down from a nominal RRP of over £800. \nRead more",
          "link": "https://www.rockpapershotgun.com/dells-1440p-240hz-alienware-monitor-is-back-to-550",
          "publishedOn": "2021-10-18T19:58:56.000Z",
          "wordCount": 993,
          "title": "Dell's 1440p 240Hz Alienware monitor is back to £550"
        },
        {
          "id": "https://www.rockpapershotgun.com/steam-deck-compatibility-interview",
          "author": "James Archer",
          "description": "Valve have always maintained that the Steam Deck is closer to a conventional PC than a handheld console, and as such should be able to run your existing library of games on Steam. But while the official Steam Deck Twitter is full of videos showing games performing well on dev kits, the compatibility status of many more games remains up in the air. That could just be through a lack of confirmation, or it could be deep-lying technical issues relating to hardware requirements or anti-cheat services that needed tweaks to work on the Deck’s Proton-based OS. Ahead of the planned December launch, Valve have unveiled their plan to bring clarity on whether specific games will be able to run (and run effectively) on the Steam Deck.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/steam-deck-compatibility-interview",
          "publishedOn": "2021-10-18T18:00:17.000Z",
          "wordCount": 2139,
          "title": "Exclusive: Here's how you'll know which games will run on Valve's Steam Deck"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-a-wd-blue-4tb-ssd-for-just-339-at-newegg-50-off-its-normal-price",
          "author": "Will Judd",
          "description": "The WD Blue SATA SSD is a great choice if you want a lot of fast storage at a cheap price, and today Newegg are offering $50 off the giant 4TB size when you use the code EMC2AAZA827. This knocks the price to $339, the cheapest we've seen a 4TB drive in some time and $40 below the current Amazon price. \nRead more",
          "link": "https://www.rockpapershotgun.com/get-a-wd-blue-4tb-ssd-for-just-339-at-newegg-50-off-its-normal-price",
          "publishedOn": "2021-10-18T17:20:24.000Z",
          "wordCount": 892,
          "title": "Get a WD Blue 4TB SSD for just $339 at Newegg - $50 off its normal price"
        },
        {
          "id": "https://www.rockpapershotgun.com/into-the-pit-review",
          "author": "Matt Cox",
          "description": "You know how some games, like, throb? I mean your Thumpers, your Devil Daggers, your Dooms. Games you disappear into, but not in that namby pamby, prancing around fulfilling all your desires sense. I mean games that will eat you alive unless you stop them. Games set in pulsating, hostile dimensions in which you don’t belong; games that fling their menageries at the battered windows of your soul, where survival teeters on a combo of hair-trigger reflexes and total concentration.\r\n\n\nInto The Pit is one of those, until it isn’t. You know you’re in trouble when the demonic eldritch hell portal starts feeling too comfortable. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/into-the-pit-review",
          "publishedOn": "2021-10-18T16:00:00.000Z",
          "wordCount": 1849,
          "title": "Into The Pit review: a gorgeous roguelike shooter that sadly descends into comfortable familiarity"
        },
        {
          "id": "https://www.rockpapershotgun.com/monster-hunter-rise-pc-vs-switch-how-the-demo-compares",
          "author": "James Archer",
          "description": "The recent launch of the Monster Hunter Rise demo on PC has given us a free look at how this soon-to-be-former Nintendo Switch exclusive will run and play when it releases in full in January 2022. This calls, naturally, for some screenshot comparisons.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/monster-hunter-rise-pc-vs-switch-how-the-demo-compares",
          "publishedOn": "2021-10-18T15:45:11.000Z",
          "wordCount": 1525,
          "title": "Monster Hunter Rise PC vs Switch: how the demo compares"
        },
        {
          "id": "https://www.rockpapershotgun.com/salt-and-sacrifice-preview-a-worthy-successor-to-salt-and-sanctuary",
          "author": "Ed Thorn",
          "description": "If you liked Dark Soulsy side-scroller Salt And Sanctuary, I have some great news. I got hands-on with an early portion of its sequel Salt And Sacrifice, and it seems set to deliver all the things that made its predecessor tick. The punishing enemies, the smooth combat, the vast skill trees, and the interconnected world are all still doing good things, but this time around they've just been joined by a few new additions, or seen some tweaks to keep things fresher, but no less difficult.\nRead more",
          "link": "https://www.rockpapershotgun.com/salt-and-sacrifice-preview-a-worthy-successor-to-salt-and-sanctuary",
          "publishedOn": "2021-10-18T15:35:05.000Z",
          "wordCount": 1687,
          "title": "With mage hunts and talking trees, Salt And Sacrifice is looking like a worthy successor to Salt And Sanctuary"
        },
        {
          "id": "https://www.rockpapershotgun.com/machinarium-is-selling-the-best-merch-a-bronze-statuette-of-its-adorable-star",
          "author": "Alice O'Connor",
          "description": "I don't buy video game merch, and if I did buy video game merch I wouldn't buy statues, and yet... my heart melts looking at Machinarium's hot new merch drop. Amanita are selling a limited run of bronze statuettes of the adventure game's adorable scrap robot star, Josef, and I love him. 405 grams of bronze might sound cold to hold but I know he'd warm my heart.\nRead more",
          "link": "https://www.rockpapershotgun.com/machinarium-is-selling-the-best-merch-a-bronze-statuette-of-its-adorable-star",
          "publishedOn": "2021-10-18T15:29:55.000Z",
          "wordCount": 777,
          "title": "Machinarium is selling the best merch: a bronze statuette of its adorable star"
        },
        {
          "id": "https://www.rockpapershotgun.com/inscryption-review",
          "author": "Brendan Caldwell",
          "description": "Be afraid. Inscryption is both a love letter to card games and a twisted, jocular caricature of their numerical excess. It had me grinning ear to ear, sometimes nervously, sometimes with the joy of someone who simply loves thumbing through new cards, even when a rustic antagonist with big hands is reaching for my throat. This is not your average deckbuilder. It's a card game with an escape room built on top, and other sinister secrets buried beneath. The depth of its rabbit hole isn't apparent at first. It starts off as a familiar card battler, if a little darkly themed. You are in a cabin, playing cards against a face shrouded in darkness. It seems like Slay The Spire or Hand Of Fate. \nThen the cards start talking.\nRead more",
          "link": "https://www.rockpapershotgun.com/inscryption-review",
          "publishedOn": "2021-10-18T15:00:00.000Z",
          "wordCount": 1992,
          "title": "Inscryption review: a sinister and excellently crafted card game with a darkly comic underbelly"
        },
        {
          "id": "https://www.rockpapershotgun.com/elden-ring-delayed-to-february-25th-2022",
          "author": "Alice O'Connor",
          "description": "In game development, the flow of time itself is convoluted, with projects centuries old phasing in and out, so we shouldn't be surprised that Bandai Namco have delayed the launch of Elden Ring. The long-awaited new game from the makers of Dark Souls was expected to launch on January 21st, but now it's due on February 25th. Sounds like the usual reason: they want more time to make it good, yeah? Oh, and supposed leaked gameplay footage is doing the rounds, though I warn you that it's a bad and disappointing clip.\nRead more",
          "link": "https://www.rockpapershotgun.com/elden-ring-delayed-to-february-25th-2022",
          "publishedOn": "2021-10-18T14:51:34.000Z",
          "wordCount": 888,
          "title": "Elden Ring delayed to February 25th, 2022"
        },
        {
          "id": "https://www.rockpapershotgun.com/succubus-censorship-on-by-default",
          "author": "Alice Bell",
          "description": "Sometimes a game is so clearly desperate for attention that you are loathe to give it any. Like that one guy whose entire brand is getting in loud quote-tweet arguments on Twitter every eight to ten weeks, you know both exactly what it wants, and that you shouldn't go there. For months now I have been getting regular emails from the Succubus devs, all of which contain 112% of my daily recommended nipple allowance, and I know - I know - I shouldn't be writing about it. It is an action-adventure-hell-titty game that is, on every level, very bad. But I am breaking my silence now because the censored version of it is, quite possibly, the funniest thing I have encountered in my recent memory, and accidentally better than anything the devs could have made on purpose. You win, Madmind Studio. You win.\nRead more",
          "link": "https://www.rockpapershotgun.com/succubus-censorship-on-by-default",
          "publishedOn": "2021-10-18T14:30:00.000Z",
          "wordCount": 792,
          "title": "Succubus has censorship on by default, and it's unintentionally the most hilarious thing I've ever seen"
        },
        {
          "id": "https://www.rockpapershotgun.com/say-hello-to-rps-new-guides-writers-rebecca-jones-and-hayden-hefford",
          "author": "Katharine Castle",
          "description": "After months of searching, I'm pleased to announce that the RPS guides team has finally added two fresh faces to its ranks. Please say hello to Rebecca Jones and Hayden Hefford.\nRead more",
          "link": "https://www.rockpapershotgun.com/say-hello-to-rps-new-guides-writers-rebecca-jones-and-hayden-hefford",
          "publishedOn": "2021-10-18T14:08:13.000Z",
          "wordCount": 871,
          "title": "Say hello to RPS' new guides writers, Rebecca Jones and Hayden Hefford"
        },
        {
          "id": "https://www.rockpapershotgun.com/oh-nope-microsofts-big-hint-at-fable-news-today-was-nothing",
          "author": "Alice O'Connor",
          "description": "Yesterday, Microsoft's Xbox Game Studios Publishing Twitter account offered what sure sounded like tantalising hints that Monday would bring big news on the mysterious upcoming new Fable game. Like, really sounded like. Like, totally sounded like the sort of obvious hint marketing campaigns drop when they're pretending it's a surprise but want you to know full well what's up. Nope. They've now deleted those tweets and apologised, saying no, no Fable news today. Oh.\nRead more",
          "link": "https://www.rockpapershotgun.com/oh-nope-microsofts-big-hint-at-fable-news-today-was-nothing",
          "publishedOn": "2021-10-18T11:46:09.000Z",
          "wordCount": 848,
          "title": "Oh, nope, Microsoft's big hint at Fable news today was nothing"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-jukebox",
          "author": "Hayden Hefford",
          "description": "Want a list of songs that play on the Back 4 Blood jukebox? A few missions into Act 1, you’ll come across the Bar Room Blitz mission. Sure, there are some story points about distracting zombies and saving people, but this mission is a smash-hit for one reason. There’s a jukebox that plays some very cool tunes in the background whilst you shoot, slash, and slaughter zombies from every angle. If you really like that one scene in Shaun Of The Dead, then this will be your fever dream.\nThis guide will show you all of the songs that you can hear on the Back 4 Blood jukebox, so that you can repeatedly replay Bar Room Blitz whilst waiting for someone to inevitably get Simon Pegg and Nick Frost to play the mission on Youtube.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-jukebox",
          "publishedOn": "2021-10-18T10:55:25.000Z",
          "wordCount": 1142,
          "title": "Back 4 Blood jukebox music list"
        },
        {
          "id": "https://www.rockpapershotgun.com/gotham-knights-trailer-introduces-its-baddies-the-court-of-owls",
          "author": "Alice O'Connor",
          "description": "If your reaction to hearing that the villains of Batman 'em up Gotham Knights are the Court of Owls is \"Hoo?\", 1) wow, good grief 2) you might want to watch these new trailers. Released over the weekend during the DC FanDome pow-o-rama, they introduce the secret society who pull Gotham's strings, as well as giving us a peek at the game's version of Penguin.\nRead more",
          "link": "https://www.rockpapershotgun.com/gotham-knights-trailer-introduces-its-baddies-the-court-of-owls",
          "publishedOn": "2021-10-18T09:46:44.000Z",
          "wordCount": 782,
          "title": "Gotham Knights trailer introduces its baddies, the Court of Owls"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-sunday-papers-614",
          "author": "Ed Thorn",
          "description": "Sundays are for inhaling the smell of a new book. Before you lean in, let's read this week's best writing about games.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-sunday-papers-614",
          "publishedOn": "2021-10-17T10:00:00.000Z",
          "wordCount": 1217,
          "title": "The Sunday Papers"
        },
        {
          "id": "https://www.rockpapershotgun.com/gta-the-trilogy-system-requirements-and-details-allegedly-leak",
          "author": "Graham Smith",
          "description": "Rockstar finally announced their long-rumoured Grand Theft Auto remasters a little over a week ago. Official confirmation that they were on the way hasn't stopped the leaks, however. A user of GTAForums has seemingly leaked a more detailed description of the games and their system requirements.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/gta-the-trilogy-system-requirements-and-details-allegedly-leak",
          "publishedOn": "2021-10-16T23:26:28.000Z",
          "wordCount": 988,
          "title": "GTA: The Trilogy system requirements and details allegedly leak"
        },
        {
          "id": "https://www.rockpapershotgun.com/dota-2s-next-hero-is-marci-from-the-dota-dragons-blood-anime",
          "author": "Graham Smith",
          "description": "Dota 2 is getting a new hero this autumn. It's Marci, the mute bodyguard from Netflix's Dota anime, Dota: Dragon's Blood. She'll join the game in an update \"coming soon.\"\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/dota-2s-next-hero-is-marci-from-the-dota-dragons-blood-anime",
          "publishedOn": "2021-10-16T22:42:10.000Z",
          "wordCount": 704,
          "title": "Dota 2's next hero is Marci from the Dota: Dragon's Blood anime"
        },
        {
          "id": "https://www.rockpapershotgun.com/tweet2doom-lets-you-play-doom-via-twitter",
          "author": "Graham Smith",
          "description": "Doom is now playable on Twitter - sort of. Thanks to Tweet2Doom bot, you can send replies to the account with a list of actions - move, turn, shoot, etc. - and get a video clip of Doom showing the results sent back to you. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/tweet2doom-lets-you-play-doom-via-twitter",
          "publishedOn": "2021-10-16T22:06:44.000Z",
          "wordCount": 830,
          "title": "Tweet2Doom lets you play Doom via Twitter"
        },
        {
          "id": "https://www.rockpapershotgun.com/rocksteadys-suicide-squad-gets-a-new-story-trailer",
          "author": "Graham Smith",
          "description": "Today's DC FanDome event brought another trailer for Rocksteady's Suicide Squad: Kill The Justice League. There's still no gameplay, but the story trailer filled out the world, its cast, and heck, it's good fun. Watch it below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/rocksteadys-suicide-squad-gets-a-new-story-trailer",
          "publishedOn": "2021-10-16T21:27:52.000Z",
          "wordCount": 761,
          "title": "Rocksteady's Suicide Squad gets a new story trailer"
        },
        {
          "id": "https://www.rockpapershotgun.com/epic-games-store-will-welcome-games-that-make-use-of-blockchain-tech",
          "author": "Graham Smith",
          "description": "Yesterday Valve told developers that they wouldn't allow games featuring NFTs or cryptocurrency on their digital storefront, Steam. Since then, Epic have followed up by telling The Verge that the Epic Games Store would be \"open to games that support cryptocurrency or blockchain-based assets.\"\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/epic-games-store-will-welcome-games-that-make-use-of-blockchain-tech",
          "publishedOn": "2021-10-16T20:48:45.000Z",
          "wordCount": 862,
          "title": "Epic Games Store will \"welcome games that make use of blockchain tech\""
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-dungeons-adds-roguelikelike-singleplayer-mode-this-december",
          "author": "Imogen Beckhelling",
          "description": "Minecraft Dungeons has finished telling its story through a number of DLCs that have released over the last year, but Mojang isn't done with the blocky Diablo-like just yet. They're introducing seasonal updates that they're calling Seasonal Adventures, adding progression systems, challenges and more - similar to the new Sea Of Thieves' Seasons. Season 1 will be called The Cloudy Climb, and it's coming this December. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-dungeons-adds-roguelikelike-singleplayer-mode-this-december",
          "publishedOn": "2021-10-16T19:10:00.000Z",
          "wordCount": 874,
          "title": "Minecraft Dungeons adds roguelikelike singleplayer mode this December"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecrafts-the-wild-update-will-add-excellent-frogs-after-caves-cliffs",
          "author": "Imogen Beckhelling",
          "description": "With Minecraft's Caves & Cliffs part 2 nearly upon us, Mojang have revealed the next big update that will follow it. Named The Wild Update, it'll focus on enhancing some of the existing areas we can explore and, importantly, adding colourful frogs! They'll arrive with the new Mangrove Swamp biome, along with tadpoles, fireflies and more. The Wild Update will also introduce the Deep Dark biome, which was supposed to arrive with Caves & Cliffs, but needed a little more time in the oven. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/minecrafts-the-wild-update-will-add-excellent-frogs-after-caves-cliffs",
          "publishedOn": "2021-10-16T19:05:00.000Z",
          "wordCount": 980,
          "title": "Minecraft's The Wild Update will add excellent frogs after Caves & Cliffs"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-will-soon-bundle-java-and-bedrock-editions-together",
          "author": "Imogen Beckhelling",
          "description": "For years and years, Minecraft's Java and Bedrock editions have lived apart, but Mojang finally have plans to unite them. They plan to package the two together next year as the Minecraft PC Bundle, so if you own one you'll get the other too. Ahead of this, both Java and Bedrock are coming to Xbox Game Pass for PC on November 2nd, which is lovely news. I've only ever owned Java, so it'll be nice to have the option to jump into Bedrock too.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-will-soon-bundle-java-and-bedrock-editions-together",
          "publishedOn": "2021-10-16T19:00:00.000Z",
          "wordCount": 814,
          "title": "Minecraft will soon bundle Java and Bedrock editions together"
        },
        {
          "id": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-165",
          "author": "Alice O'Connor",
          "description": "A week of goodbyes. Vid bud Colm waved goodbye on Monday, and Friday was the final shift at the news face for longtime evening freelancer Lauren Morton. She leaves us to join cheery RPS fanzine PC Gamer and they'll be lucky to have her, as we were. Say goodbye, gang.\nRead more",
          "link": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-165",
          "publishedOn": "2021-10-16T08:00:00.000Z",
          "wordCount": 1190,
          "title": "What are we all playing this weekend?"
        },
        {
          "id": "https://www.rockpapershotgun.com/portal-speedrunner-explains-their-wild-tricks-to-valve-developers",
          "author": "Lauren Morton",
          "description": "I'm constantly in awe of the wild tricks that speedrunners discover in just about any game they set their collective minds to. It's always a treat to hear developers being equally astounded though, and Valve's developers are no exception. Three of them recently got to have a chat with Portal speedrunner \"CantEven\" to ask about extremely calculated trick shots, weird save glitches, and all the other things that game developers don't always know about their own games.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/portal-speedrunner-explains-their-wild-tricks-to-valve-developers",
          "publishedOn": "2021-10-15T22:48:02.000Z",
          "wordCount": 920,
          "title": "Portal speedrunner explains their wild tricks to Valve developers"
        },
        {
          "id": "https://www.rockpapershotgun.com/twitch-are-confident-no-passwords-or-credit-cards-were-exposed-in-leak",
          "author": "Lauren Morton",
          "description": "Twitch were hit by a rather big source code and data breach earlier this month, which they say they've since been investigating. They've updated users again today, reiterating that the breach was made possible by a server configuration change and that they're confident no passwords, login credentials, or credit card numbers were exposed.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/twitch-are-confident-no-passwords-or-credit-cards-were-exposed-in-leak",
          "publishedOn": "2021-10-15T22:07:41.000Z",
          "wordCount": 772,
          "title": "Twitch are \"confident\" no passwords or credit cards were exposed in leak"
        },
        {
          "id": "https://www.rockpapershotgun.com/retro-sci-fi-thriller-the-invincible-now-has-a-proper-trailer",
          "author": "Lauren Morton",
          "description": "Retro-future sci-fi romp The Invincible is the upcoming thriller from some folks formerly of The Witcher, Cyberpunk, Dying Light, and others. It's based on the sci-fi novel of the same title from the 60s by Polish author Stanisław Lem. The first we saw of The Invincible last year was mostly a teaser set to some nice tunes, but now there's a full cutscene-style trailer to check out and it sure does look like some classic space stuff.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/retro-sci-fi-thriller-the-invincible-now-has-a-proper-trailer",
          "publishedOn": "2021-10-15T21:05:14.000Z",
          "wordCount": 880,
          "title": "Retro sci-fi thriller The Invincible now has a proper trailer"
        },
        {
          "id": "https://www.rockpapershotgun.com/steam-is-banning-games-with-nfts-and-cryptocurrency",
          "author": "Lauren Morton",
          "description": "Valve appear to be laying down some new rules for games on Steam, specifically games that involve trading or receiving cryptocurrancy and NFTs. The change has been shared by SpacePirate Games, developers of Age Of Rust, who say they were notified this week about the new prohibition. Over in the Steamworks portal, a new type of content that cannot be published on Steam has been added. \"Applications built on blockchain technology that issue or allow exchange of cryptocurrencies or NFTs.\"\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/steam-is-banning-games-with-nfts-and-cryptocurrency",
          "publishedOn": "2021-10-15T20:14:57.000Z",
          "wordCount": 900,
          "title": "Steam is banning games with NFTs and cryptocurrency"
        },
        {
          "id": "https://www.rockpapershotgun.com/lo-fi-adventure-chasing-static-is-now-out-with-some-classic-horror-puzzling",
          "author": "Lauren Morton",
          "description": "Chasing Static is both the name of this lo-fi Welsh horror story and also an accurate description of me attempting to track down a post about it on RPS. Someone's written about it. I just know it. Oh no, we've just mentioned it several times in a roundabout way. Well, I've finally pinned it down—chased the clues and cornered it now that it's launched and I can tell you a thing or two about it. Chasing Static is a swell and spooky story so far with a good chunk of classic horror game puzzling and just a bit of sudden scares. Come on and have a quick look.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/lo-fi-adventure-chasing-static-is-now-out-with-some-classic-horror-puzzling",
          "publishedOn": "2021-10-15T16:56:16.000Z",
          "wordCount": 966,
          "title": "Lo-fi adventure Chasing Static is now out with some classic horror puzzling"
        },
        {
          "id": "https://www.rockpapershotgun.com/ultimate-audio-bang-16-all-things-fps-merch",
          "author": "Ed Thorn",
          "description": "I've returned from my trip to the Lake District, with aching calves and a desire to talk about online shooters with Imogen. On this week's episode of the Ultimate Audio Bang, we don't chat sore muscles, instead, we focus on various Halloween events in games like Apex Legends and Rainbow Six: Siege, our thoughts on the Battlefield 2042 beta, Destiny 2 vaulting yet more stuff, and Call Of Duty: Vanguard finally introducing anti-cheat.\nRead more",
          "link": "https://www.rockpapershotgun.com/ultimate-audio-bang-16-all-things-fps-merch",
          "publishedOn": "2021-10-15T16:24:48.000Z",
          "wordCount": 852,
          "title": "Ultimate Audio Bang #16: all things FPS merch"
        },
        {
          "id": "https://www.rockpapershotgun.com/tfi-friday-three-indie-puzzle-games-with-slightly-melancholy-vibe",
          "author": "Alice Bell",
          "description": "The year has finally turned, reader. I am having discussions at home about putting the heating on. When I leave the office it isn't dark, but it's fuzzy around the edges. My knuckles are cold. It's the time of year, before the Skeleton War memes begin in earnest, to luxuriate in feeling a bit melancholy. It's healthy to feel sad sometimes, you know. Didn't you watch Inside Out? I did, and in my screening at the cinema a child called out \"Where's Bing Bong?\" when the heroic Bing Bong disappeared...\nThis week, I have collected three different puzzle games with very different vibes. I know I'm biased in favour of puzzle games more than the usual reader, but these ones are very good and worth a punt, and at least one should pique the old interest. And they all gave me that happy-sad feeling. Like, I want to wrap up in a blanket and play these games and maybe think about my granny a bit. That sort of feeling.\nRead more",
          "link": "https://www.rockpapershotgun.com/tfi-friday-three-indie-puzzle-games-with-slightly-melancholy-vibe",
          "publishedOn": "2021-10-15T15:45:00.000Z",
          "wordCount": 1529,
          "title": "TFI Friday: three indie puzzle games with slightly melancholy vibe"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-roblox-horror-games",
          "author": "Rebecca Jones",
          "description": "What are the best horror games in Roblox? It's October once again, so naturally our minds are turning to Halloween. There are so, so many horror games in the world to choose from, especially since it's a genre that lends itself so well to short indie offerings. What I'm getting at here is that there are tons of scary games on Roblox, and if you fancy giving some a go this spooky season, we've put together a list of all-time favourites and current big trends.\nYou might have seen \"scary corn game\" trending in Roblox circles recently, and if you're wondering why that is, it's because no-one can spell or pronounce Kalampokiphobia — the technical name for fear of corn. This game, which originally popped up on the platform earlier this year, looks set to be the big Roblox horror trend this Halloween, egged on by TikTok and YouTube jumpscare videos that have been doing the rounds. It's a pretty standard run-and-hide game with a truly ludicrous (but somehow still a bit creepy) stalker character pursuing you through a disorienting corn maze.\nHere's the link.\n Read more",
          "link": "https://www.rockpapershotgun.com/best-roblox-horror-games",
          "publishedOn": "2021-10-15T15:42:10.000Z",
          "wordCount": 1872,
          "title": "Best Roblox horror games: great scary games in Roblox"
        },
        {
          "id": "https://www.rockpapershotgun.com/mon-amour-is-the-most-crazed-loved-up-take-on-flappy-bird-youll-ever-see",
          "author": "Katharine Castle",
          "description": "It's been a banner week for Japanese indie game releases. First we had the delightful puzzle platformer ElecHead, now we have the latest from Onion Games, Mon Amour. It's a one-button score attack game in the same vein as Flappy Bird, only instead of piloting a dumpy chicken through a bunch of green pipes, here you're guiding a spinning, mustachioed man toward dozens of smoochable women. But before you arch that eyebrow at its somewhat questionable premise, yes, this is another entry from Onion Games where kissing saves the day, following in the esteemed footsteps of Chulip and Dandy Dungeon - and yes, it is every bit as mad and baffling (and exquisitely designed) as you'd expect.  \nRead more",
          "link": "https://www.rockpapershotgun.com/mon-amour-is-the-most-crazed-loved-up-take-on-flappy-bird-youll-ever-see",
          "publishedOn": "2021-10-15T15:38:35.000Z",
          "wordCount": 820,
          "title": "Mon Amour is the most crazed, loved up take on Flappy Bird you'll ever see"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-karlee",
          "author": "Hayden Hefford",
          "description": "Want to know the best build for Karlee in Back 4 Blood? Karlee isn’t one of the best characters in Back 4 Blood, but she still has some killer abilities that deserve a spot in your team. Most notably, Karlee can sense nearby hazards and Special Ridden, so you won’t be surprised when a Tallboy smashes around the corner. She also gets an extra quick inventory slot (used for defibrillators and stun guns) and increases the team’s use speed by 50%.\nThis guide will show you how to make the best Karlee build in Back 4 Blood, so you can stop staring at cards and start using them. Of course, you’ll need to unlock all the cleaners in Back 4 Blood before you can play as Karlee.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-karlee",
          "publishedOn": "2021-10-15T14:09:15.000Z",
          "wordCount": 1169,
          "title": "The best Back 4 Blood Karlee build"
        },
        {
          "id": "https://www.rockpapershotgun.com/song-of-farca-is-great-if-you-dont-take-it-personally",
          "author": "Sin Vega",
          "description": "Often a game can feel frustrating because you can't make decisions that you want to. I had this initially with Song Of Farca. It almost kept me from playing it further, until I came back at it with a different attitude instead, thanks to a few conversations I've had lately about player choice versus narrative.\nYou play as Izy Song, a hacking-based private investigator in a fictional, dystopian island in the near future. And she's kind of a fool.\nRead more",
          "link": "https://www.rockpapershotgun.com/song-of-farca-is-great-if-you-dont-take-it-personally",
          "publishedOn": "2021-10-15T14:00:00.000Z",
          "wordCount": 698,
          "title": "Song Of Farca is great if you don't take it personally"
        },
        {
          "id": "https://www.rockpapershotgun.com/far-cry-6-co-op-multiplayer",
          "author": "Ollie Toms",
          "description": "Want to know how to play Far Cry 6 in co-op multiplayer? Ubisoft's bombastic open-world FPS franchise is always best played with company. Double the players, double the devastation, after all. And Far Cry 6 has taken after its predecessors in offering players a couple of different ways to play the game in co-op. Whether you're looking for self-contained co-op missions or you want to play through the entire story with a friend, read on to find out how to set up Far Cry 6 for multiplayer.\nRead more",
          "link": "https://www.rockpapershotgun.com/far-cry-6-co-op-multiplayer",
          "publishedOn": "2021-10-15T13:57:47.000Z",
          "wordCount": 1297,
          "title": "How to play Far Cry 6 in co-op multiplayer mode"
        },
        {
          "id": "https://www.rockpapershotgun.com/crysis-2-3-remastered-are-out-now-making-the-trilogy-maximum-shiny",
          "author": "Alice O'Connor",
          "description": "All three games of the Crytek's super-powered shooter trilogy are now available fancied up with modern graphical bells and whistles, with Crysis 2 Remastered and Crysis 3 Remastered today following the first game's 2020 revamp. Given that developers Crytek were always years ahead of most shooters in shininess, the originals hardly look hideous but hey, you can pay for extra fancieness. The first game was always the best though.\nRead more",
          "link": "https://www.rockpapershotgun.com/crysis-2-3-remastered-are-out-now-making-the-trilogy-maximum-shiny",
          "publishedOn": "2021-10-15T13:33:01.000Z",
          "wordCount": 974,
          "title": "Crysis 2 & 3 Remastered are out now, making the trilogy maximum shiny"
        },
        {
          "id": "https://www.rockpapershotgun.com/rally-point-how-to-pay-the-deposit-and-enjoy-playing-strategy-games",
          "author": "Sin Vega",
          "description": "Strategy games are, as everyone knows, much like moving house. Whether it's your first, daunting one and you don't yet know that the whole \"most stressful thing in life\" line is a total lie, or you stopped counting house moves after your 15th, there's one obstacle that never stops getting in the way: the deposit.\r\n\nYou know you can pay it, theoretically. You could gather together the energy and focus it takes. It is not beyond you to learn how a new game works and take the time to situate yourself within its world. But doing it all at once? Right now? Ach. Now you're asking.\nThat's the deposit. And it prevents you from playing games you'd love.\nRead more",
          "link": "https://www.rockpapershotgun.com/rally-point-how-to-pay-the-deposit-and-enjoy-playing-strategy-games",
          "publishedOn": "2021-10-15T12:00:00.000Z",
          "wordCount": 2199,
          "title": "Rally Point: how to pay the deposit and enjoy playing strategy games"
        },
        {
          "id": "https://www.rockpapershotgun.com/call-of-duty-warzones-shiny-new-anti-cheat-might-have-leaked-already",
          "author": "Imogen Beckhelling",
          "description": "This week, Activision revealed Ricochet, their new kernel-level anti-cheat that will be used for Call Of Duty: Vanguard and Warzone. They've been in a constant battle with cheaters for ages now, so it's nice to see them stepping up their anti-cheat game. Unfortunately, Ricochet might have already leaked, and it's claimed cheat-makers are currently working on reverse-engineering it. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/call-of-duty-warzones-shiny-new-anti-cheat-might-have-leaked-already",
          "publishedOn": "2021-10-15T11:48:06.000Z",
          "wordCount": 874,
          "title": "Call Of Duty: Warzone's shiny new anti-cheat might have leaked already"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-jim",
          "author": "Hayden Hefford",
          "description": "Want to know the best build for Jim in Back 4 Blood? Jim is quick to take aim and fire thanks to his increased ADS speed, but damage is his real strength. With each precision kill, Jim gains 2.5% stacking damage, which stays until you are hit. This means you could increase Jim’s damage to ridiculous levels if you avoid damage. Oh, and he also gets a 10% boost to team weakspot damage, so it shouldn’t come as a surprise that Jim deserves a spot on your team in Back 4 Blood.\nThis guide will show you everything that you need to know to make the best Jim build in Back 4 Blood.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-jim",
          "publishedOn": "2021-10-15T10:59:40.000Z",
          "wordCount": 1308,
          "title": "The best Back 4 Blood Jim build"
        },
        {
          "id": "https://www.rockpapershotgun.com/gears-tactics-and-dirty-bomb-devs-working-on-a-new-sci-fi-game",
          "author": "Imogen Beckhelling",
          "description": "Splash Damage, the folks who made Gears Tactics and Brink, have announced they're working on a new sci-fi game. They've worked on a number of series created by other developers over the years, including Wolfenstein and Gears, but haven't made their own PC game since Dirty Bomb in 2014. It'll be interesting to see what they have in store - perhaps a first-person shooter like Wolfenstein: Enemy Territory? Or maybe something more strategic, given Gears Tactics' success.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/gears-tactics-and-dirty-bomb-devs-working-on-a-new-sci-fi-game",
          "publishedOn": "2021-10-15T10:22:41.000Z",
          "wordCount": 924,
          "title": "Gears Tactics and Dirty Bomb devs working on a new sci-fi game"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-hoffman",
          "author": "Hayden Hefford",
          "description": "Want to know the best build for Hoffman in Back 4 Blood? Hoffman is one of the best characters in Back 4 Blood, as he has a chance to find ammo when he kills Ridden, whilst also increasing the team’s max ammo capacity by 10%. As a bonus, he also carries an extra grenade so that you can make more zombies go boom.\nThis guide will show you everything you need to know to make the best Hoffman build in Back 4 Blood. However, don't expect to play as Hoffman straight away. You'll need to actually unlock all of the cleaners in Back 4 Blood first.\n \nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-hoffman",
          "publishedOn": "2021-10-15T09:59:26.000Z",
          "wordCount": 1224,
          "title": "The best Back 4 Blood Hoffman build"
        },
        {
          "id": "https://www.rockpapershotgun.com/deathloops-first-major-update-fixes-stuttering-adds-dlss-support",
          "author": "Alice O'Connor",
          "description": "Exactly one month after launch, Deathloop received its \"first major game update\" last night. Along with (hopefully?) fixing lingering issues with stuttering framerates, it has added DLSS support to give Nvidia folks a big FPS boost, fixed some crashes and other bugs, including a nasty one where a bad menu option would reset Colt's progress, and generally improved things. And this is the point where I think I'll finally play the game.\nRead more",
          "link": "https://www.rockpapershotgun.com/deathloops-first-major-update-fixes-stuttering-adds-dlss-support",
          "publishedOn": "2021-10-15T09:52:58.000Z",
          "wordCount": 1014,
          "title": "Deathloop's first \"major\" update fixes stuttering, adds DLSS support"
        },
        {
          "id": "https://www.rockpapershotgun.com/diablo-2-resurrecteds-servers-falling-over-due-to-modern-player-behaviour",
          "author": "Graham Smith",
          "description": "Diablo II: Resurrected launched to widespread and ongoing server issues. Today, a Blizzard community manager offered some insight into the nature of the problem - and it's partly some 20-year-old code, and partly some modern player behaviour.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/diablo-2-resurrecteds-servers-falling-over-due-to-modern-player-behaviour",
          "publishedOn": "2021-10-14T23:21:27.000Z",
          "wordCount": 1046,
          "title": "Diablo 2 Resurrected's servers falling over due to \"modern player behaviour\""
        },
        {
          "id": "https://www.rockpapershotgun.com/fifa-reportedly-wants-double-the-old-licence-fee-from-ea",
          "author": "Graham Smith",
          "description": "Last week, EA said they were considering renaming FIFA, their long-running football series. The issue is that their licensing deal with football's world governing body is up for renewal. Now a report by the New York Times says that the issue is that FIFA want double what they were getting before for EA to continue using the name.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/fifa-reportedly-wants-double-the-old-licence-fee-from-ea",
          "publishedOn": "2021-10-14T22:09:55.000Z",
          "wordCount": 872,
          "title": "FIFA reportedly wants double the old licence fee from EA"
        },
        {
          "id": "https://www.rockpapershotgun.com/dungeon-encounters-is-out-now-offering-encounters-in-dungeons",
          "author": "Graham Smith",
          "description": "Sometimes a functional game strikes me as bland or forgettable. Dungeon Encounters appeals to me, oddly. I look at this game about exploring 99 levels of a dungeon, fighting enemies using an iteration of Final Fantasy's Active Time Battle System, designed by the man who created it, and I think: yes, you should be called Dungeon Encounters.\r\n\nIt's out now, and there's a new launch trailer below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/dungeon-encounters-is-out-now-offering-encounters-in-dungeons",
          "publishedOn": "2021-10-14T21:28:06.000Z",
          "wordCount": 777,
          "title": "Dungeon Encounters is out now, offering encounters in dungeons"
        },
        {
          "id": "https://www.rockpapershotgun.com/call-of-duty-vanguards-zombie-mode-shows-new-supernatural-powers",
          "author": "Graham Smith",
          "description": "Call Of Duty: Vanguard has finally revealed its zombie mode. It continues the zombies storyline from the Black Ops series, returning to WW2, where you'll be fighting Nazi zombies with the aid of new 'Dark Aether' powers. The reveal trailer is below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/call-of-duty-vanguards-zombie-mode-shows-new-supernatural-powers",
          "publishedOn": "2021-10-14T21:08:02.000Z",
          "wordCount": 746,
          "title": "Call Of Duty: Vanguard's Zombie mode shows new supernatural powers"
        },
        {
          "id": "https://www.rockpapershotgun.com/is-this-the-cheapest-4tb-ssd-ever-312-for-a-samsung-870-qvo",
          "author": "Will Judd",
          "description": "The massive 4TB Samsung 870 Qvo has hit a historic low price at Newegg, where you can use code EMCXHEHU2 to knock this drive from $390 to just $312. That's an incredible price for a high-speed SATA SSD, just 8¢ per gigabyte (!!). \nRead more",
          "link": "https://www.rockpapershotgun.com/is-this-the-cheapest-4tb-ssd-ever-312-for-a-samsung-870-qvo",
          "publishedOn": "2021-10-14T20:20:51.000Z",
          "wordCount": 848,
          "title": "Is this the cheapest 4TB SSD ever? $312 for a Samsung 870 Qvo"
        },
        {
          "id": "https://www.rockpapershotgun.com/lenovos-legion-5-pro-rtx-3070-laptop-is-back-in-stock-and-10-off",
          "author": "Will Judd",
          "description": "Lenovo's Legion 5 Pro 16 hits the current sweet spot for a high-end gaming laptop: an RTX 3070 graphics card, an AMD Ryzen 7 5800H processor and a 2560x1600 165Hz screen. These screens are a new addition for 2021, and make a massive difference when it comes to the amount of visible detail for playing games or just browsing the web.\nThis particular laptop has been out of stock for some time, but it's finally returned to Lenovo's online store - and you can get it for 10% off when you sign up to Lenovo's email newsletter. That knocks £150 off the price, bringing this high-spec laptop to £1350.\nRead more",
          "link": "https://www.rockpapershotgun.com/lenovos-legion-5-pro-rtx-3070-laptop-is-back-in-stock-and-10-off",
          "publishedOn": "2021-10-14T19:44:19.000Z",
          "wordCount": 927,
          "title": "Lenovo's Legion 5 Pro RTX 3070 laptop is back in stock and 10% off"
        },
        {
          "id": "https://www.rockpapershotgun.com/paradox-considered-cancelling-vampire-the-masquerade-bloodlines-2",
          "author": "Alice O'Connor",
          "description": "When Paradox Interactive made the remarkable decision to take Vampire: The Masquerade - Bloodlines 2 away from its original developers, Hardsuit Labs, the company considered outright cancelling the game. That's according to returning CEO Fredrik Wester in a recent interview. Paradox still aren't saying who's making the World Of Darkness RPG now nor when it will be done, but apparently it's still happening?\nRead more",
          "link": "https://www.rockpapershotgun.com/paradox-considered-cancelling-vampire-the-masquerade-bloodlines-2",
          "publishedOn": "2021-10-14T19:22:07.000Z",
          "wordCount": 1081,
          "title": "Paradox considered cancelling Vampire: The Masquerade - Bloodlines 2"
        },
        {
          "id": "https://www.rockpapershotgun.com/baldurs-gate-3-has-added-a-sorcerer-class-and-new-region-in-latest-patch",
          "author": "Alice O'Connor",
          "description": "As Baldur's Gate 3 continues its adventure through early access, the fantasy RPG from the makers of Divinity: Original Sin has whacked in a load of newness. Patch 6 hit today to continue the story, add a Sorcerer class, open the new region called Grymforge, and spruce up the graphics. Some might focus on those big features, me I'm all about a little one: a Sorcerer spell which lets you turn characters tiny or giant. We'll see who's a tadpole now!\nRead more",
          "link": "https://www.rockpapershotgun.com/baldurs-gate-3-has-added-a-sorcerer-class-and-new-region-in-latest-patch",
          "publishedOn": "2021-10-14T17:37:05.000Z",
          "wordCount": 998,
          "title": "Baldur's Gate 3 has added a Sorcerer class and new region in latest patch"
        },
        {
          "id": "https://www.rockpapershotgun.com/sweat-shar-and-sorcerers-make-for-a-killer-new-update-for-baldurs-gate-3",
          "author": "Matthew Castle",
          "description": "Larian put blood, sweat and tears into Baldur’s Gate 3’s latest patch. I mean, they’ve literally put them in: venture into the scorching heat of a subterranean forge and you’ll see a greasy sheen on your hero’s face during conversational close-ups. Get blood spattered on you in battle and it’ll remain until you take a long rest to wash it away. Same goes for dirt, and bruises that bloom at low health. “We want you to feel you’ve been adventuring a bit,” says lead systems designer Nick Pechenin, “rather than just stepping out of a modelling agency.”\r\n\n\r\nIf he’d seen the potato-faced oddballs I’ve repeatedly made in character creation (saves are not compatible between big patches) Pechenin would not be so generous. Even so, I like seeing heroes wearing evidence of their travels. An earlier patch already made the camping system feel more demanding - a small price in food means you can’t just spam it after every fight - and now those longer treks between naps can visually sell you on the difficult journey heroes are undertaking, too. A journey that, with patch six, has gotten a little longer.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/sweat-shar-and-sorcerers-make-for-a-killer-new-update-for-baldurs-gate-3",
          "publishedOn": "2021-10-14T17:30:00.000Z",
          "wordCount": 2140,
          "title": "Sweat, Shar and sorcerers make for a killer new update for Baldur’s Gate 3"
        },
        {
          "id": "https://www.rockpapershotgun.com/elechead-review",
          "author": "Katharine Castle",
          "description": "ElecHead is one of those devilishly clever puzzle platformers that delights at every turn. Developed by solo dev NamaTakahashi, you play as the titular Elec, a tiny robot whose body can electrify whatever surface he touches, causing it to light up a dazzling shade of yellow in the dark halls of a strange, underground facility. \nTechnically, it's his head where his electrical currents stem from, which you quickly learn how to throw in order to flip switches from afar, create new platforms and dodge deadly obstacles in order to get from one side of the room to the other. The catch? Elec's body only has ten seconds of power left when he's without his head, causing him to explode if he doesn't reach it in time. The result is a stunningly good puzzle game whose bank of brilliantly conceived ideas is executed to perfection, and it left me with a big fat grin on my face for the whole of its three hour run-time.\nRead more",
          "link": "https://www.rockpapershotgun.com/elechead-review",
          "publishedOn": "2021-10-14T16:35:20.000Z",
          "wordCount": 1428,
          "title": "ElecHead review: a clever puzzle platformer with real spark"
        },
        {
          "id": "https://www.rockpapershotgun.com/far-cry-6-secret-ending",
          "author": "Ollie Toms",
          "description": "Want to know how to get the secret ending in Far Cry 6? If you've played previous entries in Ubisoft's long-running open-world FPS series, you'll likely have come to expect a secret ending somewhere early on. But fittingly for a game of this scale, in Far Cry 6 the secret ending comes not right at the very beginning, but a few hours into the game once everything starts to open up. Keep reading to learn exactly what to do to unlock Far Cry 6's secret ending.\nRead more",
          "link": "https://www.rockpapershotgun.com/far-cry-6-secret-ending",
          "publishedOn": "2021-10-14T15:46:07.000Z",
          "wordCount": 1194,
          "title": "Far Cry 6 secret ending"
        },
        {
          "id": "https://www.rockpapershotgun.com/a-windows-11-update-made-amd-performance-even-worse",
          "author": "James Archer",
          "description": "The problems keep coming for Windows 11. Besides missing gaming features and a vote of no confidence by cloud PC providers, perhaps the worst of it has been a bug that drastically increases L3 cache latency on most AMD chips. That includes some of the best CPUs for gaming, like the Ryzen 5 5600X, and while both AMD and Microsoft have promised fixes, an unrelated Windows 11 update appears to have made the problem even worse.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/a-windows-11-update-made-amd-performance-even-worse",
          "publishedOn": "2021-10-14T15:45:46.000Z",
          "wordCount": 871,
          "title": "A Windows 11 update made AMD performance even worse"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-electronic-wireless-episode-160-the-best-cities-in-games-special",
          "author": "Alice Bell",
          "description": "This week the Electronic Wireless Show podcast is going the place you can always go when you're alone and life is making you lonely. That's right: down town! We're talking about our favourite cities in games, although we spend a lot of time talking about city builders even though we decide they probably don't meet the brief.\nSurprisingly, though, we talk about games so much this week that we run out of time to do a Cavern Of Lies! Even though I had actually prepared one! Unprecedented scenes. Don't worry, though, because there are plenty of diversions this week too, including Nate's unwise excursion into green milk, and Matthew eating something he shouldn't ought to have ate.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-electronic-wireless-episode-160-the-best-cities-in-games-special",
          "publishedOn": "2021-10-14T15:25:35.000Z",
          "wordCount": 913,
          "title": "EWS podcast episode 160: the best cities special"
        },
        {
          "id": "https://www.rockpapershotgun.com/back-4-blood-doc",
          "author": "Hayden Hefford",
          "description": "Want to know the best build for Doc in Back 4 Blood? Doc is the resident healer in Back 4 Blood, so she takes on a supportive role like Mom. Doc’s passive bonuses allow her to heal each teammate for 25 health once per level, whilst also increasing her healing efficiency and the team’s trauma resistance. However, you'll need to know how to unlock all cleaners in Back 4 Blood before you can select Doc in your campaign.\nThis guide will show you everything that you need to know to create the best Doc build in Back 4 Blood, so that you can keep your teammates at the top of their game.\nRead more",
          "link": "https://www.rockpapershotgun.com/back-4-blood-doc",
          "publishedOn": "2021-10-14T15:13:42.000Z",
          "wordCount": 1341,
          "title": "The best Back 4 Blood Doc build"
        },
        {
          "id": "https://www.rockpapershotgun.com/battlefield-2042s-hazard-zone-mode-strikes-me-as-a-bit-hunt-showdown",
          "author": "Ed Thorn",
          "description": "Multiplayer FPS Battlefield 2042's Conquest and Breakthrough modes are largely about shooting bullets across vast distances on a vast map while trying to capture a vast number of objectives. They are vast, mate. But the newly revealed Hazard Zone mode? Nope, this is smaller, more survival-oriented, with a hint of Hunt: Showdown.\nRead more",
          "link": "https://www.rockpapershotgun.com/battlefield-2042s-hazard-zone-mode-strikes-me-as-a-bit-hunt-showdown",
          "publishedOn": "2021-10-14T15:01:46.000Z",
          "wordCount": 1033,
          "title": "Battlefield 2042's Hazard Zone mode strikes me as a bit Hunt: Showdown"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-good-life-review",
          "author": "Steve Hogarty",
          "description": "The Good Life – which has nothing to do with the 1970s British television show about a couple of doom-prepping swingers who owned an allotment in Surbiton – is a colourful open world adventure in which you play an investigative photographer charged with uncovering the secrets of an idyllic English town.\r\n\n\r\nLike so many of Swery’s previous games, most notably Deadly Premonition, The Good Life is characteristically goofy and haphazard. It can be broadly categorised as a daily life simulator — in the vein of Stardew Valley and Animal Crossing, but not like either of those — with a Pokémon Snap style camera mechanic in which you take photographs of interesting things and people about town for kudos and cash rewards. You can also turn into a dog or a cat whenever you like.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-good-life-review",
          "publishedOn": "2021-10-14T15:00:00.000Z",
          "wordCount": 1667,
          "title": "The Good Life review: tonally stupid, structurally broken, surprisingly deep and occasionally self-aware"
        }
      ]
    },
    {
      "title": "Root.cz - články",
      "feedUrl": "https://www.root.cz/rss/clanky/",
      "siteUrl": "https://www.root.cz/clanky/",
      "articles": [
        {
          "id": "www.root.cz-text-15722",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "Pro výuku programování se velmi často používají jazyky s grafickým výstupem. Výjimkou není ani Basic-256, který obsahuje grafickou plochu s podporou vykreslení běžných 2D entit, jednotlivých pixelů, ale i zobrazení pohyblivých spritů.",
          "link": "https://www.root.cz/clanky/zaklady-prace-s-grafickou-plochou-v-jazyku-basic-256/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-20T22:00:15.000Z",
          "wordCount": 5133,
          "title": "Základy práce s grafickou plochou v jazyku Basic-256",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/617/basic-256-1.jpg",
            "length": "43682",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15553",
          "author": "redakce@root.cz (Root.cz: Karel Kulhavý)",
          "description": "Softwarově změříme ostrost obrazu, abychom zjistili skutečné zvýšení rozlišení díky jeho použití. Matematiky možná potěší vlastní funkce Fourierovy transformace a centrální limitní věta.",
          "link": "https://www.root.cz/clanky/matematicke-mereni-rozliseni-softwarove-korigovaneho-dalekohledu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-20T22:00:10.000Z",
          "wordCount": 2420,
          "title": "Matematické měření rozlišení softwarově korigovaného dalekohledu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/426/dalekohled-1.jpg",
            "length": "42720",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15674",
          "author": "redakce@root.cz (Root.cz: Pavel Herout)",
          "description": "V poslední třetí části budou popisovány různé možnosti výsledného formátování výstupů, které dokáží výrazně ovlivnit logovanou informaci. Na závěr bude uveden realističtější příklad použití, ze které vyplynou možné kombinace.",
          "link": "https://www.root.cz/clanky/logovani-v-php-ruzne-moznosti-vysledneho-formatovani-vystupu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-19T22:00:10.000Z",
          "wordCount": 2371,
          "title": "Logování v PHP: různé možnosti výsledného formátování výstupů",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/516/php-1.jpg",
            "length": "42482",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15719",
          "author": "redakce@root.cz (Root.cz: Jiří Sluka)",
          "description": "Dnes si představíme platformu pro ladění mobilních aplikací, vyzkoušíme Visual Studio Code bez telemetrie, začneme používat Signal i mimo mobilní zařízení a nakonec navrhneme větrnou turbínu.",
          "link": "https://www.root.cz/clanky/softwarova-sklizen-20-10-2021/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-19T22:00:05.000Z",
          "wordCount": 904,
          "title": "Softwarová sklizeň (20. 10. 2021)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/root/368/kombajn-sklizen.jpg",
            "length": "394618",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15717",
          "author": "redakce@root.cz (Root.cz: Václav Steiner)",
          "description": "CZ.NIC se rozhodl, že obě IPv6 tunelovací technologie na zkoušku vypne 25. října 2021 na dobu 24 hodin. Pokud se nestane nic neočekávaného, budou servery definitivně vypnuty už 1. listopadu 2021. Proč k tomu dojde?",
          "link": "https://www.root.cz/clanky/cz-nic-zkusebne-vypne-tunelovaci-technologie-teredo-a-6to4-pro-ipv6/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-18T22:00:10.000Z",
          "wordCount": 1441,
          "title": "CZ.NIC zkušebně vypne tunelovací technologie Teredo a 6to4 pro IPv6",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/258/cervene-tlacitko-1.jpg",
            "length": "26088",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15718",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "Prozatím poslední moderní reinkarnací programovacího jazyka BASIC, s níž se seznámíme, je Basic-256. Opět se jedná o jazyk (a vývojové prostředí) určené primárně pro výuku programování, které navíc podporuje i práci s grafikou.",
          "link": "https://www.root.cz/clanky/basic-256-dalsi-moderni-reinkarnace-basicu-urcena-pro-vyuku-programovani/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-18T22:00:05.000Z",
          "wordCount": 5566,
          "title": "Basic-256: další moderní reinkarnace BASICu určená pro výuku programování",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/617/basic-256-1.jpg",
            "length": "43682",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15714",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Kódové jméno Ubuntu 22.04 LTS odhaleno. Vyšlo OpenBSD 7.0. Vznikl alternativní klient pro Snap, který umí pracovat i s repozitáři mimo Canonical. Společnost Pine64 zahájila předobjednávky pro svůj telefon PinePhone Pro.",
          "link": "https://www.root.cz/clanky/kodove-jmeno-ubuntu-22-04-lts-odhaleno-vyslo-openbsd-7-0/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-18T10:44:34.000Z",
          "wordCount": 1083,
          "title": "Kódové jméno Ubuntu 22.04 LTS odhaleno, vyšlo OpenBSD 7.0",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/67/jammy-jellyfish-1.jpg",
            "length": "27420",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15715",
          "author": "redakce@root.cz (Root.cz: CSIRT.CZ)",
          "description": "Dnes se podíváme na jemnou hodinářskou práci útočníků při získávání OTP hesel, koukneme se na nové povinnost provozovatelů informačních systémů a také na to, co můžeme čekat v oblasti kybernetické bezpečnosti od nové vlády.",
          "link": "https://www.root.cz/clanky/postrehy-z-bezpecnosti-co-odhalil-phishing-na-coinbase/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-17T22:00:10.000Z",
          "wordCount": 1949,
          "title": "Postřehy z bezpečnosti: co odhalil phishing na CoinBase",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/625/phishing-1.jpg",
            "length": "29162",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15716",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Ubuntu 21.10, nový referenční AV1 kodér, 25 let KDE a Plasma 5.23, nový linuxový smartphone PinePhone Pro, změny v systému aktualizací openSUSE Leap, Strawberry 1.0, fork Clementine běžící na Qt6.",
          "link": "https://www.root.cz/clanky/prvni-xbox-mel-mit-cpu-od-amd-apple-je-sponzorem-blenderu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-16T22:00:10.000Z",
          "wordCount": 1615,
          "title": "První Xbox měl mít CPU od AMD, Apple je sponzorem Blenderu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/219/strawberry-1-0-1.png",
            "length": "221821",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-text-15713",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Adobe už léta hlásá konec Flashe. Dokonce i oficiálně začátkem roku 2021 skončil. Přesto právníci Adobe využívají DMCA, aby vynutili konec alternativního projektu instalátoru Flashe v čínské variantě.",
          "link": "https://www.root.cz/clanky/adobe-flash-jeste-neni-mrtvy-firma-dal-tvrde-potira-souvisejici-projekty/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-14T22:00:10.000Z",
          "wordCount": 1610,
          "title": "Adobe Flash ještě není mrtvý: firma dál tvrdě potírá související projekty",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/668/flash-1.jpg",
            "length": "50926",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "Root.cz - zprávičky",
      "feedUrl": "https://www.root.cz/rss/zpravicky/",
      "siteUrl": "https://www.root.cz/zpravicky/",
      "articles": [
        {
          "id": "www.root.cz-actuality-42931",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Dodavatelské řetězce jsou nestabilní a projevuje se to dlouhými lhůtami na dodávku součástek a narůstajícími cenami. Zasáhlo to také výrobce jednodeskových počítačů Raspberry Pi, který musel poprvé v historii zvýšit cenu modelu RPi 4 zpět z 35 na 45 dolarů. Eben Upton zdůrazňuje, že jde o dočasné zdražení.",
          "link": "https://www.root.cz/zpravicky/raspberry-pi-4-s-2-gb-pameti-docasne-zvysuje-cenu-z-35-na-45-dolaru/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-21T10:45:52.000Z",
          "wordCount": 867,
          "title": "Raspberry Pi 4 s 2 GB paměti dočasně zvyšuje cenu z 35 na 45 dolarů",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/9/raspberry-pi-4-1.jpg",
            "length": "58435",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42930",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Nová verze webového prohlížeče Brave 1.31 je spojena s přechodem na vlastní vyhledávač jako výchozí – v USA, Kanadě a UK nahrazuje Google, ve Francii střídá Qwant, v Německu zase v Brave přecházejí z DuckDuckGo. Další země se budou přidávat postupně. Uživatelé samozřejmě mohou změnit na jakýkoli jiný a stávajícím uživatelům samozřejmě zůstává jejich nastavení. Brave Search má vlastní nezávislý index i engine, nesleduje uživatele ani jejich vyhledávání a kliknutí. V tuto chvíli nezobrazuje reklamy, ale v budoucnu bude reklamami podporován (plus bude možné používat Premium službu bez reklam).",
          "link": "https://www.root.cz/zpravicky/brave-1-31-s-brave-search-jako-vychozim-vyhledavacem/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-20T15:33:12.000Z",
          "wordCount": 955,
          "title": "Brave 1.31 s Brave Search jako výchozím vyhledávačem",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/693/prohlizec-brave-1.jpg",
            "length": "36009",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42929",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Nový 5nm procesor Google Tensor, displej s 90Hz a HDR10+, sklo Gorilla Glass Victus, nová baterie foťáků s podporou 4k/60p videa či 30W nabíjení s USB PD a samozřejmě Android 12, to jsou v základu nové Pixely od Googlu.",
          "link": "https://www.root.cz/zpravicky/google-predstavil-telefony-pixel-6-a-pixel-6-pro-s-vlastnim-5nm-cipem-tensor/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-20T09:40:52.000Z",
          "wordCount": 2343,
          "title": "Google představil telefony Pixel 6 a Pixel 6 Pro s vlastním 5nm čipem Tensor",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/301/google-pixel-6-1.jpg",
            "length": "37354",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-39529",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Docker je dnes technologie, která proces vývoje, testování a provozování softwaru velmi zjednodušuje. Provozujte cokoliv a kdekoliv. Už nečekejte na nastavení svého serveru nebo na aktualizaci nějaké knihovny. Mějte prostředí jako součást vaší aplikace.",
          "link": "https://www.root.cz/zpravicky/naucte-se-pracovat-s-dockerem-a-kontejnery-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-20T08:13:05.000Z",
          "wordCount": 790,
          "title": "Naučte se pracovat s Dockerem a kontejnery (školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/666/docker-logo-1.jpg",
            "length": "23650",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42927",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Nosná téma meetupu: CI/CD & DevOps culture, 20.10.2021 od 18:00 do 20:00.",
          "link": "https://www.root.cz/zpravicky/24-stretnutie-komunity-cloud-native-kubernetes-online-1/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-20T08:00:32.000Z",
          "wordCount": 872,
          "title": "24. stretnutie komunity Cloud Native – Kubernetes online",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/275/kubernetes-1.jpg",
            "length": "25370",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42928",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Na světě je nová verze webového prohlížeče Google Chrome (a též Chromium). Mezi novinkami přináší jednodušší routování pomocí URLPattern přímo v prohlížeči, dále API Eye Dropper poskytující zabudovaný nástroj pro výběr barev. Další novinky nalezneme v origin trials (například user-agent reduction).",
          "link": "https://www.root.cz/zpravicky/chrome-95-prinasi-urlpattern-ci-api-eye-dropper/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-20T06:38:05.000Z",
          "wordCount": 770,
          "title": "Chrome 95 přináší URLPattern či API Eye Dropper",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/198/chromium-vs-chrome-1.jpg",
            "length": "60818",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42923",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Společnost Apple má mezi svými produkty v nabídce čisticí hadřík. Koupí získá zákazník produkt vhodný k očištění jakýchkoli displejů Apple, včetně těch s nanotexturou. Seznam kompatibilních produktů je velmi dlouhý a logo Apple na hadříku Apple velmi povedené a dojem dokonalého výrobku podtrhuje cenovka 590 Kč.",
          "link": "https://www.root.cz/zpravicky/apple-prodava-hadrik-za-590-kc/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-19T13:30:00.000Z",
          "wordCount": 6319,
          "title": "Apple prodává hadřík za 590 Kč",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/63/eugene-atget-1.jpg",
            "length": "74222",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42922",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Raspberry Pi představuje novou rozšiřující desku pro své minipočítače. Raspberry Pi Build HAT umožní připojit k Raspberry Pi snímače či motory systému LEGO Technics / LEGO Education SPIKE, resp. oblíbené stavebnice LEGO Mindstorms (a další s konektorem LPF2). Raspberry Pi navíc mezi produkty přidává potřebné příslušenství jak na poli hardwaru (napájecí 48W zdroj, který se postará i o napájení samotného Raspberry Pi), tak na poli softwaru (Python Build HAT).",
          "link": "https://www.root.cz/zpravicky/raspberry-pi-build-hat-propoji-malinu-s-lego-technics-mindstorms/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-19T12:54:48.000Z",
          "wordCount": 1772,
          "title": "Raspberry Pi Build HAT propojí malinu s LEGO Technics / Mindstorms",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/641/raspberry-pi-build-hat-1.jpg",
            "length": "80003",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42921",
          "author": "redakce@root.cz (Root.cz: Michal Smrž)",
          "description": "Valve v rámci zkonzolovatění Linuxu na Decku spustilo hodnocení her, jak zákazníkům na Decku poběží. Hodnocení zahrnuje následující varianty:",
          "link": "https://www.root.cz/zpravicky/steam-deck-verified-hodnoceni-bezproblemovosti-chodu-her/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-19T11:33:00.000Z",
          "wordCount": 743,
          "title": "Steam Deck Verified: hodnocení bezproblémovosti chodu her",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/92/steam-deck-1.jpg",
            "length": "39877",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42920",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Dva nové čipy pro své počítače představil Apple v souvislosti s novými Macbooky Pro. Firma navyšuje počet CPU i GPU jader a hovoří až o 70 % vyšším CPU výkonu oproti M1 a o 2× rychlejším GPU v M1 Pro, resp. 4× rychlejším v M1 Max. Jinými slovy: už tak rychlé a úsporné řešení jménem Apple M1 v nových Macboocích Pro bude značně rychlejší a nikdo nemůže ani vzdáleně hovořit o tom, že by bylo (z hlediska výkonu) lepší, kdyby s Apple vrátil k Intelu (což je mimochodem plán Pata Gelsingera).",
          "link": "https://www.root.cz/zpravicky/apple-predstavil-az-10jadrova-soc-m1-pro-a-m1-max/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-18T22:00:00.000Z",
          "wordCount": 6939,
          "title": "Apple představil až 10jádrová SoC M1 Pro a M1 Max",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/535/apple-m1-pro-max-1.png",
            "length": "280919",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42919",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Canon USA je žalován kvůli multifunkčním all-in-one tiskárnám PIXMA MG6320, MG5420 a MX860, které s prázdnými zásobníky inkoustu odmítají skenovat i když k tomu žádný inkoust potřeba není. Na problém si stěžovalo přes dva tisíce uživatelů, ale Canon jim odpověděl, že je potřeba vyměnit zásobník s inkoustem.",
          "link": "https://www.root.cz/zpravicky/zaloba-na-canon-protoze-nejde-skenovat-bez-inkoustu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-18T15:40:19.000Z",
          "wordCount": 5414,
          "title": "Žaloba na Canon: není možné skenovat bez inkoustu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/231/canon-pixma-mg6320.jpg",
            "length": "33616",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42918",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Ve čtvrtek Interplay Entertainment oznámil, že aktualizoval spoustu klasických her na Steamu, aby fungovaly v Linuxu a macOS. Většinou půjde o přidání DOSBoxu. V seznamu her od Inteplay uvidíte nově velké množství her spustitelných v Linuxu (logo Steam). Jde třeba o Battle Chess, Battle Chess II: Chinese Chess, Battle Chess 4000, Descent a Descent 2.",
          "link": "https://www.root.cz/zpravicky/interplay-aktualizoval-spoustu-klasickych-her-aby-fungovaly-v-linuxu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-18T13:43:50.000Z",
          "wordCount": 1207,
          "title": "Interplay aktualizoval spoustu klasických her, aby fungovaly v Linuxu",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/357/descent-2-1.jpg",
            "length": "78569",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42917",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Obchod Google Play hlásí, že si oficiálního klienta Telegram stáhla více než miliarda uživatelů. Pavel Durov, zakladatel tohoto komunikačního nástroje, přitom na začátku letošního roku tvrdil, že jej měsíčně použije asi půl miliardy uživatelů. Překročení miliardového milníku bylo urychleno také nedávnými velkými výpadky Facebooku, které postihly také WhatsApp a Messenger a přivedly Telegramu desítky milionů nových uživatelů.",
          "link": "https://www.root.cz/zpravicky/telegram-dosahl-miliardy-stazeni-v-google-play/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-18T11:31:31.000Z",
          "wordCount": 1095,
          "title": "Telegram dosáhl miliardy stažení v Google Play",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/675/telegram-1.jpg",
            "length": "35220",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42916",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "WhatsApp přestane od 1. listopadu fungovat na Androidu 4.0.4 a starším. Ke svému běhu bude potřebovat alespoň Android 4.1.",
          "link": "https://www.root.cz/zpravicky/whatsapp-prestane-od-1-listopadu-fungovat-na-androidu-4-04-a-starsim/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-18T08:06:35.000Z",
          "wordCount": 1517,
          "title": "WhatsApp přestane od 1. listopadu fungovat na Androidu 4.0.4 a starším",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/564/whatsapp-1.jpg",
            "length": "53663",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42915",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "V rámci programu Artemis plánuje NASA návrat astronautů na Měsíc v roce 2024. Předtím bude na Měsíci vybudována síť LunaNet, která bude podobná jako WiFi s velkým počtem vysílačů. To umožní využívat také přesnou polohu a čas.",
          "link": "https://www.root.cz/zpravicky/mesic-bude-mit-svuj-internet-lunanet/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-18T06:11:28.000Z",
          "wordCount": 5002,
          "title": "Měsíc bude mít svůj internet LunaNet",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/28/nasa-astronaut-mesic-vlajka-1.jpg",
            "length": "63175",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42914",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Společnost PINE64 včera představila linuxový telefon PinePhone Pro, který je vylepšením původního PinePhone. Obsahuje SoC Rockchip RK3399S (2× A72 + 4× A53 na 1,5 GHz) a 4 GB RAM. Interní úložiště má 128 GB eMMC a je možné připojit SDCX kartu až do velikosti 2 TB.",
          "link": "https://www.root.cz/zpravicky/linuxovy-telefon-pinephone-pro/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-16T11:25:32.000Z",
          "wordCount": 2867,
          "title": "Linuxový telefon PinePhone Pro",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/682/pinephone-pro-1.jpg",
            "length": "16313",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42913",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Následující vydání oblíbené distribuce Ubuntu 22.04 LTS bude mít označení Jammy Jellyfish. Tedy šťastná medúza nebo také medúza marmeládové konzistence.",
          "link": "https://www.root.cz/zpravicky/ubuntu-22-04-lts-bude-jammy-jellyfish/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-16T10:57:59.000Z",
          "wordCount": 965,
          "title": "Ubuntu 22.04 LTS bude Jammy Jellyfish",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/52/meduza-1.jpg",
            "length": "36696",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42912",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Panel Self Refresh (PSR) je vlastnost DisplayPortu, která při statickém obrazu umožňuje snížení spotřeby. AMD konečně zapíná ve výchozím stavu PSR pro nové integrované grafické karty DCN v jádře 5.16.",
          "link": "https://www.root.cz/zpravicky/amd-konecne-zapina-ve-vychozim-stavu-panel-self-refresh-pro-nove-apu-v-jadre-5-16/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-15T12:29:18.000Z",
          "wordCount": 824,
          "title": "AMD konečně zapíná ve výchozím stavu Panel Self Refresh pro nové APU v jádře 5.16",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/654/amd-apu-1.jpg",
            "length": "20496",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42911",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Sysmon (system monitor) je nástroj od Sysinternals pro monitorování systémové aktivity a odhalení škodlivých programů. Včera Mark Russinovich z Microsoftu (je spoluzakladatel Sysinternals, který později Microsoft koupil) oznámil Sysmon pro Linux.",
          "link": "https://www.root.cz/zpravicky/microsoft-vydal-sysmon-pro-linux/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-15T12:04:00.000Z",
          "wordCount": 1589,
          "title": "Microsoft vydal Sysmon pro Linux",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/567/linux-windows-tux.png",
            "length": "121771",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-38836",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Automatizace pomocí continuous integration přímo v Gitlabu. CI vám pomůže automatizovat rutinní procesy a ušetří vám hromadu času. Pomůže vám od automatického testování, buildy po nasazování. Chcete vědět víc? Přijďte na naše školení GitLab CI, které se uskuteční 18. listopadu a proběhne plně online. Školí Ondřej Sika.",
          "link": "https://www.root.cz/zpravicky/gitlab-ci-automatizujte-primo-v-gitlabu-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-15T11:32:13.000Z",
          "wordCount": 752,
          "title": "Gitlab CI: automatizujte přímo v Gitlabu (školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/214/gitlab-ci-1.png",
            "length": "75559",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42910",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Claude Schwarz ve středu zveřejnil výsledek extrémního přetaktování Raspberry Pi Compute Module 4 až na 3 GHz.  K dosažení takového výsledku bylo potřeba odstranit víčko SoC a nahradit vodivou pastu lepším tekutým kovem Thermal Grizzly Conductonaut (obsahuje galium, cín a indium).",
          "link": "https://www.root.cz/zpravicky/extremni-pretaktovani-raspberry-pi-cm-4-na-3-ghz/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-15T07:06:04.000Z",
          "wordCount": 1394,
          "title": "Extrémní přetaktování Raspberry Pi CM 4 na 3 GHz",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/673/raspberry-pi-compute-module-4-1.jpg",
            "length": "54007",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42909",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Podle plánu vyšla nová verze Ubuntu 21.10 s kódovým jménem Impish Indri. Toto vydání bude podporováno devět měsíců, tedy do července 2022. Kromě hlavní verze Ubuntu jsou k dispozici také všechny oficiální odnože: Kubuntu, Lubuntu, Ubuntu Budgie, Ubuntu Kylin, Ubuntu MATE, Ubuntu Studio a Xubuntu.",
          "link": "https://www.root.cz/zpravicky/ubuntu-21-10-impish-indri-prinasi-wayland-na-kartach-nvidia/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-14T20:15:15.000Z",
          "wordCount": 1382,
          "title": "Ubuntu 21.10 Impish Indri přináší Wayland na kartách Nvidia",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/537/ubuntu-21-10-impish-indri-1.jpg",
            "length": "13671",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42908",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Rok a čtvrt po předchozím vydání je k dispozici nová verze distribuce Devuan s označením 4.0 a kódovým jménem Chimaera. Ten je postaven na čerstvém Debianu 11 Bullseye a vynechává z instalace závislost na systemd. Místo něj je možné si vybrat mezi SysVInit, Runit nebo OpenRC.",
          "link": "https://www.root.cz/zpravicky/devuan-4-0-chimaera-je-debian-11-bullseye-bez-systemd/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-14T20:01:35.000Z",
          "wordCount": 808,
          "title": "Devuan 4.0 Chimaera je Debian 11 Bullseye bez systemd",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/453/devuan-1.jpg",
            "length": "21885",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42902",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Vývojáři uvolnili novou verzi operačního systému OpenBSD s číselným označením 7.0. Zatímco budete stahovat čerstvé obrazy, můžete si přečíst o hlavních změnách, které nová verze přináší. Především je to nová platforma risc64 pro 64bitové procesory RISC-V. Plně podporována je zatím jen jediná deska HiFive Unmatched, ale na dalších se pracuje.",
          "link": "https://www.root.cz/zpravicky/openbsd-7-0-prinasi-podporu-pro-64bitove-procesory-risc-v/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-14T14:53:22.000Z",
          "wordCount": 843,
          "title": "OpenBSD 7.0 přináší podporu pro 64bitové procesory RISC-V",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/5/openbsd-ryba-notebook-1.jpg",
            "length": "50733",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42907",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Počítač Commodore 65 byl nikdy nevydaným nástupcem legendárního Commodore 64. Byl vyvinut mezi lety 1990 a 1991 a mělo jít o nejvýkonnější 8bitový počítač na trhu – měl 128K RAM, grafiku s rozlišením až 1280×400, stereo zvuk a 3,5\" disketovou mechaniku.",
          "link": "https://www.root.cz/zpravicky/mega65-moderni-verze-nikdy-nevydaneho-commodore-65/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-14T12:15:37.000Z",
          "wordCount": 1262,
          "title": "Mega65: moderní verze nikdy nevydaného Commodore 65",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/98/mega65-1.jpg",
            "length": "44187",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "abclinuxu - aktuální články",
      "feedUrl": "http://www.abclinuxu.cz/auto/abc.rss",
      "siteUrl": "http://www.abclinuxu.cz/clanky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-roste-podil-softwaru-ktery-vyuziva-umelou-inteligenci",
          "author": "Redakce",
          "description": "Podzimní smršť novinek od Aceru. SentinelOne v ČR nabere 300 lidí a investuje miliardu. Roste podíl softwaru, který využívá umělou inteligenci. Dodávky a ceny osobních počítačů z pohledu výrobce. VMworld: Zabezpečení na principu nulové důvěry.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-roste-podil-softwaru-ktery-vyuziva-umelou-inteligenci",
          "publishedOn": "2021-10-17T22:01:00.000Z",
          "wordCount": 1414,
          "title": "Týden na ITBiz: Roste podíl softwaru, který využívá umělou inteligenci"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-umela-inteligence-v-kooperativnich-hrach",
          "author": "Redakce",
          "description": "Nový typ magnetismu nezpůsobují spiny. Beethovenovu slavnou 10. symfonii dokončila umělá inteligence  Studium neuronových sítí může pomoci při zkoumání toho, jak se do mozku ukládají konspirační teorie. Minirobot se pohybuje díky gradientům teploty. Splynutí obřích černých děr provázejí nejen gravitační vlny.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-umela-inteligence-v-kooperativnich-hrach",
          "publishedOn": "2021-10-16T22:01:00.000Z",
          "wordCount": 1660,
          "title": "Týden na ScienceMag.cz: Umělá inteligence v kooperativních hrách"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-41-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-41-2021",
          "publishedOn": "2021-10-15T22:01:00.000Z",
          "wordCount": 2520,
          "title": "Událo se v týdnu 41/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/goodoffer24-dozivotni-licence-windows-11-za-16-66-nebo-windows-10-za-pouhych-12-52",
          "author": "Reklama",
          "description": "Získejte doživotní licenci Windows 11 za pouhých 16,66  €, Windows 10 za pouhých 12,52  €. Opět jde o finančně velmi výhodnou nabídku prodejního portálu GoodOffer24.com, kde lze najít kromě nástrojů produktivity také hry, ale i další softwarové produkty.",
          "link": "http://www.abclinuxu.cz/clanky/goodoffer24-dozivotni-licence-windows-11-za-16-66-nebo-windows-10-za-pouhych-12-52",
          "publishedOn": "2021-10-15T14:00:00.000Z",
          "wordCount": 1335,
          "title": "GoodOffer24: Doživotní licence Windows 11 za 16,66  € nebo Windows 10 za pouhých 12,52  €"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/key-trainings-je-openshift-tou-spravnou-volbou",
          "author": "Reklama",
          "description": "OpenShift je platforma pro provoz kontejnerů ve firemním prostředí. Usnadňuje standardizaci provozu vašich aplikací a současně zjednodušuje provoz a zvyšuje bezpečnost a spolehlivost provozu. Umožňuje vám přidělit vybraná oprávnění např. dodavatelským firmám a mít tak pod kontrolou větší část nebo celý vývojový cyklus aplikací. Současně vám přináší jednotný způsob monitoringu a sběru logů.",
          "link": "http://www.abclinuxu.cz/clanky/key-trainings-je-openshift-tou-spravnou-volbou",
          "publishedOn": "2021-10-13T22:01:00.000Z",
          "wordCount": 1489,
          "title": "KEY Trainings: Je OpenShift tou správnou volbou?"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/distribucni-novinky-38-40-2021",
          "author": "Redakce",
          "description": "Babí léto přineslo aktualizace řady více či méně specializovaných distribucí: přechod na Debian 11 v projektech Emmabuntüs DE4 nejen pro vzdělávání, Q4OS také s desktopovým prostředím Trinity, stabilní obrazy PureOS firmy Purism, dále Redo Rescue pro práci s diskovými oddíly, pokračující experimenty v EasyOS a mezi tím vším občerstvení MidnightBSD, UBports, IPFire, Tails, Feren OS či Debianu.",
          "link": "http://www.abclinuxu.cz/clanky/distribucni-novinky-38-40-2021",
          "publishedOn": "2021-10-11T22:01:00.000Z",
          "wordCount": 1943,
          "title": "Distribuční novinky 38-40/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-budovani-kyberneticky-odolne-spolecnosti",
          "author": "Redakce",
          "description": "Problémy s Wi-Fi mohou ohrozit fungování českých firem. Technologické trendy pro finanční ředitele: hyperautomatizace a inteligentní komponovaný byznys. Od pilotního projektu k produkčnímu nasazení umělé inteligence. S evidencí vandalismu pomůže umělá inteligence, řešení bude hledat Atos Hackathon. Budování kyberneticky odolné společnosti. Tiskárny během lockdownů a poté (1) Dodávky.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-budovani-kyberneticky-odolne-spolecnosti",
          "publishedOn": "2021-10-10T14:00:00.000Z",
          "wordCount": 1508,
          "title": "Týden na ITBiz: Budování kyberneticky odolné společnosti"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-40-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-40-2021",
          "publishedOn": "2021-10-08T22:01:00.000Z",
          "wordCount": 2905,
          "title": "Událo se v týdnu 40/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-supravodive-hydridy-ceru",
          "author": "Redakce",
          "description": "Světy s oceány a atmosférou z vodíku. Těžba ve vesmíru s pomocí bakterií. Panspermie v měřítku celé galaxie. Umělá inteligence pro předpověď počasí. Vylepšená uhlíková vlákna.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-supravodive-hydridy-ceru",
          "publishedOn": "2021-10-08T14:00:00.000Z",
          "wordCount": 1646,
          "title": "Týden na ScienceMag.cz: Supravodivé hydridy ceru"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/jaderne-noviny-prehled-za-zari-2021",
          "author": "Redakce",
          "description": "Přehled zářijových vydání Jaderných novin: stav vydání jádra, citáty týdne a seznam článků týkajících se jádra.",
          "link": "http://www.abclinuxu.cz/clanky/jaderne-noviny-prehled-za-zari-2021",
          "publishedOn": "2021-10-07T11:00:00.000Z",
          "wordCount": 2398,
          "title": "Jaderné noviny – přehled za září 2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-vztah-mezi-bezpecnosti-it-a-vyvojem-se-musi-zlepsit",
          "author": "Redakce",
          "description": "IBM Cloud a jeho umělá inteligence i ve vlastním datacentru. HPE představilo nové cloudové služby pro platformu HPE GreenLake. Pure nabízí Database-as-a-Service pro Kubernetes. Internet věcí nás obklopuje na každém kroku, účastníci Atos Hackathonu se naučí s ním zacházet. Vztah mezi bezpečností, IT a vývojem se musí zlepšit.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-vztah-mezi-bezpecnosti-it-a-vyvojem-se-musi-zlepsit",
          "publishedOn": "2021-10-03T22:01:00.000Z",
          "wordCount": 1435,
          "title": "Týden na ITBiz: Vztah mezi bezpečností, IT a vývojem se musí zlepšit"
        }
      ]
    },
    {
      "title": "abclinuxu - čerstvé zprávičky",
      "feedUrl": "http://www.abclinuxu.cz/auto/zpravicky.rss",
      "siteUrl": "http://www.abclinuxu.cz/zpravicky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/zpravicky/krakensdr",
          "author": "Ladislav Hagara",
          "description": "Na Crowd Supply běží kampaň na podporu zařízení KrakenSDR s pěti přijímači RTL-SDR. Lze je používat nezávisle nebo současně jako radiozaměřovač nebo pasivní radar.",
          "link": "http://www.abclinuxu.cz/zpravicky/krakensdr",
          "publishedOn": "2021-10-21T12:05:09.000Z",
          "wordCount": 860,
          "title": "KrakenSDR"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/sequoia-pgp-prelicencovana-z-gpl-2plus-na-lgpl-2plus",
          "author": "Ladislav Hagara",
          "description": "Implementace OpenPGP Sequoia PGP byla přelicencována z GPL 2+ na LGPL 2+. Vývojáři to zdůvodňují na dvou příkladech: Apple nepovoluje GPL software ve svém App Storu a problém s GPL má také Thunderbird.",
          "link": "http://www.abclinuxu.cz/zpravicky/sequoia-pgp-prelicencovana-z-gpl-2plus-na-lgpl-2plus",
          "publishedOn": "2021-10-21T08:48:30.000Z",
          "wordCount": 851,
          "title": "Sequoia PGP přelicencována z GPL 2+ na LGPL 2+"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/raspberry-pi-4-s-2-gb-ram-docasne-zdrazilo-z-35-na-45-dolaru",
          "author": "Ladislav Hagara",
          "description": "Problémy s výrobou a dodáváním má také Raspberry Pi. Raspberry Pi 4 s 2 GB RAM proto dočasně zdražilo z 35 na 45 dolarů.",
          "link": "http://www.abclinuxu.cz/zpravicky/raspberry-pi-4-s-2-gb-ram-docasne-zdrazilo-z-35-na-45-dolaru",
          "publishedOn": "2021-10-21T08:15:10.000Z",
          "wordCount": 852,
          "title": "Raspberry Pi 4 s 2 GB RAM dočasně zdražilo z 35 na 45 dolarů"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/gimp-2.99.8",
          "author": "Ladislav Hagara",
          "description": "Byla vydána vývojová verze 2.99.8 svobodné aplikace pro úpravu a vytváření rastrové grafiky GIMP. Jedná se o další krok směrem k verzi 3 postavené na GTK 3. Přehled novinek i s náhledy v oznámení o vydání a v souboru NEWS na GitLabu. Stabilní verze je 2.10.28.",
          "link": "http://www.abclinuxu.cz/zpravicky/gimp-2.99.8",
          "publishedOn": "2021-10-21T07:16:23.000Z",
          "wordCount": 837,
          "title": "GIMP 2.99.8"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/ok-lenovo-musime-si-promluvit-zapisek-vyvojare-haiku",
          "author": "Fluttershy, yay!",
          "description": "Obsáhlý zápisek v blogu jednoho z vývojářů Haiku, svobodného operačního systému inspirovaného BeOS, popisuje nejen zkušenosti s notebookem Lenovo ThinkPad T510 a posléze W541, ale průběžně také rozvíjí úvahy o svobodném softwaru, právu na opravu (right to repair), (ne)zveřejňování specifikací hardwaru, dotýká se politiky podepisování distribučních klíčů nejen Secure Boot aj.",
          "link": "http://www.abclinuxu.cz/zpravicky/ok-lenovo-musime-si-promluvit-zapisek-vyvojare-haiku",
          "publishedOn": "2021-10-20T21:58:23.000Z",
          "wordCount": 1313,
          "title": "OK Lenovo, musíme si promluvit! (zápisek vývojáře Haiku)"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/node.js-17",
          "author": "Ladislav Hagara",
          "description": "OpenJS Foundation, oficiální projekt konsorcia Linux Foundation, oznámila vydání verze 17.0.0 a krátce na to 17.0.1 otevřeného multiplatformního prostředí pro vývoj a běh síťových aplikací napsaných v JavaScriptu Node.js (Wikipedie). Přehled novinek v článku na Medium.",
          "link": "http://www.abclinuxu.cz/zpravicky/node.js-17",
          "publishedOn": "2021-10-20T21:46:52.000Z",
          "wordCount": 1021,
          "title": "Node.js 17"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/vscode.dev-aneb-visual-studio-code-bezici-ve-webovem-prohlizeci",
          "author": "Ladislav Hagara",
          "description": "Microsoft představil vscode.dev aneb Visual Studio Code běžící ve webovém prohlížeči.",
          "link": "http://www.abclinuxu.cz/zpravicky/vscode.dev-aneb-visual-studio-code-bezici-ve-webovem-prohlizeci",
          "publishedOn": "2021-10-20T18:34:39.000Z",
          "wordCount": 1021,
          "title": "vscode.dev aneb Visual Studio Code běžící ve webovém prohlížeči"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/organizace-software-freedom-conservancy-podala-zalobu-na-vyrobce-televizoru-vizio-kvuli-opakovanemu-porusovani-licence-gpl",
          "author": "Ladislav Hagara",
          "description": "Organizace Software Freedom Conservancy podala žalobu (pdf) na výrobce televizorů Vizio kvůli opakovanému porušování licence GPL.",
          "link": "http://www.abclinuxu.cz/zpravicky/organizace-software-freedom-conservancy-podala-zalobu-na-vyrobce-televizoru-vizio-kvuli-opakovanemu-porusovani-licence-gpl",
          "publishedOn": "2021-10-20T13:26:24.000Z",
          "wordCount": 1125,
          "title": "Organizace Software Freedom Conservancy podala žalobu na výrobce televizorů Vizio kvůli opakovanému porušování licence GPL"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/brave-1.31-s-brave-search",
          "author": "Ladislav Hagara",
          "description": "Byla vydána nová verze 1.31 webového prohlížeče Brave (Wikipedie, GitHub). Výchozím webovým vyhledávačem se stává Brave Search. Ten lze využívat i v jiných prohlížečích na adrese search.brave.com. Uživatelé Brave se mohou podílet na jeho vylepšování, pokud povolí v nastavení Web Discovery Project (WDP).",
          "link": "http://www.abclinuxu.cz/zpravicky/brave-1.31-s-brave-search",
          "publishedOn": "2021-10-20T11:35:36.000Z",
          "wordCount": 940,
          "title": "Brave 1.31 s Brave Search"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/mattermost-6.0",
          "author": "Ladislav Hagara",
          "description": "Byla vydána nová verze 6.0 a krátce na to první opravná verze 6.0.1 open source komunikační platformy Mattermost (Wikipedie). Podrobnosti v dokumentaci. Zdrojové kódy jsou k dispozici na GitHubu.",
          "link": "http://www.abclinuxu.cz/zpravicky/mattermost-6.0",
          "publishedOn": "2021-10-20T10:47:11.000Z",
          "wordCount": 960,
          "title": "Mattermost 6.0"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/vr.php?view=30634",
          "author": null,
          "description": "It's been a half-year already since AMD introduced the EPYC 7003 \"Milan\" processors that continue performing well and gaining marketshare. While the recently released Ubuntu 21.10 is not a long-term support (LTS) release, for those wondering what this latest Linux distribution means for EPYC 7003 series performance, here is a look at its performance across many benchmarks against that of Ubuntu 21.04 that was released right after the Milan launch and then Ubuntu 20.04 as the current LTS stable series.",
          "link": "https://www.phoronix.com/vr.php?view=30634",
          "publishedOn": "2021-10-21T13:00:00.000Z",
          "wordCount": 943,
          "title": "AMD EPYC 7003 \"Milan\" Performance On Ubuntu Linux Six Months After Launch"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Smart-Trace-Buffer-Linux",
          "author": null,
          "description": "AMD patches this month have begun preparing support for a new CPU feature called Smart Trace Buffer (STB)...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Smart-Trace-Buffer-Linux",
          "publishedOn": "2021-10-21T10:15:06.000Z",
          "wordCount": 1024,
          "title": "AMD \"Smart Trace Buffer\" Feature Being Wired Up For Linux"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=V3DV-Vulkan-1.1",
          "author": null,
          "description": "Mesa's V3DV driver for supporting newer Broadcom VideoCore graphics hardware with Vulkan now is advertising v1.1 support. This Vulkan 1.1 support in V3DV is notable as the Raspberry Pi 4 and newer are the most notable beneficiaries of this driver...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=V3DV-Vulkan-1.1",
          "publishedOn": "2021-10-21T09:19:39.000Z",
          "wordCount": 872,
          "title": "V3DV Raspberry Pi Driver Now Exposes Vulkan 1.1"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Raspberry-Pi-Supply-Chain",
          "author": null,
          "description": "The ongoing supply chain issues across the semiconductor industry (and more broadly) are now impacting the Raspberry Pi operations for end-users/customers when it comes to pricing...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Raspberry-Pi-Supply-Chain",
          "publishedOn": "2021-10-21T05:00:00.000Z",
          "wordCount": 768,
          "title": "Raspberry Pi Sees Their First Price Increase Due To Supply Chain issues"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ruby-YJIT",
          "author": null,
          "description": "The Ruby programming language implementation has merged YJIT, its new just-in-time (JIT) compiler...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ruby-YJIT",
          "publishedOn": "2021-10-21T04:00:00.000Z",
          "wordCount": 736,
          "title": "Ruby Lands \"YJIT\" As A Speedy, In-Process JIT Compiler"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-CUDA-11.5",
          "author": null,
          "description": "NVIDIA has made available CUDA 11.5 today as the latest version of their popular but proprietary compute stack/platform. Notable with CUDA 11.5 is that CUDA-Python has reached general availability status...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-CUDA-11.5",
          "publishedOn": "2021-10-20T23:00:11.000Z",
          "wordCount": 865,
          "title": "CUDA-Python Reaches \"GA\" With NVIDIA CUDA 11.5 Release, __int128 Preview"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GIMP-2.99.8-Released",
          "author": null,
          "description": "GIMP 3.0 as the GTK3 port of this open-source Adobe Photoshop alternative has been talked about for nearly a decade now and the work remains ongoing. However, out today is GIMP 2.99.8 as the newest development snapshot...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GIMP-2.99.8-Released",
          "publishedOn": "2021-10-20T19:06:57.000Z",
          "wordCount": 885,
          "title": "GIMP 2.99.8 Released As Another Step Toward The Long Overdue GIMP 3.0"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-ControlFlag-Open-Source",
          "author": null,
          "description": "Last year Intel announced ControlFlag as a machine learning tool for helping to uncover bugs within code. ControlFlag promised impressive results after being trained on more than one billion lines of code and at the end of 2020 was already being used internally on Intel's code-bases from firmware to software applications. We hadn't heard anything more about ControlFlag this year... Until today. Intel has now made ControlFlag open-source for helping to autonomously detect more programming bugs...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-ControlFlag-Open-Source",
          "publishedOn": "2021-10-20T18:29:35.000Z",
          "wordCount": 802,
          "title": "Intel Makes ControlFlag Open-Source For Helping To Detect Bugs In Code"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Eclipse-OpenJ9-v0.29",
          "author": null,
          "description": "The newest feature release to Eclipse OpenJ9 is now available, the high performance Java Virtual Machine originating from IBM J9...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Eclipse-OpenJ9-v0.29",
          "publishedOn": "2021-10-20T18:00:33.000Z",
          "wordCount": 777,
          "title": "Eclipse OpenJ9 0.29 Released With Full AArch64 Linux Support, More Mature JITServer Tech"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30628",
          "author": null,
          "description": "Just one week ago was the public launch of the Radeon RX 6600 as the newest offering in the RDNA2 GPU line-up. While in our Radeon RX 6600 Linux review the performance was good on AMD's well regarded open-source driver stack and standing ground against the likes of the GeForce RTX 3060 with NVIDIA's proprietary Linux driver, it turns out the RX 6600 Linux performance can be even better already. Here are benchmarks of the Radeon RX 6600 on Linux across six different driver configurations.",
          "link": "https://www.phoronix.com/vr.php?view=30628",
          "publishedOn": "2021-10-20T13:09:03.000Z",
          "wordCount": 1008,
          "title": "Radeon RX 6600 Linux Performance Rising Even Higher With Newest Open-Source Driver"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.16-Apple-Magic-2021",
          "author": null,
          "description": "Separate from all the ongoing Apple Silicon/M1 bring-up work for the Linux kernel, the Linux 5.16 cycle is set to support this year's Apple Magic Keyboard...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.16-Apple-Magic-2021",
          "publishedOn": "2021-10-20T13:03:56.000Z",
          "wordCount": 867,
          "title": "Linux 5.16 To Support The 2021 Apple Magic Keyboard"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Apple-PCIe-For-Linux-5.16",
          "author": null,
          "description": "Queued this week into the Linux PCI subsystem's \"next\" branch is the Apple PCIe driver needed to enable PCI Express support for Apple SoCs such as the M1...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Apple-PCIe-For-Linux-5.16",
          "publishedOn": "2021-10-20T09:54:53.000Z",
          "wordCount": 784,
          "title": "Apple Silicon PCIe Driver Queued For Linux 5.16"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Intel-Buddy-Allocator",
          "author": null,
          "description": "Thanks to the nature of open-source, AMD engineers for the \"AMDGPU\" kernel graphics driver are looking to make use of Intel's new i915 buddy allocator code they introduced as part of all their video memory management changes as part of their discrete graphics bring-up...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Intel-Buddy-Allocator",
          "publishedOn": "2021-10-20T07:00:00.000Z",
          "wordCount": 984,
          "title": "AMD GPU Driver Looks To Make Use Of Intel's New Buddy Allocator Code In The Linux Kernel"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Wii-U-Gamepad-Driver-v4",
          "author": null,
          "description": "It's been a half-year since talking about the Wii U gamepad driver that's been in development with mainline ambitions for supporting this wireless gamepad in conjunction with the Nintendo Wii U console. The driver has just been revised to address earlier code review comments, again renewing interest in the effort and possible mainlining in a future kernel version...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Wii-U-Gamepad-Driver-v4",
          "publishedOn": "2021-10-20T04:00:00.000Z",
          "wordCount": 947,
          "title": "Nintendo Wii U Gamepad Linux Driver Support Still Pursuing Mainline"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GraalVM-21.3-Released",
          "author": null,
          "description": "Oracle has published its latest quarterly update to GraalVM, the  open-source Java JVM/JDK implemented in Java that also supports other execution modes and programming languages from Python to R to Ruby...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GraalVM-21.3-Released",
          "publishedOn": "2021-10-19T23:17:07.000Z",
          "wordCount": 948,
          "title": "Oracle Releases GraalVM 21.3 With Java 17 Support, Other Enhancements"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Chrome-95-Released",
          "author": null,
          "description": "Chrome 95 has rolled out as stable today as the latest version of Google's web browser...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Chrome-95-Released",
          "publishedOn": "2021-10-19T19:06:38.000Z",
          "wordCount": 788,
          "title": "Chrome 95 Released With FTP Support Completely Removed, New Developer Additions"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=RadeonSI-Continues-Tuning-SPEC",
          "author": null,
          "description": "In recent months we have seen a lot of RadeonSI optimizations focused on SPECViewPerf with AMD seemingly trying to get this open-source OpenGL driver into very capable shape moving forward for workstation GL workloads. Hitting Mesa 22.0-devel today is yet another round of patches for tuning SPECViewPerf...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=RadeonSI-Continues-Tuning-SPEC",
          "publishedOn": "2021-10-19T18:49:24.000Z",
          "wordCount": 814,
          "title": "RadeonSI Lands Another \"Very Large\" Optimization To Further Boost SPECViewPerf"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Singh-CentOS-Steps-Down",
          "author": null,
          "description": "Karanbir Singh who had served as the CentOS Project Leader and involved with the community-based RHEL distribution since 2004 has stepped down from his roles...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Singh-CentOS-Steps-Down",
          "publishedOn": "2021-10-19T18:10:50.000Z",
          "wordCount": 702,
          "title": "CentOS Project Chair Karanbir Singh Steps Down"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30623",
          "author": null,
          "description": "Announced earlier this year for Google Cloud was a new family of virtual machines called Tau VMs. The initial T2D instances are powered by AMD EPYC 7003 \"Milan\" processors to deliver leading performance and are also positioned to deliver great value in going up against the likes of Amazon's Graviton2 instances. Tau VM instances are now available as a preview and Google has provided us with gratis access to the new instance types for benchmarking.",
          "link": "https://www.phoronix.com/vr.php?view=30623",
          "publishedOn": "2021-10-19T13:01:00.000Z",
          "wordCount": 1069,
          "title": "Google Cloud Tau VM Instances Deliver Better Performance, Price-Performance Than Graviton2 M6g"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=OpenCL-3.0.9-Extensions",
          "author": null,
          "description": "Last Friday night we spotted OpenCL 3.0.9 with several new extensions included. Today The Khronos Group is formally announcing these latest OpenCL additions focused on Vulkan interoperability as well as neural network inferencing...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=OpenCL-3.0.9-Extensions",
          "publishedOn": "2021-10-19T13:00:00.000Z",
          "wordCount": 886,
          "title": "Vendors Including NVIDIA Talk Up New OpenCL Extensions For Vulkan Interop, NN Inference"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Google-SiliFuzz-CPU-Defects",
          "author": null,
          "description": "With OSS-Fuzz for continuous fuzzing of open-source projects and along with working on the various sanitizers for compilers, Google has been doing a lot for proactively uncovering software defects in key open-source projects. Now though a group of their engineers have been working on SiliFuzz for software aiming to discover new CPU defects...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Google-SiliFuzz-CPU-Defects",
          "publishedOn": "2021-10-19T09:50:22.000Z",
          "wordCount": 984,
          "title": "Google Developing \"SiliFuzz\" For Fuzzing CPUs To Uncover Electrical Defects"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=RadeonSI-NGG-Culling-Navi-1x",
          "author": null,
          "description": "As another possible performance win for RadeonSI Gallium3D as AMD's open-source Radeon OpenGL driver on Linux systems is enabling of NGG culling for Navi 1x consumer graphics processors rather than limiting it only to newer Navi 2x (RDNA2) GPUs...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=RadeonSI-NGG-Culling-Navi-1x",
          "publishedOn": "2021-10-19T08:00:00.000Z",
          "wordCount": 839,
          "title": "RadeonSI Enables NGG Shader Culling For Navi 1x Consumer GPUs"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=RADV-Port-WIP-For-Haiku",
          "author": null,
          "description": "After successfully getting Mesa's software-based Lavapipe Vulkan implementation building on Haiku last month along with related Mesa code for headless support, a developer independent of AMD has started work on porting the Mesa Radeon Vulkan driver \"RADV\" to Haiku...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=RADV-Port-WIP-For-Haiku",
          "publishedOn": "2021-10-19T04:00:00.000Z",
          "wordCount": 902,
          "title": "Early Progress Made On Porting Radeon Vulkan Driver To BeOS-Inspired Haiku OS"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-22.04-LTS-Development",
          "author": null,
          "description": "Canonical today formally opened the \"Jammy\" archive for development for what will be the next version of Ubuntu, 22.04 LTS \"Jammy Jellyfish\"...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-22.04-LTS-Development",
          "publishedOn": "2021-10-18T20:00:20.000Z",
          "wordCount": 975,
          "title": "Ubuntu 22.04 LTS \"Jammy Jellyfish\" Begins Development"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Apple-M1-Pro-M1-Max",
          "author": null,
          "description": "Apple today announced the M1 Pro and M1 Max as their most powerful SoCs ever built by the company. The new chips feature up to a 10-core processor, 32-core GPU, and up to 64GB of unified memory...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Apple-M1-Pro-M1-Max",
          "publishedOn": "2021-10-18T18:30:13.000Z",
          "wordCount": 973,
          "title": "Apple Announces The M1 Pro / M1 Max, Asahi Linux Starts Eyeing Their Bring-Up"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-Deck-Verified",
          "author": null,
          "description": "Valve is introducing a Steam Deck Verified system for helping gamers find out what games have been verified to work well on their forthcoming AMD+Linux-powered handheld game console...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-Deck-Verified",
          "publishedOn": "2021-10-18T18:15:55.000Z",
          "wordCount": 764,
          "title": "Valve Launches \"Steam Deck Verified\" Program For Games That Run Well On The Steam Deck"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=VKD3D-Proton-2.5",
          "author": null,
          "description": "VKD3D-Proton as Valve's Direct3D 12 over Vulkan implementation for Steam Play's Proton is out with a big feature update...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=VKD3D-Proton-2.5",
          "publishedOn": "2021-10-18T16:04:54.000Z",
          "wordCount": 799,
          "title": "VKD3D-Proton 2.5 Released With Experimental DXR 1.1, More Games Working"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30617",
          "author": null,
          "description": "With last week's release of Ubuntu 21.10, here are some fresh benchmarks looking at the Linux gaming performance on this new release while testing both the GNOME Shell 40 default desktop to that of its KDE Plasma 5.22 based option. Both the X.Org and Wayland sessions for KDE and GNOME were benchmarked for seeing how the Linux gaming performance compares with the Radeon open-source GPU driver stack.",
          "link": "https://www.phoronix.com/vr.php?view=30617",
          "publishedOn": "2021-10-18T12:14:43.000Z",
          "wordCount": 942,
          "title": "Ubuntu 21.10 Radeon Gaming With KDE Plasma vs. GNOME Shell + Wayland vs. X.Org"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Habana-Labs-Linux-5.16",
          "author": null,
          "description": "The drama around DMA-BUF code for the Habana Labs AI driver appears to be wrapping up with the Linux 5.16 cycle that is coming up...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Habana-Labs-Linux-5.16",
          "publishedOn": "2021-10-18T10:38:16.000Z",
          "wordCount": 971,
          "title": "Habana Labs For Linux 5.16 To Bring Peer-To-Peer Support With DMA-BUF"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-22.0-OpenCL-Image-Prep",
          "author": null,
          "description": "Mesa 22.0-devel is one step closer to having OpenCL image support that is sought after by many individuals for allowing more OpenCL-enabled desktop software to work nicely with this open-source OpenCL component in Mesa...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-22.0-OpenCL-Image-Prep",
          "publishedOn": "2021-10-18T09:29:15.000Z",
          "wordCount": 871,
          "title": "Mesa 22.0 Lands Some Patches Toward OpenCL Image Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-rc6-Released",
          "author": null,
          "description": "Linus Torvalds is out with Linux 5.15-rc6 and its increase in size has him slightly worried...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-rc6-Released",
          "publishedOn": "2021-10-18T08:33:00.000Z",
          "wordCount": 856,
          "title": "Linux 5.15-rc6 Ticks Up In Size, Stops Using AMD SME By Default"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-SME-No-Default-Use",
          "author": null,
          "description": "Being sent in as a fix for the Linux 5.15 kernel this morning and to be back-ported to existing stable series is a behavior change that the Linux kernel will no longer use AMD Secure Memory Encryption (SME) by default on supported hardware but rather making it now opt-in due to shortcomings of some platforms...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-SME-No-Default-Use",
          "publishedOn": "2021-10-17T11:00:00.000Z",
          "wordCount": 910,
          "title": "Linux To No Longer Enable AMD SME Usage By Default Due To Problems With Some Hardware"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/rss.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2531/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2531/",
          "publishedOn": "2021-10-20T04:00:00.000Z",
          "wordCount": 185,
          "title": "Dark Arts"
        },
        {
          "id": "https://xkcd.com/2530/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2530/",
          "publishedOn": "2021-10-18T04:00:00.000Z",
          "wordCount": 185,
          "title": "Clinical Trials"
        },
        {
          "id": "https://xkcd.com/2529/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2529/",
          "publishedOn": "2021-10-15T04:00:00.000Z",
          "wordCount": 187,
          "title": "Unsolved Math Problems"
        },
        {
          "id": "https://xkcd.com/2528/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2528/",
          "publishedOn": "2021-10-13T04:00:00.000Z",
          "wordCount": 187,
          "title": "Flag Map Sabotage"
        }
      ]
    }
  ],
  "cliVersion": "1.11.3"
}