{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": [
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.3",
          "author": null,
          "description": "Fixed: broken links in documentation\nChore: Dependency updates\nThank you: @hirdot",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.3",
          "publishedOn": "2021-10-16T00:01:47.000Z",
          "wordCount": 292,
          "title": "v1.11.3"
        }
      ]
    },
    {
      "title": "Kotaku",
      "feedUrl": "https://kotaku.com/rss",
      "siteUrl": "https://kotaku.com",
      "articles": [
        {
          "id": "1847966405",
          "author": "Ethan Gach",
          "description": "Nintendo closed its California office today, displacing roughly 100 employees, sources tell Kotaku. \nRead more...",
          "link": "https://kotaku.com/sources-nintendo-shutters-california-office-1847966405",
          "publishedOn": "2021-10-29T21:40:00.000Z",
          "wordCount": 585,
          "title": "Nintendo Shutters California And Toronto Offices"
        },
        {
          "id": "1847966338",
          "author": "Jeremy Winslow",
          "description": "Sometimes, Halloween can be just a bit too scary. There are ghosts and ghouls and undead and…assholes. Living is frightening and, so too, is the thought of death and mortality. That’s exactly why Skul: The Hero Slayer works as a comfy spooky game. It’s not really scary. It just pretends to be.\n\nRead more...",
          "link": "https://kotaku.com/an-action-platformer-perf-for-those-too-chicken-for-hal-1847966338",
          "publishedOn": "2021-10-29T21:00:00.000Z",
          "wordCount": 689,
          "title": "An Action Platformer Perf For Those Too Chicken For Halloween"
        },
        {
          "id": "1847964508",
          "author": "Ethan Gach",
          "description": "The PSP is long dead. The Playstation Vita too. But long live Valve’s Steam Deck, a handheld that’s just around the corner, and thanks to Sony’s new PC gaming push, will finally make the dream of playing the company’s biggest blockbusters on a small portable device a reality.\n\nRead more...",
          "link": "https://kotaku.com/all-i-want-for-christmas-is-a-psp-1847964508",
          "publishedOn": "2021-10-29T19:10:00.000Z",
          "wordCount": 614,
          "title": "All I Want For Christmas Is A PSP"
        },
        {
          "id": "1847965080",
          "author": "Zack Zwiezen",
          "description": "Grand Theft Auto: San Andreas isn’t filled with ghosts, aliens, cryptids, monsters, or shadow people. But in the years after its initial 2004 release—at a time when uploading videos to the internet was hard and datamining games was less common—people believed Rockstar’s classic open-world game contained all those…\nRead more...",
          "link": "https://kotaku.com/remember-when-everyone-was-convinced-gta-san-andreas-w-1847965080",
          "publishedOn": "2021-10-29T18:55:00.000Z",
          "wordCount": 1384,
          "title": "Remember When Everyone Was Convinced GTA: San Andreas Was Full of Creepy Secrets?"
        },
        {
          "id": "1847965243",
          "author": "Ari Notis",
          "description": "Here’s a small item that had me feline fine on this debatably not-fine Friday: In Far Cry 6, there’s an island with a shipwrecked boat full of cat dolls. It’s cute. It’s also, as I just learned today, apparently a long-running gag in a particular flavor of Ubisoft map games.\nRead more...",
          "link": "https://kotaku.com/far-cry-6s-secret-cat-boat-has-a-long-history-at-ubisof-1847965243",
          "publishedOn": "2021-10-29T18:35:00.000Z",
          "wordCount": 673,
          "title": "Far Cry 6's Secret Cat Boat Has A Long History At Ubisoft"
        },
        {
          "id": "1847964266",
          "author": "Zack Zwiezen",
          "description": "Skydance New Media and Amy Hennig, the creative director on the first three Uncharted games, announced today that they are working on a new narrative-focused Marvel action-adventure game featuring an original storyline.\nRead more...",
          "link": "https://kotaku.com/uncharteds-amy-hennig-is-making-a-marvel-game-1847964266",
          "publishedOn": "2021-10-29T17:15:00.000Z",
          "wordCount": 585,
          "title": "Uncharted's Amy Hennig Is Making A Marvel Game"
        },
        {
          "id": "1847964067",
          "author": "Ethan Gach",
          "description": "Another Mario fan game looks like it’s about to bite the dust, but this time nobody’s shedding any tears. The 1up Platform is a cryptocurrency scheme that got underway earlier this year, seemingly featuring a battle royale of corporate copyrights and stolen artwork. Now it’s finally attracted the attention of Nintendo.\nRead more...",
          "link": "https://kotaku.com/unofficial-mario-nft-game-players-are-actually-glad-nin-1847964067",
          "publishedOn": "2021-10-29T17:00:00.000Z",
          "wordCount": 937,
          "title": "Unofficial Mario NFT Game Players Are Actually Glad Nintendo Discovered It"
        },
        {
          "id": "1847963965",
          "author": "Isaiah Colbert",
          "description": "Boarding a city subway is always a dice roll for whatever terror awaits you once the train doors close. Maybe there’s some trash taking up a seat, or annoying passengers who are hell bent on making their business yours. The new psychological horror game, Subway Midnight, taps into that uncertainty and spices it up by…\nRead more...",
          "link": "https://kotaku.com/a-psychedelic-horror-game-about-exploring-a-haunted-tra-1847963965",
          "publishedOn": "2021-10-29T16:45:00.000Z",
          "wordCount": 863,
          "title": "A Psychedelic Horror Game About Exploring A Haunted Train"
        },
        {
          "id": "1847963909",
          "author": "Sisi Jiang",
          "description": "While the biggest news from the Facebook Connect livestream was Facebook’s rebranding to Meta (which I refuse to use), the social media company also announced that Oculus Quest VR headsets will no longer require a Facebook account.\nRead more...",
          "link": "https://kotaku.com/hooray-oculus-quest-devices-no-longer-require-facebook-1847963909",
          "publishedOn": "2021-10-29T16:15:00.000Z",
          "wordCount": 420,
          "title": "Hooray, Oculus Quest Devices No Longer Require Facebook Accounts"
        },
        {
          "id": "1847963798",
          "author": "Jeremy Winslow",
          "description": "The first thing that comes to mind when I think of The Legend of Zelda: Majora’s Mask is that horrifying moon. It’s ominous, always smiling, a reminder that death is an inevitability for everyone. It lingers in the background, like a shadow against a wall, waiting to strike. If, after three days, you fail to save the…\nRead more...",
          "link": "https://kotaku.com/majora-s-mask-is-a-masterpiece-of-existential-horror-1847963798",
          "publishedOn": "2021-10-29T16:10:00.000Z",
          "wordCount": 1443,
          "title": "Majora’s Mask Is A Masterpiece Of Existential Horror"
        },
        {
          "id": "1847342345",
          "author": "Ari Notis",
          "description": "Even if you primarily use your Nintendo Switch as a living room console, situated in its dock and hooked up to your TV, you’ll probably want to take it on the go from time to time. That’s...kind of the portable’s whole deal. Even figures released by Nintendo show that roughly 80 percent of Switch owners use their…\nRead more...",
          "link": "https://kotaku.com/the-best-switch-carrying-cases-1847342345",
          "publishedOn": "2021-10-29T15:50:00.000Z",
          "wordCount": 962,
          "title": "The Best Switch Carrying Cases"
        },
        {
          "id": "1847963273",
          "author": "Ari Notis",
          "description": "Toss a coin to your Witcher-song-singing friends. Netflix released the first official trailer for The Witcher’s second season, which debuts on December 17. No other way to put this: It looks bonkers. It also kinda muddies the suspenseful setup from the end of the first season.\nRead more...",
          "link": "https://kotaku.com/netflixs-first-witcher-season-2-trailer-sees-yennefers-1847963273",
          "publishedOn": "2021-10-29T15:10:00.000Z",
          "wordCount": 546,
          "title": "Netflix's First Witcher Season 2 Trailer Sees Yennefer's Return"
        },
        {
          "id": "1847962684",
          "author": "Renata Price",
          "description": "Unsighted, the recent isometric Metroidvania from two trans Brazilian developers, Studio Pixel Punk, is the genre at its best. From its impeccable art, music, and atmosphere, to its open-ended “explore how and where you want” structure, deliciously anxiety-inducing time limit, and satisfying combat, it is a…\nRead more...",
          "link": "https://kotaku.com/unsighted-is-the-best-metroidvania-of-the-year-1847962684",
          "publishedOn": "2021-10-29T14:15:00.000Z",
          "wordCount": 2341,
          "title": "Unsighted Is The Best Metroidvania Of The Year"
        },
        {
          "id": "1847962011",
          "author": "Brian Ashcraft",
          "description": "It’s nearly Halloween, so there’s a good chance you’re in the mood for some horror. Might I tempt you with some from Japan?\nRead more...",
          "link": "https://kotaku.com/watch-some-of-japans-best-horror-movies-1847962011",
          "publishedOn": "2021-10-29T12:45:00.000Z",
          "wordCount": 1064,
          "title": "Watch Some Of Japan's Best Horror Movies"
        },
        {
          "id": "1819788909",
          "author": "Luke Plunkett",
          "description": "I am scared of many things in video games. Sharks mostly, but there’s other stuff. Nothing has ever scared me, though, as much as 1992's Alone in the Dark.\n\nRead more...",
          "link": "https://kotaku.com/alone-in-the-dark-scared-the-shit-out-of-me-1819788909",
          "publishedOn": "2021-10-29T00:00:00.000Z",
          "wordCount": 1101,
          "title": "Alone In The Dark Scared The Crap Out Of Me"
        },
        {
          "id": "1847959748",
          "author": "Luke Plunkett",
          "description": "Earlier this month, Valve instituted a ban on all cryptocurrency and NFT sales on Steam. This not only laid down rules governing the future sales (or lack thereof) of titles on its platform, but also booted a few games off that had already launched and were based on the technology.\nRead more...",
          "link": "https://kotaku.com/26-nft-developers-send-very-sad-letter-to-valve-after-s-1847959748",
          "publishedOn": "2021-10-28T23:20:00.000Z",
          "wordCount": 689,
          "title": "26 NFT Developers Send Very Sad Letter To Valve After Steam Ban"
        },
        {
          "id": "1847959840",
          "author": "Ian Walker",
          "description": "Making money in role-playing games often boils down to killing monsters or selling off low-level equipment you no longer need. But the terrifying Laplace no Ma (roughly Laplace’s Demon in English) takes a more novel approach, allowing you to accrue a small fortune by taking glamour shots of skeletons, ghosts, and…\nRead more...",
          "link": "https://kotaku.com/obscure-snes-rpg-lets-you-take-photos-of-lovecraftian-h-1847959840",
          "publishedOn": "2021-10-28T22:20:00.000Z",
          "wordCount": 772,
          "title": "Obscure SNES RPG Lets You Take Photos Of Lovecraftian Horrors For Mad Cash"
        },
        {
          "id": "1847959381",
          "author": "Sisi Jiang",
          "description": "At this point, we’re all just holding out hope that our favorite video game franchises aren’t getting into weird crypto shit. Sometimes, it’s a vain hope. In today’s second quarterly earnings report, Ubisoft said it is exploring blockchain for games. \nRead more...",
          "link": "https://kotaku.com/ubisoft-is-getting-into-the-blockchain-grift-1847959381",
          "publishedOn": "2021-10-28T21:45:00.000Z",
          "wordCount": 453,
          "title": "Ubisoft Is Getting Into The Blockchain Grift"
        },
        {
          "id": "1847958863",
          "author": "Ari Notis",
          "description": "Video games are a lot like years: They start coming, then they don’t stop coming, and they don’t stop coming, and they...yeah. Then you’ve got the games industry’s tectonically shifting release calendar, defined by an endless march of delays and cancellations. Even if you’re the most avid gamer, it’s a lot to keep…\nRead more...",
          "link": "https://kotaku.com/video-game-release-dates-1847958863",
          "publishedOn": "2021-10-28T21:20:00.000Z",
          "wordCount": 1637,
          "title": "Here’s Every Upcoming Video Game Release Date"
        },
        {
          "id": "1847957944",
          "author": "Mike Fahey",
          "description": "I don’t know, folks. Between trying to keep up with Amazon’s New World and the upcoming Final Fantasy XIV Endwalker expansion, I just don’t think I have time for World of Warcraft any more. Wait, I can ride a giant kitten with tufted ears that chases its tail? You son of a bitch, I’m in.\nRead more...",
          "link": "https://kotaku.com/world-of-warcraft-s-latest-mount-is-a-giant-kitty-cat-1847957944",
          "publishedOn": "2021-10-28T19:10:00.000Z",
          "wordCount": 424,
          "title": "World Of Warcraft’s Latest Mount Is A Giant Kitty Cat"
        },
        {
          "id": "1847957846",
          "author": "Zack Zwiezen",
          "description": "During a Facebook Meta keynote event dedicated to its future VR projects and plans, the social media giant revealed that PS2 classic Grand Theft Auto San Andreas is currently in development for the Oculus Quest 2. \nRead more...",
          "link": "https://kotaku.com/gta-san-andreas-enters-the-metaverse-via-oculus-quest-1847957846",
          "publishedOn": "2021-10-28T19:00:00.000Z",
          "wordCount": 711,
          "title": "GTA San Andreas Enters The Metaverse, Via Oculus Quest 2"
        },
        {
          "id": "1847957671",
          "author": "Ethan Gach",
          "description": "Amazon has been giving away free games as part of its paid Prime membership for a while now, but they’ve rarely been this good. After a powerhouse lineup last month, the service is doubling down in November with nine more, and just in time for Tomb Raider’s birthday.\nRead more...",
          "link": "https://kotaku.com/amazon-prime-s-free-games-for-november-are-shockingly-g-1847957671",
          "publishedOn": "2021-10-28T18:25:00.000Z",
          "wordCount": 405,
          "title": "Amazon Prime’s Free Games For November Are Shockingly Good, Again"
        },
        {
          "id": "1847956650",
          "author": "Zack Zwiezen",
          "description": "So, it turns out that Guardians of the Galaxy is very, very good! Don’t let Square Enix’s previous Marvel game, the online mess that is Avengers, scare you away from checking out this new, single-player adventure starring the galaxy’s most dysfunctional found family. Not only is it a blast to play, featuring a great…\nRead more...",
          "link": "https://kotaku.com/behold-the-strange-and-wondrous-aliens-of-guardians-of-1847956650",
          "publishedOn": "2021-10-28T17:30:00.000Z",
          "wordCount": 974,
          "title": "Behold The Strange And Wondrous Aliens Of Guardians Of The Galaxy"
        },
        {
          "id": "1847956351",
          "author": "Sisi Jiang",
          "description": "The Pyro-element characters in Genshin Impact are known to be high-damage dealers, but Hu Tao is an anomaly among them. She’s an ideal damage dealer for those who don’t mind her risky playstyle. More importantly, she’s only available through gacha pulls for a very limited window of time, which are called “banners”…\nRead more...",
          "link": "https://kotaku.com/genshin-impacts-strongest-character-to-make-comeback-1847956351",
          "publishedOn": "2021-10-28T17:15:00.000Z",
          "wordCount": 817,
          "title": "Genshin Impact's Strongest Character To Make Comeback"
        },
        {
          "id": "1847955870",
          "author": "Jeremy Winslow",
          "description": "Rockstar Games recently revealed Grand Theft Auto: The Trilogy - The Definitive Edition, which launches digitally next month and hits store shelves in December. Alongside this high-profile return to the franchise’s past, though, the developer is presumably still working on its future. Now, according to comments made…\nRead more...",
          "link": "https://kotaku.com/dr-dre-is-making-music-for-an-upcoming-gta-game-says-1847955870",
          "publishedOn": "2021-10-28T16:15:00.000Z",
          "wordCount": 596,
          "title": "Dr. Dre Is Making Music For An Upcoming GTA Game, Says Snoop Dogg"
        }
      ]
    },
    {
      "title": "Nintendo Life | Latest Updates",
      "feedUrl": "https://www.nintendolife.com/feeds/latest",
      "siteUrl": "https://www.nintendolife.com/feeds/latest",
      "articles": [
        {
          "id": "https://www.nintendolife.com/#article-122973",
          "author": null,
          "description": "Pikkie come home.\nPikmin Bloom is now available in the Americas, and we've quite enjoyed our time with it so far — especially now that there's a \"Comprehensive Guide For New Players\" available on Reddit, thanks to one industrious player.\nMost of the details listed in the guide are about gathering fruits, petals, and seedlings, as well as how the Pikmin squad works, but there's one little bit that stood out to us:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/random-pikmin-bloom-player-accidentally-sends-pikmin-on-homeward-bound-style-mission",
          "publishedOn": "2021-10-29T20:30:00.000Z",
          "wordCount": 1312,
          "title": "Random: Pikmin Bloom Player Accidentally Sends Pikmin On Homeward Bound-Style Mission"
        },
        {
          "id": "https://www.nintendolife.com/#article-122972",
          "author": null,
          "description": "Squid Game who?\nThe Splatoon 3 timeline so far: It was announced in February, teased again in Summer, teased again in September's Direct, and then we got a bunch of nice images to look at. All we know beyond that is the game's vague 2022 release window, and although it's almost 2022 right now, we've likely still got a while to wait before the next instalment of the ink-based multiplayer shooter.\nTo celebrate Halloween, and Splatoon 3, Nintendo has released this lovely artwork — and now, to pore over it for easter eggs and hints at what's to come:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/nintendo-teases-splatoon-3-again-with-halloween-art",
          "publishedOn": "2021-10-29T20:00:00.000Z",
          "wordCount": 1051,
          "title": "Nintendo Teases Splatoon 3 (Again) With Halloween Art"
        },
        {
          "id": "https://www.nintendolife.com/#article-122958",
          "author": null,
          "description": "It's not all about the Mega Drive / Genesis classics.\nIt's been a notable anniversary year for Sonic the Hedgehog, giving plenty of opportunities to look back nostalgically at the classic - and not-so-classic - games in the series. Yet an aspect of Sonic that gets little attention is the 8-bit era, which funnily enough happened alongside the 16-bit era.\nThe video above from the GTV Japan channel, which has been doing interesting shows about gaming culture for a number of years, digs into the original Sonic on Game Gear and Master System. It also outlines the broader history of 8-bit Sonic as well, showing that it was surprisingly prolific.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/video-learn-more-about-sonic-the-hedgehogs-8-bit-history",
          "publishedOn": "2021-10-29T19:00:00.000Z",
          "wordCount": 1814,
          "title": "Video: Learn More About Sonic The Hedgehog's 8-Bit History"
        },
        {
          "id": "https://www.nintendolife.com/#article-122971",
          "author": null,
          "description": "The Triforce of Website.\nIt might be only us games journalists that get hot-under-the-collar for brand new Zelda key art, but this day is extremely special for us: Nintendo have just released three new websites for The Legend of Zelda, Zelda II, and Link's Awakening to prepare us all for the release of the Zelda Game & Watch in November. And they're full of new assets. Delicious, high-resolution assets. YUM.\nAll three websites are in Japanese, but with the power of AI translation tools, we can roughly understand that each one is designed to introduce us to the three early Zelda games, the characters, and the monsters you'll be fighting along the way. There are even hints if you get stuck, and the original manuals to download (also in Japanese)!\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/nintendo-launches-three-new-zelda-websites-to-celebrate-game-and-watch",
          "publishedOn": "2021-10-29T18:30:00.000Z",
          "wordCount": 1737,
          "title": "Nintendo Launches Three New Zelda Websites To Celebrate Game & Watch"
        },
        {
          "id": "https://www.nintendolife.com/#article-122969",
          "author": null,
          "description": "Almost forty years of fear.\n“Family friendly” is a term often used to describe anything and everything Nintendo touches, but we all know better than that, don’t we? The famous Japanese card maker’s consoles have been knee-deep in the dead for as long as they’ve existed.\nSo! In the spirit of this spookiest of seasons we’ve selected some of the very best horror titles from Nintendo’s hardware history for your gaming enjoyment. Whether you want to be scared silly on SNES or get the gore going on GameCube, we’ve got a game for you...\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/features/the-scariest-game-on-every-nintendo-home-console",
          "publishedOn": "2021-10-29T18:00:00.000Z",
          "wordCount": 4823,
          "title": "Feature: The Scariest Game On Every Nintendo Home Console"
        },
        {
          "id": "https://www.nintendolife.com/#article-122970",
          "author": null,
          "description": "And Jaskier's back, baby.\nSpoilers for Season 2 and Season 1 of The Witcher!\nFans of Final Fantasy VII will be extremely excited to hear that the first trailer for The Witcher season two on Netflix stars an evil cabin with legs, just like that one bit in FF7 where Cloud has to fight a house. It's a great day for people who enjoy punching buildings!\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/netflixs-witcher-season-2-trailer-has-war-magic-yennefer-ciri-and-an-evil-house",
          "publishedOn": "2021-10-29T17:30:00.000Z",
          "wordCount": 1345,
          "title": "Netflix's Witcher Season 2 Trailer Has War, Magic, Yennefer, Ciri, And An Evil House"
        },
        {
          "id": "https://www.nintendolife.com/#article-122964",
          "author": null,
          "description": "Will still function independently.\nKrafton is a sizeable holding company that incorporates a growing range of studios, with the original (and best known) being Bluehole - the studio behind PUBG (PlayerUnknown's Battlegrounds). In fact, despite forming Krafton around three years ago and attracting significant funding, the official website is still bluehole.net.\nKrafton is utilising some of its resources to grow its group of development studios, and has now added Unknown Worlds to the mix. The studio is best known for the excellent Subnautica and Subnautica: Below Zero, two titles we've been able to enjoy relatively recently in their excellent Switch ports.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/pubg-owner-krafton-to-acquire-subnautica-studio-unknown-worlds",
          "publishedOn": "2021-10-29T16:00:00.000Z",
          "wordCount": 1066,
          "title": "PUBG Owner Krafton To Acquire Subnautica Studio Unknown Worlds"
        },
        {
          "id": "https://www.nintendolife.com/#article-122960",
          "author": null,
          "description": "\"The game has been rebuilt from the ground up\".\nZelda II: The Adventure of Link is beloved by many – so much so that it's often mentioned whenever 'Zelda remakes' are discussed – but only the most diehard fan would try to argue that it doesn't have its fair share of problems.\nThere's a lot of (sometimes tedious) side-scrolling combat and the difficulty level has come under particular criticism over the decades. If you're one of those people who, despite trying hard, has never really bonded with Link's second NES quest, then you might be interested to learn that indie developer Ok Impala! has created an unofficial ROM hack that alters the game to make it more enjoyable.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/this-zelda-ii-rom-hack-removes-all-the-annoying-stuff-to-present-a-totally-new-adventure",
          "publishedOn": "2021-10-29T15:30:00.000Z",
          "wordCount": 2616,
          "title": "This Zelda II ROM Hack Removes All The Annoying Stuff To Present A Totally New Adventure"
        },
        {
          "id": "https://www.nintendolife.com/#article-122957",
          "author": null,
          "description": "Console warrens.\nWhat are the three most misplaced items in everyday life? You might be thinking keys, wallets, and the television remote, but you're forgetting the one thing we're always losing: Ladies! Every time we're about to leave the house, we can never remember where we last put our ladies. Are they down the back of the sofa? In the washing machine? If only there were some way we could keep track of our ladies!\nEastasiasoft, a company whose games include \"Waifu Uncovered\" and \"Hentai vs. Evil\", have just shown off their latest take on the \"girls wearing uncomfortably tight underwear\" genre: 20 Ladies, in which you complete simple platforming puzzles to gather up all of your lost ladies. Also, the ladies are naked! For some reason! Maybe all their trousers were shredded by the spinning spike traps that litter the levels. Poor ladies.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/sonys-censors-strike-as-switch-gets-20-ladies-while-ps4-gets-20-bunnies",
          "publishedOn": "2021-10-29T14:30:00.000Z",
          "wordCount": 7992,
          "title": "Sony's Censors Strike As Switch Gets '20 Ladies' While PS4 Gets '20 Bunnies'"
        },
        {
          "id": "https://www.nintendolife.com/#article-122950",
          "author": null,
          "description": "Devilish hack 'n slashing and... dating?\nPQube is among a group of publishers that consistently localises and brings Japanese titles to the West, and the latest on its slate is MAGLAM LORD, which arrived in Japan back in Spring. It'll make its debut in North America and Europe on 4th February.\nIt's a fantasy action RPG that features hack 'n slack combat with rather cute characters, but blends that with dating sim elements. Below is part of the PR blurb, which also confirms that there'll be DLC options tied into other popular franchises.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/action-rpg-date-em-up-maglam-lord-hits-the-west-early-next-year",
          "publishedOn": "2021-10-29T14:00:00.000Z",
          "wordCount": 1139,
          "title": "Action RPG 'Date-Em-Up' MAGLAM LORD Hits The West Early Next Year"
        },
        {
          "id": "https://www.nintendolife.com/#article-122949",
          "author": null,
          "description": "Gotta stitch 'em all.\nIf you're looking for a way to be classy and nerdy at work, a wedding, or even a funeral, you can't go wrong with Pokémon Shirts — an officially licensed range of rather lovely Pokémon designs, on shirts. The company that makes them, Original Stitch, adds new designs regularly, the latest being a range that cover the original Pokémon Red and Blue starter families.\nHave a look:\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/new-pokemon-shirts-show-off-designs-for-charizard-blastoise-and-venusaur",
          "publishedOn": "2021-10-29T13:30:00.000Z",
          "wordCount": 1566,
          "title": "New Pokémon Shirts Show Off Designs For Charizard, Blastoise, And Venusaur"
        },
        {
          "id": "https://www.nintendolife.com/#article-122796",
          "author": null,
          "description": "Gross Negligee.\nA terrible way to play a very good game. That pretty much sums up our thoughts on this cloud version of Marvel's Guardians of the Galaxy on Switch. Where we've previously rated cloud versions of the likes of Hitman 3 and The Forgotten City as worth your time and money — with the caveat that streaming has its inherent foibles — Marvel's action-packed adventure just cannot cut the mustard.\nThis is a game that's jam-packed full of busy fight sequences, sequences that only get more intense as the story goes on, and we found that even on a flawless 5G wireless connection, or a superfast wired one, we had non-stop issues with input lag, stuttering, huge resolution dips, full-on freezes and disconnections. When you've shelled out a frankly ludicrous sixty pounds or dollars for the privilege, having a message frequently pop up that servers are currently strained as your experience turns into a slideshow... well, it's infuriating to say the very least.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/reviews/switch-eshop/marvels-guardians-of-the-galaxy-cloud-version",
          "publishedOn": "2021-10-29T13:00:00.000Z",
          "wordCount": 8813,
          "title": "Review: Marvel's Guardians Of The Galaxy: Cloud Version - A Disastrous Way To Play A Great Game"
        },
        {
          "id": "https://www.nintendolife.com/#article-122942",
          "author": null,
          "description": "And you can stream it right now.\nBanjo-Kazooie composer Grant Kirkhope has revisited the score for the N64 classic in a new album entitled Banjo Kazooie Rejiggyed.\nComprised of 10 tracks, the album puts a new spin on classic tunes from Rare's 1998 3D platformer. You can listen to it on Spotify, Deezer, YouTube Music and Apple Music.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/guh-huh-grant-kirkhope-has-released-a-banjo-kazooie-remix-album",
          "publishedOn": "2021-10-29T12:30:00.000Z",
          "wordCount": 1164,
          "title": "Guh-Huh! Grant Kirkhope Has Released A Banjo-Kazooie Remix Album"
        },
        {
          "id": "https://www.nintendolife.com/#article-122658",
          "author": null,
          "description": "Update: Nintendo UK lists April release.\nUpdate: Nintendo UK has updated the pre-order information for Advance Wars 1+2: Re-Boot Camp, with the new date being listed as April 8th 2022. That's a very specific date (also a Friday), so it could be that this is the new launch date for the game.\n\nOriginal Story : Sad news, folks. Nintendo has announced that Advance Wars 1+2: Re-Boot Camp has been delayed.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/oh-no-advance-wars-1plus2-re-boot-camp-has-been-delayed-on-switch",
          "publishedOn": "2021-10-29T12:25:00.000Z",
          "wordCount": 7325,
          "title": "Oh No, Advance Wars 1+2: Re-Boot Camp Has Been Delayed On Switch"
        },
        {
          "id": "https://www.nintendolife.com/#article-122932",
          "author": null,
          "description": "Prepare your virtual wallet.\nQUByte Interactive is a publisher that is certainly very busy, and undoubtedly produces some intriguing titles across platforms. It's also a big supporter of the Switch, and its QUByte Connect 2021 showcase featured a lot of titles for the system.\nWe already covered the return of much loved Neo Geo Tag team fighter Rage of the Dragons, but here's is a full-on list (with trailers) of some other Switch games unveiled in the show.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/round-up-18-intriguing-switch-games-shown-in-qubyte-connect-2021",
          "publishedOn": "2021-10-29T12:00:00.000Z",
          "wordCount": 2201,
          "title": "Round Up: 18 Intriguing Switch Games Shown In QUByte Connect 2021"
        },
        {
          "id": "https://www.nintendolife.com/#article-122937",
          "author": null,
          "description": "\"I got hooked on Luigi's Mansion\".\nDenis Villeneuve's Dune movie might not be the first attempt to adapt Frank Herbert's epic sci-fi novel, but it's certainly turned out to be one of the most successful, having earned $223.2 million in takings (at the time of writing) and garnering positive reviews – more than can be said for David Lynch's much-maligned 1984 version, which is a cult classic (well, we like it, anyway) but ultimately flopped hard at the box office.\nThe pivotal character of Paul Atreides is played by none other than Timothée Chalamet, who is currently one of the hottest young talents in Hollywood. He's also something of a gaming nut – or at least he was during his formative years. If you haven't already read about the amazing detective work which resulted in him being connected to an Xbox 360 controller modding YouTube account then you should head over to our sister site Pure Xbox for the full story, but it's worth noting that prior to the arrival of the Xbox 360, Chalamet was a big Nintendo fan.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/random-turns-out-dunes-paul-atreides-is-one-of-us-after-all",
          "publishedOn": "2021-10-29T11:30:00.000Z",
          "wordCount": 1567,
          "title": "Random: Turns Out Dune's Paul Atreides Is One Of Us After All"
        },
        {
          "id": "https://www.nintendolife.com/#article-122934",
          "author": null,
          "description": "We hope you're not expecting any massive surprises...\nTeething troubles with emulation and latency aside, it sure is nice to have N64 games on Nintendo Switch Online. While the console couldn't compete with Sony's PlayStation in purely commercial terms, it was still home to some of the best games of its era – including Zelda: Ocarina of Time and Super Mario 64, two titles which are unquestionably among the best games ever made.\nTo accompany the launch of N64 on Nintendo Switch Online, Nintendo has released a wireless version of the original N64 controller. At first glance, it looks identical to the original, but there are some notable differences. It's wireless (as we've already mentioned), and it lacks the Memory Pak port on the back.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/gallery-heres-how-the-switch-online-n64-controller-compares-to-the-real-thing",
          "publishedOn": "2021-10-29T10:30:00.000Z",
          "wordCount": 2402,
          "title": "Gallery: Here's How The Switch Online N64 Controller Compares To The Real Thing"
        },
        {
          "id": "https://www.nintendolife.com/#article-122929",
          "author": null,
          "description": "Customs charges, begone!\nLet's be honest, regardless of our age many frequenting these pages have various gaming collectibles and toys that more boring people would frown upon. You know, all those plushes and expensive limited editions of games, when some would rather buy a nice new lamp for the sitting room.\nFor those of us eager to add to our collections, Fangamer is definitely in the mix when it comes to online retailers. If you're not in North America, however, shipping and customs charges can often be as expensive - sometimes more so - than the actual item. Fangamer is aiming to improve matters for European shoppers soon, though, confirming that it'll open an EU store that will distribute locally.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/fangamer-is-finally-getting-an-eu-store",
          "publishedOn": "2021-10-29T10:00:00.000Z",
          "wordCount": 1573,
          "title": "Fangamer Is Finally Getting An EU Store"
        },
        {
          "id": "https://www.nintendolife.com/#article-122931",
          "author": null,
          "description": "And yes, it's coming to Switch.\nMicroids has revealed the first assets for its video game revival of UFO Robo Grendizer, one of the classic 'super robot' manga and anime series from the 1970s.\nCreated by Kiyoshi Nagai – better known as Go Nagai – UFO Robo Grendizer (or just plain old 'Grendizer' in the case of this new game) was released in North America under the title Force Five: Grandizer, and the series found a receptive audience in other parts of the world, including France, Canada, Italy and the Middle East.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/classic-mech-anime-ufo-robo-grendizer-is-getting-a-new-video-game-in-2023",
          "publishedOn": "2021-10-29T09:30:00.000Z",
          "wordCount": 1226,
          "title": "Classic Mech Anime 'UFO Robo Grendizer' Is Getting A New Video Game In 2023"
        },
        {
          "id": "https://www.nintendolife.com/#article-122924",
          "author": null,
          "description": "Fitness is forever.\nFamitsu's Japanese chart figures are in for the week ending 24th October, and they reflect a relatively quiet week in terms of software.\nThe only new entry in the top 10 is Blue Reflection: Second Light, which has a PS4 version in 2nd and the Switch iteration in 7th. The first two places are both PS4 titles, but then the top 10 is all Nintendo Switch. There are quite a few evergreen titles, while Metroid Dread sales more than halved to see it drop to 4th this week.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/japanese-charts-ring-fit-adventure-rises-to-third-as-switch-oled-sales-increase",
          "publishedOn": "2021-10-29T09:00:00.000Z",
          "wordCount": 1737,
          "title": "Japanese Charts: Ring Fit Adventure Rises To Third As Switch OLED Sales Increase"
        },
        {
          "id": "https://www.nintendolife.com/#article-122922",
          "author": null,
          "description": "And the 'Breakers Collection' has been delayed.\nQUByte Interactive held its 'QUByte Connect' broadcast earlier on - announcing a whole slew of upcoming Nintendo Switch releases.\nPerhaps the most exciting of the lot was the reveal the arcade and Neo Geo tag team fighter Rage of the Dragons would be getting a re-release at some point in the future. It first arrived in 2002 and was originally developed by BrezzaSoft, Noise Factory, and Evoga Entertainment, and published by Playmore Corp (SNK).\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/neo-geo-tag-team-fighter-rage-of-the-dragons-is-coming-to-switch",
          "publishedOn": "2021-10-29T03:55:00.000Z",
          "wordCount": 1946,
          "title": "Neo Geo Tag Team Fighter Rage Of The Dragons Is Coming To Switch"
        },
        {
          "id": "https://www.nintendolife.com/#article-122803",
          "author": null,
          "description": "Update: Guardian of Remembrance goes live.\nUpdate : The Wave 2 DLC for Hyrule Warriors: Age of Calamity is now officially live. To access this content, you'll need to first update your own copy of the game to version 1.3.0 which was made available earlier this week.\n\nOriginal story : Back in June, Nintendo and Koei Tecmo released the first wave of DLC content for Hyrule Warriors: Age of Calamity - bumping the game up to version 1.2.0.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/hyrule-warriors-age-of-calamity-version-1-3-0-is-now-available-wave-2-dlc-adjustments-fixes-and-more",
          "publishedOn": "2021-10-29T02:45:00.000Z",
          "wordCount": 3828,
          "title": "Hyrule Warriors: Age Of Calamity Version 1.3.0 Is Now Available - Wave 2 DLC, Adjustments, Fixes And More"
        },
        {
          "id": "https://www.nintendolife.com/#article-122921",
          "author": null,
          "description": "Let us know!\n\nToday sees the arrival of Mario Party Superstars on the Nintendo Switch. Believe it or not, but it's actually the second Mario Party game to be released on the hybrid system.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/poll-mario-party-superstars-is-out-today-on-switch-are-you-getting-it",
          "publishedOn": "2021-10-29T02:05:00.000Z",
          "wordCount": 3414,
          "title": "Poll: Mario Party Superstars Is Out Today On Switch, Are You Getting It?"
        },
        {
          "id": "https://www.nintendolife.com/#article-122920",
          "author": null,
          "description": "Get ready to party like it's 1999.\n\nNintendo's big release this week is Mario Party Superstars and it's a bit of a throwback to past generations. It features 100 classic minigames from the GameCube and Nintendo 64 generations, but is it actually worth forking out for?\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/round-up-the-reviews-are-in-for-mario-party-superstars",
          "publishedOn": "2021-10-29T01:05:00.000Z",
          "wordCount": 3020,
          "title": "Round Up: The Reviews Are In For Mario Party Superstars"
        },
        {
          "id": "https://www.nintendolife.com/#article-122906",
          "author": null,
          "description": "Probably about what you'd expect.\nDiablo II: Resurrected has been out in the wild for over a month, no doubt bringing delicious nostalgia for fans despite server issues that rumbled on for far longer than desired. It's an interesting release from a technical perspective, as it remasters a game from 2000 with updated visuals and performance, while also arriving on a broad range of systems - including the Switch, of course.\nDigital Foundry has produced a video breaking down performance, though it always feels a little unfair when Switch is put up against PS5 and Xbox Series consoles - the counter-argument would be that those are the 'current-gen' systems, which is a decent point. In any case it's an interesting analysis, especially in light of Diablo III: Eternal Collection being pretty solid on Nintendo's system back in 2018.\nRead the full article on nintendolife.com",
          "link": "https://www.nintendolife.com/news/2021/10/digital-foundry-gives-its-verdict-on-diablo-ii-resurrected-on-switch",
          "publishedOn": "2021-10-28T20:00:00.000Z",
          "wordCount": 2992,
          "title": "Digital Foundry Gives Its Verdict On Diablo II: Resurrected On Switch"
        }
      ]
    },
    {
      "title": "Rock Paper Shotgun Latest Articles Feed",
      "feedUrl": "https://www.rockpapershotgun.com/feed",
      "siteUrl": "https://www.rockpapershotgun.com/feed",
      "articles": [
        {
          "id": "https://www.rockpapershotgun.com/220-for-a-27-in-1440p-144hz-viewsonic-monitor-is-an-absolute-steal",
          "author": "Will Judd",
          "description": "It's rare to see a legitimately good 1440p 144Hz monitor for less than $250, but right now ViewSonic's VX2758-2KP-MHD is on sale at Newegg for $220 - a stunning $110 (33%) reduction from its original price of $330. \nThis 'Shell Shocker' sale ends in just a few hours, so do pick this up if you're in the market for a high-end gaming monitor at bargain basement prices!\nRead more",
          "link": "https://www.rockpapershotgun.com/220-for-a-27-in-1440p-144hz-viewsonic-monitor-is-an-absolute-steal",
          "publishedOn": "2021-10-30T01:14:39.000Z",
          "wordCount": 925,
          "title": "$220 for a 27-in 1440p 144Hz ViewSonic monitor is an absolute steal"
        },
        {
          "id": "https://www.rockpapershotgun.com/wds-2tb-sn550-nvme-ssd-is-well-cheap-on-amazon-uk",
          "author": "Will Judd",
          "description": "One of our former best gaming SSD picks, the WD Blue SN550, is down to just £140 on Amazon for a massive 2TB model. That's a historic low price by around £15 and a good £40 what it cost just a few weeks ago, making this a very good time to pick up a high performance NVMe SSD on the cheap. \nRead more",
          "link": "https://www.rockpapershotgun.com/wds-2tb-sn550-nvme-ssd-is-well-cheap-on-amazon-uk",
          "publishedOn": "2021-10-30T00:58:20.000Z",
          "wordCount": 1025,
          "title": "WD's 2TB SN550 NVMe SSD is well cheap on Amazon UK"
        },
        {
          "id": "https://www.rockpapershotgun.com/mushrooms-mould-and-killer-plants-the-best-horror-isnt-animal-its-vegetable",
          "author": "Ewan Wilson",
          "description": "Ever since I witnessed a little red-and-blue plumber-man tumble into the gnashing jaws of a Piranha Plant, I knew vegetables weren’t to be trusted. I see my suspicion of all things green and floral as a natural, even instinctual thing. We ourselves aren’t vegetable, and differences so often motivate our deepest fears. The vegetal realm is entirely inaccessible to us, its behaviour strange and habitats dark. From the carnivorous Venus flytrap to the bleeding tooth fungus, from plants that smell like rotting corpses to one's that trap prey and dissolve them with digestive fluids, it’s an unknown, often dangerous world, and one that overlaps closely with our own. And it makes for a compelling game.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/mushrooms-mould-and-killer-plants-the-best-horror-isnt-animal-its-vegetable",
          "publishedOn": "2021-10-29T16:00:00.000Z",
          "wordCount": 1845,
          "title": "Mushrooms, mould and killer plants: the best horror isn't animal, it's vegetable"
        },
        {
          "id": "https://www.rockpapershotgun.com/guardians-of-the-galaxy-worldmind",
          "author": "Hayden Hefford",
          "description": "Want to know how to convince the Worldmind in Guardians Of The Galaxy? The adventure to save the galaxy doesn’t just involve shooting Chitauri and cracking jokes. Throughout Guardians Of The Galaxy, you engage in conversations with various characters, in which you can make decisions that will alter the course of the game. Most of these have small, fairly insignificant consequences. However, the conversation with the Worldmind in Chapter 9 could help you get some crucial help in a difficult fight later in the game.\nThis guide will show you the correct choices to make to convince the Worldmind that Raker can be defeated in Guardians Of The Galaxy.\nRead more",
          "link": "https://www.rockpapershotgun.com/guardians-of-the-galaxy-worldmind",
          "publishedOn": "2021-10-29T15:59:37.000Z",
          "wordCount": 994,
          "title": "How to convince the Worldmind in Guardians Of The Galaxy"
        },
        {
          "id": "https://www.rockpapershotgun.com/an-ode-to-kain-from-blood-omen-and-his-legacy-including-untitled-goose-game",
          "author": "Nic Reuben",
          "description": "Steam user genre tags can be awful. Cyberpunk 2077 was, for example, tagged ‘masterpiece’ for months before the first gameplay trailer, while the much more reasonable and catchy ‘looks cool sure but too early to say anything definitive if we’re being adults about it’ tag was strangely absent. Happily, they are sometimes wonderful, like the tag alongside ‘comedy’ and ‘indie’ that categorises avian arsehole adventure Untitled Goose Game as having a ‘villain protagonist’. \r\n\n\r\nI’ve been thinking about villain protagonists a fair amount this week because GOG just graced our collective thinking tellies with 1996 Zelda-like Blood Omen: Legacy of Kain, in all its richly overwrought, gothic, inimitably voice-acted splendour. I would estimate this news finds you, reader, in one of two categories: those who give not a fig, and those who give so many figs they are currently scrabbling the world’s few remaining fig-bearing trees, searching vainly for an adequate quantity of figs.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/an-ode-to-kain-from-blood-omen-and-his-legacy-including-untitled-goose-game",
          "publishedOn": "2021-10-29T15:38:38.000Z",
          "wordCount": 1544,
          "title": "An ode to Kain from Blood Omen and his Legacy - including Untitled Goose Game"
        },
        {
          "id": "https://www.rockpapershotgun.com/pubg-company-buying-subnautica-studio-unknown-worlds",
          "author": "Alice O'Connor",
          "description": "Krafton, the South Korean company behind Plunkbat and Tera, today announced that they're buying Unknown Worlds, the studio splendid subaquatic survival sim series Subnautica and the fantastic FPS-RTS hybrid Natural Selection. Huh! The professed plan is for them to keep on as usual, still working on the Subnauticae as well as a mystery game debuting next year.\nRead more",
          "link": "https://www.rockpapershotgun.com/pubg-company-buying-subnautica-studio-unknown-worlds",
          "publishedOn": "2021-10-29T15:10:41.000Z",
          "wordCount": 947,
          "title": "PUBG company buying Subnautica studio Unknown Worlds"
        },
        {
          "id": "https://www.rockpapershotgun.com/ultimate-audio-bang-17-weird-and-wonderful-fps-vocab",
          "author": "Ed Thorn",
          "description": "This time, I've returned from a trip to Devon having spent too much time ignoring my friends and playing Hollow Knight instead. But what about FPSes? Well, I didn't play any of those. Thankfully Imogen has all of us covered on this week's episode of the Ultimate Audio Bang, with a news segment rammed with lots of exciting announcements. Namely, Apex Legends gets a new Legend and map, Halo Infinite sees a new trailer, and Call Of Duty's new anti-cheat Ricochet leaks early.\nRead more",
          "link": "https://www.rockpapershotgun.com/ultimate-audio-bang-17-weird-and-wonderful-fps-vocab",
          "publishedOn": "2021-10-29T15:00:00.000Z",
          "wordCount": 842,
          "title": "Ultimate Audio Bang #17: weird and wonderful FPS vocab"
        },
        {
          "id": "https://www.rockpapershotgun.com/guardians-of-the-galaxy-length",
          "author": "Hayden Hefford",
          "description": "Want to know how long it takes to beat Guardians Of The Galaxy? This planet-hopping adventure takes you on the cosmic ride of your life in an original Guardians Of The Galaxy story, involving plenty of punching, shooting, and generally jumping around with jet boots. Throughout the adventure, you'll come across many classic characters, such as Cosmo the spacedog, Adam Warlock, Mantis, Fin Fang Foom, and Lady Hellbender. However, since it isn't based directly on a certain comic storyline or movie, it can be hard to judge how long you'll actually spend playing Marvel's Guardians Of The Galaxy.\nThis guide will break down how long it takes to beat Guardians Of The Galaxy, including a list of chapters so that you can figure out how far you are through the adventure.\nRead more",
          "link": "https://www.rockpapershotgun.com/guardians-of-the-galaxy-length",
          "publishedOn": "2021-10-29T14:47:54.000Z",
          "wordCount": 1073,
          "title": "How long is the Guardians Of The Galaxy game?"
        },
        {
          "id": "https://www.rockpapershotgun.com/carve-pumpkins-for-a-virtual-pumpkin-festival-in-this-free-indie-game",
          "author": "Alice O'Connor",
          "description": "Last Halloween, Alice Bee visited Ghost Town's 999th Annual Pumpkin Festival, carving a pumpkin of her own to place amongst the spooky virtual showcase. It was a lovely little indie game from Adam \"Adamgryu\" Robinson-Yu, creator of the much-adored A Short Hike. Well, Halloween is upon us again, and Mayor Bones has returned with another gourd-o-rama, putting servers back online and inviting us to contribute new pumpkins. It's still lovely.\nRead more",
          "link": "https://www.rockpapershotgun.com/carve-pumpkins-for-a-virtual-pumpkin-festival-in-this-free-indie-game",
          "publishedOn": "2021-10-29T13:41:36.000Z",
          "wordCount": 881,
          "title": "Carve pumpkins for a virtual pumpkin festival in this free indie game"
        },
        {
          "id": "https://www.rockpapershotgun.com/hitman-3-and-the-riftbreaker-are-the-first-games-with-intel-xess-support",
          "author": "James Archer",
          "description": "Amidst all the excitement of Intel’s 12th Gen Alder Lake CPUs, let’s not forget that the first Intel dedicated graphics cards are on their way. Codenamed Arc Alchemist, these GPUs will launch alongside XeSS (Xe Super Sampling), an Nvidia DLSS-style upscaling/anti-aliasing piece of tech that promises to boost performance while sharpening up those jagged edges. And we now know the first two games that will support XeSS: Hitman 3 and The Riftbreaker.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/hitman-3-and-the-riftbreaker-are-the-first-games-with-intel-xess-support",
          "publishedOn": "2021-10-29T13:32:41.000Z",
          "wordCount": 1041,
          "title": "Hitman 3 and The Riftbreaker are the first games with Intel XeSS support"
        },
        {
          "id": "https://www.rockpapershotgun.com/where-are-all-the-good-stephen-king-games",
          "author": "Rebecca Jones",
          "description": "Halloweekend is almost upon us and sitting on my coffee table is my battered old paperback copy of Skeleton Crew, a 1985 collection of short horror stories by Stephen King. Back in my wild teenage years I binged King's entire back-catalogue of published fiction, and now that it's been long enough for me to have forgotten most of the details, I'm treating myself to some selective re-reads. Fair to say some of his stuff hasn't aged brilliantly, but despite many rough edges he undeniably remains one of my all-time favourite authors. I am, after all, a self-confessed horror nerd.\n Read more",
          "link": "https://www.rockpapershotgun.com/where-are-all-the-good-stephen-king-games",
          "publishedOn": "2021-10-29T12:30:00.000Z",
          "wordCount": 2025,
          "title": "Where are all the good Stephen King games?"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-rally-point-the-riftbreaker-is-light-on-strategy-but-carries-a-lot-with-it",
          "author": "Sin Vega",
          "description": "I hesitated. Not to play The Riftbreaker, you understand. I'd played its demo last year, which was enough to sell me on playing the full game. But to cover it as a strategy game is another matter.\nIt does games in particular a disservice to get prescriptive with genre, but there's no question that Riftbreaker falls under 'action strategy', with an even greater emphasis on action than, say, Hostile Waters or Sacrifice. But then, it also has detailed base building, tower defence, and a tonne of resource management. I've given up trying to categorise it, and it will always be distinct from most strategy games, but I think its peers could still learn a few things from it.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-rally-point-the-riftbreaker-is-light-on-strategy-but-carries-a-lot-with-it",
          "publishedOn": "2021-10-29T12:00:00.000Z",
          "wordCount": 2224,
          "title": "The Rally Point: The Riftbreaker is light on strategy but carries a lot with it"
        },
        {
          "id": "https://www.rockpapershotgun.com/facebook-parent-company-now-named-meta-unveiling-vision-of-a-metaverse",
          "author": "Alice O'Connor",
          "description": "The company behind Facebook and Oculus, previously known as Facebook, have unveiled a new name: Meta. Oh christ. Yes, it is named after the metaverse, because tech megacorps can't resist the delusion that their platform to sell adverts is elevating humanity to a new plane of existence. Mark Zuckerberg suggests that in the future they're building, you'll experience everything through virtual and augmented reality, and that definitely won't be a horrible world devoid of intimacy, okay, it'll be great.\nRead more",
          "link": "https://www.rockpapershotgun.com/facebook-parent-company-now-named-meta-unveiling-vision-of-a-metaverse",
          "publishedOn": "2021-10-29T11:01:27.000Z",
          "wordCount": 1177,
          "title": "Facebook parent company now named Meta, unveiling vision of a metaverse"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-wd-black-sn750-1tb-nvme-ssd-is-87-for-1tb-good-deal",
          "author": "Will Judd",
          "description": "The WD Black SN750 is a super-fast PCIe 3.0 SSD - and the 1TB model is down to £87 at Amazon UK, a historic low price. That's a fantastic price for what was once among the fastest NVMe SSDs on the planet, with read speeds up to nearly 3500MB/s... before the advent of faster (and more expensive) PCIe 4.0 drives in the last couple of years. \nStill, in terms of value for money, this TLC drive with a DRAM cache is going to be hard to beat - especially as the only real competitors tend to come with QLC NAND or without a DRAM cache, both of which sacrifice performance to hit lower price points!\nRead more",
          "link": "https://www.rockpapershotgun.com/the-wd-black-sn750-1tb-nvme-ssd-is-87-for-1tb-good-deal",
          "publishedOn": "2021-10-28T22:16:02.000Z",
          "wordCount": 983,
          "title": "The WD Black SN750 1TB NVMe SSD is £87 for 1TB: good deal"
        },
        {
          "id": "https://www.rockpapershotgun.com/razers-viper-ultimate-mouse-is-nearly-100-off-at-amazon-uk",
          "author": "Will Judd",
          "description": "As I've mentioned before, the Razer Viper is one of my favourite ultralight gaming mice of all time, and today the Ultimate wireless version is marked it down from £170 all the way to £73 at Amazon UK.\nThat's an incredibly good price considering this is the model that comes with a handy charging dock to ensure your mouse is always topped up without ever fussing with a cable. \nRead more",
          "link": "https://www.rockpapershotgun.com/razers-viper-ultimate-mouse-is-nearly-100-off-at-amazon-uk",
          "publishedOn": "2021-10-28T21:26:33.000Z",
          "wordCount": 1043,
          "title": "Razer's Viper Ultimate mouse is nearly £100 off at Amazon UK"
        },
        {
          "id": "https://www.rockpapershotgun.com/activision-blizzard-ceo-commits-to-waiving-forced-arbitration-and-a-temporary-paycut",
          "author": "Alice O'Connor",
          "description": "Activision Blizzard CEO Bobby Kotick has detailed plans for the company to rebuild itself following numerous legal cases and protests over alleged harrassment, discrimination, and retaliation at the company. Key points include a policy of zero-tolerance for harassment and an end to forced abitration in claims of sexual harrassment and discrimination. An employee group call this \"a huge win\". And Kotick himself has volunteered to take a huge pay cut until they achieve their stated goals.\nRead more",
          "link": "https://www.rockpapershotgun.com/activision-blizzard-ceo-commits-to-waiving-forced-arbitration-and-a-temporary-paycut",
          "publishedOn": "2021-10-28T18:44:09.000Z",
          "wordCount": 1031,
          "title": "Activision Blizzard CEO commits to waiving forced arbitration, and a temporary paycut"
        },
        {
          "id": "https://www.rockpapershotgun.com/apex-legends-new-hero-ash-hunts-squads-with-titanfall-inspired-abilities",
          "author": "Imogen Beckhelling",
          "description": "Apex Legends' next season, Escape, kicks off next week, and it introduces the new playable character Ash. She's a simulacrum (read: human brain in robot body) that you might recognise as the evil pilot from Titanfall 2's Into The Abyss level, or as the overseer of Apex Legends' 3v3 Arenas mode. Now she's descending into the Apex games herself, and having taken her for a spin already, I reckon she has some delightfully aggressive abilities that Wraith players in particular are going to enjoy. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/apex-legends-new-hero-ash-hunts-squads-with-titanfall-inspired-abilities",
          "publishedOn": "2021-10-28T17:05:00.000Z",
          "wordCount": 1194,
          "title": "Apex Legends' new hero Ash hunts squads with Titanfall-inspired abilities"
        },
        {
          "id": "https://www.rockpapershotgun.com/apex-legends-ash-abilities-tips-tricks",
          "author": "Ollie Toms",
          "description": "Want to know about Ash's abilities in Apex Legends? The upcoming addition to the Apex Legends roster will arrive next week, along with a brand new map, the new CAR SMG, and a host of weapon and Legend balance changes. Ash is turning a lot of heads thanks both to her complex and fascinating backstory and to her powerful and versatile array of abilities.\nBelow we'll walk you through how each of Ash's abilities work in detail, so you can get off to a great start with her once Season 11 drops. We'll also detail Ash's backstory for those who need to know every last detail about this dangerous new Legend.\nRead more",
          "link": "https://www.rockpapershotgun.com/apex-legends-ash-abilities-tips-tricks",
          "publishedOn": "2021-10-28T17:00:00.000Z",
          "wordCount": 2311,
          "title": "Apex Legends Ash abilities"
        },
        {
          "id": "https://www.rockpapershotgun.com/apex-legends-car-stats",
          "author": "Ollie Toms",
          "description": "Looking for up-to-date and accurate CAR SMG stats for Apex Legends? The CAR is Season 11's addition to the Apex Legends weapons arsenal, and it's got a very impressive array of stats to show off. But what's truly unique about the CAR is its ability to use both Heavy and Light Ammo, and toggle between them at the touch of a button.\nKeep reading for an in-depth look at the CAR SMG in Apex Legends, along with detailed stats covering everything from damage profiles and shots to kill to reload times and attachment slots.\nRead more",
          "link": "https://www.rockpapershotgun.com/apex-legends-car-stats",
          "publishedOn": "2021-10-28T17:00:00.000Z",
          "wordCount": 1079,
          "title": "Apex Legends CAR SMG stats [Season 11]"
        },
        {
          "id": "https://www.rockpapershotgun.com/apex-legends-new-map-stormpoint-comes-with-vicious-wildlife-and-excellent-cannons",
          "author": "Imogen Beckhelling",
          "description": "Beach map! Beach map! Beach map! Apex Legends' next season, Escape, is right around the corner, and it's bringing a tropical island to fight on. It's also bringing a the new Legend Ash, the CAR SMG and more, but most importantly: beach map! I had a chance to play a little of Respawn's battle royale in this new arena, and it is delightful. Named Stormpoint, it's the FPS's fourth map, and not only is it lovely to look at, but it's full of cool locations to explore and dangerous wildlife to dodge. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/apex-legends-new-map-stormpoint-comes-with-vicious-wildlife-and-excellent-cannons",
          "publishedOn": "2021-10-28T17:00:00.000Z",
          "wordCount": 1243,
          "title": "Apex Legends' new map Stormpoint comes with vicious wildlife and excellent cannons"
        },
        {
          "id": "https://www.rockpapershotgun.com/inscryption-is-horrifying-because-it-does-things-games-arent-supposed-to",
          "author": "Imogen Beckhelling",
          "description": "Daniel Mullins says he's not sure that \"horror\" is the most accurate way to describe his gruesome new card battler Inscryption. He immediately follows this up by telling me a friend of his had nightmares because of the menacing figure you play cards against, so yeah, maybe it's a bit horror-like. But I kind of understand his point. \r\n\n\r\nAt the start, Inscryption is like a hostage situation, where you're forced to play a card-based roguelike against a sinister games master. Then, just as you start getting the hang of things, the game evolves into something way more complex. If you've played Mullins' other games you'll know his work can go to some weird, meta places. I won't say more above the cut, because I'd hate to spoil it. But for those of you who've already played, read on for more detail on how Mullins created an excellently unsettling world.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/inscryption-is-horrifying-because-it-does-things-games-arent-supposed-to",
          "publishedOn": "2021-10-28T16:00:00.000Z",
          "wordCount": 2328,
          "title": "Inscryption is horrifying because it does things games aren't supposed to"
        },
        {
          "id": "https://www.rockpapershotgun.com/square-enix-announce-star-ocean-the-divine-force",
          "author": "Alice O'Connor",
          "description": "Tri-Ace's action-RPG series Star Ocean will return with a new game next year, Square Enix have announced. Though the series started 25 years ago on the SNES, you needn't concern yourself with that history because Squeenix say Star Ocean The Divine Force will tell a new story with new characters. Come meet them and see some of the sci-fantasy world in the trailer below.\nRead more",
          "link": "https://www.rockpapershotgun.com/square-enix-announce-star-ocean-the-divine-force",
          "publishedOn": "2021-10-28T13:55:03.000Z",
          "wordCount": 803,
          "title": "Square Enix announce Star Ocean The Divine Force"
        },
        {
          "id": "https://www.rockpapershotgun.com/forget-far-cry-6-the-bugs-in-hollow-knight-can-send-me-snarky-emails-anytime",
          "author": "Ed Thorn",
          "description": "Recently, I've heard tales of Far Cry 6 players receiving snarky emails from Ubisoft about how much time they've spent in-game. They're supposed to read as if Anton Castillo, the game's evil dictator, is mocking you for not investing enough of it toppling his regime.\nAnd even if you've spent a lot of time clearing Castillo's map markers, he'll still send you emails anyway. They feature stats like time played, checkpoints cleared, that sort of thing. Many people don't seem to like this, which I totally understand. But a part of me wishes these rude marketing emails were more of a thing. Specifically, I'd like it if the bugs from Hollow Knight spun some my way.\nRead more",
          "link": "https://www.rockpapershotgun.com/forget-far-cry-6-the-bugs-in-hollow-knight-can-send-me-snarky-emails-anytime",
          "publishedOn": "2021-10-28T10:00:00.000Z",
          "wordCount": 787,
          "title": "Forget Far Cry 6, the bugs in Hollow Knight can send me snarky emails anytime"
        },
        {
          "id": "https://www.rockpapershotgun.com/guardians-of-the-galaxy-tips",
          "author": "Hayden Hefford",
          "description": "Want to know some tips and tricks for Guardians Of The Galaxy? The adventure will take you across the vast galaxy in search of fortune, fun, and a whole lot of kicking ass, but you won’t make it far without a solid grasp of the mechanics in Guardians Of The Galaxy.\nThis guide will offer some tips and tricks that you’ll need to get familiar with if you want to turn your rag-tag group of misfits into a heroic team to be feared. We'll cover tips for all of the main aspects of the game, including combat, exploring, and all of the chats that you'll have with your teammates during your adventure.\nRead more",
          "link": "https://www.rockpapershotgun.com/guardians-of-the-galaxy-tips",
          "publishedOn": "2021-10-28T09:51:21.000Z",
          "wordCount": 1613,
          "title": "Guardians Of The Galaxy tips"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-the-brand-new-steelseries-arctis-7p-gaming-headset-for-12-off",
          "author": "Will Judd",
          "description": "The SteelSeries Arctis 7P+ is a brand new gaming headset, offering a series of small upgrades over the already-brilliant Arctis 7P. It's rare to see new items discounted right away, but today you can get this new model up for 12% off with code MOUNTAIN12.\nRead more",
          "link": "https://www.rockpapershotgun.com/get-the-brand-new-steelseries-arctis-7p-gaming-headset-for-12-off",
          "publishedOn": "2021-10-28T01:00:35.000Z",
          "wordCount": 841,
          "title": "Get the brand new SteelSeries Arctis 7P+ gaming headset for 12% off"
        },
        {
          "id": "https://www.rockpapershotgun.com/pnys-great-value-ddr4-ram-is-going-cheap-in-the-us",
          "author": "Will Judd",
          "description": "PNY isn't the first name you might think of when it comes to RAM, but they're sometimes a great value - including today, when a series of RAM kits are on sale in stores across the US. Here are the links - and some words about why you should consider them. \nRead more",
          "link": "https://www.rockpapershotgun.com/pnys-great-value-ddr4-ram-is-going-cheap-in-the-us",
          "publishedOn": "2021-10-28T00:45:23.000Z",
          "wordCount": 830,
          "title": "PNY's great value DDR4 RAM is going cheap in the US"
        },
        {
          "id": "https://www.rockpapershotgun.com/can-my-darkest-dungeon-2-party-please-shut-up-for-five-minutes",
          "author": "Alice O'Connor",
          "description": "In time, you will know the tragic extent of my failings, but in Darkest Dungeon 2 goodness me you'll hear about everyone's failings constantly. The horrific dungeon-crawling sequel entered early access yesterday, and my initial impression is that I'm surrounded by squabbling children. Managing the stress of your heroes is more important than ever, because if anyone is even mildly irked they will interrupt every fight to shout about how their squadmate is a kill-stealing dick. I'm this close to turning the stagecoach back around and embracing the impending apocalypse.\nRead more",
          "link": "https://www.rockpapershotgun.com/can-my-darkest-dungeon-2-party-please-shut-up-for-five-minutes",
          "publishedOn": "2021-10-27T17:13:36.000Z",
          "wordCount": 1083,
          "title": "Can my Darkest Dungeon 2 party please shut up for five minutes"
        },
        {
          "id": "https://www.rockpapershotgun.com/all-i-want-for-spook-month-is-more-classic-survival-horror",
          "author": "Nic Reuben",
          "description": "Listen. Outside your window, the chill wind chuckles in raspy glee at autumn’s death rattle. The branches of dying trees rake their gnarled fingers against the glass. You are spooked. You turn to the warm glow of your monitor for comfort. Instead, you find the most terrifying thing imaginable: an unpopular opinion about a videogame. On the internet, no less. You blink and rub your eyes in disbelief. Still, the words remain. Stark. Unforgiving. Undeniably spicy: “Resident Evil Village was disappointing and its success does not bode well for the future of survival horror.” \r\n\n\r\nYou go to type a comment but, uh, your fingers are gone, or something. Just hear me out. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/all-i-want-for-spook-month-is-more-classic-survival-horror",
          "publishedOn": "2021-10-27T16:30:00.000Z",
          "wordCount": 2003,
          "title": "All I want for spook month is more classic survival horror"
        },
        {
          "id": "https://www.rockpapershotgun.com/intel-12th-gen-alder-lake-cpus-specs-price-features",
          "author": "James Archer",
          "description": "After a months-long spin around the rumour mill, the first batch of Intel 12th Gen Alder Lake CPUs is official. Despite the 11th Gen Rocket Lake chips only launching earlier this year, Alder Lake represents the biggest generational jump for Intel in over half a decade, thanks to its completely redesigned “hybrid” architecture and DDR5 memory support. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/intel-12th-gen-alder-lake-cpus-specs-price-features",
          "publishedOn": "2021-10-27T16:00:07.000Z",
          "wordCount": 2251,
          "title": "Intel 12th Gen Alder Lake CPUs announced: everything you need to know"
        },
        {
          "id": "https://www.rockpapershotgun.com/satisfactory-adding-train-signals-train-timetables-and-train-crashes",
          "author": "Alice O'Connor",
          "description": "As factory-building sim Satisfactory continues to assemble itself through early access, the next major update runs a real risk of becoming a train wreck. Now in public testing, Update 5 introduces new features to manage train timetables and routes, and you'll want to pay attention to those because trains can now crash.\nRead more",
          "link": "https://www.rockpapershotgun.com/satisfactory-adding-train-signals-train-timetables-and-train-crashes",
          "publishedOn": "2021-10-27T14:24:04.000Z",
          "wordCount": 940,
          "title": "Satisfactory adding train signals, train timetables, and train crashes"
        },
        {
          "id": "https://www.rockpapershotgun.com/shadow-warrior-3-delayed-into-next-year",
          "author": "Alice O'Connor",
          "description": "The fast-paced, fast-talking violence of Shadow Warrior 3 will not arrive this year after all, now pushed back into \"early 2022.\" Devolver Digital and developers Flying Wild Hog explain it's the usual reason: they want more time to make the FPS good, yeah? A good reason. For now, you can watch the new trailer announcing the delay.\nRead more",
          "link": "https://www.rockpapershotgun.com/shadow-warrior-3-delayed-into-next-year",
          "publishedOn": "2021-10-27T10:46:10.000Z",
          "wordCount": 872,
          "title": "Shadow Warrior 3 delayed into next year"
        },
        {
          "id": "https://www.rockpapershotgun.com/wds-insanely-big-14tb-hdd-is-down-to-222-almost-90-off",
          "author": "Will Judd",
          "description": "Western Digital's 14TB Elements external hard drive is one of the largest you can buy, making it ideal for backing up entire computers, storing massive media libraries and generally being a massive data hoarder. It normally retails for around £300, but today it's dropped down to £222, an £89 discount below RRP. \nRead more",
          "link": "https://www.rockpapershotgun.com/wds-insanely-big-14tb-hdd-is-down-to-222-almost-90-off",
          "publishedOn": "2021-10-26T20:37:44.000Z",
          "wordCount": 859,
          "title": "WD's insanely big 14TB HDD is down to £222, almost £90 off"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-best-pcie-40-ssd-weve-tested-is-going-cheap-at-amazon-uk",
          "author": "Will Judd",
          "description": "WD's SN850 SSD is the fastest SSD we've ever tested, beating out rivals like the Samsung 980 Pro and Crucial P5 Plus in most workloads. If you've got a PCIe 4.0 compatible PC - or a PS5 - then this is the NVMe SSD you want! Today, both the 1TB and 2TB sizes are discounted at Amazon UK, making it a great time to upgrade to the latest and greatest NVMe SSD. \nRead more",
          "link": "https://www.rockpapershotgun.com/the-best-pcie-40-ssd-weve-tested-is-going-cheap-at-amazon-uk",
          "publishedOn": "2021-10-26T20:18:13.000Z",
          "wordCount": 886,
          "title": "The best PCIe 4.0 SSD we've tested is going cheap at Amazon UK"
        },
        {
          "id": "https://www.rockpapershotgun.com/you-can-visit-new-vegas-again-in-a-fallout-4-mod",
          "author": "Alice O'Connor",
          "description": "What happens in New Vegas stays in New Vegas, they say, though New Vegas itself will not stay in Fallout: New Vegas. A new mod named Project Mojave is attempting to recreate a lot of the post-apocalyptic Sin City and surrounding areas as a Fallout 4 mod, and you can play the first slice now. But to manage your expectations: it is not an attempt to recreate Obsidian Entertainment's game Fallout: New Vegas inside Fallout 4.\nRead more",
          "link": "https://www.rockpapershotgun.com/you-can-visit-new-vegas-again-in-a-fallout-4-mod",
          "publishedOn": "2021-10-26T18:07:57.000Z",
          "wordCount": 868,
          "title": "You can visit New Vegas again in a Fallout 4 mod"
        },
        {
          "id": "https://www.rockpapershotgun.com/turbo-overkill-is-the-most-fun-youll-have-with-a-chainsaw-leg-interview",
          "author": "Imogen Beckhelling",
          "description": "Usually, I'd assume that if a chainsaw was near someone's leg, that'd be a problem. But, when the chainsaw is embedded into your own leg and you can flick it out every time you do a butt slide, well then, it's much more of a problem for your enemies' ankles. This is exactly what you're in for with Turbo Overkill, an upcoming shooter which took Apex Legends' excellent sliding mechanics and asked, \"What if we added deadly spinning blades?\" I've had a chat with game director Sam Prebble and even played a little bit myself, and I think you'll like the answer. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/turbo-overkill-is-the-most-fun-youll-have-with-a-chainsaw-leg-interview",
          "publishedOn": "2021-10-26T17:46:59.000Z",
          "wordCount": 1631,
          "title": "Turbo Overkill is the most fun you'll have with a chainsaw leg"
        },
        {
          "id": "https://www.rockpapershotgun.com/darkest-dungeon-2-is-out-now-in-early-access",
          "author": "Imogen Beckhelling",
          "description": "Darkest Dungeon 2 has launched in early access, inviting us all on a delightfully stressful wagon ride. The sequel to Red Hook Studios' dark roguelike moves away from expeditions in the gloomy Hamlet, and instead sends you on a journey through horrific lands to stop an apocalypse. The devs recently told me about why they're taking their gothic tale on the road, and it has something to do with wanting to emulate a rather uncomfortable road trip.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/darkest-dungeon-2-is-out-now-in-early-access",
          "publishedOn": "2021-10-26T16:16:44.000Z",
          "wordCount": 961,
          "title": "Darkest Dungeon 2 is out now in early access"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-to-enable-auto-hdr-in-windows-11",
          "author": "James Archer",
          "description": "Windows 11 may not be an essential upgrade yet, but its Auto HDR feature is mightily impressive: in games that don’t support HDR (high dynamic range) natively, it can apply similar brightness-boosting, colour-emboldening effects. There’s no performance loss, so if you’ve going to upgrade to Windows 11 on your gaming rig, it’s worth giving Auto HDR a try – and this guide will show you how to enable it.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/how-to-enable-auto-hdr-in-windows-11",
          "publishedOn": "2021-10-26T15:32:33.000Z",
          "wordCount": 1264,
          "title": "How to enable Auto HDR in Windows 11"
        },
        {
          "id": "https://www.rockpapershotgun.com/you-can-batter-people-with-fish-in-chivalry-2s-new-tavern-brawl-mode",
          "author": "Alice O'Connor",
          "description": "Swords are cool and all but the medieval fight I find a delight is a tavern brawl, so I'm chuffed to heck to see Chivalry 2 focus on them in a new mode. 'Brawl' mode has players rumble through feasts and halls, fighting with found weapons including chairs, steins, and giant fish. Oh yes, thank you. Also in the field of delightful foolishness is a new headbutt move for armless players to launch one desperate last attack.\nRead more",
          "link": "https://www.rockpapershotgun.com/you-can-batter-people-with-fish-in-chivalry-2s-new-tavern-brawl-mode",
          "publishedOn": "2021-10-26T15:04:03.000Z",
          "wordCount": 887,
          "title": "You can batter people with fish in Chivalry 2's new tavern brawl mode"
        },
        {
          "id": "https://www.rockpapershotgun.com/step-back-from-the-brink-in-precipice",
          "author": "Sin Vega",
          "description": "Brinkmanship doesn't get explored all that much in games. Precipice is almost certainly derived from Balance of Power, a political strategy simulation from 1985 about the Cold War powers and their winner-armageddons-all staring contest. It was impressively original, complex, and completely unplayable. Happily, Precipice has kept most of what made that game interesting to begin with, and dumped the baggage.\nRead more",
          "link": "https://www.rockpapershotgun.com/step-back-from-the-brink-in-precipice",
          "publishedOn": "2021-10-26T14:00:00.000Z",
          "wordCount": 674,
          "title": "Step back from the brink in Precipice"
        },
        {
          "id": "https://www.rockpapershotgun.com/rad-roguelike-caves-of-qud-has-added-friendlier-modes",
          "author": "Alice O'Connor",
          "description": "I've heard a lot about sci-fantasy roguelike Caves Of Qud, split between \"This game is amazing\" and \"This game sounds amazing but what am I doing and why do I keep dying?\" Good news for both types: the latest early access update has added new areas, factions, and items for experienced players to enjoy, while also adding two new friendlier modes. Character creation is overhauled too, complete with some helpful presets.\nRead more",
          "link": "https://www.rockpapershotgun.com/rad-roguelike-caves-of-qud-has-added-friendlier-modes",
          "publishedOn": "2021-10-26T13:52:03.000Z",
          "wordCount": 980,
          "title": "Rad roguelike Caves Of Qud has added friendlier modes"
        },
        {
          "id": "https://www.rockpapershotgun.com/lo-fi-horror-and-the-allure-of-an-uncanny-bitsy",
          "author": "Kat Brewster",
          "description": "A glitched out corner, textures too-smooth in some places and too-rough in others. Play some distorted audio, and add some film grain. That’s lo-fi horror, baby, and the lo-fi games that fit this brief can prey on the valley between the uncanny and the unknown. It’s no secret that the unknown is the scariest part of any horror media. Well, aside from that clown with extremely sharp and pointy teeth - but that’s a kind of unknown. Like... Who’s their dentist? Where’d they get that axe? You know what... I take it back. I don’t want to know that one. Let’s get back to those lo-fi videogames.\nRead more",
          "link": "https://www.rockpapershotgun.com/lo-fi-horror-and-the-allure-of-an-uncanny-bitsy",
          "publishedOn": "2021-10-26T12:00:00.000Z",
          "wordCount": 1576,
          "title": "Lo-fi horror and the allure of an uncanny Bitsy"
        },
        {
          "id": "https://www.rockpapershotgun.com/phasmophobia-has-added-a-haunted-campsite-and-new-ghosts",
          "author": "Alice O'Connor",
          "description": "If Halloween is best spent doing scary things with pals, Phasmophobia is one of the best games to play this Halloween. The cooperative game sends us to investigate haunted places, trying to capture evidence of ghosts without getting murdered by them. And now it's even more Halloween-y (well, technically Friday The 13th-y) thanks to a big new early access update, which has added a new map set in a haunted campground, new types of ghost, and new spooky weather. Great, just what I wanted in a game I'm already too scared to play.\nRead more",
          "link": "https://www.rockpapershotgun.com/phasmophobia-has-added-a-haunted-campsite-and-new-ghosts",
          "publishedOn": "2021-10-26T10:14:10.000Z",
          "wordCount": 965,
          "title": "Phasmophobia has added a haunted campsite map and new ghosts"
        },
        {
          "id": "https://www.rockpapershotgun.com/valve-confirm-steam-autumn-winter-and-halloween-sale-dates",
          "author": "Alice O'Connor",
          "description": "Valve can't keep sales secret. Every year, the big dates leak well in advance, whether whispered by devs or blasted by PayPal newsletters. This year, Valve are apparently content to say them in public where anyone might here. Hey, it's just a sale, why the secrecy? So yup, we now definitely know dates for the Steam Halloween Sale, the Steam Autumn Sale, and the Steam Winter Sale.\nRead more",
          "link": "https://www.rockpapershotgun.com/valve-confirm-steam-autumn-winter-and-halloween-sale-dates",
          "publishedOn": "2021-10-26T09:07:42.000Z",
          "wordCount": 815,
          "title": "Valve confirm Steam autumn, winter, and Halloween sale dates"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-lapa-loadout-warzone",
          "author": "Charlie Biggerstaff",
          "description": "Looking for the best LAPA loadout in Warzone Season 6? Treyarch and Raven Software are sending Cold War out with a bang, adding a series of unusual, interesting weapons in the final seasons. The LAPA SMG is the latest, and one of the most intriguing yet. Several of its barrel attachments alter the LAPA’s damage and fire rate. That variety makes the LAPA a very fun gun to customize and play around with. Of course, there is always a best configuration. Once you’ve had your fun and are ready to sweat, we’re here to help.\r\n\nThe LAPA’s range isn’t great, but up close it has monstrous potential. Its high neck and head multipliers make for a skill-dependant weapon, but in the right hands, with the right build, the LAPA fries. Here’s our build of choice:\r\n\nAs usual, we’re starting off with an Agency Suppressor. Added range and bullet velocity on a suppressor remain nigh-impossible to pass up. As long as you’re using a Cold War weapon, you’ll want this attachment. Things get interesting with the barrel. We’ve gone with the Rifled Barrel, which provides the most consistent damage profile. The LAPA very much relies on chest, neck, and headshots, but the Rifled Barrel helps even out the damage to the stomach and limbs. All of the barrels are frankly pretty close in power though, so try a few and see what feels right.\r\n \nRead more",
          "link": "https://www.rockpapershotgun.com/best-lapa-loadout-warzone",
          "publishedOn": "2021-10-26T08:36:48.000Z",
          "wordCount": 1154,
          "title": "Best LAPA loadout in Warzone Season 6"
        },
        {
          "id": "https://www.rockpapershotgun.com/moonglow-bay-review",
          "author": "Jay Castello",
          "description": "Everything in the seaside town of Moonglow Bay has seen better days. That includes you, a middle-aged accountant who’s moved out of the big city for a fresh start. But things never go quite to plan, do they? The moment-to-moment of Moonglow Bay is a chilled-out experience of getting out onto the waves, exploring various biomes, catching fish, and cooking them up to sell or gift to the townspeople. But within that is an exploration of things going awry, and letting go of old dreams in order to build new ones.\nRead more",
          "link": "https://www.rockpapershotgun.com/moonglow-bay-review",
          "publishedOn": "2021-10-25T17:00:00.000Z",
          "wordCount": 1607,
          "title": "Moonglow Bay review: a relaxing fishing RPG that's all about keeping it reel"
        },
        {
          "id": "https://www.rockpapershotgun.com/please-stop-with-all-the-godawful-emails-about-nft-gaming",
          "author": "Alice Bell",
          "description": "It started a few months ago: we got an email about shoes designed using 'blockchain technology', and had a good laugh about it as a concept. But in retrospect, this email was merely the ripple on a glass of water that go ahead of a T-Rex's mighty tread. Except in this analogy the T-Rex is one of 10,001 unique dinosaurs programatically generated from different traits. And it's wearing wacky sunglasses and smoking a pipe.\nRead more",
          "link": "https://www.rockpapershotgun.com/please-stop-with-all-the-godawful-emails-about-nft-gaming",
          "publishedOn": "2021-10-25T16:21:35.000Z",
          "wordCount": 712,
          "title": "Please, stop with all the godawful emails about NFT gaming"
        },
        {
          "id": "https://www.rockpapershotgun.com/no-more-heroes-developers-grasshopper-bought-by-netease",
          "author": "Alice O'Connor",
          "description": "Chinese publishers NetEase have bought Grasshopper Manufacture, the Japanese studio behind stylish, swaggering games including No More Heroes, The Silver Case, and Killer7. While NetEase have roots in mobile games, they have been investing in fancier things. Grasshopper say that with NetEase's cash, they plan to release \"three even higher-quality 'Grasshopper Manufacture Games'\" over the next decade.\nRead more",
          "link": "https://www.rockpapershotgun.com/no-more-heroes-developers-grasshopper-bought-by-netease",
          "publishedOn": "2021-10-25T14:36:45.000Z",
          "wordCount": 986,
          "title": "No More Heroes developers Grasshopper bought by NetEase"
        },
        {
          "id": "https://www.rockpapershotgun.com/halo-infinite-campaign-trailer-shows-big-levels-with-bases-to-capture",
          "author": "Alice O'Connor",
          "description": "After focusing a lot of attention on Halo Infinite's multiplayer, Microsoft have turned back to showing off the story campaign. Today's new campaign trailer, sadly, did not give us another hot WWE promo from a space-ape but it did kinda have Far Cry-ish vibes. Watch on for Master Chef zooming around big levels in vehicles, causing big explosions, upgrading his abilities, and bantering with his new Tamagotchi girlfriend.\nRead more",
          "link": "https://www.rockpapershotgun.com/halo-infinite-campaign-trailer-shows-big-levels-with-bases-to-capture",
          "publishedOn": "2021-10-25T13:51:14.000Z",
          "wordCount": 837,
          "title": "Halo Infinite campaign trailer shows big levels with bases to capture"
        },
        {
          "id": "https://www.rockpapershotgun.com/marvels-guardians-of-the-galaxy-review",
          "author": "Ed Thorn",
          "description": "In a video game landscape that's pocked with millions of map markers and vast open worlds, Marvel's Guardians Of The Galaxy is a linear action adventure game with a clear beginning, middle and an end. It's an approach that feels refreshingly old-school, in the way it guides you smoothly from one story bit to another. But this doesn't mean it's one big flatline without any peaks, troughs, or surprises.\nIf anything, the game as a whole is a wonderful surprise. Planet-hopping as Star Lord is great fun, made even better by his colourful compatriots and the genuinely funny craic they share. Marvel fan or clueless layman? Doesn't matter, you're in for a good time no matter where you sit on the MCU scale.\nRead more",
          "link": "https://www.rockpapershotgun.com/marvels-guardians-of-the-galaxy-review",
          "publishedOn": "2021-10-25T13:00:00.000Z",
          "wordCount": 1940,
          "title": "Marvel's Guardians Of The Galaxy review: a blast from the past"
        },
        {
          "id": "https://www.rockpapershotgun.com/happy-halloween-on-rps-have-a-load-of-horror-themed-writing-to-celebrate",
          "author": "Alice Bell",
          "description": "Happy Halloween you horrible little monsters! To celebrate the spookiest of all seasons - with the big day itself coming up at the weekend - we've got a whole host of horror-themed articles that you'll see spread out over the week. Like ectoplasm. Or toxic waste. Something thematically oozey. \nThese will get you in the mood for dressing as a character from a Resident Evil game, or a scary cat of some description. Keep checking the Halloween 2021 tag to see more appearing, out of thin air - like a g-g-g-ghost.\nRead more",
          "link": "https://www.rockpapershotgun.com/happy-halloween-on-rps-have-a-load-of-horror-themed-writing-to-celebrate",
          "publishedOn": "2021-10-25T12:39:23.000Z",
          "wordCount": 1480,
          "title": "It's Halloween Week on RPS, and we've got a load of horror-themed writing to celebrate"
        },
        {
          "id": "https://www.rockpapershotgun.com/overwatchs-mccree-will-be-renamed-cole-cassidy",
          "author": "Imogen Beckhelling",
          "description": "Blizzard have announced that Overwatch's McCree will be known as Cole Cassidy going forward. They're renaming the cowboy to distance him from his real-life namesake, former Blizzard employee Jesse McCree. He left the developer due to unknown reasons in August, but his departure came after the State of California filed a lawsuit against Activision Blizzard, alleging the company fostered a \"frat boy\" culture of sexual harassment and discrimination. The name change will take effect in-game tomorrow.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/overwatchs-mccree-will-be-renamed-cole-cassidy",
          "publishedOn": "2021-10-25T12:10:53.000Z",
          "wordCount": 961,
          "title": "Overwatch's McCree will be renamed Cole Cassidy"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-beatrix-potter-and-a-fear-of-open-water-inspired-the-surreal-limbo-like-horror-puzzler-silt",
          "author": "Katharine Castle",
          "description": "\"I have a phobia of animal suits, and I have done my entire life,\" says surreal artist and Spiral Circus' co-founder Tom Mead. I'm listening to him talk about the making of his latest game, Silt, at EGX 2021. First announced at the PC Gaming Show earlier in the year, Silt is a surreal 2D puzzle game in which you play a mysterious diver who can project their soul through the window of their diving helmet to possess nearby fish. Piranhas can chomp through chains and ropes, for example, while hammerhead sharks can help bash crumbling walls to create new pathways. Hand drawn by Mead using a simplified version of his signature cross hatching and fineliner penmanship, Silt instantly calls to mind the likes of Limbo and Inside. And yet the origins of this strange, watery tale stem from a far more innocuous source of inspiration. \n\"The main influence to any of my work is good old Beatrix Potter, believe it or not,\" Mead continues. \"I blame my mum entirely because she made me and my sister watch this horrible ballet when I was a kid, and I still haven't watched it since then. Over the years, though, I realised that this was one of my main things that fuelled my characters, and the fox man character, I started drawing him and he became my main character for years.\"\nRead more",
          "link": "https://www.rockpapershotgun.com/how-beatrix-potter-and-a-fear-of-open-water-inspired-the-surreal-limbo-like-horror-puzzler-silt",
          "publishedOn": "2021-10-25T12:00:00.000Z",
          "wordCount": 2133,
          "title": "How Beatrix Potter and a fear of open water inspired the surreal, Limbo-like horror puzzler Silt"
        },
        {
          "id": "https://www.rockpapershotgun.com/age-of-empires-4-review",
          "author": "Sin Vega",
          "description": "It's tempting to bang on about the history of Age Of Empires, but let's be real here, you already know it well enough. Even if you haven't played them, the Age Of Empires games were a pillar of RTS design, and probably the most popular candidate for a comeback since publishers largely abandoned the genre in the 2000s.\nLet's not argue about which of its elements is the defining one. They're base building, four-resource-gathering contests between factions based on historical world powers, and progress throughout a match happens in explicitly tiered eras that loosely represent historical ages. Age Of Empires 4 has all of that, across four 9-mission single player campaigns, 17 skirmish maps (which can be slightly modified with seed numbers, and we're told more map options are coming), and 8 playable, well-differentiated and slightly unequal civilisations. And I kinda like it.\nRead more",
          "link": "https://www.rockpapershotgun.com/age-of-empires-4-review",
          "publishedOn": "2021-10-25T07:01:00.000Z",
          "wordCount": 2224,
          "title": "Age Of Empires 4 review: a confident and moreish strategy epic"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-sunday-papers-615",
          "author": "Ed Thorn",
          "description": "Sundays are for nearly having a heart attack when the toaster pops. Before you jolt awake, let's read this week's best writing about games.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-sunday-papers-615",
          "publishedOn": "2021-10-24T10:00:00.000Z",
          "wordCount": 1231,
          "title": "The Sunday Papers"
        },
        {
          "id": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-166",
          "author": "Alice O'Connor",
          "description": "I ate my first mince pie this week, which feels like a betrayal of my belief that Christmastime should not start before Halloween is over. That said, it wasn't a mince puff, so does it really count? Please, tell me about your festive eating. And may as well mention what you're playing this weekend.\nRead more",
          "link": "https://www.rockpapershotgun.com/what-are-we-all-playing-this-weekend-166",
          "publishedOn": "2021-10-23T08:00:00.000Z",
          "wordCount": 1020,
          "title": "What are we all playing this weekend?"
        },
        {
          "id": "https://www.rockpapershotgun.com/cd-projekt-have-bought-the-studio-behind-the-flame-in-the-flood",
          "author": "Alice O'Connor",
          "description": "Cyberpunk and Witcher crew CD Projekt have acquired The Molasses Flood, the American studio behind post-apocalyptic raft ride The Flame In The Flood and base-building game Drake Hollow. Huh! The studio will be making a game set in one of CD Projekt's worlds, which warrants a second: huh! It's all secret for now.\nRead more",
          "link": "https://www.rockpapershotgun.com/cd-projekt-have-bought-the-studio-behind-the-flame-in-the-flood",
          "publishedOn": "2021-10-22T16:35:20.000Z",
          "wordCount": 899,
          "title": "CD Projekt have bought the studio behind The Flame In The Flood"
        },
        {
          "id": "https://www.rockpapershotgun.com/my-hunger-for-games-like-warcraft-2-is-slowly-being-sated",
          "author": "Katharine Castle",
          "description": "When I think back to the games of my childhood, nothing puts a warm, fuzzy smile on my face like Warcraft 2. As one of the few PC games I had growing up, I ended up playing the campaign over and over again - or at least starting it over and over again - for what felt like actual years. I loved building up my fort and endlessly poking the peasants and peons until they shouted back at me in annoyance, and man alive, there is nothing sweeter than ordering a tooled-up army across the map and absolutely wrecking the enemy in one fell swoop of doom and destruction. \nIt is something I wish I could play again now with all my heart. I know there's version of it on GOG, but I'd also just quite like, you know, a newer, shinier version with a more up to date UI and all that jazz, and one whose map didn't whizz over to the other side of the screen with a single tap of the arrow key. I'd also like a version that isn't, somehow, made by Activision Blizzard because... *gestures to all their ongoing harassment lawsuits*. Fortunately, I've happened upon a couple of games in recent weeks that have really scratched that old Warcraft 2 itch of mine. I've already written about one of them - Diplomacy Is Not An Option - and the other is Age Of Darkness: Final Stand, a game with the most boring name imaginable, but is secretly very good.\nRead more",
          "link": "https://www.rockpapershotgun.com/my-hunger-for-games-like-warcraft-2-is-slowly-being-sated",
          "publishedOn": "2021-10-22T15:38:02.000Z",
          "wordCount": 959,
          "title": "My hunger for games like Warcraft 2 is slowly being sated"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-to-uninstall-windows-11-and-go-back-to-windows-10",
          "author": "James Archer",
          "description": "Change isn’t for everyone: just ask the 5% of Steam Hardware Survey respondents still using Windows 7. Sadly, even the most eager of early adopters might be looking to find out how to uninstall Windows 11, the very latest of Microsoft’s operating systems. It could be the newly centralised Start menu; it could be the lack of DirectStorage support among games making the best SSDs perform below their full capability; it could just be a single unsquished bug, which remains a risk with the infant OS. Fortunately, if you decide to want to switch back to Windows 10 within 10 days of installing its successor, it’s possible to roll back in just a few, mildly regretful clicks.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/how-to-uninstall-windows-11-and-go-back-to-windows-10",
          "publishedOn": "2021-10-22T15:33:24.000Z",
          "wordCount": 1127,
          "title": "How to uninstall Windows 11 and go back to Windows 10"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-to-upgrade-to-windows-11",
          "author": "James Archer",
          "description": "Alright, fine, here’s how to upgrade to Windows 11 from Windows 10. The current stance of this hardware ed is that Windows 11 has some cool features but is yet to fulfil its potential, largely owing to the missing DirectStorage capability – which, to be fair, could be a very big deal when games start supporting it. For now, then, it’s a free but absolutely not an essential upgrade, and you can think of this post as the RPS equivalent of that video where Valve tore down a Steam Deck: we’re not saying you should do this, just that you can do this. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/how-to-upgrade-to-windows-11",
          "publishedOn": "2021-10-22T15:32:39.000Z",
          "wordCount": 1278,
          "title": "How to upgrade to Windows 11"
        },
        {
          "id": "https://www.rockpapershotgun.com/truck-simulator-now-supports-mods-in-multiplayer",
          "author": "Alice O'Connor",
          "description": "After adding official multiplayer modes to American Truck Simulator and Euro Truck Simulator 2, developers SCS Software have now made both support mods in multiplayer too. They're games many truckers mod with the trucks and decor of their dreams, so it'll be nice to show everyone your true truck self. I'd call this your drivatar but Forza has already claimed that.\nRead more",
          "link": "https://www.rockpapershotgun.com/truck-simulator-now-supports-mods-in-multiplayer",
          "publishedOn": "2021-10-22T14:06:46.000Z",
          "wordCount": 918,
          "title": "Truck Simulator now supports mods in multiplayer"
        },
        {
          "id": "https://www.rockpapershotgun.com/grand-theft-auto-remastered-trilogys-first-trailer-looks-shiny-yet-cartoony",
          "author": "Alice O'Connor",
          "description": "After a stretch of teasing and leaking, Rockstar today revealed how they've renovated the GTA 3 trilogy for the upcoming horribly named collection, Grand Theft Auto: The Trilogy - The Definitive Edition. A new trailer and screenshots reveal that GTA 3, Vice City, and San Andreas still have distinctly cartoon vibes, now paired with fancy reflections and effects. Rockstar also announced a release date of November 11th and a price of... £55? Gosh. See the new look for yourself in the trailer below.\nRead more",
          "link": "https://www.rockpapershotgun.com/grand-theft-auto-remastered-trilogys-first-trailer-looks-shiny-yet-cartoony",
          "publishedOn": "2021-10-22T13:32:49.000Z",
          "wordCount": 1046,
          "title": "Grand Theft Auto remastered trilogy's first trailer looks shiny yet cartoony"
        },
        {
          "id": "https://www.rockpapershotgun.com/doom-eternals-horde-mode-arrives-next-week",
          "author": "Imogen Beckhelling",
          "description": "On Tuesday the 26th of October, Doom Eternal players will be able to rip and tear through the hellish shooter's new horde mode. If you're not quite satisfied with murdering demons in a linear fashion, you'll be able to jump into a match to fight off waves of the beasties instead. It's arriving in the game's 6.66 update, along with two new master levels and Battlemode 2.0.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/doom-eternals-horde-mode-arrives-next-week",
          "publishedOn": "2021-10-22T13:00:27.000Z",
          "wordCount": 876,
          "title": "Doom Eternal's Horde mode arrives next week"
        },
        {
          "id": "https://www.rockpapershotgun.com/halo-infinite-will-let-you-host-a-cross-platform-lan-party-on-a-pc-dedicated-server",
          "author": "Alice O'Connor",
          "description": "After decades of Halo being primarily an Xbox series [settle down, disgruntled elderly Mac fanatics -ed.], Halo Infinite will buck that with a simultaneous launch on PC too. With that December launch drawing near, a new trailer focuses on the PC edition, detailing various graphics settings and multiplayer options and noting the interesting detail that you'll be able to use a PC to host a dedicated server for a cross-platform LAN party. Watch on for lots of shots of scrolling through options menus.\nRead more",
          "link": "https://www.rockpapershotgun.com/halo-infinite-will-let-you-host-a-cross-platform-lan-party-on-a-pc-dedicated-server",
          "publishedOn": "2021-10-22T11:25:27.000Z",
          "wordCount": 912,
          "title": "Halo Infinite will let you host a cross-platform LAN party on a PC dedicated server"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-character-transfers-paused-due-to-gold-duping-glitch",
          "author": "Imogen Beckhelling",
          "description": "New World's long-awaited character transfers have been taken away almost as soon as they arrived, because they've caused a glitch that allows players to duplicate gold. The bug came about after the MMORPG's 1.0.3 update this week. It makes it so characters don't save properly after transferring, letting them trade gold and items to others while magically keeping it in their own pockets. Amazon have paused server transfers for the time being to work on a fix, and have warned players that those caught exploiting the glitch will be banned.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-character-transfers-paused-due-to-gold-duping-glitch",
          "publishedOn": "2021-10-22T10:21:39.000Z",
          "wordCount": 929,
          "title": "New World character transfers paused due to gold duping glitch"
        },
        {
          "id": "https://www.rockpapershotgun.com/how-psychonauts-2-turns-the-mind-inside-out",
          "author": "Andreas Inderwildi",
          "description": "“It’s all in your head.” It’s a response that encapsulates all the condescension and ignorance surrounding mental health issues. And yet, in a way, it’s true. Subjective experience is an objective reality – that just so happens to be located and locked away in your head. \nThese individual realities can only be conveyed through language and other subjective means of communication, and more and more games are grasping this fact, turning inward to explore and map the inland empires of the mind. They have all the tools of the medium at their disposal to turn the invisible workings of the mind into landscapes of audio-visual and mechanical metaphors that can be explored and interacted with. At their best, they convey the dynamic and complex mechanisms of the psyche in a way that only this medium can.\nRead more",
          "link": "https://www.rockpapershotgun.com/how-psychonauts-2-turns-the-mind-inside-out",
          "publishedOn": "2021-10-22T10:00:00.000Z",
          "wordCount": 1754,
          "title": "How Psychonauts 2 turns the mind inside out"
        },
        {
          "id": "https://www.rockpapershotgun.com/football-manager-2022s-early-access-beta-is-available-now",
          "author": "Graham Smith",
          "description": "Football Manager 2022 pre-launch beta is live now. If you buy the kicking sim on Steam or Epic, you can immediately start playing a nearly-finished version of the game. If you're really committed you can probably be sacked at least once before the sun comes up.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/football-manager-2022s-early-access-beta-is-available-now",
          "publishedOn": "2021-10-21T23:22:46.000Z",
          "wordCount": 723,
          "title": "Football Manager 2022's early access beta is available now"
        },
        {
          "id": "https://www.rockpapershotgun.com/no-mans-skys-new-update-lets-you-ride-on-flying-worms",
          "author": "Graham Smith",
          "description": "At this point, it has become a cliché to say that space sim No Man's Sky has come a long way since its initial release. And yet, is there any better example of its long development journey than the sandworms? Initially shown in pre-release trailers only to be cut from the release version, they were finally added in some recent updates. Now the most recent update and seasonal event adds new sandworm varieties, including rideable sandworms. The worm has indeed turned.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/no-mans-skys-new-update-lets-you-ride-on-flying-worms",
          "publishedOn": "2021-10-21T22:07:33.000Z",
          "wordCount": 774,
          "title": "No Man's Sky's new update lets you ride on flying worms"
        },
        {
          "id": "https://www.rockpapershotgun.com/corsairs-flagship-virtuoso-rgb-wireless-xt-headset-is-26-off-in-the-uk",
          "author": "Will Judd",
          "description": "Corsair's Virtuoso RGB Wireless XT is just as fancy as its long-ass name implies, and today it's £65 off as part of Corsair's autumn sale. That drops the price from £250 to £185, considerably less than even the going price on Amazon of £230. I think this is a great deal if you've got a hefty budget for an all-in-one wireless headset, so let me share a little on why I'm so convinced!\nRead more",
          "link": "https://www.rockpapershotgun.com/corsairs-flagship-virtuoso-rgb-wireless-xt-headset-is-26-off-in-the-uk",
          "publishedOn": "2021-10-21T21:54:34.000Z",
          "wordCount": 926,
          "title": "Corsair's flagship Virtuoso RGB Wireless XT headset is 26% off in the UK"
        },
        {
          "id": "https://www.rockpapershotgun.com/haunted-chocolatier-is-the-stardew-valleys-developers-next-rpg",
          "author": "Graham Smith",
          "description": "The developer of Stardew Valley has revealed their next game: Haunted Chocolatier. It's again a game about moving to a new town to \"try your hand at a new way of living\", but instead of a farm, you're opening a chocolate shop staffed by ghosts. There's an adorable trailer below.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/haunted-chocolatier-is-the-stardew-valleys-developers-next-rpg",
          "publishedOn": "2021-10-21T21:38:34.000Z",
          "wordCount": 799,
          "title": "Haunted Chocolatier is the Stardew Valley developer's next RPG"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-a-high-spec-1tb-nvme-ssd-for-139-after-a-21-off-voucher",
          "author": "Will Judd",
          "description": "The XPG S70 Blade is one of the few 'second-gen' PCIe 4.0 SSDs on the market, offering incredible speeds on PC and even full compatibility with PS5. Today the 1TB model is heavily discounted at Amazon UK, with the NVMe drive dropping from £176 all the way to £139. To get the reduced price, tick the box where it says 'Apply 21% voucher'; the reduced price will be visible at the checkout. \nRead more",
          "link": "https://www.rockpapershotgun.com/get-a-high-spec-1tb-nvme-ssd-for-139-after-a-21-off-voucher",
          "publishedOn": "2021-10-21T21:34:37.000Z",
          "wordCount": 918,
          "title": "Get a high-spec 1TB NVMe SSD for £139 after a 21% off voucher"
        },
        {
          "id": "https://www.rockpapershotgun.com/battlefield-2042-will-tweak-maps-ui-and-more-in-response-to-beta-feedback",
          "author": "Graham Smith",
          "description": "Battlefield 2042 has been and gone, and now its developers have written about what they learned based on player feedback. There are some straight fixes, some explanations, and lot more in a post on the Battlefield blog. \r\n\nAlso: a look at the five previously unrevealed specialists you'll be able to play as when the game launches.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/battlefield-2042-will-tweak-maps-ui-and-more-in-response-to-beta-feedback",
          "publishedOn": "2021-10-21T21:11:26.000Z",
          "wordCount": 815,
          "title": "Battlefield 2042 will tweak maps, UI and more in response to beta feedback"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-uncharted-movie-finally-has-a-trailer",
          "author": "Graham Smith",
          "description": "The Uncharted series will arrive on PC early next year with Uncharted 4: A Thief's End. That game features a retired Nathan Drake being coaxed into another adventure, but you therefore might want to experience some of the Indylike's earlier treasure hunts first. There is literally only one way I can think of to do that: watching the Uncharted movie, which is also due to release in cinemas early next year.\r\n\nThe first trailer just released, starring Tom Holland and Mark Wahlberg.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/the-uncharted-movie-finally-has-a-trailer",
          "publishedOn": "2021-10-21T20:52:36.000Z",
          "wordCount": 805,
          "title": "The Uncharted movie finally has a trailer"
        },
        {
          "id": "https://www.rockpapershotgun.com/razer-cap-razercon-announcements-with-first-psu-and-liquid-cooler-components",
          "author": "James Archer",
          "description": "Razer, purveyors of green and black gaming peripherals, have announced they’re having a proper go at PC components as well. The Razer Hanbo AIO liquid CPU cooler series, Razer Katana PSUs, Razer Kunai case fans and Razer Pulse Width Modulator (PWM) Fan Controller all debuted during this year's RazerCon showcase.\nRead more",
          "link": "https://www.rockpapershotgun.com/razer-cap-razercon-announcements-with-first-psu-and-liquid-cooler-components",
          "publishedOn": "2021-10-21T18:01:49.000Z",
          "wordCount": 1183,
          "title": "Razer cap RazerCon announcements with first PSU and liquid cooler components"
        },
        {
          "id": "https://www.rockpapershotgun.com/dwarf-fortress-steam-edition-video-demonstrates-convenience-of-seeing-whats-happening",
          "author": "Alice O'Connor",
          "description": "\"You will not believe what the hell just happened in Dwarf Fortress!\" my pal will tell me, proceeding to share a screenshot which, to me, is indistinguishable from e.g.:\n\r\n██,.,,;lz,zl;L:@gjse,.gm.,,.m.zm,.m,x.zm.amL:m3jp5jkmToiHy*\r\n████()ht23htuhqIJg.......UG.uos\\kjk:███/,,p,c.xz/,c./z,c;\\/.\r\n██'z,c./xz,c./zx,cpaswf/w.qfw.,/f,aa███,g.ew/t,3wq./t,,2..@|\r\n█3/.6t,.esg,f.e/sg,./ewt,./w4t4..,1t6,m42ijpnz\\kuiys8fun/.|█\r\n█|?|..../\\/\\..|@@@%%$|\"(((|..FHzFhLlk@A}||||....*|JGH,.3████\r\nzZ./@Z@@'Z'@@LSXCl;a,sl;FLZL;@'A:@,;'F\":%T@:H^OQHOh8^£$.\\/.█\n\n\"That's wild!\" I will reply, not wanting to hurt their feelings. But how delightful, then, to watch the latest video from the upcoming premium edition, where co-creator Zach Adams demonstrates defending against a goblin attack and you can actually see it's a goblin attack.\nRead more",
          "link": "https://www.rockpapershotgun.com/dwarf-fortress-steam-edition-video-demonstrates-convenience-of-seeing-whats-happening",
          "publishedOn": "2021-10-21T16:45:05.000Z",
          "wordCount": 804,
          "title": "Dwarf Fortress Steam edition video demonstrates convenience of seeing what's happening"
        },
        {
          "id": "https://www.rockpapershotgun.com/amanitas-unhappy-happy-game-is-coming-in-time-for-halloween",
          "author": "Alice O'Connor",
          "description": "Amanita Design are known for their cheery and charming adventure games, wonders like Samorost, Machinarium, Botanicula, and Chuchel. Their next game sounds like it should be their cheeriest yet, given that it's named Happy Game. Reader dear, this is a trick. Happy Game is blood and death and horror. You will see this soon, as Amanita today announced plans to release Happy Game on the 28th of October. Or you can try a demo now!\nRead more",
          "link": "https://www.rockpapershotgun.com/amanitas-unhappy-happy-game-is-coming-in-time-for-halloween",
          "publishedOn": "2021-10-21T16:12:14.000Z",
          "wordCount": 776,
          "title": "Amanita's unhappy Happy Game is coming in time for Halloween"
        },
        {
          "id": "https://www.rockpapershotgun.com/skyrim-will-add-aquariums-in-its-anniversary-edition",
          "author": "Imogen Beckhelling",
          "description": "Skyrim: Anniversary Edition comes out next month, and it's quickly becoming the fishiest version of the RPG yet. Bethesda have announced it will let you add aquariums to your Skyrim homes. We already know this edition will let us go fishing too, so I'm hoping we'll be able to yank those suckers straight out of the sea to put on display in our homes. Can't believe I'm going to buy yet another version of Skyrim just to have pet fish.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/skyrim-will-add-aquariums-in-its-anniversary-edition",
          "publishedOn": "2021-10-21T15:56:39.000Z",
          "wordCount": 931,
          "title": "Skyrim will add aquariums in its Anniversary Edition"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-electronic-wireless-show-podcast-episode-161-the-best-songs-in-games-special",
          "author": "Alice Bell",
          "description": "It occurs to me now that \"best songs\" is probably not a great topic for the podcast, given that we do not perform any of the songs, or put them in the show. But on this week's episode of The Electronic Wireless show, we talk about them songs real good. Plus, we are joined by Randy Newman, who sounds a surprising amount like Matthew Castle.\nMatthew himself has a new awkward food related story to share, Nate has been watching Squid Game, and a listener has sent in a very special musical theme for Sweeten The Deal!\nRead more",
          "link": "https://www.rockpapershotgun.com/the-electronic-wireless-show-podcast-episode-161-the-best-songs-in-games-special",
          "publishedOn": "2021-10-21T15:00:00.000Z",
          "wordCount": 870,
          "title": "EWS podcast episode 161: the best songs special"
        },
        {
          "id": "https://www.rockpapershotgun.com/cant-buy-an-rtx-3080-geforce-now-will-let-you-play-with-one-in-the-cloud",
          "author": "James Archer",
          "description": "Nvidia’s GeForce Now cloud gaming service is getting a new, ultra-premium subscription tier powered by its GeForce RTX 3080 GPU. While one of the best graphics cards around, especially for higher resolutions, the RTX 3080 has remained frustratingly hard to find in stock since it launched last year – for many, this GeForce Now tier could be the best chance of seeing what it’s like to play with one, even if is simply streaming from a server rather than a dedicated gaming PC.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/cant-buy-an-rtx-3080-geforce-now-will-let-you-play-with-one-in-the-cloud",
          "publishedOn": "2021-10-21T14:24:09.000Z",
          "wordCount": 963,
          "title": "Can’t buy an RTX 3080? GeForce Now will let you play with one in the cloud"
        },
        {
          "id": "https://www.rockpapershotgun.com/letter-from-the-editor-03",
          "author": "Katharine Castle",
          "description": "Hello folks. Sorry to be writing this letter so late into October. This time two weeks ago I was walking the halls of London's ExCel on my way to host the first RPS Presents panel at EGX 2021, and all the planning and organising I had to do for it rather cut back on my available writing time. I then took some time off to recuperate a bit, and here we are, three weeks into October and I'm only just getting round to doing my monthly editor's letter. I do apologise. But! We are here now and there's plenty to talk about. A lot of it is EGX-related, but you'll hopefully have noticed some new site features being introduced these last few weeks as well, which I'll explain below. \nRead more",
          "link": "https://www.rockpapershotgun.com/letter-from-the-editor-03",
          "publishedOn": "2021-10-21T14:12:37.000Z",
          "wordCount": 829,
          "title": "Letter From The Editor #03: EGX Rezzed is dead, long live EGX Rezzed"
        },
        {
          "id": "https://www.rockpapershotgun.com/charming-tower-defence-toy-soldiers-has-an-hd-remaster-now",
          "author": "Alice O'Connor",
          "description": "2010 tower defence game Toy Soldiers has two big neat ideas: it looks like a toybox upended onto battlefield dioramas built on bedroom tables; and you can take to the battlefield yourself to control units and vehicles. It's a good'un, and today it relaunched with an 'HD' version. I liked the original enough to buy it on both Xbox 360 and PC, but wasn't interested in getting it again until I heard Toy Soldiers: HD offers more than the usual high-res texture overhaul.\nRead more",
          "link": "https://www.rockpapershotgun.com/charming-tower-defence-toy-soldiers-has-an-hd-remaster-now",
          "publishedOn": "2021-10-21T14:07:29.000Z",
          "wordCount": 950,
          "title": "Charming tower defence Toy Soldiers has an HD remaster now"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-dark-pictures-anthology-house-of-ashes-review",
          "author": "Alice Bell",
          "description": "I have a real soft spot for Supermassive Games. Until Dawn was a knowingly schlocky teen slasher horror film made into an interactive adventure game, and it was great for at least two thirds of its runtime. I've also felt the same about their more recent project, The Dark Pictures Anthology, which began with Man Of Medan in 2019. Every time a new instalment comes out I believe it's in with a shot of being well good - although each one has since made me doubt the \"knowing\" part of my interpretation of Until Dawn. The latest entry, House Of Ashes, comes the closest yet to recapturing the daft thrills of Until Dawn, with a classic survival-horror setup that's half The Descent and half Aliens.\nThe five playable protagonists you flit between are trapped in an ancient Sumerian temple that leads into an even deeper cavern, and then an even deeperer, ancienter ruin. The turducken of potholing. But instead of delicious stuffing, the surprise in these layers is a race of vampiric monsters whose vision is based on sound, and whose spit is LSD. Your job is to get your goons out alive, and the main problem is that the goons in question are - instead of a busload of teens on a field trip gone wrong - a small team of US marines searching for WMDs in 2003 Iraq. Wakka wakka.\nRead more",
          "link": "https://www.rockpapershotgun.com/the-dark-pictures-anthology-house-of-ashes-review",
          "publishedOn": "2021-10-21T14:00:00.000Z",
          "wordCount": 2017,
          "title": "The Dark Pictures Anthology: House Of Ashes review: very nearly a fun horror romp"
        },
        {
          "id": "https://www.rockpapershotgun.com/austin-powers-spliced-into-mass-effect-makes-a-disturbingly-good-shepard",
          "author": "Imogen Beckhelling",
          "description": "The geth have begun launching seemingly random attacks on human colonies. Rumours are circling that ancient machines will soon emerge from darkspace. There is only one man equipped to deal with these threats: Intergalactic Man Of Mystery, Austin Powers. Someone has made a video editing Mike Myers' 60s spy into Mass Effect and I'm astounded at how well it works. I don't know what else to say. This is Mass Effect in its ultimate form. Please watch it, it's the best minute I've spent all week.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/austin-powers-spliced-into-mass-effect-makes-a-disturbingly-good-shepard",
          "publishedOn": "2021-10-21T13:04:21.000Z",
          "wordCount": 823,
          "title": "Austin Powers spliced into Mass Effect makes a disturbingly good Shepard"
        },
        {
          "id": "https://www.rockpapershotgun.com/into-the-pit-was-inspired-by-devil-daggers-and-a-nicolas-cage-film",
          "author": "Imogen Beckhelling",
          "description": "Into The Pit is a fast-paced roguelike shooter with hints of Doom, and excellent hands that shoot magical bullets. It's not the first occult-themed game to turn hands into guns (and I sure hope it won't be the last), but is inspired by one. I spoke to Into The Pit's creator, Tom Betts, who told me about the game's Devil Daggers influences, from weaponry to aesthetics, and why the occult setting works so well for the roguelike genre. \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/into-the-pit-was-inspired-by-devil-daggers-and-a-nicolas-cage-film",
          "publishedOn": "2021-10-21T12:00:00.000Z",
          "wordCount": 1705,
          "title": "Into The Pit was inspired by Devil Daggers and a Nicolas Cage film"
        },
        {
          "id": "https://www.rockpapershotgun.com/bethesdas-new-starfield-trailer-introduces-mercenary-and-pirate-factions",
          "author": "Imogen Beckhelling",
          "description": "I'm fighting off a real Bethesda itch right now. I know I'll hate myself if I start yet another Skyrim playthrough, and I'm too fussy to decide on a Fallout to sink another fifty hours into. But now there's a new Starfield trailer, and it's making me pine for those damned RPGs all the more. The developers have dived into Starfield's history, and revealed a handful of factions we'll come across on our space travels. It's mostly concept art, but hey, it's very nice concept art.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/bethesdas-new-starfield-trailer-introduces-mercenary-and-pirate-factions",
          "publishedOn": "2021-10-21T10:08:17.000Z",
          "wordCount": 979,
          "title": "Bethesda's new Starfield trailer introduces mercenary and pirate factions"
        },
        {
          "id": "https://www.rockpapershotgun.com/new-world-now-lets-you-transfer-your-character-to-another-server",
          "author": "Alice O'Connor",
          "description": "Server transfers opened up in New World overnight, letting players shunt their explorers from one world to another. This is a desirable feature in many MMOs, and particularly in this one because servers were so overloaded at launch that Amazon recommended players join any old server then transfer to their desired home later once things settled. All players get one transfer for free, but only one, with Amazon planning to start selling that service later.\nRead more",
          "link": "https://www.rockpapershotgun.com/new-world-now-lets-you-transfer-your-character-to-another-server",
          "publishedOn": "2021-10-21T09:46:30.000Z",
          "wordCount": 935,
          "title": "New World now lets you transfer your character to another server"
        },
        {
          "id": "https://www.rockpapershotgun.com/evertried-review",
          "author": "Brendan Caldwell",
          "description": "There is no mouse cursor in Evertried. You control everything with the keyboard, from the hops and scythe attacks of your cute otherworldly hero, to the settings in the pause menu. It's a strange omission but one that is representative of the feeling this roguelike evokes throughout your time climbing its purgatorial tower of baddies. That is to say, a feeling that there's something important missing. In fact, there seems to be a lot missing from this tile-based timewaster, small touches that could have given its solid foundation the polish it needed to excel. \nRead more",
          "link": "https://www.rockpapershotgun.com/evertried-review",
          "publishedOn": "2021-10-21T08:00:00.000Z",
          "wordCount": 1831,
          "title": "Evertried review: a rough-hewn roguelike that fails to stand out"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-the-outstanding-razer-viper-ultralight-mouse-for-50-off",
          "author": "Will Judd",
          "description": "The Razer Viper is one of my favourite mice of all time, whether we're talking about the wireless Ultimate version, the compact Mini model or the vanilla Viper. It's this OG model that is on sale today at Amazon, who have marked it down from £80 to just £40 - an incredible bargain for an ultralight mouse with a high-end optical sensor, optical mouse buttons, flexible cable and low weight of just 69 grams. \nRead more",
          "link": "https://www.rockpapershotgun.com/get-the-outstanding-razer-viper-ultralight-mouse-for-50-off",
          "publishedOn": "2021-10-20T20:30:43.000Z",
          "wordCount": 963,
          "title": "Get the outstanding Razer Viper ultralight mouse for 50% off"
        },
        {
          "id": "https://www.rockpapershotgun.com/get-an-rtx-3070-gaming-laptop-for-1250-after-a-150-discount",
          "author": "Will Judd",
          "description": "The Asus Tuf Gaming A15 is a great value gaming laptop that attracted warm reviews for its design and performance, and today it's also the cheapest RTX 3070 gaming laptop we can find*. The A15 FA506QR-HN006T specification, which includes a Ryzen 7 5800H processor, 16GB of RAM and 512GB SSD, is down to just £1250 at Overclockers after a £150 reduction. \nRead more",
          "link": "https://www.rockpapershotgun.com/get-an-rtx-3070-gaming-laptop-for-1250-after-a-150-discount",
          "publishedOn": "2021-10-20T20:05:43.000Z",
          "wordCount": 860,
          "title": "Get an RTX 3070 gaming laptop for £1250 after a £150 discount"
        },
        {
          "id": "https://www.rockpapershotgun.com/cd-projekt-red-delay-the-witcher-3s-next-gen-update",
          "author": "Alice O'Connor",
          "description": "The update adding raytracing and other mod cons to The Witcher 3 will not launch this year, developers CD Projekt Red announced today. They've been fancying up their fantasy RPG for the latest console generation, and those 'next-gen' additions are headed to PC in a patch too. But not this year. Instead, look to be blinded by the light in spring 2022. They've also delayed the next-gen version of Cyberpunk 2077 for consoles.\nRead more",
          "link": "https://www.rockpapershotgun.com/cd-projekt-red-delay-the-witcher-3s-next-gen-update",
          "publishedOn": "2021-10-20T19:17:05.000Z",
          "wordCount": 896,
          "title": "CD Projekt Red delay The Witcher 3's next-gen update"
        },
        {
          "id": "https://www.rockpapershotgun.com/god-of-war-is-coming-to-pc-in-january-2022",
          "author": "Alice O'Connor",
          "description": "As was rumoured, the dadtastic godstabber God Of War is indeed coming to PC. Sony today announced that the PlayStation-exclusive action-adventure game will launch for PC on the 14th of January, 2022. Good game, that. It'll have support for assorted PC technical fanciness too.\nRead more",
          "link": "https://www.rockpapershotgun.com/god-of-war-is-coming-to-pc-in-january-2022",
          "publishedOn": "2021-10-20T16:32:16.000Z",
          "wordCount": 907,
          "title": "God Of War is coming to PC in January 2022"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-subnautica-mods",
          "author": "Craig Pearson",
          "description": "Subnautica was a game I spent a lot of time just living in. It was a rare combination of survival and relaxation. I loved the base building, crafting what amounted to a reverse aquarium clinging to an underwater sea cliff. It grew from a small bulb of oxygen into a proper little sanctuary. When I picked it up, it was fairly late into its life, and a number of mods were already waiting to be installed. I quickly dialed down the game’s frustrations and made my time under the sea all the more enjoyable, so here are our picks for the best Subnautica mods available today.  \nRead more",
          "link": "https://www.rockpapershotgun.com/best-subnautica-mods",
          "publishedOn": "2021-10-20T15:36:25.000Z",
          "wordCount": 1742,
          "title": "Best Subnautica mods"
        },
        {
          "id": "https://www.rockpapershotgun.com/over-20-people-reported-for-behaviour-now-gone-from-activision-blizzard",
          "author": "Alice O'Connor",
          "description": "Activision Blizzard's initial response to allegations of workplace harrassment and discrimination was disappointing enough that thousands of current and former employees signed an open letter condemning it then hundreds staged a walkout in July. With several legal cases against the Warcraft and Call Of Duty owners underway, they've now admitted they haven't done enough. Yesterday, Along with laying out their next steps, they confirmed that over 20 people have \"exited\" Activision Blizzard in connection with reports against them.\nRead more",
          "link": "https://www.rockpapershotgun.com/over-20-people-reported-for-behaviour-now-gone-from-activision-blizzard",
          "publishedOn": "2021-10-20T15:26:38.000Z",
          "wordCount": 1220,
          "title": "Over 20 people reported for behaviour now gone from Activision Blizzard"
        },
        {
          "id": "https://www.rockpapershotgun.com/wd-blue-sn570-review",
          "author": "James Archer",
          "description": "There was a time, not so long ago, when the WD Blue line exemplified that “good but boring” quality that sees many a budget SSD damned by faint praise. Fast enough yet rarely eye-catchingly rapid, even when the WD Blue SN500 ditched SATA for the much quicker NVMe interface, they’ve always been sensible purchases that nonetheless lived in the shadow of the WD Black lineup. That all changes with the latest WD Blue SN570: it’s not just an excellent M.2 drive for the money, but quite possibly the single most compelling SSD for anyone sticking with PCIe 3.0.\r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/wd-blue-sn570-review",
          "publishedOn": "2021-10-20T15:23:23.000Z",
          "wordCount": 1277,
          "title": "WD Blue SN570 review: The best cheap SSD grows up"
        },
        {
          "id": "https://www.rockpapershotgun.com/the-zombies-in-back-4-blood-are-more-fashionable-than-me",
          "author": "Ed Thorn",
          "description": "I don't know what I was expecting to take away from co-op FPS Back 4 Blood. A greater sense of comradery between myself and my friends? An appreciation of the weighty guns and how magazines snap into place with each reload? The sheer amount of blood that splashes on your person with each wave of zombies you cut down? Yes, all of these things.\nBut none more so than what the zombies wear. They favour comfortable clothing, but mainly the gilet. They love gilets. And they now have me questioning my fashion choices. Should I also join them as a wearer of gilets?\nRead more",
          "link": "https://www.rockpapershotgun.com/the-zombies-in-back-4-blood-are-more-fashionable-than-me",
          "publishedOn": "2021-10-20T14:41:24.000Z",
          "wordCount": 779,
          "title": "The zombies in Back 4 Blood are more fashionable than me"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-fireflies",
          "author": "Hayden Hefford",
          "description": "Want to know more about Fireflies in Minecraft? Whether you call them Fireflies, glowbugs, or lightning bugs, they’ll all occupy the same two pixels when they come to Minecraft and it’s time to get fired up for their arrival. Fireflies were announced at Minecraft Live 2021, which also shared more details on the upcoming Caves and Cliffs part 2 update.\nThis guide will explain everything that you need to know about Fireflies in Minecraft, including when you can expect Fireflies to come to Minecraft, where Fireflies will appear, and what they do.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-fireflies",
          "publishedOn": "2021-10-20T14:40:03.000Z",
          "wordCount": 996,
          "title": "Everything that we know about Fireflies in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-mangrove-swamp",
          "author": "Hayden Hefford",
          "description": "Want to know more about mangrove swamps in Minecraft? At Minecraft Live 2021, Mojang revealed that mangrove swamps - one of the options in the biome vote way back in 2019 - are finally coming to Minecraft. Many of the ideas mentioned back then, including mangrove trees and frogs, will be key features of the mangrove swamp biome.\nThis guide will explain everything that you need to know about mangrove swamps in Minecraft, including when mangrove swamps will be released, what you will find in the new biome, and how to grow your own mangrove trees with propagules.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-mangrove-swamp",
          "publishedOn": "2021-10-20T11:42:43.000Z",
          "wordCount": 1084,
          "title": "Everything you need to know about mangrove swamps in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/activision-blizzard-want-harassment-lawsuit-paused-over-conflict-of-interest",
          "author": "Imogen Beckhelling",
          "description": "Activision Blizzard have filed an application to halt the harassment and discrimination lawsuit from the California Department of Fair Employment and Housing (DFEH). This follows an update on the suit last week, which revealed that two DFEH lawyers previously worked for the Equal Employment Opportunity Commission (EEOC), who're also going through legal proceedings with Actiblizzard, creating a conflict of interest. Now the Call Of Duty and World Of Warcraft publishers want the DFEH's case to be paused so they can investigate, and decide whether they want to try and get the case disqualified, or find \"other appropriate remedies\". \r\n\n \nRead more",
          "link": "https://www.rockpapershotgun.com/activision-blizzard-want-harassment-lawsuit-paused-over-conflict-of-interest",
          "publishedOn": "2021-10-20T10:58:01.000Z",
          "wordCount": 999,
          "title": "Activision Blizzard want harassment lawsuit paused over conflict of interest"
        },
        {
          "id": "https://www.rockpapershotgun.com/gloomhaven-pc-review",
          "author": "Nic Reuben",
          "description": "Gloomhaven’s scoundrel has a custom animation for her flintlock pistol, and I am still jazzed about it. Releasing today in full after lurking in early access for the last two years, there are 17 classes in this digital adaptation of Cephalofair’s tabletop legacy dungeon crawler, hereafter referred to as ‘Tablehaven’. Each class, from psychic rodent Mindthief to basalt shithouse Cragheart, has around 30 ability cards each. And Flaming Fowl, alongside offering Tablehaven’s entire branching campaign, map editors, and a digi-only ‘Guildmaster’ campaign, have animated this single flintlock shot. It’s almost opulent. \nAll right, so I probably won’t use it much. Five damage at range four is a belter, but that burn hurts for a single target ability. I’ll be smiling when I do, though. Grinning as the scoundrel whips the silver pistol from her hip and deletes a cultist just before he summons a skeleton. Just as I’ve been grinning at these detailed, cel-shaded dungeons and grimy sewers, or the spoken narration before each quest. All Gloomhaven needed to do was not get in Tablehaven’s way too much. Accuracy and usability would have been just fine. But there’s enough passion and pizzaz in this wonderful package that a part of me wishes I was new here, just so I could be surprised all over again.\nRead more",
          "link": "https://www.rockpapershotgun.com/gloomhaven-pc-review",
          "publishedOn": "2021-10-20T10:00:00.000Z",
          "wordCount": 1918,
          "title": "Gloomhaven review: a loving adaptation that nails the ambition and detail of the tabletop original"
        },
        {
          "id": "https://www.rockpapershotgun.com/minecraft-frogs",
          "author": "Hayden Hefford",
          "description": "Want to know more about Frogs in Minecraft? If you’ve always looked at lakes and rivers in Minecraft and thought ‘those need some slimy little amphibians that leap on lily pads and whip fireflies out of the sky with their tongues’, then you’re in luck! At Minecraft Live 2021, the team shared that we are getting Frogs in Minecraft, and they’ll actually have a lot more depth than you might expect.\nThis guide will explain everything that we currently know about Frogs in Minecraft, including how to get the different Frog variants and how they act.\nRead more",
          "link": "https://www.rockpapershotgun.com/minecraft-frogs",
          "publishedOn": "2021-10-20T09:54:34.000Z",
          "wordCount": 1154,
          "title": "Everything we know about Frogs in Minecraft"
        },
        {
          "id": "https://www.rockpapershotgun.com/best-genshin-impact-hu-tao-build",
          "author": "Amelia Zollner",
          "description": "Want to learn how to create the best Hu Tao build in Genshin Impact? As the 77th Director of the Wangsheng Funeral Parlor, Hu Tao has the help of ghosts in battle, where she’ll stir up a fright as she absolutely demolishes enemies. Despite being a bit of a prankster, the Pyro Polearm wielder will make a great DPS addition to your team.\nThis guide will show you how to create the best Hu Tao build in Genshin Impact. Below we'll cover everything you need to know about Hu Tao, including wishing, weapons, artifacts, ascension materials, talents, abilities, and constellations.\nRead more",
          "link": "https://www.rockpapershotgun.com/best-genshin-impact-hu-tao-build",
          "publishedOn": "2021-10-20T09:53:26.000Z",
          "wordCount": 2094,
          "title": "Best Genshin Impact Hu Tao build"
        }
      ]
    },
    {
      "title": "Root.cz - články",
      "feedUrl": "https://www.root.cz/rss/clanky/",
      "siteUrl": "https://www.root.cz/clanky/",
      "articles": [
        {
          "id": "www.root.cz-text-15735",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Pat Gelsinger má za sebou 8 měsíců ve funkci. Intel nyní stojí v bodě zvratu, čerstvě uvedené procesory 12. generace Core zvané Alder Lake mají firmu vrátit na výsluní. Ale to je jen polovina cesty.",
          "link": "https://www.root.cz/clanky/intel-bude-otevrenejsi-dukazem-je-uvedeni-alder-lake/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-28T22:00:10.000Z",
          "wordCount": 2354,
          "title": "Intel bude otevřenější, důkazem je uvedení Alder Lake",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/516/pat-gelsinger-1.jpg",
            "length": "28409",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15721",
          "author": "redakce@root.cz (Root.cz: Ondřej Filip)",
          "description": "Dotazy zadané do vyhledání obsahují řadu chyb. Vyhledávače umí tyto chyby odstranit a díky tomu nalézt lepší výsledky. V Seznamu jsme nedávno zrychlili a zlepšili opravu dotazů pomocí neuronových sítí.",
          "link": "https://www.root.cz/clanky/rychla-oprava-dotazu-ve-vyhledavaci-pomoci-neuronovych-siti/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-26T22:00:10.000Z",
          "wordCount": 2354,
          "title": "Rychlá oprava dotazů ve vyhledávači pomocí neuronových sítí",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/498/neuronova-sit-1.jpg",
            "length": "42694",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15728",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Sonda do světa otevřeného softwaru. Dnes si představíme nástroj pro automatické klikání, vyzkoušíme sofistikovanou kalkulačku, podíváme se na otevřeného klienta pro OneNote a řekneme si o nástroji pro auditování a obnovu hesel ve Windows.",
          "link": "https://www.root.cz/clanky/softwarova-sklizen-27-10-2021/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-26T22:00:05.000Z",
          "wordCount": 997,
          "title": "Softwarová sklizeň (27. 10. 2021)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/root/368/kombajn-sklizen.jpg",
            "length": "394618",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15730",
          "author": "redakce@root.cz (Root.cz: Daniel Salzman)",
          "description": "V předchozím díle jsme si vytvořili jednoduchou zónu ve formě zónového souboru a dnes si povíme, jak s takovým souborem pracovat. Jedná se o nejčastější uživatelskou operaci a je užitečné jí porozumět.",
          "link": "https://www.root.cz/clanky/knot-dns-sprava-zony-a-zonove-soubory/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-25T22:00:10.000Z",
          "wordCount": 3029,
          "title": "Knot DNS: správa zóny a zónové soubory",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/399/uzel-provaz-spojeni-1.jpg",
            "length": "44034",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15731",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "Poměrně často se můžeme setkat s požadavkem analýzy dat uložených v binárních souborech. S těmito soubory dokáže do určité míry pracovat jak knihovna NumPy, tak i knihovna Pandas.",
          "link": "https://www.root.cz/clanky/operace-s-daty-ulozenymi-v-binarnich-souborech-v-knihovnach-numpy-a-pandas/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-25T22:00:05.000Z",
          "wordCount": 8920,
          "title": "Operace s daty uloženými v binárních souborech v knihovnách NumPy a Pandas",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/691/hexa-perex-1.png",
            "length": "82865",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-text-15724",
          "author": "redakce@root.cz (Root.cz: CESNET CERTS)",
          "description": "V dnešním díle postřehů se podíváme na útoky v jižní Asii, na e-mailovou kampaň trojanu FlawedGrace, na varování před chybami, na zatýkání kyberzločinců a na ostatní zajímavosti ze světa výpočetní techniky.",
          "link": "https://www.root.cz/clanky/postrehy-z-bezpecnosti-intel-sgx-prolomen-enklavy-nejsou-v-bezpeci/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-24T22:00:10.000Z",
          "wordCount": 1433,
          "title": "Postřehy z bezpečnosti: Intel SGX prolomen, enklávy nejsou v bezpečí",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/674/intel-sgx-1.jpg",
            "length": "26431",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15726",
          "author": "redakce@root.cz (Root.cz: Filip Zatloukal)",
          "description": "Vývojáři Ubuntu se snaží zrychlit Snap. Desktopové prostředí GNOME 41 je dostupné v repozitářích openSUSE. Vývojáři operačního systému Haiku začali práci na portování ovladačů Mesa Radeon Vulkan. Otevřený operační systém Sculpt OS založený na frameworku Genode vydal svou novou verzi.",
          "link": "https://www.root.cz/clanky/ubuntu-zrychluje-snap-gnome-41-v-repozitarich-opensuse/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-24T22:00:05.000Z",
          "wordCount": 1105,
          "title": "Ubuntu zrychluje Snap, GNOME 41 v repozitářích openSUSE",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/563/gnome-1.jpg",
            "length": "37205",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15729",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Vyšel MX Linux 21 „Wildflower“ přechází na Debian 11, GIMP 2.99.8, XWayland 21.1.3 přidá podporu ovladače Nvidia 495.xx, Wine 6.20 opravuje 29 chyb, PipeWire 0.3.39 vylepšuje Libcamera i podporu JACK.",
          "link": "https://www.root.cz/clanky/panasonic-konci-s-vyrobou-tv-v-cr-sifive-ma-o-polovinu-rychlejsi-jadro-risc-v/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-23T22:00:10.000Z",
          "wordCount": 1685,
          "title": "Panasonic končí s výrobou TV v ČR, SiFive má o polovinu rychlejší jádro RISC-V",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/368/gimp-2-10-22-export-do-avif-1.png",
            "length": "310716",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-text-15725",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Nové Ubuntu přináší jednu významnou evoluční změnu, GNOME 40. Jinak jde z velké části o poklidné vody připravující půdu pro příští vydání s dlouhou podporou. Současné novinky napovídají, kam se vývoj ubírá.",
          "link": "https://www.root.cz/clanky/ubuntu-21-10-impish-indri-posledni-verze-pred-velkym-dubnovym-lts/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-21T22:00:10.000Z",
          "wordCount": 1548,
          "title": "Ubuntu 21.10 „Impish Indri“: poslední verze před velkým dubnovým LTS",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/697/ubuntu-21-10-impish-indri-1.jpg",
            "length": "51850",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-text-15722",
          "author": "redakce@root.cz (Root.cz: Pavel Tišnovský)",
          "description": "Pro výuku programování se velmi často používají jazyky s grafickým výstupem. Výjimkou není ani Basic-256, který obsahuje grafickou plochu s podporou vykreslení běžných 2D entit, jednotlivých pixelů, ale i zobrazení pohyblivých spritů.",
          "link": "https://www.root.cz/clanky/zaklady-prace-s-grafickou-plochou-v-jazyku-basic-256/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-20T22:00:15.000Z",
          "wordCount": 5216,
          "title": "Základy práce s grafickou plochou v jazyku Basic-256",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/617/basic-256-1.jpg",
            "length": "43682",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "Root.cz - zprávičky",
      "feedUrl": "https://www.root.cz/rss/zpravicky/",
      "siteUrl": "https://www.root.cz/zpravicky/",
      "articles": [
        {
          "id": "www.root.cz-actuality-42958",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Nový Proton Experimental v beta verzi klienta Steam ze včerejška umí spustit windowsové hry chráněné starým ale rozšířeným DRM Valve CEG (custom executable-generation). Jde zatím jen o předběžnou podoru a může se stát, že některá hra s CEG nepojede. Úspěchy i neúspěchy lze hlásit na GitHubu.",
          "link": "https://www.root.cz/zpravicky/proton-nove-umi-hry-chranene-drm-valve-ceg/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-29T12:24:25.000Z",
          "wordCount": 1105,
          "title": "Proton nově umí hry chráněné DRM Valve CEG",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/677/valve-1.jpg",
            "length": "22542",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42957",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Včera Google vydal mimořádnou bezpečnostní opravu svého prohlížeče Chrome 95.0.4638.69 pro Windows, Linux i macOS, která se týká také Chromium. Opraveno je celkem 8 zranitelností, všechny s vysokou nebezpečností. Obzvlášť nebezpečné jsou chyby CVE-2021–38000 a CVE-2021–38003, protože jsou v současnosti aktivně zneužívány.",
          "link": "https://www.root.cz/zpravicky/chrome-a-chromium-zranitelne-aktualizujte-na-95-0-4638-69/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-29T11:29:16.000Z",
          "wordCount": 793,
          "title": "Chrome i Chromium zranitelné, aktualizujte na 95.0.4638.69",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/198/chromium-vs-chrome-1.jpg",
            "length": "60818",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-40574",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Linuxových systémů přibývá, každý den se spouštějí nové servery a někdo se o ně musí starat. To znamená spoustu různých dovedností specifických právě pro linuxové prostředí. Jak to zprovoznit, kudy bezpečně dovnitř, co tam najdeme, jak se o to postaráme a jak to nastavíme nebo rozšíříme.",
          "link": "https://www.root.cz/zpravicky/naucte-se-pouzivat-linux-spravne-a-bezpecne-online-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-29T08:40:36.000Z",
          "wordCount": 805,
          "title": "Naučte se používat Linux správně a bezpečně (online školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/440/skoleni-1.jpg",
            "length": "61676",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42956",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Včera CEO Facebooku Mark Zuckerberg řekl, že se společnost Facebook přejmenovává na Meta. Jména jednotlivých produktů jako Facebook, Whatsapp a Instagram zůstávají stejné. Výjimkou je Oculus s VR brýlemi. Ty budou nově prodávány pod značkou Meta a Oculus už se nebude používat.",
          "link": "https://www.root.cz/zpravicky/spolecnost-facebook-se-prejmenovava-na-meta/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-29T05:47:41.000Z",
          "wordCount": 4128,
          "title": "Společnost Facebook se přejmenovává na Meta",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/452/meta-1.jpg",
            "length": "17934",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42955",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Privátní klíč určený k podpisu digitálních očkovacích certifikátů zřejmě unikl a koluje po nejrůznějších platformách včetně sociálních sítí a webových fór. Internetem se také šíří potvrzení o očkování vystavené pro Adolfa Hitlera narozeného 1. ledna 1900. Kromě toho je možné potkat také certifikáty pro jména Mickey Mouse, Sponge Bob a další známá jména. Mobilní aplikace pro kontrolu očkovacích certifikátů je považují za platné.",
          "link": "https://www.root.cz/zpravicky/unikly-privatni-klice-pro-tvorbu-ockovacich-certifikatu-koluje-certifikat-adolfa-hitlera/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-28T20:11:58.000Z",
          "wordCount": 1700,
          "title": "Unikly privátní klíče pro tvorbu očkovacích certifikátů, koluje certifikát Adolfa Hitlera",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/313/ockovaci-certifikat-covid-1.jpg",
            "length": "54511",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42954",
          "author": "redakce@root.cz (Root.cz: Calculon)",
          "description": "S blížícím se vydáním Go 1.18 dochází k posledním úpravám návrhu generických typů v Go. Tato zatím největší změna od vydání první verze jazyka zahrnuje rozšíření překladače a standardní knihovny. V případě knihovny budou zatím změny provizorní, bez zaručení zpětné kompatibility.",
          "link": "https://www.root.cz/zpravicky/deni-okolo-generickych-typu-v-go/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-28T19:54:19.000Z",
          "wordCount": 3239,
          "title": "Dění okolo generických typů v Go",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/492/go-language-1.jpg",
            "length": "42779",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42953",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Pokrývání pražského metra mobilním signálem zdárně pokračuje, o prázdninách byly pokryty čtyři stanice a teď se k nim přidávají další. Od tohoto týdne je vysokorychlostní sítí LTE i 5G pokryt i poslední úsek linky A, tedy stanice Skalka a Depo Hostivař a oba traťové tunely mezi nimi. Cestující na zelené lince tak mohou telefonovat či datovat v celém úseku od Nemocnice Motol po Depo Hostivař. Jedinou výjimku tvoří samotná stanice Jiřího z Poděbrad, do které se LTE síť dostane po dokončení modernizace a vybudování výtahů, píše v oznámení dopravní podnik.",
          "link": "https://www.root.cz/zpravicky/metro-ma-signalem-pokrytou-celou-linku-a-v-cele-siti-zbyva-uz-jen-pet-stanic/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-28T10:48:02.000Z",
          "wordCount": 936,
          "title": "Metro má signálem pokrytou celou linku A, v celé síti zbývá už jen pět stanic",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/383/metro-praha-mobil-1.jpg",
            "length": "44050",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42952",
          "author": "redakce@root.cz (Root.cz: Petr Šrámek)",
          "description": "Raspberry Pi Foundation zveřejnila novou verzi populárního miniaturního jednodeskového počítače Raspberry Pi Zero W ve verzi 2. Hlavní změnou je výměna procesoru – místo obstarožního BCM2835 byl použit BCM2710A1, který je používán i v jednodeskových počítačích Raspberry Pi 3.",
          "link": "https://www.root.cz/zpravicky/raspberry-pi-zero-2-w-petkrat-vyssi-vykon-na-stejne-desce-za-stejnou-cenu/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-28T08:35:17.000Z",
          "wordCount": 1592,
          "title": "Raspberry Pi Zero 2 W: pětkrát vyšší výkon na stejné desce",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/393/raspberry-pi-zero-2-w-1.jpg",
            "length": "46683",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42951",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Více než 80 let byla nedílnou součástí fotografické historie japonská značka Olympus. Mateřská firma téhož jména nakonec před několika měsíci fotografickou divizi prodala do jiných rukou a fotografický svět očekával, jak to „s Olympusem“ dopadne. Dnes přichází v historii této foto značky významná zpráva. Olympus jako foto značka se mění na OM SYSTEM, přičemž v tomto názvu navazujícím na úspěšnou řadu kinofilmových zrcadlovek OM a pozdějších digi bezzrcadlovek OM-D, se nadále ukrývá původní dědictví Olympusu a jeho designéra Yoshihisy Maitaniho.",
          "link": "https://www.root.cz/zpravicky/znacka-fotoaparatu-olympus-se-meni-na-om-system/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-27T12:45:00.000Z",
          "wordCount": 876,
          "title": "Značka fotoaparátů Olympus se mění na OM SYSTEM",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/157/olympus-om-d-e-m1-1.jpg",
            "length": "66910",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42950",
          "author": "redakce@root.cz (Root.cz: jerry_wlk)",
          "description": "Server KrebsOnSecurity zveřejnil velmi znepokojivou zprávu o platebních terminálech čínské společnosti PAX Technology, které jsou ve 120 zemích v počtu zhruba 60 milionů. Mají být zodpovědné za kybernetické útoky nejen v USA, ale i v UK a EU.",
          "link": "https://www.root.cz/zpravicky/platebni-terminaly-pax-technology-zneuzity-ke-kybernetickym-utokum/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-27T12:16:58.000Z",
          "wordCount": 777,
          "title": "Platební terminály PAX Technology zneužity ke kybernetickým útokům",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/171/pax-technologies-1.jpg",
            "length": "68541",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42949",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Server Phoronix otestoval výkon aktuálně nejnovějšího procesoru od Intelu (do příchodu Alder Lake je to model 11900K) na platformě Windows 11 oproti pěti různým linuxovým distribucím. Porovnány byly nejnovější Windows 11 Pro oproti Ubuntu 20.04.3 LTS, Ubuntu 21.10, Arch Linuxu, Fedoře Workstation 35 a chybět nemohl ani Intel Clear Linux 35150.",
          "link": "https://www.root.cz/zpravicky/intel-core-i9-11900k-a-windows-11-versus-pet-linuxovych-distribuci/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-27T11:33:38.000Z",
          "wordCount": 926,
          "title": "Intel Core i9 11900K a Windows 11 versus pět linuxových distribucí",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/160/intel-procesor-cpu-chladic-1.jpg",
            "length": "46121",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42948",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Francouzská distribuce NuTyX, stavějící na projektech Linux From Scratch / Beyond Linux From Scratch, přichází po roce v nové verzi, tedy vlastně spíše aktuálním snapshotu označeném jako 21.10.0. Přináší aktualizované verze jádra, desktopových prostředí i dalších aplikací (včetně vlastního správce balíčků cards 2.4.138), přičemž zahrnuje též podporu 32bit procesorů.",
          "link": "https://www.root.cz/zpravicky/nutyx-21-10-0-s-podporou-32bit-x86/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-27T08:45:00.000Z",
          "wordCount": 880,
          "title": "NuTyX 21.10.0 s podporou 32bit x86",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/80/nutyx-1.jpg",
            "length": "72535",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-38836",
          "author": "redakce@root.cz (Root.cz: Redakce)",
          "description": "Automatizace pomocí continuous integration přímo v Gitlabu. CI vám pomůže automatizovat rutinní procesy a ušetří vám hromadu času. Pomůže vám od automatického testování, buildy po nasazování. Chcete vědět víc? Přijďte na naše školení GitLab CI, které se uskuteční 18. listopadu a proběhne plně online. Školí Ondřej Sika.",
          "link": "https://www.root.cz/zpravicky/gitlab-ci-automatizujte-primo-v-gitlabu-skoleni/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-27T08:38:35.000Z",
          "wordCount": 794,
          "title": "Gitlab CI: automatizujte přímo v Gitlabu (školení)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/214/gitlab-ci-1.png",
            "length": "75559",
            "type": "image/png"
          }
        },
        {
          "id": "www.root.cz-actuality-42947",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Již třetí velké vylepšení výrobních procesů své 5nm rodiny přináší tchaj-wanská TSMC. N4P stále staví na původní 5nm technologii, ale oproti původní variantě procesu N5 přináší o 11% vyšší výkon čipů, oproti dosud nejnovější inkarnaci N4 pak o 6% vyšší. Současně zvyšuje energetickou efektivitu o 22 % a hustotu tranzistorů v čipech o 6 %. Výrobní proces také pracuje s menším počtem masek, klesá tak komplexita výroby waferů a za stejný čas bude možné jich továrnou prohnat víc.",
          "link": "https://www.root.cz/zpravicky/tsmc-predstavil-vyrobni-proces-n4p-cipy-budou-mensi-vykonnejsi-uspornejsi-i-levnejsi/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-27T07:30:00.000Z",
          "wordCount": 2421,
          "title": "TSMC představil výrobní proces N4P, čipy budou menší, výkonnější, úspornější i levnější",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/307/300mm-wafer-1.jpg",
            "length": "82261",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42946",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "Po zbrusu novém YubiKey Bio se čtečkou otisků prstů přichází společnost Yubico s novinkou v modré řade Security Key. Konkrétně jde o model Security Key C NFC, který nenabízí všechny možnosti autentizace jako velký YubiKey, ale zaměřuje se na standard FIDO. S ním se přihlásíte k mnoha webovým službám, k novějším verzím OpenSSH nebo ke službám státní správy pomocí mojeID.",
          "link": "https://www.root.cz/zpravicky/yubico-nabizi-security-key-c-nfc-s-usb-c-za-29-eur/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-27T06:51:00.000Z",
          "wordCount": 1464,
          "title": "Yubico nabízí Security Key C NFC s USB-C za 29 eur",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/288/yubikey-security-key-1.jpg",
            "length": "36472",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42945",
          "author": "redakce@root.cz (Root.cz: Petr Krčmář)",
          "description": "CETIN přestává v některých pražských lokalitách poskytovat své služby pomocí DSL a místo toho nabídne připojení pomocí optiky. CETIN tímto oznamuje záměr ukončit nabídku a poskytování služby zpřístupnění prostřednictvím účastnického metalického vedení z důvodu přechodu na přístupy realizované prostřednictvím účastnického optického vedení, píše se v oznámení společnosti [PDF].",
          "link": "https://www.root.cz/zpravicky/cetin-zacne-v-nekterych-lokalitach-nabizet-optiku-misto-dsl/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-27T06:00:00.000Z",
          "wordCount": 1200,
          "title": "CETIN začne v některých lokalitách nabízet optiku místo DSL",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/513/terminator-cetin-1.jpg",
            "length": "36156",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42944",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Sony inzeruje nový telefon Xperia Pro-I jako filmařský. Do vínku mu dala špičkovou výbavu a hlavně 1\" stacked CMOS snímač, což je její aktuální špička v této třídě (a tedy i světová špička). Počin sám o sobě je to zajímavý právě tím, že se podařilo vměstnat fotoaparát s 1palcovým snímačem do těla smartphonu. V minulosti už to takové produkty byly. Panasonic před lety nabízel rozměrově velký model CM1, později Sharp přinesl smartphone Aquos R6 s ekv. 19mm f/1.9 objektivem nad 1\" snímačem, v obou případech na objektivu čněl nápis LEICA.",
          "link": "https://www.root.cz/zpravicky/sony-xperia-pro-i-smartphone-s-1palcovym-snimacem-a-4k-120p-12bit-videem/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-26T12:01:31.000Z",
          "wordCount": 2810,
          "title": "Sony Xperia Pro-I, smartphone s 1palcovým snímačem a 4k/120p 12bit videem",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/140/sony-xperia-pro-i-1.jpg",
            "length": "30823",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42943",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Jednou ze změn, které zamířily v těchto dnech do větve DRM-Next, je podpora rozhraní DisplayPort ve verzi 2.0 v rámci otevřeného ovladače AMDGPU pro Radeony. Jde o počáteční várku kódu, samostatný pull request řeší podporu DisplayPort 2.0 Multi-Stream Transport (MST). Jde zhruba o 400 řádků zdrojového kódu, vše v rámci příprav na příští generaci GPU AMD.",
          "link": "https://www.root.cz/zpravicky/do-ovladace-amdgpu-miri-podpora-displayport-2-0-multi-stream-transport/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-26T11:08:26.000Z",
          "wordCount": 905,
          "title": "Do ovladače AMDGPU míří podpora DisplayPort 2.0 Multi-Stream Transport",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/586/displayport-hdmi-1.jpg",
            "length": "31833",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42940",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "10.11.2021 od 18:00 do 20:00, nosná téma meetupu: Day-2 operations (wins/fails)",
          "link": "https://www.root.cz/zpravicky/25-stretnutie-komunity-cloud-native-kubernetes-online/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-26T07:44:59.000Z",
          "wordCount": 876,
          "title": "25. stretnutie komunity Cloud Native – Kubernetes (online)",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/122/kubernetes-1.jpg",
            "length": "21058",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42942",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Obvykle vydává Linus Torvalds nové verze jádra v neděli, novou vývojovou verzi Linuxu 5.15 však nechal na pondělí, neb je na cestách. Každopádně Linux 5.15 RC7 je na světě a jsme zase o kousek blíže k finálnímu vydání a přechod na vývoj v rámci větve budoucího Linuxu 5.16.",
          "link": "https://www.root.cz/zpravicky/linux-5-15-rc7-o-1-den-pozdeji-finalni-verze-na-spadnuti/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-26T07:30:00.000Z",
          "wordCount": 859,
          "title": "Linux 5.15-rc7 o 1 den později, finální verze na spadnutí",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/121/linus-torvalds-1.jpg",
            "length": "24059",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42941",
          "author": "redakce@root.cz (Root.cz: David Ježek)",
          "description": "Několikrát jsme zpravodajství Jense Axboeho o pokračujících optimalizacích linuxového IO subsystému vynechali. Včera Jens informoval o dosažení nové mety, která překonává kulatou hranici 10 miliónů IOPS na jedno CPU jádro. Testovací stroj je přitom stále stejný, tedy AMD Ryzen 9 5950X v kombinaci s dvojicí úložišť Intel Optane 5800X.",
          "link": "https://www.root.cz/zpravicky/linux-prolomil-hranici-10-milionu-iops/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-26T07:09:59.000Z",
          "wordCount": 1132,
          "title": "Linux prolomil hranici 10 miliónů IOPS",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/root/26/ssd-server-intel.jpg",
            "length": "67571",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42939",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Hardkernel, výrobce jednodeskových počítačů ODROID, uvedl dvoukanálový měřič proudu a spotřeby ODROID Smart Power3. Ten má pomoci vývojářům malých zařízení například redukovat jejich spotřebu. Zařízení používá ESP32 a výstup je možné přenášet po sériové lince přes USB do počítače.",
          "link": "https://www.root.cz/zpravicky/odroid-smart-power3/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-25T14:33:08.000Z",
          "wordCount": 1234,
          "title": "ODROID Smart Power3",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/317/smart-power-3-1.jpg",
            "length": "43349",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42938",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Minulý týden Intel uvolnil svůj nástroj ControlFlag jako open source pod licencí MIT. ControlFlag automaticky kontroluje kód v C/C++ a využívá speciální samoučící detekci vzorů. Naučen byl na asi miliardě řádek zdrojových kódů open source software na GitHubu. Dokáže detekovat anomálie v kódu, které by mohly být potenciálně zdroji chyb.",
          "link": "https://www.root.cz/zpravicky/intel-vydal-jako-oepn-source-controlflag-pro-automatickou-kontrolu-kodu-v-c-c/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-25T12:25:09.000Z",
          "wordCount": 1637,
          "title": "Intel vydal jako open source ControlFlag pro automatickou kontrolu kódu v C/C++",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/116/fustrovany-programator-1.jpg",
            "length": "53261",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42936",
          "author": "redakce@root.cz (Root.cz: anonymní)",
          "description": "Čtrnáctý ročník konference DevConf.cz proběhne 28–29. ledna v hybridním formátu: fyzicky na FIT VUT a zároveň v online prostředí. Pokud chcete přispět do programu svou vlastní přednáškou nebo workshopem, čas na přihlášení máte do 31. října, tedy do konce tohoto týdne, prostřednictvím online formuláře.",
          "link": "https://www.root.cz/zpravicky/devconf-cz-2022-deadline-na-prihlaseni-prednasek-prodlouzen-do-31-rijna/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-25T06:35:39.000Z",
          "wordCount": 775,
          "title": "DevConf.cz 2022 - deadline na přihlášení přednášek prodloužen do 31. října",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/579/konference-internet-a-technologie-19-1.jpg",
            "length": "52279",
            "type": "image/jpeg"
          }
        },
        {
          "id": "www.root.cz-actuality-42937",
          "author": "redakce@root.cz (Root.cz: Jan Fikar)",
          "description": "Známý americký server o informačních technologiích InfoWorld ocenil nejlepší open source software za rok 2021 cenou Bossie (Best of Open Source Software) pro development, analýzu dat a strojové učení. Oceněno bylo 28 projektů, mezi nimi například Windows Terminal, který používá akceleraci GPU a je až o řád rychlejší než tradiční Windows konzole.",
          "link": "https://www.root.cz/zpravicky/nejlepsi-open-source-software-pode-infoworld-2021-bossie-awards/?utm_source=rss&utm_medium=text&utm_campaign=rss",
          "publishedOn": "2021-10-25T06:34:22.000Z",
          "wordCount": 1218,
          "title": "Nejlepší open source software pode InfoWorld 2021 Bossie Awards",
          "enclosure": {
            "url": "https://i.iinfo.cz/images/644/medaile-1.jpg",
            "length": "36195",
            "type": "image/jpeg"
          }
        }
      ]
    },
    {
      "title": "abclinuxu - aktuální články",
      "feedUrl": "http://www.abclinuxu.cz/auto/abc.rss",
      "siteUrl": "http://www.abclinuxu.cz/clanky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-43-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-43-2021",
          "publishedOn": "2021-10-29T22:01:00.000Z",
          "wordCount": 2039,
          "title": "Událo se v týdnu 43/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-umela-inteligence-a-rekurzivni-sebezdokonalovani-2",
          "author": "Redakce",
          "description": "Poločas rozpadu neutronu. Máme se bát, pokud umělá inteligence navrhne jinou umělou inteligenci? Superionický led. Počátky počítačů na Slovensku. Na Venuši žádné oceány být nemusely.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-umela-inteligence-a-rekurzivni-sebezdokonalovani-2",
          "publishedOn": "2021-10-29T16:30:00.000Z",
          "wordCount": 1631,
          "title": "Týden na ScienceMag.cz: Umělá inteligence a rekurzívní sebezdokonalování"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-umela-inteligence-a-rekurzivni-sebezdokonalovani",
          "author": "Redakce",
          "description": "Poločas rozpadu neutronu. Máme se bát, pokud umělá inteligence navrhne jinou umělou inteligenci? Superionický led. Počátky počítačů na Slovensku. Na Venuši žádné oceány být nemusely.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-umela-inteligence-a-rekurzivni-sebezdokonalovani",
          "publishedOn": "2021-10-29T16:30:00.000Z",
          "wordCount": 1631,
          "title": "Týden na ScienceMag.cz: Umělá inteligence a rekurzívní sebezdokonalování"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/distribucni-novinky-41-42-2021",
          "author": "Redakce",
          "description": "V říjnu bylo dosud vydáno Ubuntu 21.10, OpenBSD 7.0 nebo ruská, na Mandrivě založená ROSA Fresh Desktop R12. Na Debian „Bullseye“ přešly jeho deriváty bez systemd Devuan a MX Linux. Také byly aktualizovány distribuce KaOS, GhostBSD, Porteus Kiosk, Redcore Linux či NuTyX.",
          "link": "http://www.abclinuxu.cz/clanky/distribucni-novinky-41-42-2021",
          "publishedOn": "2021-10-26T16:00:00.000Z",
          "wordCount": 2062,
          "title": "Distribuční novinky 41-42/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-organizace-letos-vynalozi-na-technologie-podporujici-budoucnost-prace-656-miliard-dolaru",
          "author": "Redakce",
          "description": "Red Hat novými aktualizacemi podporuje edge computing. Organizace letos vynaloží na technologie podporující budoucnost práce 656 miliard dolarů. HPE GreenLake přináší inovativní architekturu správy dat. Tiskárny během lockdownů a poté (2) Nedostatek dílů.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-organizace-letos-vynalozi-na-technologie-podporujici-budoucnost-prace-656-miliard-dolaru",
          "publishedOn": "2021-10-24T14:00:00.000Z",
          "wordCount": 1355,
          "title": "Týden na ITBiz: Organizace letos vynaloží na technologie podporující budoucnost práce 656 miliard dolarů"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-42-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-42-2021",
          "publishedOn": "2021-10-22T22:01:00.000Z",
          "wordCount": 2231,
          "title": "Událo se v týdnu 42/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-umela-inteligence-a-signaly-odmen",
          "author": "Redakce",
          "description": "Problém zpětnovazebného učení u skutečné umělé inteligence. Primordiální černé díry. Záhadné rádiové vlny. Nejchytřejší psi. Drony jako hasiči.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-umela-inteligence-a-signaly-odmen",
          "publishedOn": "2021-10-21T22:01:00.000Z",
          "wordCount": 1618,
          "title": "Týden na ScienceMag.cz: Umělá inteligence a signály odměn"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-roste-podil-softwaru-ktery-vyuziva-umelou-inteligenci",
          "author": "Redakce",
          "description": "Podzimní smršť novinek od Aceru. SentinelOne v ČR nabere 300 lidí a investuje miliardu. Roste podíl softwaru, který využívá umělou inteligenci. Dodávky a ceny osobních počítačů z pohledu výrobce. VMworld: Zabezpečení na principu nulové důvěry.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-itbiz-roste-podil-softwaru-ktery-vyuziva-umelou-inteligenci",
          "publishedOn": "2021-10-17T22:01:00.000Z",
          "wordCount": 1363,
          "title": "Týden na ITBiz: Roste podíl softwaru, který využívá umělou inteligenci"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-umela-inteligence-v-kooperativnich-hrach",
          "author": "Redakce",
          "description": "Nový typ magnetismu nezpůsobují spiny. Beethovenovu slavnou 10. symfonii dokončila umělá inteligence  Studium neuronových sítí může pomoci při zkoumání toho, jak se do mozku ukládají konspirační teorie. Minirobot se pohybuje díky gradientům teploty. Splynutí obřích černých děr provázejí nejen gravitační vlny.",
          "link": "http://www.abclinuxu.cz/clanky/tyden-na-sciencemag.cz-umela-inteligence-v-kooperativnich-hrach",
          "publishedOn": "2021-10-16T22:01:00.000Z",
          "wordCount": 1609,
          "title": "Týden na ScienceMag.cz: Umělá inteligence v kooperativních hrách"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-41-2021",
          "author": "Redakce",
          "description": "Ucelený přehled článků, zpráviček a diskusí za minulých 7 dní.",
          "link": "http://www.abclinuxu.cz/clanky/udalo-se-v-tydnu-41-2021",
          "publishedOn": "2021-10-15T22:01:00.000Z",
          "wordCount": 2469,
          "title": "Událo se v týdnu 41/2021"
        },
        {
          "id": "http://www.abclinuxu.cz/clanky/goodoffer24-dozivotni-licence-windows-11-za-16-66-nebo-windows-10-za-pouhych-12-52",
          "author": "Reklama",
          "description": "Získejte doživotní licenci Windows 11 za pouhých 16,66  €, Windows 10 za pouhých 12,52  €. Opět jde o finančně velmi výhodnou nabídku prodejního portálu GoodOffer24.com, kde lze najít kromě nástrojů produktivity také hry, ale i další softwarové produkty.",
          "link": "http://www.abclinuxu.cz/clanky/goodoffer24-dozivotni-licence-windows-11-za-16-66-nebo-windows-10-za-pouhych-12-52",
          "publishedOn": "2021-10-15T14:00:00.000Z",
          "wordCount": 1279,
          "title": "GoodOffer24: Doživotní licence Windows 11 za 16,66  € nebo Windows 10 za pouhých 12,52  €"
        }
      ]
    },
    {
      "title": "abclinuxu - čerstvé zprávičky",
      "feedUrl": "http://www.abclinuxu.cz/auto/zpravicky.rss",
      "siteUrl": "http://www.abclinuxu.cz/zpravicky",
      "articles": [
        {
          "id": "http://www.abclinuxu.cz/zpravicky/project-trident-konci",
          "author": "Ladislav Hagara",
          "description": "Project Trident, desktopová distribuce vycházející z Void Linuxu (dříve z TrueOS) s grafickým prostředím Lumina, končí.",
          "link": "http://www.abclinuxu.cz/zpravicky/project-trident-konci",
          "publishedOn": "2021-10-29T21:23:29.000Z",
          "wordCount": 750,
          "title": "Project Trident končí"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/the-uni-v3-mechanicka-klavesnice-pro-stenografii-tesnopis",
          "author": "Ladislav Hagara",
          "description": "The Uni v3 je mechanická klávesnici (stenografovací stroj) pro stenografii (těsnopis). Na Kickstarteru běží kampaň na její podporu. Používat ji lze společně s open source enginem Plover (r/Plover) z projektu Open Steno.",
          "link": "http://www.abclinuxu.cz/zpravicky/the-uni-v3-mechanicka-klavesnice-pro-stenografii-tesnopis",
          "publishedOn": "2021-10-29T18:45:33.000Z",
          "wordCount": 784,
          "title": "The Uni v3, mechanická klávesnice pro stenografii (těsnopis)"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/sprite-fright-13.-open-source-film-od-blender-studia",
          "author": "Ladislav Hagara",
          "description": "Dnes v 17:00 má na YouTube online premiéru Sprite Fright, již 13. open source film od Blender Studia.",
          "link": "http://www.abclinuxu.cz/zpravicky/sprite-fright-13.-open-source-film-od-blender-studia",
          "publishedOn": "2021-10-29T10:56:34.000Z",
          "wordCount": 1006,
          "title": "Sprite Fright, 13. open source film od Blender Studia"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/bitva-o-wesnoth-1.16-aktualizace-dobyvani-dun",
          "author": "Ladislav Hagara",
          "description": "Po více než 3 letech od vydání verze 1.14 byla vydána Bitva o Wesnoth 1.16 — Aktualizace Dobývání dun (The Battle for Wesnoth 1.16 - Dune Conquests Update). Videoukázka této open source tahové strategické počítačové hry s fantasy tematikou na YouTube.",
          "link": "http://www.abclinuxu.cz/zpravicky/bitva-o-wesnoth-1.16-aktualizace-dobyvani-dun",
          "publishedOn": "2021-10-29T10:37:22.000Z",
          "wordCount": 935,
          "title": "Bitva o Wesnoth 1.16 — Aktualizace Dobývání dun"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/threema-for-desktop",
          "author": "Ladislav Hagara",
          "description": "Vývojáři komunikátoru Threema (Wikipedie) představili desktopového klienta Threema for Desktop postaveného na Electronu. Ke stažení je deb i rpm. Zdrojové kódy jsou k dispozici na GitHubu.",
          "link": "http://www.abclinuxu.cz/zpravicky/threema-for-desktop",
          "publishedOn": "2021-10-29T09:58:15.000Z",
          "wordCount": 894,
          "title": "Threema for Desktop"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/mark-zuckerberg-oznamil-prejmenovani-spolecnost-facebook-na-meta",
          "author": "Ladislav Hagara",
          "description": "Mark Zuckerberg oznámil přejmenování společnosti Facebook stojící za stejnojmennou sociální sítí na Meta.",
          "link": "http://www.abclinuxu.cz/zpravicky/mark-zuckerberg-oznamil-prejmenovani-spolecnost-facebook-na-meta",
          "publishedOn": "2021-10-28T20:59:50.000Z",
          "wordCount": 1290,
          "title": "Mark Zuckerberg oznámil přejmenování společnosti Facebook na Meta"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/audacity-3.1",
          "author": "Ladislav Hagara",
          "description": "Byla vydána nová stabilní verze 3.1 (3.1.0) svobodného multiplatformního softwaru pro editování a nahrávání zvukových souborů Audacity (Wikipedie). Přehled nových vlastností ve videu na YouTube a v aktualizované dokumentaci.",
          "link": "http://www.abclinuxu.cz/zpravicky/audacity-3.1",
          "publishedOn": "2021-10-28T12:58:07.000Z",
          "wordCount": 1296,
          "title": "Audacity 3.1"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/raspberry-pi-zero-2-w",
          "author": "Ladislav Hagara",
          "description": "V listopadu 2015 bylo představeno pětidolarové Raspberry Pi Zero. V únoru 2017 desetidolarové Raspberry Pi Zero W s Wi-Fi a Bluetooth. Dnes bylo představeno vylepšené patnáctidolarové Raspberry Pi Zero 2 W.",
          "link": "http://www.abclinuxu.cz/zpravicky/raspberry-pi-zero-2-w",
          "publishedOn": "2021-10-28T10:06:26.000Z",
          "wordCount": 1075,
          "title": "Raspberry Pi Zero 2 W"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/warzone-2100-4.2.0",
          "author": "Ladislav Hagara",
          "description": "Realtimová strategie Warzone 2100 (Wikipedie) byla vydána ve verzi 4.2.0. Podrobný přehled novinek, změn a oprav v ChangeLogu na GitHubu. Nejnovější verzi Warzone 2100 lze instalovat také ze Snapcraftu. Brzy i z Flathubu.",
          "link": "http://www.abclinuxu.cz/zpravicky/warzone-2100-4.2.0",
          "publishedOn": "2021-10-27T23:17:33.000Z",
          "wordCount": 769,
          "title": "Warzone 2100 4.2.0"
        },
        {
          "id": "http://www.abclinuxu.cz/zpravicky/x.org-server-21.1.0",
          "author": "Fluttershy, yay!",
          "description": "X Server (xorg-server) 21.1.0 byl oficiálně vydán. Mezi stěžejními novinkami je jmenována podpora např. proměnlivé obnovovací frekvence v modesetting, 2D akcelerace GLAMOR v Xvfb, gest touchpadu v XInput 2.4 nebo dokončení přechodu z Autotools na Meson. XWayland byl již dříve vydán samostatně.",
          "link": "http://www.abclinuxu.cz/zpravicky/x.org-server-21.1.0",
          "publishedOn": "2021-10-27T20:45:37.000Z",
          "wordCount": 4775,
          "title": "X.Org Server 21.1.0"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Project-Trident-No-More",
          "author": null,
          "description": "Project Trident had been an operating system originally based on TrueOS/FreeBSD before shifting to Void Linux as its base and worked on various innovations like OpenZFS-based root installations but now the developers behind the ambitious advanced desktop OS project have decided to call it quits...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Project-Trident-No-More",
          "publishedOn": "2021-10-30T04:00:00.000Z",
          "wordCount": 782,
          "title": "Void-Linux-Powered Project Trident To Cease Operations"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Zink-Closer-To-4.6-Conformance",
          "author": null,
          "description": "While there has been less major progress to report on Mesa's Zink OpenGL-over-Vulkan code in recent weeks, Mike Blumenkrantz of Valve and others continue optimizing and fixing this increasing useful implementation. Most recently the game Bioshock: Infinite is running on Zink and there are more fixes in aiming toward OpenGL 4.6 conformance...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Zink-Closer-To-4.6-Conformance",
          "publishedOn": "2021-10-29T15:42:49.000Z",
          "wordCount": 818,
          "title": "Zink OpenGL On Vulkan Inches Closer To OpenGL 4.6 Conformance, More Games Working"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-P-State-Linux-v3",
          "author": null,
          "description": "In early September AMD posted their new \"amd-pstate\" CPU frequency scaling driver for Linux that leverages ACPI CPPC data available with Zen 2 and newer processors for making wiser frequency scaling decisions. The goal of AMD P-State is to offer better performance-per-Watt and today they have posted a new revision of this driver...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-P-State-Linux-v3",
          "publishedOn": "2021-10-29T15:13:22.000Z",
          "wordCount": 962,
          "title": "AMD Posts Latest Revision To Its New P-State Linux Driver"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=RadeonSI-EO-October-2021",
          "author": null,
          "description": "Well known AMD open-source OpenGL driver developer Marek Olšák has landed another big batch of patches to further lower the driver overhead of this Linux OpenGL driver...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=RadeonSI-EO-October-2021",
          "publishedOn": "2021-10-29T12:50:32.000Z",
          "wordCount": 881,
          "title": "RadeonSI Lands Yet Another Round Of Optimizations That Further Reduce CPU Overhead"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=i965-Mesa-Classic-To-2022",
          "author": null,
          "description": "Earlier this year was talk of finally retiring the Intel \"i965\" Mesa classic OpenGL driver along with the rest of the \"classic Mesa\" driver code now that it's been replaced by the Crocus Gallium3D driver and the other open-source Mesa OpenGL divers all using the modern Gallium3D architecture. Those plans are still on but shifting now into 2022...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=i965-Mesa-Classic-To-2022",
          "publishedOn": "2021-10-29T12:15:17.000Z",
          "wordCount": 1042,
          "title": "Intel's i965 Mesa Classic OpenGL Driver Will Stick Around A Bit Longer"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=X.Org-Bye-Bye-Autotools",
          "author": null,
          "description": "With X.Org Server 21.1 having finally shipped this week, the X.Org Server Autotools build system support has been killed off...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=X.Org-Bye-Bye-Autotools",
          "publishedOn": "2021-10-29T10:49:19.000Z",
          "wordCount": 723,
          "title": "X.Org Server Bids Farewell To Autotools"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Improved-Retpolines-Linux-5.16",
          "author": null,
          "description": "A set of patches improving the return trampoline \"Retpoline\" code used for Spectre V2 mitigations has made its way into tip.git's \"objtool/core\" staging area ahead of the upcoming Linux 5.16 merge window...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Improved-Retpolines-Linux-5.16",
          "publishedOn": "2021-10-29T09:45:55.000Z",
          "wordCount": 773,
          "title": "Improved Retpoline Code Staged Ahead Of Linux 5.16"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Wayland-1.20-Release-Plans",
          "author": null,
          "description": "It's been nine months since the release of Wayland 1.19 while now release plans have been drafted for Wayland 1.20...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Wayland-1.20-Release-Plans",
          "publishedOn": "2021-10-29T09:20:34.000Z",
          "wordCount": 845,
          "title": "Wayland 1.20 Planned For Release In December"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=CEG-DRM-Games-On-Steam-Play",
          "author": null,
          "description": "Running the newest Steam client beta paired with the newest Proton Experimental should yield more Windows games working on Steam Play with Linux...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=CEG-DRM-Games-On-Steam-Play",
          "publishedOn": "2021-10-29T08:28:44.000Z",
          "wordCount": 732,
          "title": "Games Relying On CEG DRM Should Now Be Able To Run With Steam Play"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Babelfish-PostgreSQL",
          "author": null,
          "description": "Amazon Web Services today announced the open-source Babelfish for PostgreSQL server project. Babelfish allows for applications written against Microsoft SQL Server to work seamlessly with PostgreSQL...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Babelfish-PostgreSQL",
          "publishedOn": "2021-10-28T22:13:18.000Z",
          "wordCount": 811,
          "title": "Amazon Open-Sources Babelfish for PostgreSQL To More Easily Move Away From Microsoft SQL"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Fedora-35-Next-Week",
          "author": null,
          "description": "After dealing with blocker bugs the past two weeks, Fedora 35 is now confirmed for releasing next week...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Fedora-35-Next-Week",
          "publishedOn": "2021-10-28T18:08:20.000Z",
          "wordCount": 796,
          "title": "Fedora 35 Cleared For Release Next Week"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Straight-Line-Speculation-x86",
          "author": null,
          "description": "Disclosed last year by Arm was their processors affected by a straight-line speculation vulnerability. In this case the processor could speculatively execute instructions linearly in memory past an unconditional change in control flow. There has been talk about possible straight-line speculation on x86/x86_64 but without any action while now GCC and LLVM/Clang compiler developers along with Linux kernel developers are preparing such mitigation support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Straight-Line-Speculation-x86",
          "publishedOn": "2021-10-28T13:54:48.000Z",
          "wordCount": 966,
          "title": "Linux + GCC/Clang Patches Coming For Straight-Line Speculation Mitigation On x86/x86_64"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=wlroots-Vulkan-Renderer",
          "author": null,
          "description": "The wlroots modular Wayland compositing library that was started by the Sway compositor now has an initial Vulkan renderer merged...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=wlroots-Vulkan-Renderer",
          "publishedOn": "2021-10-28T13:24:32.000Z",
          "wordCount": 785,
          "title": "Sway's wlroots Lands Initial Vulkan Renderer"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30647",
          "author": null,
          "description": "As a good sign ahead of the important Ubuntu 22.04 LTS release in the spring, Ubuntu 21.10 further ups the 64-bit ARM (AArch64) performance. Here is a look at some of the gains in going from Ubuntu 21.04 to the recently released Ubuntu 21.10.",
          "link": "https://www.phoronix.com/vr.php?view=30647",
          "publishedOn": "2021-10-28T13:00:00.000Z",
          "wordCount": 746,
          "title": "Ubuntu 21.10 Performance Continues In The Right Direction For AArch64"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Blender-3.x-Roadmap",
          "author": null,
          "description": "With Blender 3.0 releasing soon, the Blender project has published a Blender 3.x road-map outlining some of their plans for future releases...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Blender-3.x-Roadmap",
          "publishedOn": "2021-10-28T11:22:31.000Z",
          "wordCount": 864,
          "title": "Blender 3.x Roadmap Has Big Plans For Vulkan, Other Improvements"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Embedded-DisplayPort-1.5",
          "author": null,
          "description": "It's been six years already since VESA published the Embedded DisplayPort 1.4b specification while finally it's been succeeded by eDP 1.5...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Embedded-DisplayPort-1.5",
          "publishedOn": "2021-10-28T08:52:18.000Z",
          "wordCount": 758,
          "title": "Embedded DisplayPort 1.5 Specification Published"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Raspberry-Pi-Zero-2-W",
          "author": null,
          "description": "The Raspberry Pi Foundation today is launching the Raspberry Pi Zero 2 W as their newest single board computer succeeding the $10 Raspberry Pi Zero W...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Raspberry-Pi-Zero-2-W",
          "publishedOn": "2021-10-28T06:00:00.000Z",
          "wordCount": 780,
          "title": "Raspberry Pi Zero 2 W Launches As Newer, Faster $10 Single Board Computer"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Nitrokey-FIDO-U2F-Linux-5.16",
          "author": null,
          "description": "If you happen to have a Nitrokey FIDO U2F as a two-factor authentication key, proper Linux support is about to land. While at launch it mentioned working out-of-the-box across all major browsers and platforms -- including Linux -- a change is needed to the kernel that's now on the way for the 5.16 cycle...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Nitrokey-FIDO-U2F-Linux-5.16",
          "publishedOn": "2021-10-28T05:00:53.000Z",
          "wordCount": 780,
          "title": "Nitrokey FIDO U2F Support Coming With Linux 5.16"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=DragonFlyBSD-makefs-FAT",
          "author": null,
          "description": "One could consider it long overdue, but DragonFlyBSD has finally merged support for FAT file-systems with the makefs utility...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=DragonFlyBSD-makefs-FAT",
          "publishedOn": "2021-10-28T04:25:57.000Z",
          "wordCount": 652,
          "title": "DragonFlyBSD's makefs Adds Support For FAT"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-rc3-Released",
          "author": null,
          "description": "The latest weekly test release of Mesa 21.3 is now available ahead of the anticipated stable debut in November...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-rc3-Released",
          "publishedOn": "2021-10-27T22:41:36.000Z",
          "wordCount": 786,
          "title": "Mesa 21.3-rc3 Released With Many Zink OpenGL-On-Vulkan Fixes"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Wakefield-OpenJDK-Java-Wayland",
          "author": null,
          "description": "Project Wakefield is the recently established OpenJDK initiative to implement native Wayland support within Java...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Wakefield-OpenJDK-Java-Wayland",
          "publishedOn": "2021-10-27T18:00:00.000Z",
          "wordCount": 783,
          "title": "Project Wakefield Is OpenJDK's Effort To Improve Java On Wayland"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=X.Org-Server-21.1",
          "author": null,
          "description": "X.Org Server 21.1 is now officially available as this first xorg-server update in three years and what began development as X.Org Server 1.21 prior to the versioning change...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=X.Org-Server-21.1",
          "publishedOn": "2021-10-27T17:33:49.000Z",
          "wordCount": 818,
          "title": "X.Org Server 21.1 Released With Variable Rate Refresh In Modesetting Driver, Other Work"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30645",
          "author": null,
          "description": "Intel is using their inaugural Intel Innovation virtual event today to formally announce the highly-anticipated 12th Gen Core \"Alder Lake\" processors. These first desktop processors built on their \"Intel 7\" process and employ a hybrid architecture will be available in retail channels next week. Today we can talk more about Alder Lake specifications and features while our Linux performance benchmarks and support analysis will come once the Alder Lake review embargo expires next week.",
          "link": "https://www.phoronix.com/vr.php?view=30645",
          "publishedOn": "2021-10-27T16:00:01.000Z",
          "wordCount": 1123,
          "title": "Intel Announces 12th Gen Core \"Alder Lake\" CPUs, Linux Tests Forthcoming"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-New-Dev-Zone",
          "author": null,
          "description": "Along with announcing Alder Lake and other hardware advancements, Intel is using their new Innovation event kicking off today to also talk more about their vast collection of software... This follows Intel CEO Pat Gelsinger's comments from earlier in the week around a bias towards open-source and a pledge to openness. As part of this, Intel is today announcing a new and unified Developer Zone...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-New-Dev-Zone",
          "publishedOn": "2021-10-27T16:00:00.000Z",
          "wordCount": 1124,
          "title": "Intel Announces New Developer Zone To Showcase Their Wide Array Of Software"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Qt-6.2.1-LTS-Released",
          "author": null,
          "description": "It's been just shy of one month since Qt 6.2 debuted as the first Qt6 Long-Term Support (LTS) release and ported many of the remaining modules over from Qt5. Shipping today is now Qt 6.2.1 as the first point release with more than two-hundred fixes...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Qt-6.2.1-LTS-Released",
          "publishedOn": "2021-10-27T09:38:02.000Z",
          "wordCount": 837,
          "title": "Qt 6.2.1 Released With 200+ Bug Fixes"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Nintendo-HID-For-Linux-5.16",
          "author": null,
          "description": "After stalling last year when it was queued up in HID's \"for-5.10/nintendo\" branch only to not make it into HID-next at the time, that threshold has now been crossed with the latest Nintendo Switch controller driver now ready for introduction in Linux 5.16. This open-source driver enables the Nintendo Switch Joy-Con and Pro controllers to work under Linux with a mainline kernel driver...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Nintendo-HID-For-Linux-5.16",
          "publishedOn": "2021-10-27T09:06:16.000Z",
          "wordCount": 780,
          "title": "Nintendo Switch Controller Driver Finally Set For Linux 5.16"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Apple-Silicon-GPIO-Linux-5.16",
          "author": null,
          "description": "Along with the Apple Silicon PCIe driver, another new driver for supporting Apple Silicon (primarily with a focus on the Apple M1 for now) with the upcoming Linux 5.16 cycle is a new pinctrl/GPIO driver...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Apple-Silicon-GPIO-Linux-5.16",
          "publishedOn": "2021-10-27T08:34:06.000Z",
          "wordCount": 787,
          "title": "Apple Silicon GPIO Driver Queued Ahead Of Linux 5.16"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=MSM-Changes-For-Linux-5.16",
          "author": null,
          "description": "The MSM DRM driver for supporting the open-source display/graphics support with Qualcomm Snapdragon SoCs has submitted their main feature pull request to DRM-Next ahead of the upcoming Linux 5.16 merge window...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=MSM-Changes-For-Linux-5.16",
          "publishedOn": "2021-10-27T06:00:00.000Z",
          "wordCount": 776,
          "title": "Qualcomm MSM DRM Driver Improvements Submitted Ahead Of Linux 5.16"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Pyston-Roadmap-2021",
          "author": null,
          "description": "Pyston as the alternative Python implementation open-sourced originally by Dropbox is forming ambitious plans for a bright future...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Pyston-Roadmap-2021",
          "publishedOn": "2021-10-26T22:56:26.000Z",
          "wordCount": 802,
          "title": "Alternative Python Implementation \"Pyston\" Plans For Greater Performance, 64-bit ARM"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-AMX-For-Linux-5.16",
          "author": null,
          "description": "It's been over one year since Intel disclosed Advanced Matrix Extensions and began posting patches for bringing up AMX support under Linux in anticipation of Xeon Scalable \"Sapphire Rapids\" processors. While the compiler-side work to GCC and LLVM/Clang has been landing, finally with the forthcoming Linux 5.16 cycle that AMX support appears ready for landing...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-AMX-For-Linux-5.16",
          "publishedOn": "2021-10-26T18:00:02.000Z",
          "wordCount": 923,
          "title": "Intel AMX Support Appears Ready For Linux 5.16"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-495.44-Linux-Driver",
          "author": null,
          "description": "Following the NVIDIA 495 beta Linux driver from earlier this month, NVIDIA 495.44 is out today for Linux users as the stable release...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-495.44-Linux-Driver",
          "publishedOn": "2021-10-26T15:07:21.000Z",
          "wordCount": 779,
          "title": "NVIDIA 495.44 Linux Driver Released With GBM Support"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30640",
          "author": null,
          "description": "Now that Windows 11 has been out as stable and the initial round of updates coming out, I've been running fresh Windows 11 vs. Linux benchmarks for seeing how Microsoft's latest operating system release compares to the fresh batch of Linux distributions. First up is the fresh look at the Windows 11 vs. Linux performance on an Intel Core i9 11900K Rocket Lake system.",
          "link": "https://www.phoronix.com/vr.php?view=30640",
          "publishedOn": "2021-10-26T13:09:27.000Z",
          "wordCount": 984,
          "title": "Intel Core i9 11900K: Five Linux Distros Show Sizable Lead Over Windows 11"
        }
      ]
    },
    {
      "title": "xkcd.com",
      "feedUrl": "https://xkcd.com/rss.xml",
      "siteUrl": "https://xkcd.com/",
      "articles": [
        {
          "id": "https://xkcd.com/2535/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2535/",
          "publishedOn": "2021-10-29T04:00:00.000Z",
          "wordCount": 187,
          "title": "Common Cold Viruses"
        },
        {
          "id": "https://xkcd.com/2534/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2534/",
          "publishedOn": "2021-10-27T04:00:00.000Z",
          "wordCount": 185,
          "title": "Retractable Rocket"
        },
        {
          "id": "https://xkcd.com/2533/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2533/",
          "publishedOn": "2021-10-25T04:00:00.000Z",
          "wordCount": 187,
          "title": "Slope Hypothesis Testing"
        },
        {
          "id": "https://xkcd.com/2532/",
          "author": null,
          "description": "",
          "link": "https://xkcd.com/2532/",
          "publishedOn": "2021-10-22T04:00:00.000Z",
          "wordCount": 187,
          "title": "Censored Vaccine Card"
        }
      ]
    }
  ],
  "cliVersion": "1.11.3"
}